// components/security_interstitials/core/common/mojom/interstitial_commands.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_SECURITY_INTERSTITIALS_CORE_COMMON_MOJOM_INTERSTITIAL_COMMANDS_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_SECURITY_INTERSTITIALS_CORE_COMMON_MOJOM_INTERSTITIAL_COMMANDS_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace security_interstitials::mojom {
namespace internal {
class InterstitialCommands_DontProceed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<InterstitialCommands_DontProceed_Params_Data>;

    InterstitialCommands_DontProceed_Params_Data();
    ~InterstitialCommands_DontProceed_Params_Data() = delete;
};
static_assert(sizeof(InterstitialCommands_DontProceed_Params_Data) == 8, "Bad sizeof(InterstitialCommands_DontProceed_Params_Data)");
class InterstitialCommands_Proceed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<InterstitialCommands_Proceed_Params_Data>;

    InterstitialCommands_Proceed_Params_Data();
    ~InterstitialCommands_Proceed_Params_Data() = delete;
};
static_assert(sizeof(InterstitialCommands_Proceed_Params_Data) == 8, "Bad sizeof(InterstitialCommands_Proceed_Params_Data)");
class InterstitialCommands_ShowMoreSection_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<InterstitialCommands_ShowMoreSection_Params_Data>;

    InterstitialCommands_ShowMoreSection_Params_Data();
    ~InterstitialCommands_ShowMoreSection_Params_Data() = delete;
};
static_assert(sizeof(InterstitialCommands_ShowMoreSection_Params_Data) == 8, "Bad sizeof(InterstitialCommands_ShowMoreSection_Params_Data)");
class InterstitialCommands_OpenHelpCenter_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<InterstitialCommands_OpenHelpCenter_Params_Data>;

    InterstitialCommands_OpenHelpCenter_Params_Data();
    ~InterstitialCommands_OpenHelpCenter_Params_Data() = delete;
};
static_assert(sizeof(InterstitialCommands_OpenHelpCenter_Params_Data) == 8, "Bad sizeof(InterstitialCommands_OpenHelpCenter_Params_Data)");
class InterstitialCommands_OpenDiagnostic_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<InterstitialCommands_OpenDiagnostic_Params_Data>;

    InterstitialCommands_OpenDiagnostic_Params_Data();
    ~InterstitialCommands_OpenDiagnostic_Params_Data() = delete;
};
static_assert(sizeof(InterstitialCommands_OpenDiagnostic_Params_Data) == 8, "Bad sizeof(InterstitialCommands_OpenDiagnostic_Params_Data)");
class InterstitialCommands_Reload_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<InterstitialCommands_Reload_Params_Data>;

    InterstitialCommands_Reload_Params_Data();
    ~InterstitialCommands_Reload_Params_Data() = delete;
};
static_assert(sizeof(InterstitialCommands_Reload_Params_Data) == 8, "Bad sizeof(InterstitialCommands_Reload_Params_Data)");
class InterstitialCommands_OpenDateSettings_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<InterstitialCommands_OpenDateSettings_Params_Data>;

    InterstitialCommands_OpenDateSettings_Params_Data();
    ~InterstitialCommands_OpenDateSettings_Params_Data() = delete;
};
static_assert(sizeof(InterstitialCommands_OpenDateSettings_Params_Data) == 8, "Bad sizeof(InterstitialCommands_OpenDateSettings_Params_Data)");
class InterstitialCommands_OpenLogin_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<InterstitialCommands_OpenLogin_Params_Data>;

    InterstitialCommands_OpenLogin_Params_Data();
    ~InterstitialCommands_OpenLogin_Params_Data() = delete;
};
static_assert(sizeof(InterstitialCommands_OpenLogin_Params_Data) == 8, "Bad sizeof(InterstitialCommands_OpenLogin_Params_Data)");
class InterstitialCommands_DoReport_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<InterstitialCommands_DoReport_Params_Data>;

    InterstitialCommands_DoReport_Params_Data();
    ~InterstitialCommands_DoReport_Params_Data() = delete;
};
static_assert(sizeof(InterstitialCommands_DoReport_Params_Data) == 8, "Bad sizeof(InterstitialCommands_DoReport_Params_Data)");
class InterstitialCommands_DontReport_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<InterstitialCommands_DontReport_Params_Data>;

    InterstitialCommands_DontReport_Params_Data();
    ~InterstitialCommands_DontReport_Params_Data() = delete;
};
static_assert(sizeof(InterstitialCommands_DontReport_Params_Data) == 8, "Bad sizeof(InterstitialCommands_DontReport_Params_Data)");
class InterstitialCommands_OpenReportingPrivacy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<InterstitialCommands_OpenReportingPrivacy_Params_Data>;

    InterstitialCommands_OpenReportingPrivacy_Params_Data();
    ~InterstitialCommands_OpenReportingPrivacy_Params_Data() = delete;
};
static_assert(sizeof(InterstitialCommands_OpenReportingPrivacy_Params_Data) == 8, "Bad sizeof(InterstitialCommands_OpenReportingPrivacy_Params_Data)");
class InterstitialCommands_OpenWhitepaper_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<InterstitialCommands_OpenWhitepaper_Params_Data>;

    InterstitialCommands_OpenWhitepaper_Params_Data();
    ~InterstitialCommands_OpenWhitepaper_Params_Data() = delete;
};
static_assert(sizeof(InterstitialCommands_OpenWhitepaper_Params_Data) == 8, "Bad sizeof(InterstitialCommands_OpenWhitepaper_Params_Data)");
class InterstitialCommands_ReportPhishingError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<InterstitialCommands_ReportPhishingError_Params_Data>;

    InterstitialCommands_ReportPhishingError_Params_Data();
    ~InterstitialCommands_ReportPhishingError_Params_Data() = delete;
};
static_assert(sizeof(InterstitialCommands_ReportPhishingError_Params_Data) == 8, "Bad sizeof(InterstitialCommands_ReportPhishingError_Params_Data)");
class InterstitialCommands_OpenEnhancedProtectionSettings_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<InterstitialCommands_OpenEnhancedProtectionSettings_Params_Data>;

    InterstitialCommands_OpenEnhancedProtectionSettings_Params_Data();
    ~InterstitialCommands_OpenEnhancedProtectionSettings_Params_Data() = delete;
};
static_assert(sizeof(InterstitialCommands_OpenEnhancedProtectionSettings_Params_Data) == 8,
    "Bad sizeof(InterstitialCommands_OpenEnhancedProtectionSettings_Params_Data)");

} // namespace internal

class InterstitialCommands_DontProceed_ParamsDataView {
public:
    InterstitialCommands_DontProceed_ParamsDataView() = default;

    InterstitialCommands_DontProceed_ParamsDataView(internal::InterstitialCommands_DontProceed_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::InterstitialCommands_DontProceed_Params_Data* data_ = nullptr;
};

class InterstitialCommands_Proceed_ParamsDataView {
public:
    InterstitialCommands_Proceed_ParamsDataView() = default;

    InterstitialCommands_Proceed_ParamsDataView(internal::InterstitialCommands_Proceed_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::InterstitialCommands_Proceed_Params_Data* data_ = nullptr;
};

class InterstitialCommands_ShowMoreSection_ParamsDataView {
public:
    InterstitialCommands_ShowMoreSection_ParamsDataView() = default;

    InterstitialCommands_ShowMoreSection_ParamsDataView(internal::InterstitialCommands_ShowMoreSection_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::InterstitialCommands_ShowMoreSection_Params_Data* data_ = nullptr;
};

class InterstitialCommands_OpenHelpCenter_ParamsDataView {
public:
    InterstitialCommands_OpenHelpCenter_ParamsDataView() = default;

    InterstitialCommands_OpenHelpCenter_ParamsDataView(internal::InterstitialCommands_OpenHelpCenter_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::InterstitialCommands_OpenHelpCenter_Params_Data* data_ = nullptr;
};

class InterstitialCommands_OpenDiagnostic_ParamsDataView {
public:
    InterstitialCommands_OpenDiagnostic_ParamsDataView() = default;

    InterstitialCommands_OpenDiagnostic_ParamsDataView(internal::InterstitialCommands_OpenDiagnostic_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::InterstitialCommands_OpenDiagnostic_Params_Data* data_ = nullptr;
};

class InterstitialCommands_Reload_ParamsDataView {
public:
    InterstitialCommands_Reload_ParamsDataView() = default;

    InterstitialCommands_Reload_ParamsDataView(internal::InterstitialCommands_Reload_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::InterstitialCommands_Reload_Params_Data* data_ = nullptr;
};

class InterstitialCommands_OpenDateSettings_ParamsDataView {
public:
    InterstitialCommands_OpenDateSettings_ParamsDataView() = default;

    InterstitialCommands_OpenDateSettings_ParamsDataView(internal::InterstitialCommands_OpenDateSettings_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::InterstitialCommands_OpenDateSettings_Params_Data* data_ = nullptr;
};

class InterstitialCommands_OpenLogin_ParamsDataView {
public:
    InterstitialCommands_OpenLogin_ParamsDataView() = default;

    InterstitialCommands_OpenLogin_ParamsDataView(internal::InterstitialCommands_OpenLogin_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::InterstitialCommands_OpenLogin_Params_Data* data_ = nullptr;
};

class InterstitialCommands_DoReport_ParamsDataView {
public:
    InterstitialCommands_DoReport_ParamsDataView() = default;

    InterstitialCommands_DoReport_ParamsDataView(internal::InterstitialCommands_DoReport_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::InterstitialCommands_DoReport_Params_Data* data_ = nullptr;
};

class InterstitialCommands_DontReport_ParamsDataView {
public:
    InterstitialCommands_DontReport_ParamsDataView() = default;

    InterstitialCommands_DontReport_ParamsDataView(internal::InterstitialCommands_DontReport_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::InterstitialCommands_DontReport_Params_Data* data_ = nullptr;
};

class InterstitialCommands_OpenReportingPrivacy_ParamsDataView {
public:
    InterstitialCommands_OpenReportingPrivacy_ParamsDataView() = default;

    InterstitialCommands_OpenReportingPrivacy_ParamsDataView(internal::InterstitialCommands_OpenReportingPrivacy_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::InterstitialCommands_OpenReportingPrivacy_Params_Data* data_ = nullptr;
};

class InterstitialCommands_OpenWhitepaper_ParamsDataView {
public:
    InterstitialCommands_OpenWhitepaper_ParamsDataView() = default;

    InterstitialCommands_OpenWhitepaper_ParamsDataView(internal::InterstitialCommands_OpenWhitepaper_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::InterstitialCommands_OpenWhitepaper_Params_Data* data_ = nullptr;
};

class InterstitialCommands_ReportPhishingError_ParamsDataView {
public:
    InterstitialCommands_ReportPhishingError_ParamsDataView() = default;

    InterstitialCommands_ReportPhishingError_ParamsDataView(internal::InterstitialCommands_ReportPhishingError_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::InterstitialCommands_ReportPhishingError_Params_Data* data_ = nullptr;
};

class InterstitialCommands_OpenEnhancedProtectionSettings_ParamsDataView {
public:
    InterstitialCommands_OpenEnhancedProtectionSettings_ParamsDataView() = default;

    InterstitialCommands_OpenEnhancedProtectionSettings_ParamsDataView(
        internal::InterstitialCommands_OpenEnhancedProtectionSettings_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::InterstitialCommands_OpenEnhancedProtectionSettings_Params_Data* data_ = nullptr;
};

} // security_interstitials::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // COMPONENTS_SECURITY_INTERSTITIALS_CORE_COMMON_MOJOM_INTERSTITIAL_COMMANDS_MOJOM_PARAMS_DATA_H_
