// third_party/blink/public/mojom/peerconnection/peer_connection_tracker.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_PEERCONNECTION_PEER_CONNECTION_TRACKER_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_PEERCONNECTION_PEER_CONNECTION_TRACKER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionManager_OnSuspend_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PeerConnectionManager_OnSuspend_Params_Data>;

    PeerConnectionManager_OnSuspend_Params_Data();
    ~PeerConnectionManager_OnSuspend_Params_Data() = delete;
};
static_assert(sizeof(PeerConnectionManager_OnSuspend_Params_Data) == 8, "Bad sizeof(PeerConnectionManager_OnSuspend_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionManager_OnThermalStateChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t thermal_state;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PeerConnectionManager_OnThermalStateChange_Params_Data>;

    PeerConnectionManager_OnThermalStateChange_Params_Data();
    ~PeerConnectionManager_OnThermalStateChange_Params_Data() = delete;
};
static_assert(sizeof(PeerConnectionManager_OnThermalStateChange_Params_Data) == 16, "Bad sizeof(PeerConnectionManager_OnThermalStateChange_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionManager_OnSpeedLimitChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t speed_limit;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PeerConnectionManager_OnSpeedLimitChange_Params_Data>;

    PeerConnectionManager_OnSpeedLimitChange_Params_Data();
    ~PeerConnectionManager_OnSpeedLimitChange_Params_Data() = delete;
};
static_assert(sizeof(PeerConnectionManager_OnSpeedLimitChange_Params_Data) == 16, "Bad sizeof(PeerConnectionManager_OnSpeedLimitChange_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionManager_StartEventLog_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t peer_connection_local_id;
    int32_t output_period_ms;

private:
    friend class mojo::internal::MessageFragment<PeerConnectionManager_StartEventLog_Params_Data>;

    PeerConnectionManager_StartEventLog_Params_Data();
    ~PeerConnectionManager_StartEventLog_Params_Data() = delete;
};
static_assert(sizeof(PeerConnectionManager_StartEventLog_Params_Data) == 16, "Bad sizeof(PeerConnectionManager_StartEventLog_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionManager_StopEventLog_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t peer_connection_local_id;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PeerConnectionManager_StopEventLog_Params_Data>;

    PeerConnectionManager_StopEventLog_Params_Data();
    ~PeerConnectionManager_StopEventLog_Params_Data() = delete;
};
static_assert(sizeof(PeerConnectionManager_StopEventLog_Params_Data) == 16, "Bad sizeof(PeerConnectionManager_StopEventLog_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionManager_GetStandardStats_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PeerConnectionManager_GetStandardStats_Params_Data>;

    PeerConnectionManager_GetStandardStats_Params_Data();
    ~PeerConnectionManager_GetStandardStats_Params_Data() = delete;
};
static_assert(sizeof(PeerConnectionManager_GetStandardStats_Params_Data) == 8, "Bad sizeof(PeerConnectionManager_GetStandardStats_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionManager_GetCurrentState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PeerConnectionManager_GetCurrentState_Params_Data>;

    PeerConnectionManager_GetCurrentState_Params_Data();
    ~PeerConnectionManager_GetCurrentState_Params_Data() = delete;
};
static_assert(sizeof(PeerConnectionManager_GetCurrentState_Params_Data) == 8, "Bad sizeof(PeerConnectionManager_GetCurrentState_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionTrackerHost_AddPeerConnection_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PeerConnectionInfo_Data> info;

private:
    friend class mojo::internal::MessageFragment<PeerConnectionTrackerHost_AddPeerConnection_Params_Data>;

    PeerConnectionTrackerHost_AddPeerConnection_Params_Data();
    ~PeerConnectionTrackerHost_AddPeerConnection_Params_Data() = delete;
};
static_assert(sizeof(PeerConnectionTrackerHost_AddPeerConnection_Params_Data) == 16, "Bad sizeof(PeerConnectionTrackerHost_AddPeerConnection_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionTrackerHost_RemovePeerConnection_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t lid;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PeerConnectionTrackerHost_RemovePeerConnection_Params_Data>;

    PeerConnectionTrackerHost_RemovePeerConnection_Params_Data();
    ~PeerConnectionTrackerHost_RemovePeerConnection_Params_Data() = delete;
};
static_assert(
    sizeof(PeerConnectionTrackerHost_RemovePeerConnection_Params_Data) == 16, "Bad sizeof(PeerConnectionTrackerHost_RemovePeerConnection_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionTrackerHost_UpdatePeerConnection_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t lid;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> type;
    mojo::internal::Pointer<mojo::internal::String_Data> value;

private:
    friend class mojo::internal::MessageFragment<PeerConnectionTrackerHost_UpdatePeerConnection_Params_Data>;

    PeerConnectionTrackerHost_UpdatePeerConnection_Params_Data();
    ~PeerConnectionTrackerHost_UpdatePeerConnection_Params_Data() = delete;
};
static_assert(
    sizeof(PeerConnectionTrackerHost_UpdatePeerConnection_Params_Data) == 32, "Bad sizeof(PeerConnectionTrackerHost_UpdatePeerConnection_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionTrackerHost_OnPeerConnectionSessionIdSet_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t lid;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> session_id;

private:
    friend class mojo::internal::MessageFragment<PeerConnectionTrackerHost_OnPeerConnectionSessionIdSet_Params_Data>;

    PeerConnectionTrackerHost_OnPeerConnectionSessionIdSet_Params_Data();
    ~PeerConnectionTrackerHost_OnPeerConnectionSessionIdSet_Params_Data() = delete;
};
static_assert(sizeof(PeerConnectionTrackerHost_OnPeerConnectionSessionIdSet_Params_Data) == 24,
    "Bad sizeof(PeerConnectionTrackerHost_OnPeerConnectionSessionIdSet_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionTrackerHost_GetUserMedia_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t request_id;
    uint8_t audio : 1;
    uint8_t video : 1;
    uint8_t pad2_[3];
    mojo::internal::Pointer<mojo::internal::String_Data> audio_constraints;
    mojo::internal::Pointer<mojo::internal::String_Data> video_constraints;

private:
    friend class mojo::internal::MessageFragment<PeerConnectionTrackerHost_GetUserMedia_Params_Data>;

    PeerConnectionTrackerHost_GetUserMedia_Params_Data();
    ~PeerConnectionTrackerHost_GetUserMedia_Params_Data() = delete;
};
static_assert(sizeof(PeerConnectionTrackerHost_GetUserMedia_Params_Data) == 32, "Bad sizeof(PeerConnectionTrackerHost_GetUserMedia_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionTrackerHost_GetUserMediaSuccess_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t request_id;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> stream_id;
    mojo::internal::Pointer<mojo::internal::String_Data> audio_track_info;
    mojo::internal::Pointer<mojo::internal::String_Data> video_track_info;

private:
    friend class mojo::internal::MessageFragment<PeerConnectionTrackerHost_GetUserMediaSuccess_Params_Data>;

    PeerConnectionTrackerHost_GetUserMediaSuccess_Params_Data();
    ~PeerConnectionTrackerHost_GetUserMediaSuccess_Params_Data() = delete;
};
static_assert(sizeof(PeerConnectionTrackerHost_GetUserMediaSuccess_Params_Data) == 40, "Bad sizeof(PeerConnectionTrackerHost_GetUserMediaSuccess_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionTrackerHost_GetUserMediaFailure_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t request_id;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> error;
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<PeerConnectionTrackerHost_GetUserMediaFailure_Params_Data>;

    PeerConnectionTrackerHost_GetUserMediaFailure_Params_Data();
    ~PeerConnectionTrackerHost_GetUserMediaFailure_Params_Data() = delete;
};
static_assert(sizeof(PeerConnectionTrackerHost_GetUserMediaFailure_Params_Data) == 32, "Bad sizeof(PeerConnectionTrackerHost_GetUserMediaFailure_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionTrackerHost_GetDisplayMedia_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t request_id;
    uint8_t audio : 1;
    uint8_t video : 1;
    uint8_t pad2_[3];
    mojo::internal::Pointer<mojo::internal::String_Data> audio_constraints;
    mojo::internal::Pointer<mojo::internal::String_Data> video_constraints;

private:
    friend class mojo::internal::MessageFragment<PeerConnectionTrackerHost_GetDisplayMedia_Params_Data>;

    PeerConnectionTrackerHost_GetDisplayMedia_Params_Data();
    ~PeerConnectionTrackerHost_GetDisplayMedia_Params_Data() = delete;
};
static_assert(sizeof(PeerConnectionTrackerHost_GetDisplayMedia_Params_Data) == 32, "Bad sizeof(PeerConnectionTrackerHost_GetDisplayMedia_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionTrackerHost_GetDisplayMediaSuccess_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t request_id;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> stream_id;
    mojo::internal::Pointer<mojo::internal::String_Data> audio_track_info;
    mojo::internal::Pointer<mojo::internal::String_Data> video_track_info;

private:
    friend class mojo::internal::MessageFragment<PeerConnectionTrackerHost_GetDisplayMediaSuccess_Params_Data>;

    PeerConnectionTrackerHost_GetDisplayMediaSuccess_Params_Data();
    ~PeerConnectionTrackerHost_GetDisplayMediaSuccess_Params_Data() = delete;
};
static_assert(
    sizeof(PeerConnectionTrackerHost_GetDisplayMediaSuccess_Params_Data) == 40, "Bad sizeof(PeerConnectionTrackerHost_GetDisplayMediaSuccess_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionTrackerHost_GetDisplayMediaFailure_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t request_id;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> error;
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<PeerConnectionTrackerHost_GetDisplayMediaFailure_Params_Data>;

    PeerConnectionTrackerHost_GetDisplayMediaFailure_Params_Data();
    ~PeerConnectionTrackerHost_GetDisplayMediaFailure_Params_Data() = delete;
};
static_assert(
    sizeof(PeerConnectionTrackerHost_GetDisplayMediaFailure_Params_Data) == 32, "Bad sizeof(PeerConnectionTrackerHost_GetDisplayMediaFailure_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionTrackerHost_WebRtcEventLogWrite_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t lid;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> output;

private:
    friend class mojo::internal::MessageFragment<PeerConnectionTrackerHost_WebRtcEventLogWrite_Params_Data>;

    PeerConnectionTrackerHost_WebRtcEventLogWrite_Params_Data();
    ~PeerConnectionTrackerHost_WebRtcEventLogWrite_Params_Data() = delete;
};
static_assert(sizeof(PeerConnectionTrackerHost_WebRtcEventLogWrite_Params_Data) == 24, "Bad sizeof(PeerConnectionTrackerHost_WebRtcEventLogWrite_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionTrackerHost_AddStandardStats_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t lid;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ListValue_Data> value;

private:
    friend class mojo::internal::MessageFragment<PeerConnectionTrackerHost_AddStandardStats_Params_Data>;

    PeerConnectionTrackerHost_AddStandardStats_Params_Data();
    ~PeerConnectionTrackerHost_AddStandardStats_Params_Data() = delete;
};
static_assert(sizeof(PeerConnectionTrackerHost_AddStandardStats_Params_Data) == 24, "Bad sizeof(PeerConnectionTrackerHost_AddStandardStats_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeerConnectionTrackerHost_AddLegacyStats_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t lid;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ListValue_Data> value;

private:
    friend class mojo::internal::MessageFragment<PeerConnectionTrackerHost_AddLegacyStats_Params_Data>;

    PeerConnectionTrackerHost_AddLegacyStats_Params_Data();
    ~PeerConnectionTrackerHost_AddLegacyStats_Params_Data() = delete;
};
static_assert(sizeof(PeerConnectionTrackerHost_AddLegacyStats_Params_Data) == 24, "Bad sizeof(PeerConnectionTrackerHost_AddLegacyStats_Params_Data)");

} // namespace internal

class PeerConnectionManager_OnSuspend_ParamsDataView {
public:
    PeerConnectionManager_OnSuspend_ParamsDataView() = default;

    PeerConnectionManager_OnSuspend_ParamsDataView(internal::PeerConnectionManager_OnSuspend_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::PeerConnectionManager_OnSuspend_Params_Data* data_ = nullptr;
};

class PeerConnectionManager_OnThermalStateChange_ParamsDataView {
public:
    PeerConnectionManager_OnThermalStateChange_ParamsDataView() = default;

    PeerConnectionManager_OnThermalStateChange_ParamsDataView(internal::PeerConnectionManager_OnThermalStateChange_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
