// ui/webui/resources/cr_components/app_management/app_management.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef UI_WEBUI_RESOURCES_CR_COMPONENTS_APP_MANAGEMENT_APP_MANAGEMENT_MOJOM_PARAMS_DATA_H_
#define UI_WEBUI_RESOURCES_CR_COMPONENTS_APP_MANAGEMENT_APP_MANAGEMENT_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace app_management::mojom {
namespace internal {
class PageHandlerFactory_CreatePageHandler_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data page;
    mojo::internal::Handle_Data handler;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PageHandlerFactory_CreatePageHandler_Params_Data>;

    PageHandlerFactory_CreatePageHandler_Params_Data();
    ~PageHandlerFactory_CreatePageHandler_Params_Data() = delete;
};
static_assert(sizeof(PageHandlerFactory_CreatePageHandler_Params_Data) == 24, "Bad sizeof(PageHandlerFactory_CreatePageHandler_Params_Data)");
class PageHandler_GetApps_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PageHandler_GetApps_Params_Data>;

    PageHandler_GetApps_Params_Data();
    ~PageHandler_GetApps_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_GetApps_Params_Data) == 8, "Bad sizeof(PageHandler_GetApps_Params_Data)");
class PageHandler_GetApps_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::App_Data>>> apps;

private:
    friend class mojo::internal::MessageFragment<PageHandler_GetApps_ResponseParams_Data>;

    PageHandler_GetApps_ResponseParams_Data();
    ~PageHandler_GetApps_ResponseParams_Data() = delete;
};
static_assert(sizeof(PageHandler_GetApps_ResponseParams_Data) == 16, "Bad sizeof(PageHandler_GetApps_ResponseParams_Data)");
class PageHandler_GetApp_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<PageHandler_GetApp_Params_Data>;

    PageHandler_GetApp_Params_Data();
    ~PageHandler_GetApp_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_GetApp_Params_Data) == 16, "Bad sizeof(PageHandler_GetApp_Params_Data)");
class PageHandler_GetApp_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::App_Data> app;

private:
    friend class mojo::internal::MessageFragment<PageHandler_GetApp_ResponseParams_Data>;

    PageHandler_GetApp_ResponseParams_Data();
    ~PageHandler_GetApp_ResponseParams_Data() = delete;
};
static_assert(sizeof(PageHandler_GetApp_ResponseParams_Data) == 16, "Bad sizeof(PageHandler_GetApp_ResponseParams_Data)");
class PageHandler_GetSubAppToParentMap_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PageHandler_GetSubAppToParentMap_Params_Data>;

    PageHandler_GetSubAppToParentMap_Params_Data();
    ~PageHandler_GetSubAppToParentMap_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_GetSubAppToParentMap_Params_Data) == 8, "Bad sizeof(PageHandler_GetSubAppToParentMap_Params_Data)");
class PageHandler_GetSubAppToParentMap_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<
        mojo::internal::Map_Data<mojo::internal::Pointer<mojo::internal::String_Data>, mojo::internal::Pointer<mojo::internal::String_Data>>>
        sub_app_to_parent_map;

private:
    friend class mojo::internal::MessageFragment<PageHandler_GetSubAppToParentMap_ResponseParams_Data>;

    PageHandler_GetSubAppToParentMap_ResponseParams_Data();
    ~PageHandler_GetSubAppToParentMap_ResponseParams_Data() = delete;
};
static_assert(sizeof(PageHandler_GetSubAppToParentMap_ResponseParams_Data) == 16, "Bad sizeof(PageHandler_GetSubAppToParentMap_ResponseParams_Data)");
class PageHandler_GetExtensionAppPermissionMessages_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<PageHandler_GetExtensionAppPermissionMessages_Params_Data>;

    PageHandler_GetExtensionAppPermissionMessages_Params_Data();
    ~PageHandler_GetExtensionAppPermissionMessages_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_GetExtensionAppPermissionMessages_Params_Data) == 16, "Bad sizeof(PageHandler_GetExtensionAppPermissionMessages_Params_Data)");
class PageHandler_GetExtensionAppPermissionMessages_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::ExtensionAppPermissionMessage_Data>>> messages;

private:
    friend class mojo::internal::MessageFragment<PageHandler_GetExtensionAppPermissionMessages_ResponseParams_Data>;

    PageHandler_GetExtensionAppPermissionMessages_ResponseParams_Data();
    ~PageHandler_GetExtensionAppPermissionMessages_ResponseParams_Data() = delete;
};
static_assert(sizeof(PageHandler_GetExtensionAppPermissionMessages_ResponseParams_Data) == 16,
    "Bad sizeof(PageHandler_GetExtensionAppPermissionMessages_ResponseParams_Data)");
class PageHandler_SetPinned_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    uint8_t pinned : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PageHandler_SetPinned_Params_Data>;

    PageHandler_SetPinned_Params_Data();
    ~PageHandler_SetPinned_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_SetPinned_Params_Data) == 24, "Bad sizeof(PageHandler_SetPinned_Params_Data)");
class PageHandler_SetPermission_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    mojo::internal::Pointer<internal::Permission_Data> permission;

private:
    friend class mojo::internal::MessageFragment<PageHandler_SetPermission_Params_Data>;

    PageHandler_SetPermission_Params_Data();
    ~PageHandler_SetPermission_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_SetPermission_Params_Data) == 24, "Bad sizeof(PageHandler_SetPermission_Params_Data)");
class PageHandler_SetResizeLocked_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    uint8_t locked : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PageHandler_SetResizeLocked_Params_Data>;

    PageHandler_SetResizeLocked_Params_Data();
    ~PageHandler_SetResizeLocked_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_SetResizeLocked_Params_Data) == 24, "Bad sizeof(PageHandler_SetResizeLocked_Params_Data)");
class PageHandler_Uninstall_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<PageHandler_Uninstall_Params_Data>;

    PageHandler_Uninstall_Params_Data();
    ~PageHandler_Uninstall_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_Uninstall_Params_Data) == 16, "Bad sizeof(PageHandler_Uninstall_Params_Data)");
class PageHandler_OpenNativeSettings_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<PageHandler_OpenNativeSettings_Params_Data>;

    PageHandler_OpenNativeSettings_Params_Data();
    ~PageHandler_OpenNativeSettings_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_OpenNativeSettings_Params_Data) == 16, "Bad sizeof(PageHandler_OpenNativeSettings_Params_Data)");
class PageHandler_SetPreferredApp_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    uint8_t is_preferred_app : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PageHandler_SetPreferredApp_Params_Data>;

    PageHandler_SetPreferredApp_Params_Data();
    ~PageHandler_SetPreferredApp_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_SetPreferredApp_Params_Data) == 24, "Bad sizeof(PageHandler_SetPreferredApp_Params_Data)");
class PageHandler_GetOverlappingPreferredApps_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<PageHandler_GetOverlappingPreferredApps_Params_Data>;

    PageHandler_GetOverlappingPreferredApps_Params_Data();
    ~PageHandler_GetOverlappingPreferredApps_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_GetOverlappingPreferredApps_Params_Data) == 16, "Bad sizeof(PageHandler_GetOverlappingPreferredApps_Params_Data)");
class PageHandler_GetOverlappingPreferredApps_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> app_ids;

private:
    friend class mojo::internal::MessageFragment<PageHandler_GetOverlappingPreferredApps_ResponseParams_Data>;

    PageHandler_GetOverlappingPreferredApps_ResponseParams_Data();
    ~PageHandler_GetOverlappingPreferredApps_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(PageHandler_GetOverlappingPreferredApps_ResponseParams_Data) == 16, "Bad sizeof(PageHandler_GetOverlappingPreferredApps_ResponseParams_Data)");
class PageHandler_UpdateAppSize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<PageHandler_UpdateAppSize_Params_Data>;

    PageHandler_UpdateAppSize_Params_Data();
    ~PageHandler_UpdateAppSize_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_UpdateAppSize_Params_Data) == 16, "Bad sizeof(PageHandler_UpdateAppSize_Params_Data)");
class PageHandler_SetWindowMode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    int32_t window_mode;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PageHandler_SetWindowMode_Params_Data>;

    PageHandler_SetWindowMode_Params_Data();
    ~PageHandler_SetWindowMode_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_SetWindowMode_Params_Data) == 24, "Bad sizeof(PageHandler_SetWindowMode_Params_Data)");
class PageHandler_SetRunOnOsLoginMode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    int32_t run_on_os_login_mode;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PageHandler_SetRunOnOsLoginMode_Params_Data>;

    PageHandler_SetRunOnOsLoginMode_Params_Data();
    ~PageHandler_SetRunOnOsLoginMode_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_SetRunOnOsLoginMode_Params_Data) == 24, "Bad sizeof(PageHandler_SetRunOnOsLoginMode_Params_Data)");
class PageHandler_SetFileHandlingEnabled_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    uint8_t enabled : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PageHandler_SetFileHandlingEnabled_Params_Data>;

    PageHandler_SetFileHandlingEnabled_Params_Data();
    ~PageHandler_SetFileHandlingEnabled_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_SetFileHandlingEnabled_Params_Data) == 24, "Bad sizeof(PageHandler_SetFileHandlingEnabled_Params_Data)");
class PageHandler_ShowDefaultAppAssociationsUi_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PageHandler_ShowDefaultAppAssociationsUi_Params_Data>;

    PageHandler_ShowDefaultAppAssociationsUi_Params_Data();
    ~PageHandler_ShowDefaultAppAssociationsUi_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_ShowDefaultAppAssociationsUi_Params_Data) == 8, "Bad sizeof(PageHandler_ShowDefaultAppAssociationsUi_Params_Data)");
class PageHandler_OpenStorePage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<PageHandler_OpenStorePage_Params_Data>;

    PageHandler_OpenStorePage_Params_Data();
    ~PageHandler_OpenStorePage_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_OpenStorePage_Params_Data) == 16, "Bad sizeof(PageHandler_OpenStorePage_Params_Data)");
class PageHandler_SetAppLocale_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    mojo::internal::Pointer<mojo::internal::String_Data> locale_tag;

private:
    friend class mojo::internal::MessageFragment<PageHandler_SetAppLocale_Params_Data>;

    PageHandler_SetAppLocale_Params_Data();
    ~PageHandler_SetAppLocale_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_SetAppLocale_Params_Data) == 24, "Bad sizeof(PageHandler_SetAppLocale_Params_Data)");
class Page_OnAppAdded_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::App_Data> app;

private:
    friend class mojo::internal::MessageFragment<Page_OnAppAdded_Params_Data>;

    Page_OnAppAdded_Params_Data();
    ~Page_OnAppAdded_Params_Data() = delete;
};
static_assert(sizeof(Page_OnAppAdded_Params_Data) == 16, "Bad sizeof(Page_OnAppAdded_Params_Data)");
class Page_OnAppChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::App_Data> update;

private:
    friend class mojo::internal::MessageFragment<Page_OnAppChanged_Params_Data>;

    Page_OnAppChanged_Params_Data();
    ~Page_OnAppChanged_Params_Data() = delete;
};
static_assert(sizeof(Page_OnAppChanged_Params_Data) == 16, "Bad sizeof(Page_OnAppChanged_Params_Data)");
class Page_OnAppRemoved_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<Page_OnAppRemoved_Params_Data>;

    Page_OnAppRemoved_Params_Data();
    ~Page_OnAppRemoved_Params_Data() = delete;
};
static_assert(sizeof(Page_OnAppRemoved_Params_Data) == 16, "Bad sizeof(Page_OnAppRemoved_Params_Data)");

} // namespace internal

class PageHandlerFactory_CreatePageHandler_ParamsDataView {
public:
    PageHandlerFactory_CreatePageHandler_ParamsDataView() = default;

    PageHandlerFactory_CreatePageHandler_ParamsDataView(internal::PageHandlerFactory_CreatePageHandler_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakePage()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::app_management::mojom::PageInterfaceBase>>(&data_->page, &result, message_);
        DCHECK(ret);
        return result;
    }
    template <typename UserType> UserType TakeHandler()
    {
        UserType result;
