// third_party/blink/public/mojom/filesystem/file_system.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_FILESYSTEM_FILE_SYSTEM_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_FILESYSTEM_FILE_SYSTEM_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemCancellableOperation_Cancel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FileSystemCancellableOperation_Cancel_Params_Data>;

    FileSystemCancellableOperation_Cancel_Params_Data();
    ~FileSystemCancellableOperation_Cancel_Params_Data() = delete;
};
static_assert(sizeof(FileSystemCancellableOperation_Cancel_Params_Data) == 8, "Bad sizeof(FileSystemCancellableOperation_Cancel_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemCancellableOperation_Cancel_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemCancellableOperation_Cancel_ResponseParams_Data>;

    FileSystemCancellableOperation_Cancel_ResponseParams_Data();
    ~FileSystemCancellableOperation_Cancel_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemCancellableOperation_Cancel_ResponseParams_Data) == 16, "Bad sizeof(FileSystemCancellableOperation_Cancel_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemOperationListener_ResultsRetrieved_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::filesystem::mojom::internal::DirectoryEntry_Data>>> entries;
    uint8_t has_more : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FileSystemOperationListener_ResultsRetrieved_Params_Data>;

    FileSystemOperationListener_ResultsRetrieved_Params_Data();
    ~FileSystemOperationListener_ResultsRetrieved_Params_Data() = delete;
};
static_assert(sizeof(FileSystemOperationListener_ResultsRetrieved_Params_Data) == 24, "Bad sizeof(FileSystemOperationListener_ResultsRetrieved_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemOperationListener_DidWrite_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t byte_count;
    uint8_t complete : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FileSystemOperationListener_DidWrite_Params_Data>;

    FileSystemOperationListener_DidWrite_Params_Data();
    ~FileSystemOperationListener_DidWrite_Params_Data() = delete;
};
static_assert(sizeof(FileSystemOperationListener_DidWrite_Params_Data) == 24, "Bad sizeof(FileSystemOperationListener_DidWrite_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemOperationListener_ErrorOccurred_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemOperationListener_ErrorOccurred_Params_Data>;

    FileSystemOperationListener_ErrorOccurred_Params_Data();
    ~FileSystemOperationListener_ErrorOccurred_Params_Data() = delete;
};
static_assert(sizeof(FileSystemOperationListener_ErrorOccurred_Params_Data) == 16, "Bad sizeof(FileSystemOperationListener_ErrorOccurred_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ReceivedSnapshotListener_DidReceiveSnapshotFile_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ReceivedSnapshotListener_DidReceiveSnapshotFile_Params_Data>;

    ReceivedSnapshotListener_DidReceiveSnapshotFile_Params_Data();
    ~ReceivedSnapshotListener_DidReceiveSnapshotFile_Params_Data() = delete;
};
static_assert(
    sizeof(ReceivedSnapshotListener_DidReceiveSnapshotFile_Params_Data) == 8, "Bad sizeof(ReceivedSnapshotListener_DidReceiveSnapshotFile_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_Open_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> origin;
    int32_t file_system_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_Open_Params_Data>;

    FileSystemManager_Open_Params_Data();
    ~FileSystemManager_Open_Params_Data() = delete;
};
static_assert(sizeof(FileSystemManager_Open_Params_Data) == 24, "Bad sizeof(FileSystemManager_Open_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_Open_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> name;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> root_url;
    int32_t error_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_Open_ResponseParams_Data>;

    FileSystemManager_Open_ResponseParams_Data();
    ~FileSystemManager_Open_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemManager_Open_ResponseParams_Data) == 32, "Bad sizeof(FileSystemManager_Open_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_ResolveURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> filesystem_url;

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_ResolveURL_Params_Data>;

    FileSystemManager_ResolveURL_Params_Data();
    ~FileSystemManager_ResolveURL_Params_Data() = delete;
};
static_assert(sizeof(FileSystemManager_ResolveURL_Params_Data) == 16, "Bad sizeof(FileSystemManager_ResolveURL_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_ResolveURL_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::FileSystemInfo_Data> info;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> file_path;
    uint8_t is_directory : 1;
    uint8_t pad2_[3];
    int32_t error_code;

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_ResolveURL_ResponseParams_Data>;

    FileSystemManager_ResolveURL_ResponseParams_Data();
    ~FileSystemManager_ResolveURL_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemManager_ResolveURL_ResponseParams_Data) == 32, "Bad sizeof(FileSystemManager_ResolveURL_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_Move_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> src_path;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> dest_path;

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_Move_Params_Data>;

    FileSystemManager_Move_Params_Data();
    ~FileSystemManager_Move_Params_Data() = delete;
};
static_assert(sizeof(FileSystemManager_Move_Params_Data) == 24, "Bad sizeof(FileSystemManager_Move_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_Move_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_Move_ResponseParams_Data>;

    FileSystemManager_Move_ResponseParams_Data();
    ~FileSystemManager_Move_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemManager_Move_ResponseParams_Data) == 16, "Bad sizeof(FileSystemManager_Move_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_Copy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> src_path;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> dest_path;

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_Copy_Params_Data>;

    FileSystemManager_Copy_Params_Data();
    ~FileSystemManager_Copy_Params_Data() = delete;
};
static_assert(sizeof(FileSystemManager_Copy_Params_Data) == 24, "Bad sizeof(FileSystemManager_Copy_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_Copy_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_Copy_ResponseParams_Data>;

    FileSystemManager_Copy_ResponseParams_Data();
    ~FileSystemManager_Copy_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemManager_Copy_ResponseParams_Data) == 16, "Bad sizeof(FileSystemManager_Copy_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_Remove_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> path;
    uint8_t recursive : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_Remove_Params_Data>;

    FileSystemManager_Remove_Params_Data();
    ~FileSystemManager_Remove_Params_Data() = delete;
};
static_assert(sizeof(FileSystemManager_Remove_Params_Data) == 24, "Bad sizeof(FileSystemManager_Remove_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_Remove_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_Remove_ResponseParams_Data>;

    FileSystemManager_Remove_ResponseParams_Data();
    ~FileSystemManager_Remove_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemManager_Remove_ResponseParams_Data) == 16, "Bad sizeof(FileSystemManager_Remove_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_ReadMetadata_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> path;

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_ReadMetadata_Params_Data>;

    FileSystemManager_ReadMetadata_Params_Data();
    ~FileSystemManager_ReadMetadata_Params_Data() = delete;
};
static_assert(sizeof(FileSystemManager_ReadMetadata_Params_Data) == 16, "Bad sizeof(FileSystemManager_ReadMetadata_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_ReadMetadata_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FileInfo_Data> file_info;
    int32_t error_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_ReadMetadata_ResponseParams_Data>;

    FileSystemManager_ReadMetadata_ResponseParams_Data();
    ~FileSystemManager_ReadMetadata_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemManager_ReadMetadata_ResponseParams_Data) == 24, "Bad sizeof(FileSystemManager_ReadMetadata_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_Create_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> path;
    uint8_t exclusive : 1;
    uint8_t is_directory : 1;
    uint8_t recursive : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_Create_Params_Data>;

    FileSystemManager_Create_Params_Data();
    ~FileSystemManager_Create_Params_Data() = delete;
};
static_assert(sizeof(FileSystemManager_Create_Params_Data) == 24, "Bad sizeof(FileSystemManager_Create_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_Create_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_Create_ResponseParams_Data>;

    FileSystemManager_Create_ResponseParams_Data();
    ~FileSystemManager_Create_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemManager_Create_ResponseParams_Data) == 16, "Bad sizeof(FileSystemManager_Create_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_Exists_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> path;
    uint8_t is_directory : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_Exists_Params_Data>;

    FileSystemManager_Exists_Params_Data();
    ~FileSystemManager_Exists_Params_Data() = delete;
};
static_assert(sizeof(FileSystemManager_Exists_Params_Data) == 24, "Bad sizeof(FileSystemManager_Exists_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_Exists_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_Exists_ResponseParams_Data>;

    FileSystemManager_Exists_ResponseParams_Data();
    ~FileSystemManager_Exists_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemManager_Exists_ResponseParams_Data) == 16, "Bad sizeof(FileSystemManager_Exists_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_ReadDirectory_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> path;
    mojo::internal::Interface_Data listener;

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_ReadDirectory_Params_Data>;

    FileSystemManager_ReadDirectory_Params_Data();
    ~FileSystemManager_ReadDirectory_Params_Data() = delete;
};
static_assert(sizeof(FileSystemManager_ReadDirectory_Params_Data) == 24, "Bad sizeof(FileSystemManager_ReadDirectory_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_ReadDirectorySync_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> path;

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_ReadDirectorySync_Params_Data>;

    FileSystemManager_ReadDirectorySync_Params_Data();
    ~FileSystemManager_ReadDirectorySync_Params_Data() = delete;
};
static_assert(sizeof(FileSystemManager_ReadDirectorySync_Params_Data) == 16, "Bad sizeof(FileSystemManager_ReadDirectorySync_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_ReadDirectorySync_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::filesystem::mojom::internal::DirectoryEntry_Data>>> entries;
    int32_t error_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_ReadDirectorySync_ResponseParams_Data>;

    FileSystemManager_ReadDirectorySync_ResponseParams_Data();
    ~FileSystemManager_ReadDirectorySync_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemManager_ReadDirectorySync_ResponseParams_Data) == 24, "Bad sizeof(FileSystemManager_ReadDirectorySync_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_Write_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> file_path;
    mojo::internal::Interface_Data blob;
    int64_t position;
    mojo::internal::Handle_Data op_receiver;
    mojo::internal::Interface_Data listener;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_Write_Params_Data>;

    FileSystemManager_Write_Params_Data();
    ~FileSystemManager_Write_Params_Data() = delete;
};
static_assert(sizeof(FileSystemManager_Write_Params_Data) == 48, "Bad sizeof(FileSystemManager_Write_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_WriteSync_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> file_path;
    mojo::internal::Interface_Data blob;
    int64_t position;

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_WriteSync_Params_Data>;

    FileSystemManager_WriteSync_Params_Data();
    ~FileSystemManager_WriteSync_Params_Data() = delete;
};
static_assert(sizeof(FileSystemManager_WriteSync_Params_Data) == 32, "Bad sizeof(FileSystemManager_WriteSync_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_WriteSync_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t byte_count;
    int32_t error_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_WriteSync_ResponseParams_Data>;

    FileSystemManager_WriteSync_ResponseParams_Data();
    ~FileSystemManager_WriteSync_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemManager_WriteSync_ResponseParams_Data) == 24, "Bad sizeof(FileSystemManager_WriteSync_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_Truncate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> file_path;
    int64_t length;
    mojo::internal::Handle_Data op_receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_Truncate_Params_Data>;

    FileSystemManager_Truncate_Params_Data();
    ~FileSystemManager_Truncate_Params_Data() = delete;
};
static_assert(sizeof(FileSystemManager_Truncate_Params_Data) == 32, "Bad sizeof(FileSystemManager_Truncate_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_Truncate_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_Truncate_ResponseParams_Data>;

    FileSystemManager_Truncate_ResponseParams_Data();
    ~FileSystemManager_Truncate_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemManager_Truncate_ResponseParams_Data) == 16, "Bad sizeof(FileSystemManager_Truncate_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_TruncateSync_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> file_path;
    int64_t length;

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_TruncateSync_Params_Data>;

    FileSystemManager_TruncateSync_Params_Data();
    ~FileSystemManager_TruncateSync_Params_Data() = delete;
};
static_assert(sizeof(FileSystemManager_TruncateSync_Params_Data) == 24, "Bad sizeof(FileSystemManager_TruncateSync_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_TruncateSync_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_TruncateSync_ResponseParams_Data>;

    FileSystemManager_TruncateSync_ResponseParams_Data();
    ~FileSystemManager_TruncateSync_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemManager_TruncateSync_ResponseParams_Data) == 16, "Bad sizeof(FileSystemManager_TruncateSync_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_CreateSnapshotFile_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> file_path;

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_CreateSnapshotFile_Params_Data>;

    FileSystemManager_CreateSnapshotFile_Params_Data();
    ~FileSystemManager_CreateSnapshotFile_Params_Data() = delete;
};
static_assert(sizeof(FileSystemManager_CreateSnapshotFile_Params_Data) == 16, "Bad sizeof(FileSystemManager_CreateSnapshotFile_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_CreateSnapshotFile_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FileInfo_Data> file_info;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> platform_path;
    int32_t error_code;
    mojo::internal::Interface_Data snapshot_listener;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_CreateSnapshotFile_ResponseParams_Data>;

    FileSystemManager_CreateSnapshotFile_ResponseParams_Data();
    ~FileSystemManager_CreateSnapshotFile_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemManager_CreateSnapshotFile_ResponseParams_Data) == 40, "Bad sizeof(FileSystemManager_CreateSnapshotFile_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_GetPlatformPath_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> file_path;

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_GetPlatformPath_Params_Data>;

    FileSystemManager_GetPlatformPath_Params_Data();
    ~FileSystemManager_GetPlatformPath_Params_Data() = delete;
};
static_assert(sizeof(FileSystemManager_GetPlatformPath_Params_Data) == 16, "Bad sizeof(FileSystemManager_GetPlatformPath_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_GetPlatformPath_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> platform_path;

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_GetPlatformPath_ResponseParams_Data>;

    FileSystemManager_GetPlatformPath_ResponseParams_Data();
    ~FileSystemManager_GetPlatformPath_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemManager_GetPlatformPath_ResponseParams_Data) == 16, "Bad sizeof(FileSystemManager_GetPlatformPath_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_RegisterBlob_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> content_type;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    uint64_t length;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> expected_modification_time;

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_RegisterBlob_Params_Data>;

    FileSystemManager_RegisterBlob_Params_Data();
    ~FileSystemManager_RegisterBlob_Params_Data() = delete;
};
static_assert(sizeof(FileSystemManager_RegisterBlob_Params_Data) == 40, "Bad sizeof(FileSystemManager_RegisterBlob_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemManager_RegisterBlob_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::SerializedBlob_Data> blob;

private:
    friend class mojo::internal::MessageFragment<FileSystemManager_RegisterBlob_ResponseParams_Data>;

    FileSystemManager_RegisterBlob_ResponseParams_Data();
    ~FileSystemManager_RegisterBlob_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemManager_RegisterBlob_ResponseParams_Data) == 16, "Bad sizeof(FileSystemManager_RegisterBlob_ResponseParams_Data)");

} // namespace internal

class FileSystemCancellableOperation_Cancel_ParamsDataView {
public:
    FileSystemCancellableOperation_Cancel_ParamsDataView() = default;

    FileSystemCancellableOperation_Cancel_ParamsDataView(internal::FileSystemCancellableOperation_Cancel_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::FileSystemCancellableOperation_Cancel_Params_Data* data_ = nullptr;
};

class FileSystemCancellableOperation_Cancel_ResponseParamsDataView {
public:
    FileSystemCancellableOperation_Cancel_ResponseParamsDataView() = default;

    FileSystemCancellableOperation_Cancel_ResponseParamsDataView(
        internal::FileSystemCancellableOperation_Cancel_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
