// third_party/blink/public/mojom/dwrite_font_proxy/dwrite_font_proxy.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_DWRITE_FONT_PROXY_DWRITE_FONT_PROXY_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_DWRITE_FONT_PROXY_DWRITE_FONT_PROXY_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_FindFamily_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> family_name;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_FindFamily_Params_Data>;

    DWriteFontProxy_FindFamily_Params_Data();
    ~DWriteFontProxy_FindFamily_Params_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_FindFamily_Params_Data) == 16, "Bad sizeof(DWriteFontProxy_FindFamily_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_FindFamily_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t out_index;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_FindFamily_ResponseParams_Data>;

    DWriteFontProxy_FindFamily_ResponseParams_Data();
    ~DWriteFontProxy_FindFamily_ResponseParams_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_FindFamily_ResponseParams_Data) == 16, "Bad sizeof(DWriteFontProxy_FindFamily_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_GetFamilyCount_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_GetFamilyCount_Params_Data>;

    DWriteFontProxy_GetFamilyCount_Params_Data();
    ~DWriteFontProxy_GetFamilyCount_Params_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_GetFamilyCount_Params_Data) == 8, "Bad sizeof(DWriteFontProxy_GetFamilyCount_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_GetFamilyCount_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t out_count;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_GetFamilyCount_ResponseParams_Data>;

    DWriteFontProxy_GetFamilyCount_ResponseParams_Data();
    ~DWriteFontProxy_GetFamilyCount_ResponseParams_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_GetFamilyCount_ResponseParams_Data) == 16, "Bad sizeof(DWriteFontProxy_GetFamilyCount_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_GetFamilyNames_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t family_index;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_GetFamilyNames_Params_Data>;

    DWriteFontProxy_GetFamilyNames_Params_Data();
    ~DWriteFontProxy_GetFamilyNames_Params_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_GetFamilyNames_Params_Data) == 16, "Bad sizeof(DWriteFontProxy_GetFamilyNames_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_GetFamilyNames_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::DWriteStringPair_Data>>> out_family_names;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_GetFamilyNames_ResponseParams_Data>;

    DWriteFontProxy_GetFamilyNames_ResponseParams_Data();
    ~DWriteFontProxy_GetFamilyNames_ResponseParams_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_GetFamilyNames_ResponseParams_Data) == 16, "Bad sizeof(DWriteFontProxy_GetFamilyNames_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_GetFontFileHandles_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t family_index;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_GetFontFileHandles_Params_Data>;

    DWriteFontProxy_GetFontFileHandles_Params_Data();
    ~DWriteFontProxy_GetFontFileHandles_Params_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_GetFontFileHandles_Params_Data) == 16, "Bad sizeof(DWriteFontProxy_GetFontFileHandles_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_GetFontFileHandles_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyFile_Data>>> file_handles;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_GetFontFileHandles_ResponseParams_Data>;

    DWriteFontProxy_GetFontFileHandles_ResponseParams_Data();
    ~DWriteFontProxy_GetFontFileHandles_ResponseParams_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_GetFontFileHandles_ResponseParams_Data) == 16, "Bad sizeof(DWriteFontProxy_GetFontFileHandles_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_MatchUniqueFont_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> font_unique_name;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_MatchUniqueFont_Params_Data>;

    DWriteFontProxy_MatchUniqueFont_Params_Data();
    ~DWriteFontProxy_MatchUniqueFont_Params_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_MatchUniqueFont_Params_Data) == 16, "Bad sizeof(DWriteFontProxy_MatchUniqueFont_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_MatchUniqueFont_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyFile_Data> file_handle;
    uint32_t ttc_index;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_MatchUniqueFont_ResponseParams_Data>;

    DWriteFontProxy_MatchUniqueFont_ResponseParams_Data();
    ~DWriteFontProxy_MatchUniqueFont_ResponseParams_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_MatchUniqueFont_ResponseParams_Data) == 24, "Bad sizeof(DWriteFontProxy_MatchUniqueFont_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_MapCharacters_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> text;
    mojo::internal::Pointer<internal::DWriteFontStyle_Data> font_style;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> locale_name;
    uint32_t reading_direction;
    uint8_t pad3_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> base_family_name;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_MapCharacters_Params_Data>;

    DWriteFontProxy_MapCharacters_Params_Data();
    ~DWriteFontProxy_MapCharacters_Params_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_MapCharacters_Params_Data) == 48, "Bad sizeof(DWriteFontProxy_MapCharacters_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_MapCharacters_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::MapCharactersResult_Data> out;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_MapCharacters_ResponseParams_Data>;

    DWriteFontProxy_MapCharacters_ResponseParams_Data();
    ~DWriteFontProxy_MapCharacters_ResponseParams_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_MapCharacters_ResponseParams_Data) == 16, "Bad sizeof(DWriteFontProxy_MapCharacters_ResponseParams_Data)");

} // namespace internal

class DWriteFontProxy_FindFamily_ParamsDataView {
public:
    DWriteFontProxy_FindFamily_ParamsDataView() = default;

    DWriteFontProxy_FindFamily_ParamsDataView(internal::DWriteFontProxy_FindFamily_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetFamilyNameDataView(::mojo_base::mojom::String16DataView* output);

    template <typename UserType> [[nodiscard]] bool ReadFamilyName(UserType* output)
    {

        auto* pointer = data_->family_name.Get();
        return mojo::internal::Deserialize<::mojo_base::mojom::String16DataView>(pointer, output, message_);
    }

private:
    internal::DWriteFontProxy_FindFamily_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class DWriteFontProxy_FindFamily_ResponseParamsDataView {
public:
    DWriteFontProxy_FindFamily_ResponseParamsDataView() = default;

    DWriteFontProxy_FindFamily_ResponseParamsDataView(internal::DWriteFontProxy_FindFamily_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    uint32_t out_index() const
    {
        return data_->out_index;
    }

private:
    internal::DWriteFontProxy_FindFamily_ResponseParams_Data* data_ = nullptr;
};

class DWriteFontProxy_GetFamilyCount_ParamsDataView {
public:
    DWriteFontProxy_GetFamilyCount_ParamsDataView() = default;

    DWriteFontProxy_GetFamilyCount_ParamsDataView(internal::DWriteFontProxy_GetFamilyCount_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::DWriteFontProxy_GetFamilyCount_Params_Data* data_ = nullptr;
};

class DWriteFontProxy_GetFamilyCount_ResponseParamsDataView {
public:
    DWriteFontProxy_GetFamilyCount_ResponseParamsDataView() = default;

    DWriteFontProxy_GetFamilyCount_ResponseParamsDataView(internal::DWriteFontProxy_GetFamilyCount_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    uint32_t out_count() const
    {
        return data_->out_count;
    }

private:
    internal::DWriteFontProxy_GetFamilyCount_ResponseParams_Data* data_ = nullptr;
};

class DWriteFontProxy_GetFamilyNames_ParamsDataView {
public:
    DWriteFontProxy_GetFamilyNames_ParamsDataView() = default;

    DWriteFontProxy_GetFamilyNames_ParamsDataView(internal::DWriteFontProxy_GetFamilyNames_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    uint32_t family_index() const
    {
        return data_->family_index;
    }

private:
    internal::DWriteFontProxy_GetFamilyNames_Params_Data* data_ = nullptr;
};

class DWriteFontProxy_GetFamilyNames_ResponseParamsDataView {
public:
    DWriteFontProxy_GetFamilyNames_ResponseParamsDataView() = default;

    DWriteFontProxy_GetFamilyNames_ResponseParamsDataView(internal::DWriteFontProxy_GetFamilyNames_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetOutFamilyNamesDataView(mojo::ArrayDataView<DWriteStringPairDataView>* output);

    template <typename UserType> [[nodiscard]] bool ReadOutFamilyNames(UserType* output)
    {

        auto* pointer = data_->out_family_names.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<::blink::mojom::DWriteStringPairDataView>>(pointer, output, message_);
    }

private:
    internal::DWriteFontProxy_GetFamilyNames_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class DWriteFontProxy_GetFontFileHandles_ParamsDataView {
public:
    DWriteFontProxy_GetFontFileHandles_ParamsDataView() = default;

    DWriteFontProxy_GetFontFileHandles_ParamsDataView(internal::DWriteFontProxy_GetFontFileHandles_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    uint32_t family_index() const
    {
        return data_->family_index;
    }

private:
    internal::DWriteFontProxy_GetFontFileHandles_Params_Data* data_ = nullptr;
};

class DWriteFontProxy_GetFontFileHandles_ResponseParamsDataView {
public:
    DWriteFontProxy_GetFontFileHandles_ResponseParamsDataView() = default;

    DWriteFontProxy_GetFontFileHandles_ResponseParamsDataView(internal::DWriteFontProxy_GetFontFileHandles_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetFileHandlesDataView(mojo::ArrayDataView<::mojo_base::mojom::ReadOnlyFileDataView>* output);

    template <typename UserType> [[nodiscard]] bool ReadFileHandles(UserType* output)
    {

        auto* pointer = data_->file_handles.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<::mojo_base::mojom::ReadOnlyFileDataView>>(pointer, output, message_);
    }

private:
    internal::DWriteFontProxy_GetFontFileHandles_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class DWriteFontProxy_MatchUniqueFont_ParamsDataView {
public:
    DWriteFontProxy_MatchUniqueFont_ParamsDataView() = default;

    DWriteFontProxy_MatchUniqueFont_ParamsDataView(internal::DWriteFontProxy_MatchUniqueFont_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetFontUniqueNameDataView(::mojo_base::mojom::String16DataView* output);

    template <typename UserType> [[nodiscard]] bool ReadFontUniqueName(UserType* output)
    {

        auto* pointer = data_->font_unique_name.Get();
        return mojo::internal::Deserialize<::mojo_base::mojom::String16DataView>(pointer, output, message_);
    }

private:
    internal::DWriteFontProxy_MatchUniqueFont_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class DWriteFontProxy_MatchUniqueFont_ResponseParamsDataView {
public:
    DWriteFontProxy_MatchUniqueFont_ResponseParamsDataView() = default;

    DWriteFontProxy_MatchUniqueFont_ResponseParamsDataView(internal::DWriteFontProxy_MatchUniqueFont_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetFileHandleDataView(::mojo_base::mojom::ReadOnlyFileDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadFileHandle(UserType* output)
    {

        static_assert(mojo::internal::IsValidUserTypeForOptionalValue<::mojo_base::mojom::ReadOnlyFileDataView, UserType>(),
            "Attempting to read the optional `file_handle` field into a type which "
            "cannot represent a null value. Either wrap the destination object "
            "with std::optional, ensure that any corresponding "
            "{Struct/Union/Array/String}Traits define the necessary IsNull and "
            "SetToNull methods, or use `MaybeReadFileHandle` instead "
            "of `ReadFileHandle if you're fine with null values being "
            "silently ignored in this case.");
        auto* pointer = data_->file_handle.Get();
        return mojo::internal::Deserialize<::mojo_base::mojom::ReadOnlyFileDataView>(pointer, output, message_);
    }
    uint32_t ttc_index() const
    {
        return data_->ttc_index;
    }

private:
    internal::DWriteFontProxy_MatchUniqueFont_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class DWriteFontProxy_MapCharacters_ParamsDataView {
public:
    DWriteFontProxy_MapCharacters_ParamsDataView() = default;

    DWriteFontProxy_MapCharacters_ParamsDataView(internal::DWriteFontProxy_MapCharacters_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetTextDataView(::mojo_base::mojom::String16DataView* output);

    template <typename UserType> [[nodiscard]] bool ReadText(UserType* output)
    {

        auto* pointer = data_->text.Get();
        return mojo::internal::Deserialize<::mojo_base::mojom::String16DataView>(pointer, output, message_);
    }
    inline void GetFontStyleDataView(DWriteFontStyleDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadFontStyle(UserType* output)
    {

        auto* pointer = data_->font_style.Get();
        return mojo::internal::Deserialize<::blink::mojom::DWriteFontStyleDataView>(pointer, output, message_);
    }
    inline void GetLocaleNameDataView(::mojo_base::mojom::String16DataView* output);

    template <typename UserType> [[nodiscard]] bool ReadLocaleName(UserType* output)
    {

        auto* pointer = data_->locale_name.Get();
        return mojo::internal::Deserialize<::mojo_base::mojom::String16DataView>(pointer, output, message_);
    }
    uint32_t reading_direction() const
    {
        return data_->reading_direction;
    }
    inline void GetBaseFamilyNameDataView(::mojo_base::mojom::String16DataView* output);

    template <typename UserType> [[nodiscard]] bool ReadBaseFamilyName(UserType* output)
    {

        auto* pointer = data_->base_family_name.Get();
        return mojo::internal::Deserialize<::mojo_base::mojom::String16DataView>(pointer, output, message_);
    }

private:
    internal::DWriteFontProxy_MapCharacters_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class DWriteFontProxy_MapCharacters_ResponseParamsDataView {
public:
    DWriteFontProxy_MapCharacters_ResponseParamsDataView() = default;

    DWriteFontProxy_MapCharacters_ResponseParamsDataView(internal::DWriteFontProxy_MapCharacters_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetOutDataView(MapCharactersResultDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadOut(UserType* output)
    {

        auto* pointer = data_->out.Get();
        return mojo::internal::Deserialize<::blink::mojom::MapCharactersResultDataView>(pointer, output, message_);
    }

private:
    internal::DWriteFontProxy_MapCharacters_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

inline void DWriteFontProxy_FindFamily_ParamsDataView::GetFamilyNameDataView(::mojo_base::mojom::String16DataView* output)
{
    auto pointer = data_->family_name.Get();
    *output = ::mojo_base::mojom::String16DataView(pointer, message_);
}

inline void DWriteFontProxy_GetFamilyNames_ResponseParamsDataView::GetOutFamilyNamesDataView(mojo::ArrayDataView<DWriteStringPairDataView>* output)
{
    auto pointer = data_->out_family_names.Get();
    *output = mojo::ArrayDataView<DWriteStringPairDataView>(pointer, message_);
}

inline void DWriteFontProxy_GetFontFileHandles_ResponseParamsDataView::GetFileHandlesDataView(
    mojo::ArrayDataView<::mojo_base::mojom::ReadOnlyFileDataView>* output)
{
    auto pointer = data_->file_handles.Get();
    *output = mojo::ArrayDataView<::mojo_base::mojom::ReadOnlyFileDataView>(pointer, message_);
}

inline void DWriteFontProxy_MatchUniqueFont_ParamsDataView::GetFontUniqueNameDataView(::mojo_base::mojom::String16DataView* output)
{
    auto pointer = data_->font_unique_name.Get();
    *output = ::mojo_base::mojom::String16DataView(pointer, message_);
}

inline void DWriteFontProxy_MatchUniqueFont_ResponseParamsDataView::GetFileHandleDataView(::mojo_base::mojom::ReadOnlyFileDataView* output)
{
    auto pointer = data_->file_handle.Get();
    *output = ::mojo_base::mojom::ReadOnlyFileDataView(pointer, message_);
}

inline void DWriteFontProxy_MapCharacters_ParamsDataView::GetTextDataView(::mojo_base::mojom::String16DataView* output)
{
    auto pointer = data_->text.Get();
    *output = ::mojo_base::mojom::String16DataView(pointer, message_);
}
inline void DWriteFontProxy_MapCharacters_ParamsDataView::GetFontStyleDataView(DWriteFontStyleDataView* output)
{
    auto pointer = data_->font_style.Get();
    *output = DWriteFontStyleDataView(pointer, message_);
}
inline void DWriteFontProxy_MapCharacters_ParamsDataView::GetLocaleNameDataView(::mojo_base::mojom::String16DataView* output)
{
    auto pointer = data_->locale_name.Get();
    *output = ::mojo_base::mojom::String16DataView(pointer, message_);
}
inline void DWriteFontProxy_MapCharacters_ParamsDataView::GetBaseFamilyNameDataView(::mojo_base::mojom::String16DataView* output)
{
    auto pointer = data_->base_family_name.Get();
    *output = ::mojo_base::mojom::String16DataView(pointer, message_);
}

inline void DWriteFontProxy_MapCharacters_ResponseParamsDataView::GetOutDataView(MapCharactersResultDataView* output)
{
    auto pointer = data_->out.Get();
    *output = MapCharactersResultDataView(pointer, message_);
}

} // blink::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // THIRD_PARTY_BLINK_PUBLIC_MOJOM_DWRITE_FONT_PROXY_DWRITE_FONT_PROXY_MOJOM_PARAMS_DATA_H_
