// components/safe_browsing/content/common/safe_browsing.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_SAFE_BROWSING_CONTENT_COMMON_SAFE_BROWSING_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_SAFE_BROWSING_CONTENT_COMMON_SAFE_BROWSING_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace safe_browsing::mojom {
namespace internal {
class SafeBrowsing_CreateCheckerAndCheck_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::LocalFrameToken_Data> frame_token;
    mojo::internal::Handle_Data receiver;
    int32_t load_flags;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<mojo::internal::String_Data> method;
    mojo::internal::Pointer<::network::mojom::internal::HttpRequestHeaders_Data> headers;
    uint8_t has_user_gesture : 1;
    uint8_t originated_from_service_worker : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<SafeBrowsing_CreateCheckerAndCheck_Params_Data>;

    SafeBrowsing_CreateCheckerAndCheck_Params_Data();
    ~SafeBrowsing_CreateCheckerAndCheck_Params_Data() = delete;
};
static_assert(sizeof(SafeBrowsing_CreateCheckerAndCheck_Params_Data) == 56, "Bad sizeof(SafeBrowsing_CreateCheckerAndCheck_Params_Data)");
class SafeBrowsing_CreateCheckerAndCheck_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t proceed : 1;
    uint8_t showed_interstitial : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<SafeBrowsing_CreateCheckerAndCheck_ResponseParams_Data>;

    SafeBrowsing_CreateCheckerAndCheck_ResponseParams_Data();
    ~SafeBrowsing_CreateCheckerAndCheck_ResponseParams_Data() = delete;
};
static_assert(sizeof(SafeBrowsing_CreateCheckerAndCheck_ResponseParams_Data) == 16, "Bad sizeof(SafeBrowsing_CreateCheckerAndCheck_ResponseParams_Data)");
class SafeBrowsing_Clone_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SafeBrowsing_Clone_Params_Data>;

    SafeBrowsing_Clone_Params_Data();
    ~SafeBrowsing_Clone_Params_Data() = delete;
};
static_assert(sizeof(SafeBrowsing_Clone_Params_Data) == 16, "Bad sizeof(SafeBrowsing_Clone_Params_Data)");
class ThreatReporter_GetThreatDOMDetails_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ThreatReporter_GetThreatDOMDetails_Params_Data>;

    ThreatReporter_GetThreatDOMDetails_Params_Data();
    ~ThreatReporter_GetThreatDOMDetails_Params_Data() = delete;
};
static_assert(sizeof(ThreatReporter_GetThreatDOMDetails_Params_Data) == 8, "Bad sizeof(ThreatReporter_GetThreatDOMDetails_Params_Data)");
class ThreatReporter_GetThreatDOMDetails_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::ThreatDOMDetailsNode_Data>>> nodes;

private:
    friend class mojo::internal::MessageFragment<ThreatReporter_GetThreatDOMDetails_ResponseParams_Data>;

    ThreatReporter_GetThreatDOMDetails_ResponseParams_Data();
    ~ThreatReporter_GetThreatDOMDetails_ResponseParams_Data() = delete;
};
static_assert(sizeof(ThreatReporter_GetThreatDOMDetails_ResponseParams_Data) == 16, "Bad sizeof(ThreatReporter_GetThreatDOMDetails_ResponseParams_Data)");
class PhishingDetector_StartPhishingDetection_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<PhishingDetector_StartPhishingDetection_Params_Data>;

    PhishingDetector_StartPhishingDetection_Params_Data();
    ~PhishingDetector_StartPhishingDetection_Params_Data() = delete;
};
static_assert(sizeof(PhishingDetector_StartPhishingDetection_Params_Data) == 16, "Bad sizeof(PhishingDetector_StartPhishingDetection_Params_Data)");
class PhishingDetector_StartPhishingDetection_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ProtoWrapper_Data> request;

private:
    friend class mojo::internal::MessageFragment<PhishingDetector_StartPhishingDetection_ResponseParams_Data>;

    PhishingDetector_StartPhishingDetection_ResponseParams_Data();
    ~PhishingDetector_StartPhishingDetection_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(PhishingDetector_StartPhishingDetection_ResponseParams_Data) == 24, "Bad sizeof(PhishingDetector_StartPhishingDetection_ResponseParams_Data)");
class PhishingModelSetter_SetImageEmbeddingAndPhishingFlatBufferModel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> region;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyFile_Data> tflite_model;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyFile_Data> image_embedding_model;

private:
    friend class mojo::internal::MessageFragment<PhishingModelSetter_SetImageEmbeddingAndPhishingFlatBufferModel_Params_Data>;

    PhishingModelSetter_SetImageEmbeddingAndPhishingFlatBufferModel_Params_Data();
    ~PhishingModelSetter_SetImageEmbeddingAndPhishingFlatBufferModel_Params_Data() = delete;
};
static_assert(sizeof(PhishingModelSetter_SetImageEmbeddingAndPhishingFlatBufferModel_Params_Data) == 32,
    "Bad sizeof(PhishingModelSetter_SetImageEmbeddingAndPhishingFlatBufferModel_Params_Data)");
class PhishingModelSetter_AttachImageEmbeddingModel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyFile_Data> image_embedding_model;

private:
    friend class mojo::internal::MessageFragment<PhishingModelSetter_AttachImageEmbeddingModel_Params_Data>;

    PhishingModelSetter_AttachImageEmbeddingModel_Params_Data();
    ~PhishingModelSetter_AttachImageEmbeddingModel_Params_Data() = delete;
};
static_assert(sizeof(PhishingModelSetter_AttachImageEmbeddingModel_Params_Data) == 16, "Bad sizeof(PhishingModelSetter_AttachImageEmbeddingModel_Params_Data)");
class PhishingModelSetter_SetPhishingFlatBufferModel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> region;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyFile_Data> tflite_model;

private:
    friend class mojo::internal::MessageFragment<PhishingModelSetter_SetPhishingFlatBufferModel_Params_Data>;

    PhishingModelSetter_SetPhishingFlatBufferModel_Params_Data();
    ~PhishingModelSetter_SetPhishingFlatBufferModel_Params_Data() = delete;
};
static_assert(
    sizeof(PhishingModelSetter_SetPhishingFlatBufferModel_Params_Data) == 24, "Bad sizeof(PhishingModelSetter_SetPhishingFlatBufferModel_Params_Data)");
class PhishingModelSetter_ClearScorer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PhishingModelSetter_ClearScorer_Params_Data>;

    PhishingModelSetter_ClearScorer_Params_Data();
    ~PhishingModelSetter_ClearScorer_Params_Data() = delete;
};
static_assert(sizeof(PhishingModelSetter_ClearScorer_Params_Data) == 8, "Bad sizeof(PhishingModelSetter_ClearScorer_Params_Data)");
class PhishingModelSetter_SetTestObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data observer;

private:
    friend class mojo::internal::MessageFragment<PhishingModelSetter_SetTestObserver_Params_Data>;

    PhishingModelSetter_SetTestObserver_Params_Data();
    ~PhishingModelSetter_SetTestObserver_Params_Data() = delete;
};
static_assert(sizeof(PhishingModelSetter_SetTestObserver_Params_Data) == 16, "Bad sizeof(PhishingModelSetter_SetTestObserver_Params_Data)");
class PhishingModelSetter_SetTestObserver_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PhishingModelSetter_SetTestObserver_ResponseParams_Data>;

    PhishingModelSetter_SetTestObserver_ResponseParams_Data();
    ~PhishingModelSetter_SetTestObserver_ResponseParams_Data() = delete;
};
static_assert(sizeof(PhishingModelSetter_SetTestObserver_ResponseParams_Data) == 8, "Bad sizeof(PhishingModelSetter_SetTestObserver_ResponseParams_Data)");
class PhishingModelSetterTestObserver_PhishingModelUpdated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PhishingModelSetterTestObserver_PhishingModelUpdated_Params_Data>;

    PhishingModelSetterTestObserver_PhishingModelUpdated_Params_Data();
    ~PhishingModelSetterTestObserver_PhishingModelUpdated_Params_Data() = delete;
};
static_assert(sizeof(PhishingModelSetterTestObserver_PhishingModelUpdated_Params_Data) == 8,
    "Bad sizeof(PhishingModelSetterTestObserver_PhishingModelUpdated_Params_Data)");
class PhishingImageEmbedderDetector_StartImageEmbedding_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<PhishingImageEmbedderDetector_StartImageEmbedding_Params_Data>;

    PhishingImageEmbedderDetector_StartImageEmbedding_Params_Data();
    ~PhishingImageEmbedderDetector_StartImageEmbedding_Params_Data() = delete;
};
static_assert(
    sizeof(PhishingImageEmbedderDetector_StartImageEmbedding_Params_Data) == 16, "Bad sizeof(PhishingImageEmbedderDetector_StartImageEmbedding_Params_Data)");
class PhishingImageEmbedderDetector_StartImageEmbedding_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ProtoWrapper_Data> image_embedding_request;

private:
    friend class mojo::internal::MessageFragment<PhishingImageEmbedderDetector_StartImageEmbedding_ResponseParams_Data>;

    PhishingImageEmbedderDetector_StartImageEmbedding_ResponseParams_Data();
    ~PhishingImageEmbedderDetector_StartImageEmbedding_ResponseParams_Data() = delete;
};
static_assert(sizeof(PhishingImageEmbedderDetector_StartImageEmbedding_ResponseParams_Data) == 24,
    "Bad sizeof(PhishingImageEmbedderDetector_StartImageEmbedding_ResponseParams_Data)");
class ExtensionWebRequestReporter_SendWebRequestData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> origin_extension_id;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> telemetry_url;
    int32_t protocol_type;
    int32_t contact_initiator_type;

private:
    friend class mojo::internal::MessageFragment<ExtensionWebRequestReporter_SendWebRequestData_Params_Data>;

    ExtensionWebRequestReporter_SendWebRequestData_Params_Data();
    ~ExtensionWebRequestReporter_SendWebRequestData_Params_Data() = delete;
};
static_assert(
    sizeof(ExtensionWebRequestReporter_SendWebRequestData_Params_Data) == 32, "Bad sizeof(ExtensionWebRequestReporter_SendWebRequestData_Params_Data)");
class ExtensionWebRequestReporter_Clone_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ExtensionWebRequestReporter_Clone_Params_Data>;

    ExtensionWebRequestReporter_Clone_Params_Data();
    ~ExtensionWebRequestReporter_Clone_Params_Data() = delete;
};
static_assert(sizeof(ExtensionWebRequestReporter_Clone_Params_Data) == 16, "Bad sizeof(ExtensionWebRequestReporter_Clone_Params_Data)");

} // namespace internal

class SafeBrowsing_CreateCheckerAndCheck_ParamsDataView {
public:
    SafeBrowsing_CreateCheckerAndCheck_ParamsDataView() = default;

    SafeBrowsing_CreateCheckerAndCheck_ParamsDataView(internal::SafeBrowsing_CreateCheckerAndCheck_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetFrameTokenDataView(::blink::mojom::LocalFrameTokenDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadFrameToken(UserType* output)
    {

        static_assert(mojo::internal::IsValidUserTypeForOptionalValue<::blink::mojom::LocalFrameTokenDataView, UserType>(),
            "Attempting to read the optional `frame_token` field into a type which "
