// third_party/blink/public/mojom/indexeddb/indexeddb.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_INDEXEDDB_INDEXEDDB_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_INDEXEDDB_INDEXEDDB_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBFactoryClient_Error_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t code;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> message;

private:
    friend class mojo::internal::MessageFragment<IDBFactoryClient_Error_Params_Data>;

    IDBFactoryClient_Error_Params_Data();
    ~IDBFactoryClient_Error_Params_Data() = delete;
};
static_assert(sizeof(IDBFactoryClient_Error_Params_Data) == 24, "Bad sizeof(IDBFactoryClient_Error_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBFactoryClient_Blocked_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t existing_version;

private:
    friend class mojo::internal::MessageFragment<IDBFactoryClient_Blocked_Params_Data>;

    IDBFactoryClient_Blocked_Params_Data();
    ~IDBFactoryClient_Blocked_Params_Data() = delete;
};
static_assert(sizeof(IDBFactoryClient_Blocked_Params_Data) == 16, "Bad sizeof(IDBFactoryClient_Blocked_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBFactoryClient_UpgradeNeeded_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data pending_database;
    int64_t old_version;
    int32_t data_loss;
    uint8_t pad2_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> data_loss_message;
    mojo::internal::Pointer<internal::IDBDatabaseMetadata_Data> db_metadata;

private:
    friend class mojo::internal::MessageFragment<IDBFactoryClient_UpgradeNeeded_Params_Data>;

    IDBFactoryClient_UpgradeNeeded_Params_Data();
    ~IDBFactoryClient_UpgradeNeeded_Params_Data() = delete;
};
static_assert(sizeof(IDBFactoryClient_UpgradeNeeded_Params_Data) == 48, "Bad sizeof(IDBFactoryClient_UpgradeNeeded_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBFactoryClient_OpenSuccess_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data pending_database;
    mojo::internal::Pointer<internal::IDBDatabaseMetadata_Data> metadata;

private:
    friend class mojo::internal::MessageFragment<IDBFactoryClient_OpenSuccess_Params_Data>;

    IDBFactoryClient_OpenSuccess_Params_Data();
    ~IDBFactoryClient_OpenSuccess_Params_Data() = delete;
};
static_assert(sizeof(IDBFactoryClient_OpenSuccess_Params_Data) == 24, "Bad sizeof(IDBFactoryClient_OpenSuccess_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBFactoryClient_DeleteSuccess_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t old_version;

private:
    friend class mojo::internal::MessageFragment<IDBFactoryClient_DeleteSuccess_Params_Data>;

    IDBFactoryClient_DeleteSuccess_Params_Data();
    ~IDBFactoryClient_DeleteSuccess_Params_Data() = delete;
};
static_assert(sizeof(IDBFactoryClient_DeleteSuccess_Params_Data) == 16, "Bad sizeof(IDBFactoryClient_DeleteSuccess_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabaseCallbacks_ForcedClose_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<IDBDatabaseCallbacks_ForcedClose_Params_Data>;

    IDBDatabaseCallbacks_ForcedClose_Params_Data();
    ~IDBDatabaseCallbacks_ForcedClose_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabaseCallbacks_ForcedClose_Params_Data) == 8, "Bad sizeof(IDBDatabaseCallbacks_ForcedClose_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabaseCallbacks_VersionChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t old_version;
    int64_t new_version;

private:
    friend class mojo::internal::MessageFragment<IDBDatabaseCallbacks_VersionChange_Params_Data>;

    IDBDatabaseCallbacks_VersionChange_Params_Data();
    ~IDBDatabaseCallbacks_VersionChange_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabaseCallbacks_VersionChange_Params_Data) == 24, "Bad sizeof(IDBDatabaseCallbacks_VersionChange_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabaseCallbacks_Abort_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t transaction_id;
    int32_t code;
    uint8_t pad1_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> message;

private:
    friend class mojo::internal::MessageFragment<IDBDatabaseCallbacks_Abort_Params_Data>;

    IDBDatabaseCallbacks_Abort_Params_Data();
    ~IDBDatabaseCallbacks_Abort_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabaseCallbacks_Abort_Params_Data) == 32, "Bad sizeof(IDBDatabaseCallbacks_Abort_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabaseCallbacks_Complete_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t transaction_id;

private:
    friend class mojo::internal::MessageFragment<IDBDatabaseCallbacks_Complete_Params_Data>;

    IDBDatabaseCallbacks_Complete_Params_Data();
    ~IDBDatabaseCallbacks_Complete_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabaseCallbacks_Complete_Params_Data) == 16, "Bad sizeof(IDBDatabaseCallbacks_Complete_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBCursor_Advance_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t count;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<IDBCursor_Advance_Params_Data>;

    IDBCursor_Advance_Params_Data();
    ~IDBCursor_Advance_Params_Data() = delete;
};
static_assert(sizeof(IDBCursor_Advance_Params_Data) == 16, "Bad sizeof(IDBCursor_Advance_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBCursor_Advance_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::IDBCursorResult_Data result;

private:
    friend class mojo::internal::MessageFragment<IDBCursor_Advance_ResponseParams_Data>;

    IDBCursor_Advance_ResponseParams_Data();
    ~IDBCursor_Advance_ResponseParams_Data() = delete;
};
static_assert(sizeof(IDBCursor_Advance_ResponseParams_Data) == 24, "Bad sizeof(IDBCursor_Advance_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBCursor_Continue_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::IDBKey_Data key;
    internal::IDBKey_Data primary_key;

private:
    friend class mojo::internal::MessageFragment<IDBCursor_Continue_Params_Data>;

    IDBCursor_Continue_Params_Data();
    ~IDBCursor_Continue_Params_Data() = delete;
};
static_assert(sizeof(IDBCursor_Continue_Params_Data) == 40, "Bad sizeof(IDBCursor_Continue_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBCursor_Continue_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::IDBCursorResult_Data result;

private:
    friend class mojo::internal::MessageFragment<IDBCursor_Continue_ResponseParams_Data>;

    IDBCursor_Continue_ResponseParams_Data();
    ~IDBCursor_Continue_ResponseParams_Data() = delete;
};
static_assert(sizeof(IDBCursor_Continue_ResponseParams_Data) == 24, "Bad sizeof(IDBCursor_Continue_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBCursor_Prefetch_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t count;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<IDBCursor_Prefetch_Params_Data>;

    IDBCursor_Prefetch_Params_Data();
    ~IDBCursor_Prefetch_Params_Data() = delete;
};
static_assert(sizeof(IDBCursor_Prefetch_Params_Data) == 16, "Bad sizeof(IDBCursor_Prefetch_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBCursor_Prefetch_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::IDBCursorResult_Data result;

private:
    friend class mojo::internal::MessageFragment<IDBCursor_Prefetch_ResponseParams_Data>;

    IDBCursor_Prefetch_ResponseParams_Data();
    ~IDBCursor_Prefetch_ResponseParams_Data() = delete;
};
static_assert(sizeof(IDBCursor_Prefetch_ResponseParams_Data) == 24, "Bad sizeof(IDBCursor_Prefetch_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBCursor_PrefetchReset_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t used_prefetches;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<IDBCursor_PrefetchReset_Params_Data>;

    IDBCursor_PrefetchReset_Params_Data();
    ~IDBCursor_PrefetchReset_Params_Data() = delete;
};
static_assert(sizeof(IDBCursor_PrefetchReset_Params_Data) == 16, "Bad sizeof(IDBCursor_PrefetchReset_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBTransaction_CreateObjectStore_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t object_store_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> name;
    mojo::internal::Pointer<internal::IDBKeyPath_Data> key_path;
    uint8_t auto_increment : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<IDBTransaction_CreateObjectStore_Params_Data>;

    IDBTransaction_CreateObjectStore_Params_Data();
    ~IDBTransaction_CreateObjectStore_Params_Data() = delete;
};
static_assert(sizeof(IDBTransaction_CreateObjectStore_Params_Data) == 40, "Bad sizeof(IDBTransaction_CreateObjectStore_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBTransaction_DeleteObjectStore_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t object_store_id;

private:
    friend class mojo::internal::MessageFragment<IDBTransaction_DeleteObjectStore_Params_Data>;

    IDBTransaction_DeleteObjectStore_Params_Data();
    ~IDBTransaction_DeleteObjectStore_Params_Data() = delete;
};
static_assert(sizeof(IDBTransaction_DeleteObjectStore_Params_Data) == 16, "Bad sizeof(IDBTransaction_DeleteObjectStore_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBTransaction_Put_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t object_store_id;
    mojo::internal::Pointer<internal::IDBValue_Data> value;
    internal::IDBKey_Data key;
    int32_t mode;
    uint8_t pad3_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::IDBIndexKeys_Data>>> index_keys;

private:
    friend class mojo::internal::MessageFragment<IDBTransaction_Put_Params_Data>;

    IDBTransaction_Put_Params_Data();
    ~IDBTransaction_Put_Params_Data() = delete;
};
static_assert(sizeof(IDBTransaction_Put_Params_Data) == 56, "Bad sizeof(IDBTransaction_Put_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBTransaction_Put_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::IDBTransactionPutResult_Data result;

private:
    friend class mojo::internal::MessageFragment<IDBTransaction_Put_ResponseParams_Data>;

    IDBTransaction_Put_ResponseParams_Data();
    ~IDBTransaction_Put_ResponseParams_Data() = delete;
};
static_assert(sizeof(IDBTransaction_Put_ResponseParams_Data) == 24, "Bad sizeof(IDBTransaction_Put_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBTransaction_Commit_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t num_errors_handled;

private:
    friend class mojo::internal::MessageFragment<IDBTransaction_Commit_Params_Data>;

    IDBTransaction_Commit_Params_Data();
    ~IDBTransaction_Commit_Params_Data() = delete;
};
static_assert(sizeof(IDBTransaction_Commit_Params_Data) == 16, "Bad sizeof(IDBTransaction_Commit_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabaseGetAllResultSink_ReceiveResults_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::IDBRecord_Data>>> records;
    uint8_t done : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<IDBDatabaseGetAllResultSink_ReceiveResults_Params_Data>;

    IDBDatabaseGetAllResultSink_ReceiveResults_Params_Data();
    ~IDBDatabaseGetAllResultSink_ReceiveResults_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabaseGetAllResultSink_ReceiveResults_Params_Data) == 24, "Bad sizeof(IDBDatabaseGetAllResultSink_ReceiveResults_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabaseGetAllResultSink_OnError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::IDBError_Data> error;

private:
    friend class mojo::internal::MessageFragment<IDBDatabaseGetAllResultSink_OnError_Params_Data>;

    IDBDatabaseGetAllResultSink_OnError_Params_Data();
    ~IDBDatabaseGetAllResultSink_OnError_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabaseGetAllResultSink_OnError_Params_Data) == 16, "Bad sizeof(IDBDatabaseGetAllResultSink_OnError_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_RenameObjectStore_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t transaction_id;
    int64_t object_store_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> new_name;

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_RenameObjectStore_Params_Data>;

    IDBDatabase_RenameObjectStore_Params_Data();
    ~IDBDatabase_RenameObjectStore_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabase_RenameObjectStore_Params_Data) == 32, "Bad sizeof(IDBDatabase_RenameObjectStore_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_CreateTransaction_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedEndpointHandle_Data transaction_receiver;
    int32_t mode;
    int64_t transaction_id;
    mojo::internal::Pointer<mojo::internal::Array_Data<int64_t>> object_store_ids;
    int32_t durability;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_CreateTransaction_Params_Data>;

    IDBDatabase_CreateTransaction_Params_Data();
    ~IDBDatabase_CreateTransaction_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabase_CreateTransaction_Params_Data) == 40, "Bad sizeof(IDBDatabase_CreateTransaction_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_VersionChangeIgnored_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_VersionChangeIgnored_Params_Data>;

    IDBDatabase_VersionChangeIgnored_Params_Data();
    ~IDBDatabase_VersionChangeIgnored_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabase_VersionChangeIgnored_Params_Data) == 8, "Bad sizeof(IDBDatabase_VersionChangeIgnored_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_Get_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t transaction_id;
    int64_t object_store_id;
    int64_t index_id;
    mojo::internal::Pointer<internal::IDBKeyRange_Data> key_range;
    uint8_t key_only : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_Get_Params_Data>;

    IDBDatabase_Get_Params_Data();
    ~IDBDatabase_Get_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabase_Get_Params_Data) == 48, "Bad sizeof(IDBDatabase_Get_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_Get_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::IDBDatabaseGetResult_Data result;

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_Get_ResponseParams_Data>;

    IDBDatabase_Get_ResponseParams_Data();
    ~IDBDatabase_Get_ResponseParams_Data() = delete;
};
static_assert(sizeof(IDBDatabase_Get_ResponseParams_Data) == 24, "Bad sizeof(IDBDatabase_Get_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_GetAll_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t transaction_id;
    int64_t object_store_id;
    int64_t index_id;
    mojo::internal::Pointer<internal::IDBKeyRange_Data> key_range;
    int32_t result_type;
    int32_t direction;
    int64_t max_count;

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_GetAll_Params_Data>;

    IDBDatabase_GetAll_Params_Data();
    ~IDBDatabase_GetAll_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabase_GetAll_Params_Data) == 56, "Bad sizeof(IDBDatabase_GetAll_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_GetAll_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedEndpointHandle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_GetAll_ResponseParams_Data>;

    IDBDatabase_GetAll_ResponseParams_Data();
    ~IDBDatabase_GetAll_ResponseParams_Data() = delete;
};
static_assert(sizeof(IDBDatabase_GetAll_ResponseParams_Data) == 16, "Bad sizeof(IDBDatabase_GetAll_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_SetIndexKeys_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t transaction_id;
    int64_t object_store_id;
    internal::IDBKey_Data primary_key;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::IDBIndexKeys_Data>>> index_keys;

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_SetIndexKeys_Params_Data>;

    IDBDatabase_SetIndexKeys_Params_Data();
    ~IDBDatabase_SetIndexKeys_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabase_SetIndexKeys_Params_Data) == 48, "Bad sizeof(IDBDatabase_SetIndexKeys_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_SetIndexesReady_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t transaction_id;
    int64_t object_store_id;
    mojo::internal::Pointer<mojo::internal::Array_Data<int64_t>> index_ids;

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_SetIndexesReady_Params_Data>;

    IDBDatabase_SetIndexesReady_Params_Data();
    ~IDBDatabase_SetIndexesReady_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabase_SetIndexesReady_Params_Data) == 32, "Bad sizeof(IDBDatabase_SetIndexesReady_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_OpenCursor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t transaction_id;
    int64_t object_store_id;
    int64_t index_id;
    mojo::internal::Pointer<internal::IDBKeyRange_Data> key_range;
    int32_t direction;
    uint8_t key_only : 1;
    uint8_t pad5_[3];
    int32_t task_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_OpenCursor_Params_Data>;

    IDBDatabase_OpenCursor_Params_Data();
    ~IDBDatabase_OpenCursor_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabase_OpenCursor_Params_Data) == 56, "Bad sizeof(IDBDatabase_OpenCursor_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_OpenCursor_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::IDBDatabaseOpenCursorResult_Data result;

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_OpenCursor_ResponseParams_Data>;

    IDBDatabase_OpenCursor_ResponseParams_Data();
    ~IDBDatabase_OpenCursor_ResponseParams_Data() = delete;
};
static_assert(sizeof(IDBDatabase_OpenCursor_ResponseParams_Data) == 24, "Bad sizeof(IDBDatabase_OpenCursor_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_Count_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t transaction_id;
    int64_t object_store_id;
    int64_t index_id;
    mojo::internal::Pointer<internal::IDBKeyRange_Data> key_range;

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_Count_Params_Data>;

    IDBDatabase_Count_Params_Data();
    ~IDBDatabase_Count_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabase_Count_Params_Data) == 40, "Bad sizeof(IDBDatabase_Count_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_Count_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[3];
    uint32_t count;

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_Count_ResponseParams_Data>;

    IDBDatabase_Count_ResponseParams_Data();
    ~IDBDatabase_Count_ResponseParams_Data() = delete;
};
static_assert(sizeof(IDBDatabase_Count_ResponseParams_Data) == 16, "Bad sizeof(IDBDatabase_Count_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_DeleteRange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t transaction_id;
    int64_t object_store_id;
    mojo::internal::Pointer<internal::IDBKeyRange_Data> key_range;

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_DeleteRange_Params_Data>;

    IDBDatabase_DeleteRange_Params_Data();
    ~IDBDatabase_DeleteRange_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabase_DeleteRange_Params_Data) == 32, "Bad sizeof(IDBDatabase_DeleteRange_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_DeleteRange_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_DeleteRange_ResponseParams_Data>;

    IDBDatabase_DeleteRange_ResponseParams_Data();
    ~IDBDatabase_DeleteRange_ResponseParams_Data() = delete;
};
static_assert(sizeof(IDBDatabase_DeleteRange_ResponseParams_Data) == 16, "Bad sizeof(IDBDatabase_DeleteRange_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_GetKeyGeneratorCurrentNumber_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t transaction_id;
    int64_t object_store_id;

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_GetKeyGeneratorCurrentNumber_Params_Data>;

    IDBDatabase_GetKeyGeneratorCurrentNumber_Params_Data();
    ~IDBDatabase_GetKeyGeneratorCurrentNumber_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabase_GetKeyGeneratorCurrentNumber_Params_Data) == 24, "Bad sizeof(IDBDatabase_GetKeyGeneratorCurrentNumber_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_GetKeyGeneratorCurrentNumber_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t result;
    mojo::internal::Pointer<internal::IDBError_Data> error;

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_GetKeyGeneratorCurrentNumber_ResponseParams_Data>;

    IDBDatabase_GetKeyGeneratorCurrentNumber_ResponseParams_Data();
    ~IDBDatabase_GetKeyGeneratorCurrentNumber_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(IDBDatabase_GetKeyGeneratorCurrentNumber_ResponseParams_Data) == 24, "Bad sizeof(IDBDatabase_GetKeyGeneratorCurrentNumber_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_Clear_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t transaction_id;
    int64_t object_store_id;

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_Clear_Params_Data>;

    IDBDatabase_Clear_Params_Data();
    ~IDBDatabase_Clear_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabase_Clear_Params_Data) == 24, "Bad sizeof(IDBDatabase_Clear_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_Clear_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_Clear_ResponseParams_Data>;

    IDBDatabase_Clear_ResponseParams_Data();
    ~IDBDatabase_Clear_ResponseParams_Data() = delete;
};
static_assert(sizeof(IDBDatabase_Clear_ResponseParams_Data) == 16, "Bad sizeof(IDBDatabase_Clear_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_CreateIndex_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t transaction_id;
    int64_t object_store_id;
    int64_t index_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> name;
    mojo::internal::Pointer<internal::IDBKeyPath_Data> key_path;
    uint8_t unique : 1;
    uint8_t multi_entry : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_CreateIndex_Params_Data>;

    IDBDatabase_CreateIndex_Params_Data();
    ~IDBDatabase_CreateIndex_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabase_CreateIndex_Params_Data) == 56, "Bad sizeof(IDBDatabase_CreateIndex_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_DeleteIndex_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t transaction_id;
    int64_t object_store_id;
    int64_t index_id;

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_DeleteIndex_Params_Data>;

    IDBDatabase_DeleteIndex_Params_Data();
    ~IDBDatabase_DeleteIndex_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabase_DeleteIndex_Params_Data) == 32, "Bad sizeof(IDBDatabase_DeleteIndex_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_RenameIndex_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t transaction_id;
    int64_t object_store_id;
    int64_t index_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> new_name;

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_RenameIndex_Params_Data>;

    IDBDatabase_RenameIndex_Params_Data();
    ~IDBDatabase_RenameIndex_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabase_RenameIndex_Params_Data) == 40, "Bad sizeof(IDBDatabase_RenameIndex_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_Abort_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t transaction_id;

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_Abort_Params_Data>;

    IDBDatabase_Abort_Params_Data();
    ~IDBDatabase_Abort_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabase_Abort_Params_Data) == 16, "Bad sizeof(IDBDatabase_Abort_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_DidBecomeInactive_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_DidBecomeInactive_Params_Data>;

    IDBDatabase_DidBecomeInactive_Params_Data();
    ~IDBDatabase_DidBecomeInactive_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabase_DidBecomeInactive_Params_Data) == 8, "Bad sizeof(IDBDatabase_DidBecomeInactive_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBDatabase_UpdatePriority_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t new_priority;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<IDBDatabase_UpdatePriority_Params_Data>;

    IDBDatabase_UpdatePriority_Params_Data();
    ~IDBDatabase_UpdatePriority_Params_Data() = delete;
};
static_assert(sizeof(IDBDatabase_UpdatePriority_Params_Data) == 16, "Bad sizeof(IDBDatabase_UpdatePriority_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBFactory_GetDatabaseInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<IDBFactory_GetDatabaseInfo_Params_Data>;

    IDBFactory_GetDatabaseInfo_Params_Data();
    ~IDBFactory_GetDatabaseInfo_Params_Data() = delete;
};
static_assert(sizeof(IDBFactory_GetDatabaseInfo_Params_Data) == 8, "Bad sizeof(IDBFactory_GetDatabaseInfo_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBFactory_GetDatabaseInfo_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::IDBNameAndVersion_Data>>> names_and_versions;
    mojo::internal::Pointer<internal::IDBError_Data> error;

private:
    friend class mojo::internal::MessageFragment<IDBFactory_GetDatabaseInfo_ResponseParams_Data>;

    IDBFactory_GetDatabaseInfo_ResponseParams_Data();
    ~IDBFactory_GetDatabaseInfo_ResponseParams_Data() = delete;
};
static_assert(sizeof(IDBFactory_GetDatabaseInfo_ResponseParams_Data) == 24, "Bad sizeof(IDBFactory_GetDatabaseInfo_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBFactory_Open_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data client;
    mojo::internal::AssociatedInterface_Data database_callbacks;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> name;
    int64_t version;
    mojo::internal::AssociatedEndpointHandle_Data version_change_transaction_receiver;
    int32_t priority;
    int64_t transaction_id;

private:
    friend class mojo::internal::MessageFragment<IDBFactory_Open_Params_Data>;

    IDBFactory_Open_Params_Data();
    ~IDBFactory_Open_Params_Data() = delete;
};
static_assert(sizeof(IDBFactory_Open_Params_Data) == 56, "Bad sizeof(IDBFactory_Open_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) IDBFactory_DeleteDatabase_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data client;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> name;
    uint8_t force_close : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<IDBFactory_DeleteDatabase_Params_Data>;

    IDBFactory_DeleteDatabase_Params_Data();
    ~IDBFactory_DeleteDatabase_Params_Data() = delete;
};
static_assert(sizeof(IDBFactory_DeleteDatabase_Params_Data) == 32, "Bad sizeof(IDBFactory_DeleteDatabase_Params_Data)");

} // namespace internal

class IDBFactoryClient_Error_ParamsDataView {
public:
    IDBFactoryClient_Error_ParamsDataView() = default;

    IDBFactoryClient_Error_ParamsDataView(internal::IDBFactoryClient_Error_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadCode(UserType* output) const
    {
        auto data_value = data_->code;
        return mojo::internal::Deserialize<::blink::mojom::IDBException>(data_value, output);
    }
    IDBException code() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::blink::mojom::IDBException>(data_->code));
    }
    inline void GetMessageDataView(::mojo_base::mojom::String16DataView* output);

