// ui/webui/resources/cr_components/history_clusters/history_clusters.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef UI_WEBUI_RESOURCES_CR_COMPONENTS_HISTORY_CLUSTERS_HISTORY_CLUSTERS_MOJOM_PARAMS_DATA_H_
#define UI_WEBUI_RESOURCES_CR_COMPONENTS_HISTORY_CLUSTERS_HISTORY_CLUSTERS_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace history_clusters::mojom {
namespace internal {
class PageHandler_OpenHistoryUrl_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::ui::mojom::internal::ClickModifiers_Data> click_modifiers;

private:
    friend class mojo::internal::MessageFragment<PageHandler_OpenHistoryUrl_Params_Data>;

    PageHandler_OpenHistoryUrl_Params_Data();
    ~PageHandler_OpenHistoryUrl_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_OpenHistoryUrl_Params_Data) == 24, "Bad sizeof(PageHandler_OpenHistoryUrl_Params_Data)");
class PageHandler_SetPage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data page;

private:
    friend class mojo::internal::MessageFragment<PageHandler_SetPage_Params_Data>;

    PageHandler_SetPage_Params_Data();
    ~PageHandler_SetPage_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_SetPage_Params_Data) == 16, "Bad sizeof(PageHandler_SetPage_Params_Data)");
class PageHandler_ShowContextMenuForSearchbox_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> query;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> point;

private:
    friend class mojo::internal::MessageFragment<PageHandler_ShowContextMenuForSearchbox_Params_Data>;

    PageHandler_ShowContextMenuForSearchbox_Params_Data();
    ~PageHandler_ShowContextMenuForSearchbox_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_ShowContextMenuForSearchbox_Params_Data) == 24, "Bad sizeof(PageHandler_ShowContextMenuForSearchbox_Params_Data)");
class PageHandler_ShowContextMenuForURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> point;

private:
    friend class mojo::internal::MessageFragment<PageHandler_ShowContextMenuForURL_Params_Data>;

    PageHandler_ShowContextMenuForURL_Params_Data();
    ~PageHandler_ShowContextMenuForURL_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_ShowContextMenuForURL_Params_Data) == 24, "Bad sizeof(PageHandler_ShowContextMenuForURL_Params_Data)");
class PageHandler_ShowSidePanelUI_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PageHandler_ShowSidePanelUI_Params_Data>;

    PageHandler_ShowSidePanelUI_Params_Data();
    ~PageHandler_ShowSidePanelUI_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_ShowSidePanelUI_Params_Data) == 8, "Bad sizeof(PageHandler_ShowSidePanelUI_Params_Data)");
class PageHandler_ToggleVisibility_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t visible : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PageHandler_ToggleVisibility_Params_Data>;

    PageHandler_ToggleVisibility_Params_Data();
    ~PageHandler_ToggleVisibility_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_ToggleVisibility_Params_Data) == 16, "Bad sizeof(PageHandler_ToggleVisibility_Params_Data)");
class PageHandler_ToggleVisibility_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t visible : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PageHandler_ToggleVisibility_ResponseParams_Data>;

    PageHandler_ToggleVisibility_ResponseParams_Data();
    ~PageHandler_ToggleVisibility_ResponseParams_Data() = delete;
};
static_assert(sizeof(PageHandler_ToggleVisibility_ResponseParams_Data) == 16, "Bad sizeof(PageHandler_ToggleVisibility_ResponseParams_Data)");
class PageHandler_StartQueryClusters_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> query;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> begin_time;
    uint8_t recluster : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PageHandler_StartQueryClusters_Params_Data>;

    PageHandler_StartQueryClusters_Params_Data();
    ~PageHandler_StartQueryClusters_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_StartQueryClusters_Params_Data) == 32, "Bad sizeof(PageHandler_StartQueryClusters_Params_Data)");
class PageHandler_LoadMoreClusters_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> query;

private:
    friend class mojo::internal::MessageFragment<PageHandler_LoadMoreClusters_Params_Data>;

    PageHandler_LoadMoreClusters_Params_Data();
    ~PageHandler_LoadMoreClusters_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_LoadMoreClusters_Params_Data) == 16, "Bad sizeof(PageHandler_LoadMoreClusters_Params_Data)");
class PageHandler_HideVisits_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::history_clusters::mojom::internal::URLVisit_Data>>> visits;

private:
    friend class mojo::internal::MessageFragment<PageHandler_HideVisits_Params_Data>;

    PageHandler_HideVisits_Params_Data();
    ~PageHandler_HideVisits_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_HideVisits_Params_Data) == 16, "Bad sizeof(PageHandler_HideVisits_Params_Data)");
class PageHandler_HideVisits_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PageHandler_HideVisits_ResponseParams_Data>;

    PageHandler_HideVisits_ResponseParams_Data();
    ~PageHandler_HideVisits_ResponseParams_Data() = delete;
};
static_assert(sizeof(PageHandler_HideVisits_ResponseParams_Data) == 16, "Bad sizeof(PageHandler_HideVisits_ResponseParams_Data)");
class PageHandler_RemoveVisits_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::history_clusters::mojom::internal::URLVisit_Data>>> visits;

private:
    friend class mojo::internal::MessageFragment<PageHandler_RemoveVisits_Params_Data>;

    PageHandler_RemoveVisits_Params_Data();
    ~PageHandler_RemoveVisits_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_RemoveVisits_Params_Data) == 16, "Bad sizeof(PageHandler_RemoveVisits_Params_Data)");
class PageHandler_RemoveVisits_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PageHandler_RemoveVisits_ResponseParams_Data>;

    PageHandler_RemoveVisits_ResponseParams_Data();
    ~PageHandler_RemoveVisits_ResponseParams_Data() = delete;
};
static_assert(sizeof(PageHandler_RemoveVisits_ResponseParams_Data) == 16, "Bad sizeof(PageHandler_RemoveVisits_ResponseParams_Data)");
class PageHandler_RemoveVisitByUrlAndTime_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    double timestamp;

private:
    friend class mojo::internal::MessageFragment<PageHandler_RemoveVisitByUrlAndTime_Params_Data>;

    PageHandler_RemoveVisitByUrlAndTime_Params_Data();
    ~PageHandler_RemoveVisitByUrlAndTime_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_RemoveVisitByUrlAndTime_Params_Data) == 24, "Bad sizeof(PageHandler_RemoveVisitByUrlAndTime_Params_Data)");
class PageHandler_RemoveVisitByUrlAndTime_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PageHandler_RemoveVisitByUrlAndTime_ResponseParams_Data>;

    PageHandler_RemoveVisitByUrlAndTime_ResponseParams_Data();
    ~PageHandler_RemoveVisitByUrlAndTime_ResponseParams_Data() = delete;
};
static_assert(sizeof(PageHandler_RemoveVisitByUrlAndTime_ResponseParams_Data) == 16, "Bad sizeof(PageHandler_RemoveVisitByUrlAndTime_ResponseParams_Data)");
class PageHandler_OpenVisitUrlsInTabGroup_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::history_clusters::mojom::internal::URLVisit_Data>>> visits;
    mojo::internal::Pointer<mojo::internal::String_Data> tab_group_name;

private:
    friend class mojo::internal::MessageFragment<PageHandler_OpenVisitUrlsInTabGroup_Params_Data>;

    PageHandler_OpenVisitUrlsInTabGroup_Params_Data();
    ~PageHandler_OpenVisitUrlsInTabGroup_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_OpenVisitUrlsInTabGroup_Params_Data) == 24, "Bad sizeof(PageHandler_OpenVisitUrlsInTabGroup_Params_Data)");
class PageHandler_RecordVisitAction_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t visit_action;
    uint32_t visit_index;
    int32_t visit_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PageHandler_RecordVisitAction_Params_Data>;

    PageHandler_RecordVisitAction_Params_Data();
    ~PageHandler_RecordVisitAction_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_RecordVisitAction_Params_Data) == 24, "Bad sizeof(PageHandler_RecordVisitAction_Params_Data)");
class PageHandler_RecordRelatedSearchAction_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t action;
    uint32_t visit_index;

private:
    friend class mojo::internal::MessageFragment<PageHandler_RecordRelatedSearchAction_Params_Data>;

    PageHandler_RecordRelatedSearchAction_Params_Data();
    ~PageHandler_RecordRelatedSearchAction_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_RecordRelatedSearchAction_Params_Data) == 16, "Bad sizeof(PageHandler_RecordRelatedSearchAction_Params_Data)");
class PageHandler_RecordClusterAction_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t cluster_action;
    uint32_t cluster_index;

private:
    friend class mojo::internal::MessageFragment<PageHandler_RecordClusterAction_Params_Data>;

    PageHandler_RecordClusterAction_Params_Data();
    ~PageHandler_RecordClusterAction_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_RecordClusterAction_Params_Data) == 16, "Bad sizeof(PageHandler_RecordClusterAction_Params_Data)");
class PageHandler_RecordToggledVisibility_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t visible : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PageHandler_RecordToggledVisibility_Params_Data>;

    PageHandler_RecordToggledVisibility_Params_Data();
    ~PageHandler_RecordToggledVisibility_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_RecordToggledVisibility_Params_Data) == 16, "Bad sizeof(PageHandler_RecordToggledVisibility_Params_Data)");
class Page_OnClustersQueryResult_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::QueryResult_Data> result;

private:
    friend class mojo::internal::MessageFragment<Page_OnClustersQueryResult_Params_Data>;

    Page_OnClustersQueryResult_Params_Data();
    ~Page_OnClustersQueryResult_Params_Data() = delete;
};
static_assert(sizeof(Page_OnClustersQueryResult_Params_Data) == 16, "Bad sizeof(Page_OnClustersQueryResult_Params_Data)");
class Page_OnClusterImageUpdated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t cluster_index;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> image_url;

private:
    friend class mojo::internal::MessageFragment<Page_OnClusterImageUpdated_Params_Data>;

    Page_OnClusterImageUpdated_Params_Data();
    ~Page_OnClusterImageUpdated_Params_Data() = delete;
};
static_assert(sizeof(Page_OnClusterImageUpdated_Params_Data) == 24, "Bad sizeof(Page_OnClusterImageUpdated_Params_Data)");
class Page_OnVisitsHidden_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::history_clusters::mojom::internal::URLVisit_Data>>> hidden_visits;

private:
    friend class mojo::internal::MessageFragment<Page_OnVisitsHidden_Params_Data>;

    Page_OnVisitsHidden_Params_Data();
    ~Page_OnVisitsHidden_Params_Data() = delete;
};
static_assert(sizeof(Page_OnVisitsHidden_Params_Data) == 16, "Bad sizeof(Page_OnVisitsHidden_Params_Data)");
class Page_OnVisitsRemoved_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::history_clusters::mojom::internal::URLVisit_Data>>> removed_visits;

private:
    friend class mojo::internal::MessageFragment<Page_OnVisitsRemoved_Params_Data>;

    Page_OnVisitsRemoved_Params_Data();
    ~Page_OnVisitsRemoved_Params_Data() = delete;
};
static_assert(sizeof(Page_OnVisitsRemoved_Params_Data) == 16, "Bad sizeof(Page_OnVisitsRemoved_Params_Data)");
class Page_OnHistoryDeleted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<Page_OnHistoryDeleted_Params_Data>;

    Page_OnHistoryDeleted_Params_Data();
    ~Page_OnHistoryDeleted_Params_Data() = delete;
};
static_assert(sizeof(Page_OnHistoryDeleted_Params_Data) == 8, "Bad sizeof(Page_OnHistoryDeleted_Params_Data)");
class Page_OnQueryChangedByUser_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> query;

private:
    friend class mojo::internal::MessageFragment<Page_OnQueryChangedByUser_Params_Data>;

    Page_OnQueryChangedByUser_Params_Data();
    ~Page_OnQueryChangedByUser_Params_Data() = delete;
};
static_assert(sizeof(Page_OnQueryChangedByUser_Params_Data) == 16, "Bad sizeof(Page_OnQueryChangedByUser_Params_Data)");

} // namespace internal

class PageHandler_OpenHistoryUrl_ParamsDataView {
public:
    PageHandler_OpenHistoryUrl_ParamsDataView() = default;

    PageHandler_OpenHistoryUrl_ParamsDataView(internal::PageHandler_OpenHistoryUrl_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetUrlDataView(::url::mojom::UrlDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadUrl(UserType* output)
    {

        auto* pointer = data_->url.Get();
        return mojo::internal::Deserialize<::url::mojom::UrlDataView>(pointer, output, message_);
    }
    inline void GetClickModifiersDataView(::ui::mojom::ClickModifiersDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadClickModifiers(UserType* output)
    {

