// third_party/blink/public/mojom/clipboard/clipboard.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_CLIPBOARD_CLIPBOARD_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_CLIPBOARD_CLIPBOARD_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_GetSequenceNumber_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t buffer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_GetSequenceNumber_Params_Data>;

    ClipboardHost_GetSequenceNumber_Params_Data();
    ~ClipboardHost_GetSequenceNumber_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_GetSequenceNumber_Params_Data) == 16, "Bad sizeof(ClipboardHost_GetSequenceNumber_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_GetSequenceNumber_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::ClipboardSequenceNumberToken_Data> result;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_GetSequenceNumber_ResponseParams_Data>;

    ClipboardHost_GetSequenceNumber_ResponseParams_Data();
    ~ClipboardHost_GetSequenceNumber_ResponseParams_Data() = delete;
};
static_assert(sizeof(ClipboardHost_GetSequenceNumber_ResponseParams_Data) == 16, "Bad sizeof(ClipboardHost_GetSequenceNumber_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_IsFormatAvailable_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t format;
    int32_t buffer;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_IsFormatAvailable_Params_Data>;

    ClipboardHost_IsFormatAvailable_Params_Data();
    ~ClipboardHost_IsFormatAvailable_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_IsFormatAvailable_Params_Data) == 16, "Bad sizeof(ClipboardHost_IsFormatAvailable_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_IsFormatAvailable_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_IsFormatAvailable_ResponseParams_Data>;

    ClipboardHost_IsFormatAvailable_ResponseParams_Data();
    ~ClipboardHost_IsFormatAvailable_ResponseParams_Data() = delete;
};
static_assert(sizeof(ClipboardHost_IsFormatAvailable_ResponseParams_Data) == 16, "Bad sizeof(ClipboardHost_IsFormatAvailable_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadAvailableTypes_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t buffer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadAvailableTypes_Params_Data>;

    ClipboardHost_ReadAvailableTypes_Params_Data();
    ~ClipboardHost_ReadAvailableTypes_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_ReadAvailableTypes_Params_Data) == 16, "Bad sizeof(ClipboardHost_ReadAvailableTypes_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadAvailableTypes_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data>>> types;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadAvailableTypes_ResponseParams_Data>;

    ClipboardHost_ReadAvailableTypes_ResponseParams_Data();
    ~ClipboardHost_ReadAvailableTypes_ResponseParams_Data() = delete;
};
static_assert(sizeof(ClipboardHost_ReadAvailableTypes_ResponseParams_Data) == 16, "Bad sizeof(ClipboardHost_ReadAvailableTypes_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadText_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t buffer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadText_Params_Data>;

    ClipboardHost_ReadText_Params_Data();
    ~ClipboardHost_ReadText_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_ReadText_Params_Data) == 16, "Bad sizeof(ClipboardHost_ReadText_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadText_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> result;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadText_ResponseParams_Data>;

    ClipboardHost_ReadText_ResponseParams_Data();
    ~ClipboardHost_ReadText_ResponseParams_Data() = delete;
};
static_assert(sizeof(ClipboardHost_ReadText_ResponseParams_Data) == 16, "Bad sizeof(ClipboardHost_ReadText_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadHtml_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t buffer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadHtml_Params_Data>;

    ClipboardHost_ReadHtml_Params_Data();
    ~ClipboardHost_ReadHtml_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_ReadHtml_Params_Data) == 16, "Bad sizeof(ClipboardHost_ReadHtml_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadHtml_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> markup;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    uint32_t fragment_start;
    uint32_t fragment_end;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadHtml_ResponseParams_Data>;

    ClipboardHost_ReadHtml_ResponseParams_Data();
    ~ClipboardHost_ReadHtml_ResponseParams_Data() = delete;
};
static_assert(sizeof(ClipboardHost_ReadHtml_ResponseParams_Data) == 32, "Bad sizeof(ClipboardHost_ReadHtml_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadSvg_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t buffer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadSvg_Params_Data>;

    ClipboardHost_ReadSvg_Params_Data();
    ~ClipboardHost_ReadSvg_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_ReadSvg_Params_Data) == 16, "Bad sizeof(ClipboardHost_ReadSvg_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadSvg_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> result;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadSvg_ResponseParams_Data>;

    ClipboardHost_ReadSvg_ResponseParams_Data();
    ~ClipboardHost_ReadSvg_ResponseParams_Data() = delete;
};
static_assert(sizeof(ClipboardHost_ReadSvg_ResponseParams_Data) == 16, "Bad sizeof(ClipboardHost_ReadSvg_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadRtf_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t buffer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadRtf_Params_Data>;

    ClipboardHost_ReadRtf_Params_Data();
    ~ClipboardHost_ReadRtf_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_ReadRtf_Params_Data) == 16, "Bad sizeof(ClipboardHost_ReadRtf_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadRtf_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString_Data> result;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadRtf_ResponseParams_Data>;

    ClipboardHost_ReadRtf_ResponseParams_Data();
    ~ClipboardHost_ReadRtf_ResponseParams_Data() = delete;
};
static_assert(sizeof(ClipboardHost_ReadRtf_ResponseParams_Data) == 16, "Bad sizeof(ClipboardHost_ReadRtf_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadPng_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t buffer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadPng_Params_Data>;

    ClipboardHost_ReadPng_Params_Data();
    ~ClipboardHost_ReadPng_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_ReadPng_Params_Data) == 16, "Bad sizeof(ClipboardHost_ReadPng_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadPng_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::mojo_base::mojom::internal::BigBuffer_Data png;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadPng_ResponseParams_Data>;

    ClipboardHost_ReadPng_ResponseParams_Data();
    ~ClipboardHost_ReadPng_ResponseParams_Data() = delete;
};
static_assert(sizeof(ClipboardHost_ReadPng_ResponseParams_Data) == 24, "Bad sizeof(ClipboardHost_ReadPng_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadFiles_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t buffer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadFiles_Params_Data>;

    ClipboardHost_ReadFiles_Params_Data();
    ~ClipboardHost_ReadFiles_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_ReadFiles_Params_Data) == 16, "Bad sizeof(ClipboardHost_ReadFiles_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadFiles_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::ClipboardFiles_Data> result;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadFiles_ResponseParams_Data>;

    ClipboardHost_ReadFiles_ResponseParams_Data();
    ~ClipboardHost_ReadFiles_ResponseParams_Data() = delete;
};
static_assert(sizeof(ClipboardHost_ReadFiles_ResponseParams_Data) == 16, "Bad sizeof(ClipboardHost_ReadFiles_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadDataTransferCustomData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t buffer;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> type;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadDataTransferCustomData_Params_Data>;

    ClipboardHost_ReadDataTransferCustomData_Params_Data();
    ~ClipboardHost_ReadDataTransferCustomData_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_ReadDataTransferCustomData_Params_Data) == 24, "Bad sizeof(ClipboardHost_ReadDataTransferCustomData_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadDataTransferCustomData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> result;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadDataTransferCustomData_ResponseParams_Data>;

    ClipboardHost_ReadDataTransferCustomData_ResponseParams_Data();
    ~ClipboardHost_ReadDataTransferCustomData_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(ClipboardHost_ReadDataTransferCustomData_ResponseParams_Data) == 16, "Bad sizeof(ClipboardHost_ReadDataTransferCustomData_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadAvailableCustomAndStandardFormats_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadAvailableCustomAndStandardFormats_Params_Data>;

    ClipboardHost_ReadAvailableCustomAndStandardFormats_Params_Data();
    ~ClipboardHost_ReadAvailableCustomAndStandardFormats_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_ReadAvailableCustomAndStandardFormats_Params_Data) == 8,
    "Bad sizeof(ClipboardHost_ReadAvailableCustomAndStandardFormats_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadAvailableCustomAndStandardFormats_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data>>> format_types;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadAvailableCustomAndStandardFormats_ResponseParams_Data>;

    ClipboardHost_ReadAvailableCustomAndStandardFormats_ResponseParams_Data();
    ~ClipboardHost_ReadAvailableCustomAndStandardFormats_ResponseParams_Data() = delete;
};
static_assert(sizeof(ClipboardHost_ReadAvailableCustomAndStandardFormats_ResponseParams_Data) == 16,
    "Bad sizeof(ClipboardHost_ReadAvailableCustomAndStandardFormats_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadUnsanitizedCustomFormat_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> format;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadUnsanitizedCustomFormat_Params_Data>;

    ClipboardHost_ReadUnsanitizedCustomFormat_Params_Data();
    ~ClipboardHost_ReadUnsanitizedCustomFormat_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_ReadUnsanitizedCustomFormat_Params_Data) == 16, "Bad sizeof(ClipboardHost_ReadUnsanitizedCustomFormat_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_ReadUnsanitizedCustomFormat_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::mojo_base::mojom::internal::BigBuffer_Data data;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_ReadUnsanitizedCustomFormat_ResponseParams_Data>;

    ClipboardHost_ReadUnsanitizedCustomFormat_ResponseParams_Data();
    ~ClipboardHost_ReadUnsanitizedCustomFormat_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(ClipboardHost_ReadUnsanitizedCustomFormat_ResponseParams_Data) == 24, "Bad sizeof(ClipboardHost_ReadUnsanitizedCustomFormat_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_WriteText_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> text;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_WriteText_Params_Data>;

    ClipboardHost_WriteText_Params_Data();
    ~ClipboardHost_WriteText_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_WriteText_Params_Data) == 16, "Bad sizeof(ClipboardHost_WriteText_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_WriteHtml_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> markup;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_WriteHtml_Params_Data>;

    ClipboardHost_WriteHtml_Params_Data();
    ~ClipboardHost_WriteHtml_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_WriteHtml_Params_Data) == 24, "Bad sizeof(ClipboardHost_WriteHtml_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_WriteSvg_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> markup;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_WriteSvg_Params_Data>;

    ClipboardHost_WriteSvg_Params_Data();
    ~ClipboardHost_WriteSvg_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_WriteSvg_Params_Data) == 16, "Bad sizeof(ClipboardHost_WriteSvg_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_WriteSmartPasteMarker_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_WriteSmartPasteMarker_Params_Data>;

    ClipboardHost_WriteSmartPasteMarker_Params_Data();
    ~ClipboardHost_WriteSmartPasteMarker_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_WriteSmartPasteMarker_Params_Data) == 8, "Bad sizeof(ClipboardHost_WriteSmartPasteMarker_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_WriteDataTransferCustomData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Map_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data>,
        mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data>>>
        data;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_WriteDataTransferCustomData_Params_Data>;

    ClipboardHost_WriteDataTransferCustomData_Params_Data();
    ~ClipboardHost_WriteDataTransferCustomData_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_WriteDataTransferCustomData_Params_Data) == 16, "Bad sizeof(ClipboardHost_WriteDataTransferCustomData_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_WriteBookmark_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> url;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> title;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_WriteBookmark_Params_Data>;

    ClipboardHost_WriteBookmark_Params_Data();
    ~ClipboardHost_WriteBookmark_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_WriteBookmark_Params_Data) == 24, "Bad sizeof(ClipboardHost_WriteBookmark_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_WriteImage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::skia::mojom::internal::BitmapN32_Data> image;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_WriteImage_Params_Data>;

    ClipboardHost_WriteImage_Params_Data();
    ~ClipboardHost_WriteImage_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_WriteImage_Params_Data) == 16, "Bad sizeof(ClipboardHost_WriteImage_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_WriteUnsanitizedCustomFormat_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> format;
    ::mojo_base::mojom::internal::BigBuffer_Data data;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_WriteUnsanitizedCustomFormat_Params_Data>;

    ClipboardHost_WriteUnsanitizedCustomFormat_Params_Data();
    ~ClipboardHost_WriteUnsanitizedCustomFormat_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_WriteUnsanitizedCustomFormat_Params_Data) == 32, "Bad sizeof(ClipboardHost_WriteUnsanitizedCustomFormat_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ClipboardHost_CommitWrite_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ClipboardHost_CommitWrite_Params_Data>;

    ClipboardHost_CommitWrite_Params_Data();
    ~ClipboardHost_CommitWrite_Params_Data() = delete;
};
static_assert(sizeof(ClipboardHost_CommitWrite_Params_Data) == 8, "Bad sizeof(ClipboardHost_CommitWrite_Params_Data)");

} // namespace internal

class ClipboardHost_GetSequenceNumber_ParamsDataView {
public:
    ClipboardHost_GetSequenceNumber_ParamsDataView() = default;

    ClipboardHost_GetSequenceNumber_ParamsDataView(internal::ClipboardHost_GetSequenceNumber_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadBuffer(UserType* output) const
    {
        auto data_value = data_->buffer;
        return mojo::internal::Deserialize<::blink::mojom::ClipboardBuffer>(data_value, output);
    }
    ClipboardBuffer buffer() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::blink::mojom::ClipboardBuffer>(data_->buffer));
    }

private:
    internal::ClipboardHost_GetSequenceNumber_Params_Data* data_ = nullptr;
};

