// components/autofill/content/common/mojom/autofill_agent.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_AUTOFILL_CONTENT_COMMON_MOJOM_AUTOFILL_AGENT_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_AUTOFILL_CONTENT_COMMON_MOJOM_AUTOFILL_AGENT_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace autofill::mojom {
namespace internal {
class AutofillAgent_TriggerFormExtraction_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AutofillAgent_TriggerFormExtraction_Params_Data>;

    AutofillAgent_TriggerFormExtraction_Params_Data();
    ~AutofillAgent_TriggerFormExtraction_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_TriggerFormExtraction_Params_Data) == 8, "Bad sizeof(AutofillAgent_TriggerFormExtraction_Params_Data)");
class AutofillAgent_TriggerFormExtractionWithResponse_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AutofillAgent_TriggerFormExtractionWithResponse_Params_Data>;

    AutofillAgent_TriggerFormExtractionWithResponse_Params_Data();
    ~AutofillAgent_TriggerFormExtractionWithResponse_Params_Data() = delete;
};
static_assert(
    sizeof(AutofillAgent_TriggerFormExtractionWithResponse_Params_Data) == 8, "Bad sizeof(AutofillAgent_TriggerFormExtractionWithResponse_Params_Data)");
class AutofillAgent_TriggerFormExtractionWithResponse_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<AutofillAgent_TriggerFormExtractionWithResponse_ResponseParams_Data>;

    AutofillAgent_TriggerFormExtractionWithResponse_ResponseParams_Data();
    ~AutofillAgent_TriggerFormExtractionWithResponse_ResponseParams_Data() = delete;
};
static_assert(sizeof(AutofillAgent_TriggerFormExtractionWithResponse_ResponseParams_Data) == 16,
    "Bad sizeof(AutofillAgent_TriggerFormExtractionWithResponse_ResponseParams_Data)");
class AutofillAgent_ApplyFieldsAction_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t action_type;
    int32_t action_persistence;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::autofill::mojom::internal::FormFieldData_FillData_Data>>> fields;

private:
    friend class mojo::internal::MessageFragment<AutofillAgent_ApplyFieldsAction_Params_Data>;

    AutofillAgent_ApplyFieldsAction_Params_Data();
    ~AutofillAgent_ApplyFieldsAction_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_ApplyFieldsAction_Params_Data) == 24, "Bad sizeof(AutofillAgent_ApplyFieldsAction_Params_Data)");
class AutofillAgent_ApplyFieldAction_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t action_type;
    int32_t action_persistence;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> value;

private:
    friend class mojo::internal::MessageFragment<AutofillAgent_ApplyFieldAction_Params_Data>;

    AutofillAgent_ApplyFieldAction_Params_Data();
    ~AutofillAgent_ApplyFieldAction_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_ApplyFieldAction_Params_Data) == 32, "Bad sizeof(AutofillAgent_ApplyFieldAction_Params_Data)");
class AutofillAgent_ExtractForm_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FormRendererId_Data> form;

private:
    friend class mojo::internal::MessageFragment<AutofillAgent_ExtractForm_Params_Data>;

    AutofillAgent_ExtractForm_Params_Data();
    ~AutofillAgent_ExtractForm_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_ExtractForm_Params_Data) == 16, "Bad sizeof(AutofillAgent_ExtractForm_Params_Data)");
class AutofillAgent_ExtractForm_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;

private:
    friend class mojo::internal::MessageFragment<AutofillAgent_ExtractForm_ResponseParams_Data>;

    AutofillAgent_ExtractForm_ResponseParams_Data();
    ~AutofillAgent_ExtractForm_ResponseParams_Data() = delete;
};
static_assert(sizeof(AutofillAgent_ExtractForm_ResponseParams_Data) == 16, "Bad sizeof(AutofillAgent_ExtractForm_ResponseParams_Data)");
class AutofillAgent_FieldTypePredictionsAvailable_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::autofill::mojom::internal::FormDataPredictions_Data>>> forms;

private:
    friend class mojo::internal::MessageFragment<AutofillAgent_FieldTypePredictionsAvailable_Params_Data>;

    AutofillAgent_FieldTypePredictionsAvailable_Params_Data();
    ~AutofillAgent_FieldTypePredictionsAvailable_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_FieldTypePredictionsAvailable_Params_Data) == 16, "Bad sizeof(AutofillAgent_FieldTypePredictionsAvailable_Params_Data)");
class AutofillAgent_ClearPreviewedForm_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AutofillAgent_ClearPreviewedForm_Params_Data>;

    AutofillAgent_ClearPreviewedForm_Params_Data();
    ~AutofillAgent_ClearPreviewedForm_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_ClearPreviewedForm_Params_Data) == 8, "Bad sizeof(AutofillAgent_ClearPreviewedForm_Params_Data)");
class AutofillAgent_TriggerSuggestions_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field;
    int32_t trigger_source;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<AutofillAgent_TriggerSuggestions_Params_Data>;

    AutofillAgent_TriggerSuggestions_Params_Data();
    ~AutofillAgent_TriggerSuggestions_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_TriggerSuggestions_Params_Data) == 24, "Bad sizeof(AutofillAgent_TriggerSuggestions_Params_Data)");
class AutofillAgent_SetSuggestionAvailability_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field;
    int32_t suggestion_availability;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<AutofillAgent_SetSuggestionAvailability_Params_Data>;

    AutofillAgent_SetSuggestionAvailability_Params_Data();
    ~AutofillAgent_SetSuggestionAvailability_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_SetSuggestionAvailability_Params_Data) == 24, "Bad sizeof(AutofillAgent_SetSuggestionAvailability_Params_Data)");
class AutofillAgent_AcceptDataListSuggestion_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> value;

private:
    friend class mojo::internal::MessageFragment<AutofillAgent_AcceptDataListSuggestion_Params_Data>;

    AutofillAgent_AcceptDataListSuggestion_Params_Data();
    ~AutofillAgent_AcceptDataListSuggestion_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_AcceptDataListSuggestion_Params_Data) == 24, "Bad sizeof(AutofillAgent_AcceptDataListSuggestion_Params_Data)");
class AutofillAgent_PreviewPasswordSuggestion_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> username;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> password;

private:
    friend class mojo::internal::MessageFragment<AutofillAgent_PreviewPasswordSuggestion_Params_Data>;

    AutofillAgent_PreviewPasswordSuggestion_Params_Data();
    ~AutofillAgent_PreviewPasswordSuggestion_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_PreviewPasswordSuggestion_Params_Data) == 24, "Bad sizeof(AutofillAgent_PreviewPasswordSuggestion_Params_Data)");
class AutofillAgent_PreviewPasswordGenerationSuggestion_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> password;

private:
    friend class mojo::internal::MessageFragment<AutofillAgent_PreviewPasswordGenerationSuggestion_Params_Data>;

    AutofillAgent_PreviewPasswordGenerationSuggestion_Params_Data();
    ~AutofillAgent_PreviewPasswordGenerationSuggestion_Params_Data() = delete;
};
static_assert(
    sizeof(AutofillAgent_PreviewPasswordGenerationSuggestion_Params_Data) == 16, "Bad sizeof(AutofillAgent_PreviewPasswordGenerationSuggestion_Params_Data)");
class AutofillAgent_GetPotentialLastFourCombinationsForStandaloneCvc_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AutofillAgent_GetPotentialLastFourCombinationsForStandaloneCvc_Params_Data>;

    AutofillAgent_GetPotentialLastFourCombinationsForStandaloneCvc_Params_Data();
    ~AutofillAgent_GetPotentialLastFourCombinationsForStandaloneCvc_Params_Data() = delete;
};
static_assert(sizeof(AutofillAgent_GetPotentialLastFourCombinationsForStandaloneCvc_Params_Data) == 8,
    "Bad sizeof(AutofillAgent_GetPotentialLastFourCombinationsForStandaloneCvc_Params_Data)");
class AutofillAgent_GetPotentialLastFourCombinationsForStandaloneCvc_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> potential_matches;

private:
    friend class mojo::internal::MessageFragment<AutofillAgent_GetPotentialLastFourCombinationsForStandaloneCvc_ResponseParams_Data>;

    AutofillAgent_GetPotentialLastFourCombinationsForStandaloneCvc_ResponseParams_Data();
    ~AutofillAgent_GetPotentialLastFourCombinationsForStandaloneCvc_ResponseParams_Data() = delete;
};
static_assert(sizeof(AutofillAgent_GetPotentialLastFourCombinationsForStandaloneCvc_ResponseParams_Data) == 16,
    "Bad sizeof(AutofillAgent_GetPotentialLastFourCombinationsForStandaloneCvc_ResponseParams_Data)");
class PasswordAutofillAgent_SetPasswordFillData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::PasswordFormFillData_Data> form_data;

private:
    friend class mojo::internal::MessageFragment<PasswordAutofillAgent_SetPasswordFillData_Params_Data>;

    PasswordAutofillAgent_SetPasswordFillData_Params_Data();
    ~PasswordAutofillAgent_SetPasswordFillData_Params_Data() = delete;
};
static_assert(sizeof(PasswordAutofillAgent_SetPasswordFillData_Params_Data) == 16, "Bad sizeof(PasswordAutofillAgent_SetPasswordFillData_Params_Data)");
class PasswordAutofillAgent_FillPasswordSuggestion_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> username;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> password;

private:
    friend class mojo::internal::MessageFragment<PasswordAutofillAgent_FillPasswordSuggestion_Params_Data>;

    PasswordAutofillAgent_FillPasswordSuggestion_Params_Data();
    ~PasswordAutofillAgent_FillPasswordSuggestion_Params_Data() = delete;
};
static_assert(sizeof(PasswordAutofillAgent_FillPasswordSuggestion_Params_Data) == 24, "Bad sizeof(PasswordAutofillAgent_FillPasswordSuggestion_Params_Data)");
class PasswordAutofillAgent_FillPasswordSuggestion_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PasswordAutofillAgent_FillPasswordSuggestion_ResponseParams_Data>;

    PasswordAutofillAgent_FillPasswordSuggestion_ResponseParams_Data();
    ~PasswordAutofillAgent_FillPasswordSuggestion_ResponseParams_Data() = delete;
};
static_assert(sizeof(PasswordAutofillAgent_FillPasswordSuggestion_ResponseParams_Data) == 16,
    "Bad sizeof(PasswordAutofillAgent_FillPasswordSuggestion_ResponseParams_Data)");
class PasswordAutofillAgent_FillPasswordSuggestionById_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> username_element_id;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> password_element_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> username;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> password;
    int32_t suggestion_source;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PasswordAutofillAgent_FillPasswordSuggestionById_Params_Data>;

    PasswordAutofillAgent_FillPasswordSuggestionById_Params_Data();
    ~PasswordAutofillAgent_FillPasswordSuggestionById_Params_Data() = delete;
};
static_assert(
    sizeof(PasswordAutofillAgent_FillPasswordSuggestionById_Params_Data) == 48, "Bad sizeof(PasswordAutofillAgent_FillPasswordSuggestionById_Params_Data)");
class PasswordAutofillAgent_PreviewPasswordSuggestionById_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> username_element_id;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> password_element_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> username;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> password;

private:
    friend class mojo::internal::MessageFragment<PasswordAutofillAgent_PreviewPasswordSuggestionById_Params_Data>;

    PasswordAutofillAgent_PreviewPasswordSuggestionById_Params_Data();
    ~PasswordAutofillAgent_PreviewPasswordSuggestionById_Params_Data() = delete;
};
static_assert(sizeof(PasswordAutofillAgent_PreviewPasswordSuggestionById_Params_Data) == 40,
    "Bad sizeof(PasswordAutofillAgent_PreviewPasswordSuggestionById_Params_Data)");
class PasswordAutofillAgent_InformNoSavedCredentials_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t should_show_popup_without_passwords : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PasswordAutofillAgent_InformNoSavedCredentials_Params_Data>;

    PasswordAutofillAgent_InformNoSavedCredentials_Params_Data();
    ~PasswordAutofillAgent_InformNoSavedCredentials_Params_Data() = delete;
};
static_assert(
    sizeof(PasswordAutofillAgent_InformNoSavedCredentials_Params_Data) == 16, "Bad sizeof(PasswordAutofillAgent_InformNoSavedCredentials_Params_Data)");
class PasswordAutofillAgent_FillIntoFocusedField_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_password : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> credential;

private:
    friend class mojo::internal::MessageFragment<PasswordAutofillAgent_FillIntoFocusedField_Params_Data>;

    PasswordAutofillAgent_FillIntoFocusedField_Params_Data();
    ~PasswordAutofillAgent_FillIntoFocusedField_Params_Data() = delete;
};
static_assert(sizeof(PasswordAutofillAgent_FillIntoFocusedField_Params_Data) == 24, "Bad sizeof(PasswordAutofillAgent_FillIntoFocusedField_Params_Data)");
class PasswordAutofillAgent_PreviewField_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> value;

private:
    friend class mojo::internal::MessageFragment<PasswordAutofillAgent_PreviewField_Params_Data>;

    PasswordAutofillAgent_PreviewField_Params_Data();
    ~PasswordAutofillAgent_PreviewField_Params_Data() = delete;
};
static_assert(sizeof(PasswordAutofillAgent_PreviewField_Params_Data) == 24, "Bad sizeof(PasswordAutofillAgent_PreviewField_Params_Data)");
class PasswordAutofillAgent_FillField_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> value;
    int32_t suggestion_source;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PasswordAutofillAgent_FillField_Params_Data>;

    PasswordAutofillAgent_FillField_Params_Data();
    ~PasswordAutofillAgent_FillField_Params_Data() = delete;
};
static_assert(sizeof(PasswordAutofillAgent_FillField_Params_Data) == 32, "Bad sizeof(PasswordAutofillAgent_FillField_Params_Data)");
class PasswordAutofillAgent_SetLoggingState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t active : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PasswordAutofillAgent_SetLoggingState_Params_Data>;

    PasswordAutofillAgent_SetLoggingState_Params_Data();
    ~PasswordAutofillAgent_SetLoggingState_Params_Data() = delete;
};
static_assert(sizeof(PasswordAutofillAgent_SetLoggingState_Params_Data) == 16, "Bad sizeof(PasswordAutofillAgent_SetLoggingState_Params_Data)");
class PasswordAutofillAgent_AnnotateFieldsWithParsingResult_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::ParsingResult_Data> parsing_result;

private:
    friend class mojo::internal::MessageFragment<PasswordAutofillAgent_AnnotateFieldsWithParsingResult_Params_Data>;

    PasswordAutofillAgent_AnnotateFieldsWithParsingResult_Params_Data();
    ~PasswordAutofillAgent_AnnotateFieldsWithParsingResult_Params_Data() = delete;
};
static_assert(sizeof(PasswordAutofillAgent_AnnotateFieldsWithParsingResult_Params_Data) == 16,
    "Bad sizeof(PasswordAutofillAgent_AnnotateFieldsWithParsingResult_Params_Data)");
class PasswordGenerationAgent_GeneratedPasswordAccepted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> generated_password;

private:
    friend class mojo::internal::MessageFragment<PasswordGenerationAgent_GeneratedPasswordAccepted_Params_Data>;

    PasswordGenerationAgent_GeneratedPasswordAccepted_Params_Data();
    ~PasswordGenerationAgent_GeneratedPasswordAccepted_Params_Data() = delete;
};
static_assert(
    sizeof(PasswordGenerationAgent_GeneratedPasswordAccepted_Params_Data) == 16, "Bad sizeof(PasswordGenerationAgent_GeneratedPasswordAccepted_Params_Data)");
class PasswordGenerationAgent_TriggeredGeneratePassword_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PasswordGenerationAgent_TriggeredGeneratePassword_Params_Data>;

    PasswordGenerationAgent_TriggeredGeneratePassword_Params_Data();
    ~PasswordGenerationAgent_TriggeredGeneratePassword_Params_Data() = delete;
};
static_assert(
    sizeof(PasswordGenerationAgent_TriggeredGeneratePassword_Params_Data) == 8, "Bad sizeof(PasswordGenerationAgent_TriggeredGeneratePassword_Params_Data)");
class PasswordGenerationAgent_TriggeredGeneratePassword_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::PasswordGenerationUIData_Data> data;

private:
    friend class mojo::internal::MessageFragment<PasswordGenerationAgent_TriggeredGeneratePassword_ResponseParams_Data>;

    PasswordGenerationAgent_TriggeredGeneratePassword_ResponseParams_Data();
    ~PasswordGenerationAgent_TriggeredGeneratePassword_ResponseParams_Data() = delete;
};
static_assert(sizeof(PasswordGenerationAgent_TriggeredGeneratePassword_ResponseParams_Data) == 16,
    "Bad sizeof(PasswordGenerationAgent_TriggeredGeneratePassword_ResponseParams_Data)");
class PasswordGenerationAgent_FoundFormEligibleForGeneration_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::PasswordFormGenerationData_Data> form;

private:
    friend class mojo::internal::MessageFragment<PasswordGenerationAgent_FoundFormEligibleForGeneration_Params_Data>;

    PasswordGenerationAgent_FoundFormEligibleForGeneration_Params_Data();
    ~PasswordGenerationAgent_FoundFormEligibleForGeneration_Params_Data() = delete;
};
static_assert(sizeof(PasswordGenerationAgent_FoundFormEligibleForGeneration_Params_Data) == 16,
    "Bad sizeof(PasswordGenerationAgent_FoundFormEligibleForGeneration_Params_Data)");
class PasswordGenerationAgent_FocusNextFieldAfterPasswords_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PasswordGenerationAgent_FocusNextFieldAfterPasswords_Params_Data>;

    PasswordGenerationAgent_FocusNextFieldAfterPasswords_Params_Data();
    ~PasswordGenerationAgent_FocusNextFieldAfterPasswords_Params_Data() = delete;
};
static_assert(sizeof(PasswordGenerationAgent_FocusNextFieldAfterPasswords_Params_Data) == 8,
    "Bad sizeof(PasswordGenerationAgent_FocusNextFieldAfterPasswords_Params_Data)");

} // namespace internal

class AutofillAgent_TriggerFormExtraction_ParamsDataView {
public:
    AutofillAgent_TriggerFormExtraction_ParamsDataView() = default;

    AutofillAgent_TriggerFormExtraction_ParamsDataView(internal::AutofillAgent_TriggerFormExtraction_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::AutofillAgent_TriggerFormExtraction_Params_Data* data_ = nullptr;
};

class AutofillAgent_TriggerFormExtractionWithResponse_ParamsDataView {
public:
    AutofillAgent_TriggerFormExtractionWithResponse_ParamsDataView() = default;

    AutofillAgent_TriggerFormExtractionWithResponse_ParamsDataView(
