// components/autofill/content/common/mojom/autofill_driver.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_AUTOFILL_CONTENT_COMMON_MOJOM_AUTOFILL_DRIVER_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_AUTOFILL_CONTENT_COMMON_MOJOM_AUTOFILL_DRIVER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace autofill::mojom {
namespace internal {
class AutofillDriver_FormsSeen_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data>>> updated_forms;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::autofill::mojom::internal::FormRendererId_Data>>> removed_forms;

private:
    friend class mojo::internal::MessageFragment<AutofillDriver_FormsSeen_Params_Data>;

    AutofillDriver_FormsSeen_Params_Data();
    ~AutofillDriver_FormsSeen_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_FormsSeen_Params_Data) == 24, "Bad sizeof(AutofillDriver_FormsSeen_Params_Data)");
class AutofillDriver_FormSubmitted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;
    int32_t source;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<AutofillDriver_FormSubmitted_Params_Data>;

    AutofillDriver_FormSubmitted_Params_Data();
    ~AutofillDriver_FormSubmitted_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_FormSubmitted_Params_Data) == 24, "Bad sizeof(AutofillDriver_FormSubmitted_Params_Data)");
class AutofillDriver_CaretMovedInFormField_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field_id;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> caret_bounds;

private:
    friend class mojo::internal::MessageFragment<AutofillDriver_CaretMovedInFormField_Params_Data>;

    AutofillDriver_CaretMovedInFormField_Params_Data();
    ~AutofillDriver_CaretMovedInFormField_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_CaretMovedInFormField_Params_Data) == 32, "Bad sizeof(AutofillDriver_CaretMovedInFormField_Params_Data)");
class AutofillDriver_TextFieldDidChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeTicks_Data> timestamp;

private:
    friend class mojo::internal::MessageFragment<AutofillDriver_TextFieldDidChange_Params_Data>;

    AutofillDriver_TextFieldDidChange_Params_Data();
    ~AutofillDriver_TextFieldDidChange_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_TextFieldDidChange_Params_Data) == 32, "Bad sizeof(AutofillDriver_TextFieldDidChange_Params_Data)");
class AutofillDriver_DidEndTextFieldEditing_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AutofillDriver_DidEndTextFieldEditing_Params_Data>;

    AutofillDriver_DidEndTextFieldEditing_Params_Data();
    ~AutofillDriver_DidEndTextFieldEditing_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_DidEndTextFieldEditing_Params_Data) == 8, "Bad sizeof(AutofillDriver_DidEndTextFieldEditing_Params_Data)");
class AutofillDriver_TextFieldDidScroll_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field_id;

private:
    friend class mojo::internal::MessageFragment<AutofillDriver_TextFieldDidScroll_Params_Data>;

    AutofillDriver_TextFieldDidScroll_Params_Data();
    ~AutofillDriver_TextFieldDidScroll_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_TextFieldDidScroll_Params_Data) == 24, "Bad sizeof(AutofillDriver_TextFieldDidScroll_Params_Data)");
class AutofillDriver_SelectControlDidChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field_id;

private:
    friend class mojo::internal::MessageFragment<AutofillDriver_SelectControlDidChange_Params_Data>;

    AutofillDriver_SelectControlDidChange_Params_Data();
    ~AutofillDriver_SelectControlDidChange_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_SelectControlDidChange_Params_Data) == 24, "Bad sizeof(AutofillDriver_SelectControlDidChange_Params_Data)");
class AutofillDriver_SelectFieldOptionsDidChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;

private:
    friend class mojo::internal::MessageFragment<AutofillDriver_SelectFieldOptionsDidChange_Params_Data>;

    AutofillDriver_SelectFieldOptionsDidChange_Params_Data();
    ~AutofillDriver_SelectFieldOptionsDidChange_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_SelectFieldOptionsDidChange_Params_Data) == 16, "Bad sizeof(AutofillDriver_SelectFieldOptionsDidChange_Params_Data)");
class AutofillDriver_FocusOnFormField_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field_id;

private:
    friend class mojo::internal::MessageFragment<AutofillDriver_FocusOnFormField_Params_Data>;

    AutofillDriver_FocusOnFormField_Params_Data();
    ~AutofillDriver_FocusOnFormField_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_FocusOnFormField_Params_Data) == 24, "Bad sizeof(AutofillDriver_FocusOnFormField_Params_Data)");
class AutofillDriver_FocusOnNonFormField_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AutofillDriver_FocusOnNonFormField_Params_Data>;

    AutofillDriver_FocusOnNonFormField_Params_Data();
    ~AutofillDriver_FocusOnNonFormField_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_FocusOnNonFormField_Params_Data) == 8, "Bad sizeof(AutofillDriver_FocusOnNonFormField_Params_Data)");
class AutofillDriver_AskForValuesToFill_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field_id;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> caret_bounds;
    int32_t trigger_source;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<AutofillDriver_AskForValuesToFill_Params_Data>;

    AutofillDriver_AskForValuesToFill_Params_Data();
    ~AutofillDriver_AskForValuesToFill_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_AskForValuesToFill_Params_Data) == 40, "Bad sizeof(AutofillDriver_AskForValuesToFill_Params_Data)");
class AutofillDriver_HidePopup_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AutofillDriver_HidePopup_Params_Data>;

    AutofillDriver_HidePopup_Params_Data();
    ~AutofillDriver_HidePopup_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_HidePopup_Params_Data) == 8, "Bad sizeof(AutofillDriver_HidePopup_Params_Data)");
class AutofillDriver_DidFillAutofillFormData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeTicks_Data> timestamp;

private:
    friend class mojo::internal::MessageFragment<AutofillDriver_DidFillAutofillFormData_Params_Data>;

    AutofillDriver_DidFillAutofillFormData_Params_Data();
    ~AutofillDriver_DidFillAutofillFormData_Params_Data() = delete;
};
static_assert(sizeof(AutofillDriver_DidFillAutofillFormData_Params_Data) == 24, "Bad sizeof(AutofillDriver_DidFillAutofillFormData_Params_Data)");
class AutofillDriver_JavaScriptChangedAutofilledValue_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> old_value;
    uint8_t formatting_only : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<AutofillDriver_JavaScriptChangedAutofilledValue_Params_Data>;

    AutofillDriver_JavaScriptChangedAutofilledValue_Params_Data();
    ~AutofillDriver_JavaScriptChangedAutofilledValue_Params_Data() = delete;
};
static_assert(
    sizeof(AutofillDriver_JavaScriptChangedAutofilledValue_Params_Data) == 40, "Bad sizeof(AutofillDriver_JavaScriptChangedAutofilledValue_Params_Data)");
class PasswordManagerDriver_PasswordFormsParsed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data>>> forms_data;

private:
    friend class mojo::internal::MessageFragment<PasswordManagerDriver_PasswordFormsParsed_Params_Data>;

    PasswordManagerDriver_PasswordFormsParsed_Params_Data();
    ~PasswordManagerDriver_PasswordFormsParsed_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_PasswordFormsParsed_Params_Data) == 16, "Bad sizeof(PasswordManagerDriver_PasswordFormsParsed_Params_Data)");
class PasswordManagerDriver_PasswordFormsRendered_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data>>> visible_forms_data;

private:
    friend class mojo::internal::MessageFragment<PasswordManagerDriver_PasswordFormsRendered_Params_Data>;

    PasswordManagerDriver_PasswordFormsRendered_Params_Data();
    ~PasswordManagerDriver_PasswordFormsRendered_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_PasswordFormsRendered_Params_Data) == 16, "Bad sizeof(PasswordManagerDriver_PasswordFormsRendered_Params_Data)");
class PasswordManagerDriver_PasswordFormSubmitted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form_data;

private:
    friend class mojo::internal::MessageFragment<PasswordManagerDriver_PasswordFormSubmitted_Params_Data>;

    PasswordManagerDriver_PasswordFormSubmitted_Params_Data();
    ~PasswordManagerDriver_PasswordFormSubmitted_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_PasswordFormSubmitted_Params_Data) == 16, "Bad sizeof(PasswordManagerDriver_PasswordFormSubmitted_Params_Data)");
class PasswordManagerDriver_InformAboutUserInput_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form_data;

private:
    friend class mojo::internal::MessageFragment<PasswordManagerDriver_InformAboutUserInput_Params_Data>;

    PasswordManagerDriver_InformAboutUserInput_Params_Data();
    ~PasswordManagerDriver_InformAboutUserInput_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_InformAboutUserInput_Params_Data) == 16, "Bad sizeof(PasswordManagerDriver_InformAboutUserInput_Params_Data)");
class PasswordManagerDriver_DynamicFormSubmission_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t submission_indication_event;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PasswordManagerDriver_DynamicFormSubmission_Params_Data>;

    PasswordManagerDriver_DynamicFormSubmission_Params_Data();
    ~PasswordManagerDriver_DynamicFormSubmission_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_DynamicFormSubmission_Params_Data) == 16, "Bad sizeof(PasswordManagerDriver_DynamicFormSubmission_Params_Data)");
class PasswordManagerDriver_PasswordFormCleared_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form_data;

private:
    friend class mojo::internal::MessageFragment<PasswordManagerDriver_PasswordFormCleared_Params_Data>;

    PasswordManagerDriver_PasswordFormCleared_Params_Data();
    ~PasswordManagerDriver_PasswordFormCleared_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_PasswordFormCleared_Params_Data) == 16, "Bad sizeof(PasswordManagerDriver_PasswordFormCleared_Params_Data)");
class PasswordManagerDriver_RecordSavePasswordProgress_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> log;

private:
    friend class mojo::internal::MessageFragment<PasswordManagerDriver_RecordSavePasswordProgress_Params_Data>;

    PasswordManagerDriver_RecordSavePasswordProgress_Params_Data();
    ~PasswordManagerDriver_RecordSavePasswordProgress_Params_Data() = delete;
};
static_assert(
    sizeof(PasswordManagerDriver_RecordSavePasswordProgress_Params_Data) == 16, "Bad sizeof(PasswordManagerDriver_RecordSavePasswordProgress_Params_Data)");
class PasswordManagerDriver_UserModifiedPasswordField_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PasswordManagerDriver_UserModifiedPasswordField_Params_Data>;

    PasswordManagerDriver_UserModifiedPasswordField_Params_Data();
    ~PasswordManagerDriver_UserModifiedPasswordField_Params_Data() = delete;
};
static_assert(
    sizeof(PasswordManagerDriver_UserModifiedPasswordField_Params_Data) == 8, "Bad sizeof(PasswordManagerDriver_UserModifiedPasswordField_Params_Data)");
class PasswordManagerDriver_UserModifiedNonPasswordField_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> renderer_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> value;
    uint8_t autocomplete_attribute_has_username : 1;
    uint8_t is_likely_otp : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PasswordManagerDriver_UserModifiedNonPasswordField_Params_Data>;

    PasswordManagerDriver_UserModifiedNonPasswordField_Params_Data();
    ~PasswordManagerDriver_UserModifiedNonPasswordField_Params_Data() = delete;
};
static_assert(
    sizeof(PasswordManagerDriver_UserModifiedNonPasswordField_Params_Data) == 32, "Bad sizeof(PasswordManagerDriver_UserModifiedNonPasswordField_Params_Data)");
class PasswordManagerDriver_ShowPasswordSuggestions_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::PasswordSuggestionRequest_Data> request;

private:
    friend class mojo::internal::MessageFragment<PasswordManagerDriver_ShowPasswordSuggestions_Params_Data>;

    PasswordManagerDriver_ShowPasswordSuggestions_Params_Data();
    ~PasswordManagerDriver_ShowPasswordSuggestions_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_ShowPasswordSuggestions_Params_Data) == 16, "Bad sizeof(PasswordManagerDriver_ShowPasswordSuggestions_Params_Data)");
class PasswordManagerDriver_CheckSafeBrowsingReputation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> form_action;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> frame_url;

private:
    friend class mojo::internal::MessageFragment<PasswordManagerDriver_CheckSafeBrowsingReputation_Params_Data>;

    PasswordManagerDriver_CheckSafeBrowsingReputation_Params_Data();
    ~PasswordManagerDriver_CheckSafeBrowsingReputation_Params_Data() = delete;
};
static_assert(
    sizeof(PasswordManagerDriver_CheckSafeBrowsingReputation_Params_Data) == 24, "Bad sizeof(PasswordManagerDriver_CheckSafeBrowsingReputation_Params_Data)");
class PasswordManagerDriver_FocusedInputChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> focused_field_id;
    int32_t focused_field_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PasswordManagerDriver_FocusedInputChanged_Params_Data>;

    PasswordManagerDriver_FocusedInputChanged_Params_Data();
    ~PasswordManagerDriver_FocusedInputChanged_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_FocusedInputChanged_Params_Data) == 24, "Bad sizeof(PasswordManagerDriver_FocusedInputChanged_Params_Data)");
class PasswordManagerDriver_LogFirstFillingResult_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FormRendererId_Data> form_renderer_id;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PasswordManagerDriver_LogFirstFillingResult_Params_Data>;

    PasswordManagerDriver_LogFirstFillingResult_Params_Data();
    ~PasswordManagerDriver_LogFirstFillingResult_Params_Data() = delete;
};
static_assert(sizeof(PasswordManagerDriver_LogFirstFillingResult_Params_Data) == 24, "Bad sizeof(PasswordManagerDriver_LogFirstFillingResult_Params_Data)");
class PasswordGenerationDriver_AutomaticGenerationAvailable_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::PasswordGenerationUIData_Data> password_generation_ui_data;

private:
    friend class mojo::internal::MessageFragment<PasswordGenerationDriver_AutomaticGenerationAvailable_Params_Data>;

    PasswordGenerationDriver_AutomaticGenerationAvailable_Params_Data();
    ~PasswordGenerationDriver_AutomaticGenerationAvailable_Params_Data() = delete;
};
static_assert(sizeof(PasswordGenerationDriver_AutomaticGenerationAvailable_Params_Data) == 16,
    "Bad sizeof(PasswordGenerationDriver_AutomaticGenerationAvailable_Params_Data)");
class PasswordGenerationDriver_ShowPasswordEditingPopup_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> bounds;
    mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form_data;
    mojo::internal::Pointer<::autofill::mojom::internal::FieldRendererId_Data> field_renderer_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> password_value;

private:
    friend class mojo::internal::MessageFragment<PasswordGenerationDriver_ShowPasswordEditingPopup_Params_Data>;

    PasswordGenerationDriver_ShowPasswordEditingPopup_Params_Data();
    ~PasswordGenerationDriver_ShowPasswordEditingPopup_Params_Data() = delete;
};
static_assert(
    sizeof(PasswordGenerationDriver_ShowPasswordEditingPopup_Params_Data) == 40, "Bad sizeof(PasswordGenerationDriver_ShowPasswordEditingPopup_Params_Data)");
class PasswordGenerationDriver_PasswordGenerationRejectedByTyping_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PasswordGenerationDriver_PasswordGenerationRejectedByTyping_Params_Data>;

    PasswordGenerationDriver_PasswordGenerationRejectedByTyping_Params_Data();
    ~PasswordGenerationDriver_PasswordGenerationRejectedByTyping_Params_Data() = delete;
};
static_assert(sizeof(PasswordGenerationDriver_PasswordGenerationRejectedByTyping_Params_Data) == 8,
    "Bad sizeof(PasswordGenerationDriver_PasswordGenerationRejectedByTyping_Params_Data)");
class PasswordGenerationDriver_PresaveGeneratedPassword_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form_data;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> password_value;

private:
    friend class mojo::internal::MessageFragment<PasswordGenerationDriver_PresaveGeneratedPassword_Params_Data>;

    PasswordGenerationDriver_PresaveGeneratedPassword_Params_Data();
    ~PasswordGenerationDriver_PresaveGeneratedPassword_Params_Data() = delete;
};
static_assert(
    sizeof(PasswordGenerationDriver_PresaveGeneratedPassword_Params_Data) == 24, "Bad sizeof(PasswordGenerationDriver_PresaveGeneratedPassword_Params_Data)");
class PasswordGenerationDriver_PasswordNoLongerGenerated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::autofill::mojom::internal::FormData_Data> form_data;

private:
    friend class mojo::internal::MessageFragment<PasswordGenerationDriver_PasswordNoLongerGenerated_Params_Data>;

    PasswordGenerationDriver_PasswordNoLongerGenerated_Params_Data();
    ~PasswordGenerationDriver_PasswordNoLongerGenerated_Params_Data() = delete;
};
static_assert(
    sizeof(PasswordGenerationDriver_PasswordNoLongerGenerated_Params_Data) == 16, "Bad sizeof(PasswordGenerationDriver_PasswordNoLongerGenerated_Params_Data)");
class PasswordGenerationDriver_FrameWasScrolled_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PasswordGenerationDriver_FrameWasScrolled_Params_Data>;

    PasswordGenerationDriver_FrameWasScrolled_Params_Data();
    ~PasswordGenerationDriver_FrameWasScrolled_Params_Data() = delete;
};
static_assert(sizeof(PasswordGenerationDriver_FrameWasScrolled_Params_Data) == 8, "Bad sizeof(PasswordGenerationDriver_FrameWasScrolled_Params_Data)");
class PasswordGenerationDriver_GenerationElementLostFocus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PasswordGenerationDriver_GenerationElementLostFocus_Params_Data>;

    PasswordGenerationDriver_GenerationElementLostFocus_Params_Data();
    ~PasswordGenerationDriver_GenerationElementLostFocus_Params_Data() = delete;
};
static_assert(sizeof(PasswordGenerationDriver_GenerationElementLostFocus_Params_Data) == 8,
    "Bad sizeof(PasswordGenerationDriver_GenerationElementLostFocus_Params_Data)");

} // namespace internal

class AutofillDriver_FormsSeen_ParamsDataView {
public:
    AutofillDriver_FormsSeen_ParamsDataView() = default;

    AutofillDriver_FormsSeen_ParamsDataView(internal::AutofillDriver_FormsSeen_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetUpdatedFormsDataView(mojo::ArrayDataView<::autofill::mojom::FormDataDataView>* output);

    template <typename UserType> [[nodiscard]] bool ReadUpdatedForms(UserType* output)
    {

        auto* pointer = data_->updated_forms.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<::autofill::mojom::FormDataDataView>>(pointer, output, message_);
    }
