// components/history_clusters/history_clusters_internals/webui/history_clusters_internals.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_HISTORY_CLUSTERS_HISTORY_CLUSTERS_INTERNALS_WEBUI_HISTORY_CLUSTERS_INTERNALS_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_HISTORY_CLUSTERS_HISTORY_CLUSTERS_INTERNALS_WEBUI_HISTORY_CLUSTERS_INTERNALS_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace history_clusters_internals::mojom {
namespace internal {
class PageHandlerFactory_CreatePageHandler_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data page;
    mojo::internal::Handle_Data page_handler;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PageHandlerFactory_CreatePageHandler_Params_Data>;

    PageHandlerFactory_CreatePageHandler_Params_Data();
    ~PageHandlerFactory_CreatePageHandler_Params_Data() = delete;
};
static_assert(sizeof(PageHandlerFactory_CreatePageHandler_Params_Data) == 24, "Bad sizeof(PageHandlerFactory_CreatePageHandler_Params_Data)");
class PageHandler_GetContextClustersJson_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PageHandler_GetContextClustersJson_Params_Data>;

    PageHandler_GetContextClustersJson_Params_Data();
    ~PageHandler_GetContextClustersJson_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_GetContextClustersJson_Params_Data) == 8, "Bad sizeof(PageHandler_GetContextClustersJson_Params_Data)");
class PageHandler_GetContextClustersJson_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> context_clusters_json;

private:
    friend class mojo::internal::MessageFragment<PageHandler_GetContextClustersJson_ResponseParams_Data>;

    PageHandler_GetContextClustersJson_ResponseParams_Data();
    ~PageHandler_GetContextClustersJson_ResponseParams_Data() = delete;
};
static_assert(sizeof(PageHandler_GetContextClustersJson_ResponseParams_Data) == 16, "Bad sizeof(PageHandler_GetContextClustersJson_ResponseParams_Data)");
class PageHandler_PrintKeywordBagStateToLogMessages_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PageHandler_PrintKeywordBagStateToLogMessages_Params_Data>;

    PageHandler_PrintKeywordBagStateToLogMessages_Params_Data();
    ~PageHandler_PrintKeywordBagStateToLogMessages_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_PrintKeywordBagStateToLogMessages_Params_Data) == 8, "Bad sizeof(PageHandler_PrintKeywordBagStateToLogMessages_Params_Data)");
class Page_OnLogMessageAdded_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> message;

private:
    friend class mojo::internal::MessageFragment<Page_OnLogMessageAdded_Params_Data>;

    Page_OnLogMessageAdded_Params_Data();
    ~Page_OnLogMessageAdded_Params_Data() = delete;
};
static_assert(sizeof(Page_OnLogMessageAdded_Params_Data) == 16, "Bad sizeof(Page_OnLogMessageAdded_Params_Data)");

} // namespace internal

class PageHandlerFactory_CreatePageHandler_ParamsDataView {
public:
    PageHandlerFactory_CreatePageHandler_ParamsDataView() = default;

    PageHandlerFactory_CreatePageHandler_ParamsDataView(internal::PageHandlerFactory_CreatePageHandler_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakePage()
    {
        UserType result;
        bool ret
            = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::history_clusters_internals::mojom::PageInterfaceBase>>(&data_->page, &result, message_);
        DCHECK(ret);
        return result;
    }
    template <typename UserType> UserType TakePageHandler()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::history_clusters_internals::mojom::PageHandlerInterfaceBase>>(
            &data_->page_handler, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::PageHandlerFactory_CreatePageHandler_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class PageHandler_GetContextClustersJson_ParamsDataView {
public:
    PageHandler_GetContextClustersJson_ParamsDataView() = default;

    PageHandler_GetContextClustersJson_ParamsDataView(internal::PageHandler_GetContextClustersJson_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::PageHandler_GetContextClustersJson_Params_Data* data_ = nullptr;
};

class PageHandler_GetContextClustersJson_ResponseParamsDataView {
public:
    PageHandler_GetContextClustersJson_ResponseParamsDataView() = default;

    PageHandler_GetContextClustersJson_ResponseParamsDataView(internal::PageHandler_GetContextClustersJson_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetContextClustersJsonDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadContextClustersJson(UserType* output)
    {

        auto* pointer = data_->context_clusters_json.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }

private:
    internal::PageHandler_GetContextClustersJson_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class PageHandler_PrintKeywordBagStateToLogMessages_ParamsDataView {
public:
    PageHandler_PrintKeywordBagStateToLogMessages_ParamsDataView() = default;

    PageHandler_PrintKeywordBagStateToLogMessages_ParamsDataView(
        internal::PageHandler_PrintKeywordBagStateToLogMessages_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::PageHandler_PrintKeywordBagStateToLogMessages_Params_Data* data_ = nullptr;
};

class Page_OnLogMessageAdded_ParamsDataView {
public:
    Page_OnLogMessageAdded_ParamsDataView() = default;

    Page_OnLogMessageAdded_ParamsDataView(internal::Page_OnLogMessageAdded_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetMessageDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadMessage(UserType* output)
    {

        auto* pointer = data_->message.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }

private:
    internal::Page_OnLogMessageAdded_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

inline void PageHandler_GetContextClustersJson_ResponseParamsDataView::GetContextClustersJsonDataView(mojo::StringDataView* output)
{
    auto pointer = data_->context_clusters_json.Get();
    *output = mojo::StringDataView(pointer, message_);
}

inline void Page_OnLogMessageAdded_ParamsDataView::GetMessageDataView(mojo::StringDataView* output)
{
    auto pointer = data_->message.Get();
    *output = mojo::StringDataView(pointer, message_);
}

} // history_clusters_internals::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // COMPONENTS_HISTORY_CLUSTERS_HISTORY_CLUSTERS_INTERNALS_WEBUI_HISTORY_CLUSTERS_INTERNALS_MOJOM_PARAMS_DATA_H_
