// third_party/blink/public/mojom/hid/hid.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_HID_HID_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_HID_HID_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) HidService_RegisterClient_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data client;

private:
    friend class mojo::internal::MessageFragment<HidService_RegisterClient_Params_Data>;

    HidService_RegisterClient_Params_Data();
    ~HidService_RegisterClient_Params_Data() = delete;
};
static_assert(sizeof(HidService_RegisterClient_Params_Data) == 16, "Bad sizeof(HidService_RegisterClient_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) HidService_GetDevices_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<HidService_GetDevices_Params_Data>;

    HidService_GetDevices_Params_Data();
    ~HidService_GetDevices_Params_Data() = delete;
};
static_assert(sizeof(HidService_GetDevices_Params_Data) == 8, "Bad sizeof(HidService_GetDevices_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) HidService_GetDevices_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::device::mojom::internal::HidDeviceInfo_Data>>> devices;

private:
    friend class mojo::internal::MessageFragment<HidService_GetDevices_ResponseParams_Data>;

    HidService_GetDevices_ResponseParams_Data();
    ~HidService_GetDevices_ResponseParams_Data() = delete;
};
static_assert(sizeof(HidService_GetDevices_ResponseParams_Data) == 16, "Bad sizeof(HidService_GetDevices_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) HidService_RequestDevice_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::HidDeviceFilter_Data>>> filters;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::HidDeviceFilter_Data>>> exclusion_filters;

private:
    friend class mojo::internal::MessageFragment<HidService_RequestDevice_Params_Data>;

    HidService_RequestDevice_Params_Data();
    ~HidService_RequestDevice_Params_Data() = delete;
};
static_assert(sizeof(HidService_RequestDevice_Params_Data) == 24, "Bad sizeof(HidService_RequestDevice_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) HidService_RequestDevice_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::device::mojom::internal::HidDeviceInfo_Data>>> devices;

private:
    friend class mojo::internal::MessageFragment<HidService_RequestDevice_ResponseParams_Data>;

    HidService_RequestDevice_ResponseParams_Data();
    ~HidService_RequestDevice_ResponseParams_Data() = delete;
};
static_assert(sizeof(HidService_RequestDevice_ResponseParams_Data) == 16, "Bad sizeof(HidService_RequestDevice_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) HidService_Connect_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> device_guid;
    mojo::internal::Interface_Data client;

private:
    friend class mojo::internal::MessageFragment<HidService_Connect_Params_Data>;

    HidService_Connect_Params_Data();
    ~HidService_Connect_Params_Data() = delete;
};
static_assert(sizeof(HidService_Connect_Params_Data) == 24, "Bad sizeof(HidService_Connect_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) HidService_Connect_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data connection;

private:
    friend class mojo::internal::MessageFragment<HidService_Connect_ResponseParams_Data>;

    HidService_Connect_ResponseParams_Data();
    ~HidService_Connect_ResponseParams_Data() = delete;
};
static_assert(sizeof(HidService_Connect_ResponseParams_Data) == 16, "Bad sizeof(HidService_Connect_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) HidService_Forget_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::device::mojom::internal::HidDeviceInfo_Data> device_info;

private:
    friend class mojo::internal::MessageFragment<HidService_Forget_Params_Data>;

    HidService_Forget_Params_Data();
    ~HidService_Forget_Params_Data() = delete;
};
static_assert(sizeof(HidService_Forget_Params_Data) == 16, "Bad sizeof(HidService_Forget_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) HidService_Forget_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<HidService_Forget_ResponseParams_Data>;

    HidService_Forget_ResponseParams_Data();
    ~HidService_Forget_ResponseParams_Data() = delete;
};
static_assert(sizeof(HidService_Forget_ResponseParams_Data) == 8, "Bad sizeof(HidService_Forget_ResponseParams_Data)");

} // namespace internal

class HidService_RegisterClient_ParamsDataView {
public:
    HidService_RegisterClient_ParamsDataView() = default;

    HidService_RegisterClient_ParamsDataView(internal::HidService_RegisterClient_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeClient()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<::device::mojom::HidManagerClientAssociatedPtrInfoDataView>(&data_->client, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::HidService_RegisterClient_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class HidService_GetDevices_ParamsDataView {
public:
    HidService_GetDevices_ParamsDataView() = default;

    HidService_GetDevices_ParamsDataView(internal::HidService_GetDevices_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::HidService_GetDevices_Params_Data* data_ = nullptr;
};

class HidService_GetDevices_ResponseParamsDataView {
public:
    HidService_GetDevices_ResponseParamsDataView() = default;

    HidService_GetDevices_ResponseParamsDataView(internal::HidService_GetDevices_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetDevicesDataView(mojo::ArrayDataView<::device::mojom::HidDeviceInfoDataView>* output);

    template <typename UserType> [[nodiscard]] bool ReadDevices(UserType* output)
    {

        auto* pointer = data_->devices.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<::device::mojom::HidDeviceInfoDataView>>(pointer, output, message_);
    }

private:
    internal::HidService_GetDevices_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class HidService_RequestDevice_ParamsDataView {
public:
    HidService_RequestDevice_ParamsDataView() = default;

    HidService_RequestDevice_ParamsDataView(internal::HidService_RequestDevice_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetFiltersDataView(mojo::ArrayDataView<HidDeviceFilterDataView>* output);

    template <typename UserType> [[nodiscard]] bool ReadFilters(UserType* output)
    {

        auto* pointer = data_->filters.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<::blink::mojom::HidDeviceFilterDataView>>(pointer, output, message_);
    }
    inline void GetExclusionFiltersDataView(mojo::ArrayDataView<HidDeviceFilterDataView>* output);

    template <typename UserType> [[nodiscard]] bool ReadExclusionFilters(UserType* output)
    {

        auto* pointer = data_->exclusion_filters.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<::blink::mojom::HidDeviceFilterDataView>>(pointer, output, message_);
    }

private:
    internal::HidService_RequestDevice_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class HidService_RequestDevice_ResponseParamsDataView {
public:
    HidService_RequestDevice_ResponseParamsDataView() = default;

    HidService_RequestDevice_ResponseParamsDataView(internal::HidService_RequestDevice_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetDevicesDataView(mojo::ArrayDataView<::device::mojom::HidDeviceInfoDataView>* output);

    template <typename UserType> [[nodiscard]] bool ReadDevices(UserType* output)
    {

        auto* pointer = data_->devices.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<::device::mojom::HidDeviceInfoDataView>>(pointer, output, message_);
    }

private:
    internal::HidService_RequestDevice_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class HidService_Connect_ParamsDataView {
public:
    HidService_Connect_ParamsDataView() = default;

    HidService_Connect_ParamsDataView(internal::HidService_Connect_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetDeviceGuidDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadDeviceGuid(UserType* output)
    {

        auto* pointer = data_->device_guid.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }
    template <typename UserType> UserType TakeClient()
    {
        UserType result;
        bool ret
            = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::device::mojom::HidConnectionClientInterfaceBase>>(&data_->client, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::HidService_Connect_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class HidService_Connect_ResponseParamsDataView {
public:
    HidService_Connect_ResponseParamsDataView() = default;

    HidService_Connect_ResponseParamsDataView(internal::HidService_Connect_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeConnection()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::device::mojom::HidConnectionInterfaceBase>>(&data_->connection, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::HidService_Connect_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class HidService_Forget_ParamsDataView {
public:
    HidService_Forget_ParamsDataView() = default;

    HidService_Forget_ParamsDataView(internal::HidService_Forget_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetDeviceInfoDataView(::device::mojom::HidDeviceInfoDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadDeviceInfo(UserType* output)
    {

        auto* pointer = data_->device_info.Get();
        return mojo::internal::Deserialize<::device::mojom::HidDeviceInfoDataView>(pointer, output, message_);
    }

private:
    internal::HidService_Forget_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class HidService_Forget_ResponseParamsDataView {
public:
    HidService_Forget_ResponseParamsDataView() = default;

    HidService_Forget_ResponseParamsDataView(internal::HidService_Forget_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::HidService_Forget_ResponseParams_Data* data_ = nullptr;
};

inline void HidService_GetDevices_ResponseParamsDataView::GetDevicesDataView(mojo::ArrayDataView<::device::mojom::HidDeviceInfoDataView>* output)
{
    auto pointer = data_->devices.Get();
    *output = mojo::ArrayDataView<::device::mojom::HidDeviceInfoDataView>(pointer, message_);
}

inline void HidService_RequestDevice_ParamsDataView::GetFiltersDataView(mojo::ArrayDataView<HidDeviceFilterDataView>* output)
{
    auto pointer = data_->filters.Get();
    *output = mojo::ArrayDataView<HidDeviceFilterDataView>(pointer, message_);
}
inline void HidService_RequestDevice_ParamsDataView::GetExclusionFiltersDataView(mojo::ArrayDataView<HidDeviceFilterDataView>* output)
{
    auto pointer = data_->exclusion_filters.Get();
    *output = mojo::ArrayDataView<HidDeviceFilterDataView>(pointer, message_);
}

inline void HidService_RequestDevice_ResponseParamsDataView::GetDevicesDataView(mojo::ArrayDataView<::device::mojom::HidDeviceInfoDataView>* output)
{
    auto pointer = data_->devices.Get();
    *output = mojo::ArrayDataView<::device::mojom::HidDeviceInfoDataView>(pointer, message_);
}

inline void HidService_Connect_ParamsDataView::GetDeviceGuidDataView(mojo::StringDataView* output)
{
    auto pointer = data_->device_guid.Get();
    *output = mojo::StringDataView(pointer, message_);
}

inline void HidService_Forget_ParamsDataView::GetDeviceInfoDataView(::device::mojom::HidDeviceInfoDataView* output)
{
    auto pointer = data_->device_info.Get();
    *output = ::device::mojom::HidDeviceInfoDataView(pointer, message_);
}

} // blink::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // THIRD_PARTY_BLINK_PUBLIC_MOJOM_HID_HID_MOJOM_PARAMS_DATA_H_
