// third_party/blink/public/mojom/subapps/sub_apps_service.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_SUBAPPS_SUB_APPS_SERVICE_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_SUBAPPS_SUB_APPS_SERVICE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SubAppsService_Add_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::SubAppsServiceAddParameters_Data>>> sub_apps_to_add;

private:
    friend class mojo::internal::MessageFragment<SubAppsService_Add_Params_Data>;

    SubAppsService_Add_Params_Data();
    ~SubAppsService_Add_Params_Data() = delete;
};
static_assert(sizeof(SubAppsService_Add_Params_Data) == 16, "Bad sizeof(SubAppsService_Add_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SubAppsService_Add_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::SubAppsServiceAddResult_Data>>> result;

private:
    friend class mojo::internal::MessageFragment<SubAppsService_Add_ResponseParams_Data>;

    SubAppsService_Add_ResponseParams_Data();
    ~SubAppsService_Add_ResponseParams_Data() = delete;
};
static_assert(sizeof(SubAppsService_Add_ResponseParams_Data) == 16, "Bad sizeof(SubAppsService_Add_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SubAppsService_List_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SubAppsService_List_Params_Data>;

    SubAppsService_List_Params_Data();
    ~SubAppsService_List_Params_Data() = delete;
};
static_assert(sizeof(SubAppsService_List_Params_Data) == 8, "Bad sizeof(SubAppsService_List_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SubAppsService_List_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SubAppsServiceListResult_Data> result;

private:
    friend class mojo::internal::MessageFragment<SubAppsService_List_ResponseParams_Data>;

    SubAppsService_List_ResponseParams_Data();
    ~SubAppsService_List_ResponseParams_Data() = delete;
};
static_assert(sizeof(SubAppsService_List_ResponseParams_Data) == 16, "Bad sizeof(SubAppsService_List_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SubAppsService_Remove_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> manifest_id_paths;

private:
    friend class mojo::internal::MessageFragment<SubAppsService_Remove_Params_Data>;

    SubAppsService_Remove_Params_Data();
    ~SubAppsService_Remove_Params_Data() = delete;
};
static_assert(sizeof(SubAppsService_Remove_Params_Data) == 16, "Bad sizeof(SubAppsService_Remove_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SubAppsService_Remove_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::SubAppsServiceRemoveResult_Data>>> result;

private:
    friend class mojo::internal::MessageFragment<SubAppsService_Remove_ResponseParams_Data>;

    SubAppsService_Remove_ResponseParams_Data();
    ~SubAppsService_Remove_ResponseParams_Data() = delete;
};
static_assert(sizeof(SubAppsService_Remove_ResponseParams_Data) == 16, "Bad sizeof(SubAppsService_Remove_ResponseParams_Data)");

} // namespace internal

class SubAppsService_Add_ParamsDataView {
public:
    SubAppsService_Add_ParamsDataView() = default;

    SubAppsService_Add_ParamsDataView(internal::SubAppsService_Add_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetSubAppsToAddDataView(mojo::ArrayDataView<SubAppsServiceAddParametersDataView>* output);

    template <typename UserType> [[nodiscard]] bool ReadSubAppsToAdd(UserType* output)
    {

        auto* pointer = data_->sub_apps_to_add.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<::blink::mojom::SubAppsServiceAddParametersDataView>>(pointer, output, message_);
    }

private:
    internal::SubAppsService_Add_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class SubAppsService_Add_ResponseParamsDataView {
public:
    SubAppsService_Add_ResponseParamsDataView() = default;

    SubAppsService_Add_ResponseParamsDataView(internal::SubAppsService_Add_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetResultDataView(mojo::ArrayDataView<SubAppsServiceAddResultDataView>* output);

    template <typename UserType> [[nodiscard]] bool ReadResult(UserType* output)
    {

        auto* pointer = data_->result.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<::blink::mojom::SubAppsServiceAddResultDataView>>(pointer, output, message_);
    }

private:
    internal::SubAppsService_Add_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class SubAppsService_List_ParamsDataView {
public:
    SubAppsService_List_ParamsDataView() = default;

    SubAppsService_List_ParamsDataView(internal::SubAppsService_List_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::SubAppsService_List_Params_Data* data_ = nullptr;
};

class SubAppsService_List_ResponseParamsDataView {
public:
    SubAppsService_List_ResponseParamsDataView() = default;

    SubAppsService_List_ResponseParamsDataView(internal::SubAppsService_List_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetResultDataView(SubAppsServiceListResultDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadResult(UserType* output)
    {

        auto* pointer = data_->result.Get();
        return mojo::internal::Deserialize<::blink::mojom::SubAppsServiceListResultDataView>(pointer, output, message_);
    }

private:
    internal::SubAppsService_List_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class SubAppsService_Remove_ParamsDataView {
public:
    SubAppsService_Remove_ParamsDataView() = default;

    SubAppsService_Remove_ParamsDataView(internal::SubAppsService_Remove_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetManifestIdPathsDataView(mojo::ArrayDataView<mojo::StringDataView>* output);

    template <typename UserType> [[nodiscard]] bool ReadManifestIdPaths(UserType* output)
    {

        auto* pointer = data_->manifest_id_paths.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<mojo::StringDataView>>(pointer, output, message_);
    }

private:
    internal::SubAppsService_Remove_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class SubAppsService_Remove_ResponseParamsDataView {
public:
    SubAppsService_Remove_ResponseParamsDataView() = default;

    SubAppsService_Remove_ResponseParamsDataView(internal::SubAppsService_Remove_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetResultDataView(mojo::ArrayDataView<SubAppsServiceRemoveResultDataView>* output);

    template <typename UserType> [[nodiscard]] bool ReadResult(UserType* output)
    {

        auto* pointer = data_->result.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<::blink::mojom::SubAppsServiceRemoveResultDataView>>(pointer, output, message_);
    }

private:
    internal::SubAppsService_Remove_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

inline void SubAppsService_Add_ParamsDataView::GetSubAppsToAddDataView(mojo::ArrayDataView<SubAppsServiceAddParametersDataView>* output)
{
    auto pointer = data_->sub_apps_to_add.Get();
    *output = mojo::ArrayDataView<SubAppsServiceAddParametersDataView>(pointer, message_);
}

inline void SubAppsService_Add_ResponseParamsDataView::GetResultDataView(mojo::ArrayDataView<SubAppsServiceAddResultDataView>* output)
{
    auto pointer = data_->result.Get();
    *output = mojo::ArrayDataView<SubAppsServiceAddResultDataView>(pointer, message_);
}

inline void SubAppsService_List_ResponseParamsDataView::GetResultDataView(SubAppsServiceListResultDataView* output)
{
    auto pointer = data_->result.Get();
    *output = SubAppsServiceListResultDataView(pointer, message_);
}

inline void SubAppsService_Remove_ParamsDataView::GetManifestIdPathsDataView(mojo::ArrayDataView<mojo::StringDataView>* output)
{
    auto pointer = data_->manifest_id_paths.Get();
    *output = mojo::ArrayDataView<mojo::StringDataView>(pointer, message_);
}

inline void SubAppsService_Remove_ResponseParamsDataView::GetResultDataView(mojo::ArrayDataView<SubAppsServiceRemoveResultDataView>* output)
{
    auto pointer = data_->result.Get();
    *output = mojo::ArrayDataView<SubAppsServiceRemoveResultDataView>(pointer, message_);
}

} // blink::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // THIRD_PARTY_BLINK_PUBLIC_MOJOM_SUBAPPS_SUB_APPS_SERVICE_MOJOM_PARAMS_DATA_H_
