// media/mojo/mojom/audio_stream_factory.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MEDIA_MOJO_MOJOM_AUDIO_STREAM_FACTORY_MOJOM_PARAMS_DATA_H_
#define MEDIA_MOJO_MOJOM_AUDIO_STREAM_FACTORY_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media::mojom {
namespace internal {
class AudioStreamFactory_CreateInputStream_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data stream;
    mojo::internal::Interface_Data client;
    mojo::internal::Interface_Data observer;
    mojo::internal::Interface_Data log;
    uint32_t shared_memory_count;
    mojo::internal::Pointer<mojo::internal::String_Data> device_id;
    mojo::internal::Pointer<::media::mojom::internal::AudioParameters_Data> params;
    uint8_t enable_agc : 1;
    uint8_t pad7_[7];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> key_press_count_buffer;
    mojo::internal::Pointer<::media::mojom::internal::AudioProcessingConfig_Data> processing_config;

private:
    friend class mojo::internal::MessageFragment<AudioStreamFactory_CreateInputStream_Params_Data>;

    AudioStreamFactory_CreateInputStream_Params_Data();
    ~AudioStreamFactory_CreateInputStream_Params_Data() = delete;
};
static_assert(sizeof(AudioStreamFactory_CreateInputStream_Params_Data) == 80, "Bad sizeof(AudioStreamFactory_CreateInputStream_Params_Data)");
class AudioStreamFactory_CreateInputStream_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::ReadOnlyAudioDataPipe_Data> data_pipe;
    uint8_t initially_muted : 1;
    uint8_t pad1_[7];
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> stream_id;

private:
    friend class mojo::internal::MessageFragment<AudioStreamFactory_CreateInputStream_ResponseParams_Data>;

    AudioStreamFactory_CreateInputStream_ResponseParams_Data();
    ~AudioStreamFactory_CreateInputStream_ResponseParams_Data() = delete;
};
static_assert(sizeof(AudioStreamFactory_CreateInputStream_ResponseParams_Data) == 32, "Bad sizeof(AudioStreamFactory_CreateInputStream_ResponseParams_Data)");
class AudioStreamFactory_AssociateInputAndOutputForAec_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> input_stream_id;
    mojo::internal::Pointer<mojo::internal::String_Data> output_device_id;

private:
    friend class mojo::internal::MessageFragment<AudioStreamFactory_AssociateInputAndOutputForAec_Params_Data>;

    AudioStreamFactory_AssociateInputAndOutputForAec_Params_Data();
    ~AudioStreamFactory_AssociateInputAndOutputForAec_Params_Data() = delete;
};
static_assert(
    sizeof(AudioStreamFactory_AssociateInputAndOutputForAec_Params_Data) == 24, "Bad sizeof(AudioStreamFactory_AssociateInputAndOutputForAec_Params_Data)");
class AudioStreamFactory_CreateOutputStream_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data stream;
    mojo::internal::AssociatedInterface_Data observer;
    mojo::internal::Interface_Data log;
    uint8_t pad2_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> device_id;
    mojo::internal::Pointer<::media::mojom::internal::AudioParameters_Data> params;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> group_id;

private:
    friend class mojo::internal::MessageFragment<AudioStreamFactory_CreateOutputStream_Params_Data>;

    AudioStreamFactory_CreateOutputStream_Params_Data();
    ~AudioStreamFactory_CreateOutputStream_Params_Data() = delete;
};
static_assert(sizeof(AudioStreamFactory_CreateOutputStream_Params_Data) == 56, "Bad sizeof(AudioStreamFactory_CreateOutputStream_Params_Data)");
class AudioStreamFactory_CreateOutputStream_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::ReadWriteAudioDataPipe_Data> data_pipe;

private:
    friend class mojo::internal::MessageFragment<AudioStreamFactory_CreateOutputStream_ResponseParams_Data>;

    AudioStreamFactory_CreateOutputStream_ResponseParams_Data();
    ~AudioStreamFactory_CreateOutputStream_ResponseParams_Data() = delete;
};
static_assert(sizeof(AudioStreamFactory_CreateOutputStream_ResponseParams_Data) == 16, "Bad sizeof(AudioStreamFactory_CreateOutputStream_ResponseParams_Data)");
class AudioStreamFactory_CreateSwitchableOutputStream_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data stream;
    mojo::internal::Handle_Data device_switch_receiver;
    mojo::internal::AssociatedInterface_Data observer;
    mojo::internal::Interface_Data log;
    mojo::internal::Pointer<mojo::internal::String_Data> device_id;
    mojo::internal::Pointer<::media::mojom::internal::AudioParameters_Data> params;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> group_id;

private:
    friend class mojo::internal::MessageFragment<AudioStreamFactory_CreateSwitchableOutputStream_Params_Data>;

    AudioStreamFactory_CreateSwitchableOutputStream_Params_Data();
    ~AudioStreamFactory_CreateSwitchableOutputStream_Params_Data() = delete;
};
static_assert(
    sizeof(AudioStreamFactory_CreateSwitchableOutputStream_Params_Data) == 56, "Bad sizeof(AudioStreamFactory_CreateSwitchableOutputStream_Params_Data)");
class AudioStreamFactory_CreateSwitchableOutputStream_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::ReadWriteAudioDataPipe_Data> data_pipe;

private:
    friend class mojo::internal::MessageFragment<AudioStreamFactory_CreateSwitchableOutputStream_ResponseParams_Data>;

    AudioStreamFactory_CreateSwitchableOutputStream_ResponseParams_Data();
    ~AudioStreamFactory_CreateSwitchableOutputStream_ResponseParams_Data() = delete;
};
static_assert(sizeof(AudioStreamFactory_CreateSwitchableOutputStream_ResponseParams_Data) == 16,
    "Bad sizeof(AudioStreamFactory_CreateSwitchableOutputStream_ResponseParams_Data)");
class AudioStreamFactory_BindMuter_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedEndpointHandle_Data receiver;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> group_id;

private:
    friend class mojo::internal::MessageFragment<AudioStreamFactory_BindMuter_Params_Data>;

    AudioStreamFactory_BindMuter_Params_Data();
    ~AudioStreamFactory_BindMuter_Params_Data() = delete;
};
static_assert(sizeof(AudioStreamFactory_BindMuter_Params_Data) == 24, "Bad sizeof(AudioStreamFactory_BindMuter_Params_Data)");
class AudioStreamFactory_CreateLoopbackStream_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    mojo::internal::Interface_Data client;
    mojo::internal::Interface_Data observer;
    uint32_t shared_memory_count;
    mojo::internal::Pointer<::media::mojom::internal::AudioParameters_Data> params;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> group_id;

private:
    friend class mojo::internal::MessageFragment<AudioStreamFactory_CreateLoopbackStream_Params_Data>;

    AudioStreamFactory_CreateLoopbackStream_Params_Data();
    ~AudioStreamFactory_CreateLoopbackStream_Params_Data() = delete;
};
static_assert(sizeof(AudioStreamFactory_CreateLoopbackStream_Params_Data) == 48, "Bad sizeof(AudioStreamFactory_CreateLoopbackStream_Params_Data)");
class AudioStreamFactory_CreateLoopbackStream_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::ReadOnlyAudioDataPipe_Data> data_pipe;

private:
    friend class mojo::internal::MessageFragment<AudioStreamFactory_CreateLoopbackStream_ResponseParams_Data>;

    AudioStreamFactory_CreateLoopbackStream_ResponseParams_Data();
    ~AudioStreamFactory_CreateLoopbackStream_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(AudioStreamFactory_CreateLoopbackStream_ResponseParams_Data) == 16, "Bad sizeof(AudioStreamFactory_CreateLoopbackStream_ResponseParams_Data)");

} // namespace internal

class AudioStreamFactory_CreateInputStream_ParamsDataView {
public:
