// media/mojo/mojom/content_decryption_module.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MEDIA_MOJO_MOJOM_CONTENT_DECRYPTION_MODULE_MOJOM_PARAMS_DATA_H_
#define MEDIA_MOJO_MOJOM_CONTENT_DECRYPTION_MODULE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media::mojom {
namespace internal {
class ContentDecryptionModule_SetClient_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data client;

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModule_SetClient_Params_Data>;

    ContentDecryptionModule_SetClient_Params_Data();
    ~ContentDecryptionModule_SetClient_Params_Data() = delete;
};
static_assert(sizeof(ContentDecryptionModule_SetClient_Params_Data) == 16, "Bad sizeof(ContentDecryptionModule_SetClient_Params_Data)");
class ContentDecryptionModule_SetServerCertificate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> certificate_data;

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModule_SetServerCertificate_Params_Data>;

    ContentDecryptionModule_SetServerCertificate_Params_Data();
    ~ContentDecryptionModule_SetServerCertificate_Params_Data() = delete;
};
static_assert(sizeof(ContentDecryptionModule_SetServerCertificate_Params_Data) == 16, "Bad sizeof(ContentDecryptionModule_SetServerCertificate_Params_Data)");
class ContentDecryptionModule_SetServerCertificate_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CdmPromiseResult_Data> result;

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModule_SetServerCertificate_ResponseParams_Data>;

    ContentDecryptionModule_SetServerCertificate_ResponseParams_Data();
    ~ContentDecryptionModule_SetServerCertificate_ResponseParams_Data() = delete;
};
static_assert(sizeof(ContentDecryptionModule_SetServerCertificate_ResponseParams_Data) == 16,
    "Bad sizeof(ContentDecryptionModule_SetServerCertificate_ResponseParams_Data)");
class ContentDecryptionModule_GetStatusForPolicy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t min_hdcp_version;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModule_GetStatusForPolicy_Params_Data>;

    ContentDecryptionModule_GetStatusForPolicy_Params_Data();
    ~ContentDecryptionModule_GetStatusForPolicy_Params_Data() = delete;
};
static_assert(sizeof(ContentDecryptionModule_GetStatusForPolicy_Params_Data) == 16, "Bad sizeof(ContentDecryptionModule_GetStatusForPolicy_Params_Data)");
class ContentDecryptionModule_GetStatusForPolicy_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CdmPromiseResult_Data> result;
    int32_t key_status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModule_GetStatusForPolicy_ResponseParams_Data>;

    ContentDecryptionModule_GetStatusForPolicy_ResponseParams_Data();
    ~ContentDecryptionModule_GetStatusForPolicy_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(ContentDecryptionModule_GetStatusForPolicy_ResponseParams_Data) == 24, "Bad sizeof(ContentDecryptionModule_GetStatusForPolicy_ResponseParams_Data)");
class ContentDecryptionModule_CreateSessionAndGenerateRequest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t session_type;
    int32_t init_data_type;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> init_data;

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModule_CreateSessionAndGenerateRequest_Params_Data>;

    ContentDecryptionModule_CreateSessionAndGenerateRequest_Params_Data();
    ~ContentDecryptionModule_CreateSessionAndGenerateRequest_Params_Data() = delete;
};
static_assert(sizeof(ContentDecryptionModule_CreateSessionAndGenerateRequest_Params_Data) == 24,
    "Bad sizeof(ContentDecryptionModule_CreateSessionAndGenerateRequest_Params_Data)");
class ContentDecryptionModule_CreateSessionAndGenerateRequest_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CdmPromiseResult_Data> result;
    mojo::internal::Pointer<mojo::internal::String_Data> session_id;

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModule_CreateSessionAndGenerateRequest_ResponseParams_Data>;

    ContentDecryptionModule_CreateSessionAndGenerateRequest_ResponseParams_Data();
    ~ContentDecryptionModule_CreateSessionAndGenerateRequest_ResponseParams_Data() = delete;
};
static_assert(sizeof(ContentDecryptionModule_CreateSessionAndGenerateRequest_ResponseParams_Data) == 24,
    "Bad sizeof(ContentDecryptionModule_CreateSessionAndGenerateRequest_ResponseParams_Data)");
class ContentDecryptionModule_LoadSession_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t session_type;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> session_id;

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModule_LoadSession_Params_Data>;

    ContentDecryptionModule_LoadSession_Params_Data();
    ~ContentDecryptionModule_LoadSession_Params_Data() = delete;
};
static_assert(sizeof(ContentDecryptionModule_LoadSession_Params_Data) == 24, "Bad sizeof(ContentDecryptionModule_LoadSession_Params_Data)");
class ContentDecryptionModule_LoadSession_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CdmPromiseResult_Data> result;
    mojo::internal::Pointer<mojo::internal::String_Data> session_id;

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModule_LoadSession_ResponseParams_Data>;

    ContentDecryptionModule_LoadSession_ResponseParams_Data();
    ~ContentDecryptionModule_LoadSession_ResponseParams_Data() = delete;
};
static_assert(sizeof(ContentDecryptionModule_LoadSession_ResponseParams_Data) == 24, "Bad sizeof(ContentDecryptionModule_LoadSession_ResponseParams_Data)");
class ContentDecryptionModule_UpdateSession_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> session_id;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> response;

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModule_UpdateSession_Params_Data>;

    ContentDecryptionModule_UpdateSession_Params_Data();
    ~ContentDecryptionModule_UpdateSession_Params_Data() = delete;
};
static_assert(sizeof(ContentDecryptionModule_UpdateSession_Params_Data) == 24, "Bad sizeof(ContentDecryptionModule_UpdateSession_Params_Data)");
class ContentDecryptionModule_UpdateSession_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CdmPromiseResult_Data> result;

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModule_UpdateSession_ResponseParams_Data>;

    ContentDecryptionModule_UpdateSession_ResponseParams_Data();
    ~ContentDecryptionModule_UpdateSession_ResponseParams_Data() = delete;
};
static_assert(sizeof(ContentDecryptionModule_UpdateSession_ResponseParams_Data) == 16, "Bad sizeof(ContentDecryptionModule_UpdateSession_ResponseParams_Data)");
class ContentDecryptionModule_CloseSession_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> session_id;

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModule_CloseSession_Params_Data>;

    ContentDecryptionModule_CloseSession_Params_Data();
    ~ContentDecryptionModule_CloseSession_Params_Data() = delete;
};
static_assert(sizeof(ContentDecryptionModule_CloseSession_Params_Data) == 16, "Bad sizeof(ContentDecryptionModule_CloseSession_Params_Data)");
class ContentDecryptionModule_CloseSession_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CdmPromiseResult_Data> result;

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModule_CloseSession_ResponseParams_Data>;

    ContentDecryptionModule_CloseSession_ResponseParams_Data();
    ~ContentDecryptionModule_CloseSession_ResponseParams_Data() = delete;
};
static_assert(sizeof(ContentDecryptionModule_CloseSession_ResponseParams_Data) == 16, "Bad sizeof(ContentDecryptionModule_CloseSession_ResponseParams_Data)");
class ContentDecryptionModule_RemoveSession_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> session_id;

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModule_RemoveSession_Params_Data>;

    ContentDecryptionModule_RemoveSession_Params_Data();
    ~ContentDecryptionModule_RemoveSession_Params_Data() = delete;
};
static_assert(sizeof(ContentDecryptionModule_RemoveSession_Params_Data) == 16, "Bad sizeof(ContentDecryptionModule_RemoveSession_Params_Data)");
class ContentDecryptionModule_RemoveSession_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CdmPromiseResult_Data> result;

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModule_RemoveSession_ResponseParams_Data>;

    ContentDecryptionModule_RemoveSession_ResponseParams_Data();
    ~ContentDecryptionModule_RemoveSession_ResponseParams_Data() = delete;
};
static_assert(sizeof(ContentDecryptionModule_RemoveSession_ResponseParams_Data) == 16, "Bad sizeof(ContentDecryptionModule_RemoveSession_ResponseParams_Data)");
class ContentDecryptionModuleClient_OnSessionMessage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> session_id;
    int32_t message_type;
    uint8_t pad1_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> message;

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModuleClient_OnSessionMessage_Params_Data>;

    ContentDecryptionModuleClient_OnSessionMessage_Params_Data();
    ~ContentDecryptionModuleClient_OnSessionMessage_Params_Data() = delete;
};
static_assert(
    sizeof(ContentDecryptionModuleClient_OnSessionMessage_Params_Data) == 32, "Bad sizeof(ContentDecryptionModuleClient_OnSessionMessage_Params_Data)");
class ContentDecryptionModuleClient_OnSessionClosed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> session_id;
    int32_t reason;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModuleClient_OnSessionClosed_Params_Data>;

    ContentDecryptionModuleClient_OnSessionClosed_Params_Data();
    ~ContentDecryptionModuleClient_OnSessionClosed_Params_Data() = delete;
};
static_assert(sizeof(ContentDecryptionModuleClient_OnSessionClosed_Params_Data) == 24, "Bad sizeof(ContentDecryptionModuleClient_OnSessionClosed_Params_Data)");
class ContentDecryptionModuleClient_OnSessionKeysChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> session_id;
    uint8_t has_additional_usable_key : 1;
    uint8_t pad1_[7];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::CdmKeyInformation_Data>>> keys_info;

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModuleClient_OnSessionKeysChange_Params_Data>;

    ContentDecryptionModuleClient_OnSessionKeysChange_Params_Data();
    ~ContentDecryptionModuleClient_OnSessionKeysChange_Params_Data() = delete;
};
static_assert(
    sizeof(ContentDecryptionModuleClient_OnSessionKeysChange_Params_Data) == 32, "Bad sizeof(ContentDecryptionModuleClient_OnSessionKeysChange_Params_Data)");
class ContentDecryptionModuleClient_OnSessionExpirationUpdate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> session_id;
    double new_expiry_time_sec;

private:
    friend class mojo::internal::MessageFragment<ContentDecryptionModuleClient_OnSessionExpirationUpdate_Params_Data>;

    ContentDecryptionModuleClient_OnSessionExpirationUpdate_Params_Data();
    ~ContentDecryptionModuleClient_OnSessionExpirationUpdate_Params_Data() = delete;
};
static_assert(sizeof(ContentDecryptionModuleClient_OnSessionExpirationUpdate_Params_Data) == 24,
    "Bad sizeof(ContentDecryptionModuleClient_OnSessionExpirationUpdate_Params_Data)");
class CdmFactory_CreateCdm_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CdmConfig_Data> cdm_config;

private:
    friend class mojo::internal::MessageFragment<CdmFactory_CreateCdm_Params_Data>;

    CdmFactory_CreateCdm_Params_Data();
    ~CdmFactory_CreateCdm_Params_Data() = delete;
};
static_assert(sizeof(CdmFactory_CreateCdm_Params_Data) == 16, "Bad sizeof(CdmFactory_CreateCdm_Params_Data)");
class CdmFactory_CreateCdm_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data cdm;
    mojo::internal::Pointer<internal::CdmContext_Data> cdm_context;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CdmFactory_CreateCdm_ResponseParams_Data>;

    CdmFactory_CreateCdm_ResponseParams_Data();
    ~CdmFactory_CreateCdm_ResponseParams_Data() = delete;
};
static_assert(sizeof(CdmFactory_CreateCdm_ResponseParams_Data) == 32, "Bad sizeof(CdmFactory_CreateCdm_ResponseParams_Data)");

} // namespace internal

class ContentDecryptionModule_SetClient_ParamsDataView {
public:
    ContentDecryptionModule_SetClient_ParamsDataView() = default;

    ContentDecryptionModule_SetClient_ParamsDataView(internal::ContentDecryptionModule_SetClient_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeClient()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<::media::mojom::ContentDecryptionModuleClientAssociatedPtrInfoDataView>(&data_->client, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::ContentDecryptionModule_SetClient_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

