// media/mojo/mojom/media_metrics_provider.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MEDIA_MOJO_MOJOM_MEDIA_METRICS_PROVIDER_MOJOM_PARAMS_DATA_H_
#define MEDIA_MOJO_MOJOM_MEDIA_METRICS_PROVIDER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media::mojom {
namespace internal {
class MediaMetricsProvider_Initialize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_mse : 1;
    uint8_t pad0_[3];
    int32_t url_scheme;
    int32_t stream_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_Initialize_Params_Data>;

    MediaMetricsProvider_Initialize_Params_Data();
    ~MediaMetricsProvider_Initialize_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_Initialize_Params_Data) == 24, "Bad sizeof(MediaMetricsProvider_Initialize_Params_Data)");
class MediaMetricsProvider_OnStarted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::PipelineStatus_Data> status;

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_OnStarted_Params_Data>;

    MediaMetricsProvider_OnStarted_Params_Data();
    ~MediaMetricsProvider_OnStarted_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_OnStarted_Params_Data) == 16, "Bad sizeof(MediaMetricsProvider_OnStarted_Params_Data)");
class MediaMetricsProvider_OnError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::PipelineStatus_Data> status;

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_OnError_Params_Data>;

    MediaMetricsProvider_OnError_Params_Data();
    ~MediaMetricsProvider_OnError_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_OnError_Params_Data) == 16, "Bad sizeof(MediaMetricsProvider_OnError_Params_Data)");
class MediaMetricsProvider_OnFallback_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::PipelineStatus_Data> status;

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_OnFallback_Params_Data>;

    MediaMetricsProvider_OnFallback_Params_Data();
    ~MediaMetricsProvider_OnFallback_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_OnFallback_Params_Data) == 16, "Bad sizeof(MediaMetricsProvider_OnFallback_Params_Data)");
class MediaMetricsProvider_SetHasPlayed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_SetHasPlayed_Params_Data>;

    MediaMetricsProvider_SetHasPlayed_Params_Data();
    ~MediaMetricsProvider_SetHasPlayed_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetHasPlayed_Params_Data) == 8, "Bad sizeof(MediaMetricsProvider_SetHasPlayed_Params_Data)");
class MediaMetricsProvider_SetHaveEnough_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_SetHaveEnough_Params_Data>;

    MediaMetricsProvider_SetHaveEnough_Params_Data();
    ~MediaMetricsProvider_SetHaveEnough_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetHaveEnough_Params_Data) == 8, "Bad sizeof(MediaMetricsProvider_SetHaveEnough_Params_Data)");
class MediaMetricsProvider_SetIsEME_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_SetIsEME_Params_Data>;

    MediaMetricsProvider_SetIsEME_Params_Data();
    ~MediaMetricsProvider_SetIsEME_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetIsEME_Params_Data) == 8, "Bad sizeof(MediaMetricsProvider_SetIsEME_Params_Data)");
class MediaMetricsProvider_SetTimeToMetadata_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> elapsed;

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_SetTimeToMetadata_Params_Data>;

    MediaMetricsProvider_SetTimeToMetadata_Params_Data();
    ~MediaMetricsProvider_SetTimeToMetadata_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetTimeToMetadata_Params_Data) == 16, "Bad sizeof(MediaMetricsProvider_SetTimeToMetadata_Params_Data)");
class MediaMetricsProvider_SetTimeToFirstFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> elapsed;

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_SetTimeToFirstFrame_Params_Data>;

    MediaMetricsProvider_SetTimeToFirstFrame_Params_Data();
    ~MediaMetricsProvider_SetTimeToFirstFrame_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetTimeToFirstFrame_Params_Data) == 16, "Bad sizeof(MediaMetricsProvider_SetTimeToFirstFrame_Params_Data)");
class MediaMetricsProvider_SetTimeToPlayReady_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> elapsed;

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_SetTimeToPlayReady_Params_Data>;

    MediaMetricsProvider_SetTimeToPlayReady_Params_Data();
    ~MediaMetricsProvider_SetTimeToPlayReady_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetTimeToPlayReady_Params_Data) == 16, "Bad sizeof(MediaMetricsProvider_SetTimeToPlayReady_Params_Data)");
class MediaMetricsProvider_SetRendererType_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t renderer_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_SetRendererType_Params_Data>;

    MediaMetricsProvider_SetRendererType_Params_Data();
    ~MediaMetricsProvider_SetRendererType_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetRendererType_Params_Data) == 16, "Bad sizeof(MediaMetricsProvider_SetRendererType_Params_Data)");
class MediaMetricsProvider_SetKeySystem_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> key_system;

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_SetKeySystem_Params_Data>;

    MediaMetricsProvider_SetKeySystem_Params_Data();
    ~MediaMetricsProvider_SetKeySystem_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetKeySystem_Params_Data) == 16, "Bad sizeof(MediaMetricsProvider_SetKeySystem_Params_Data)");
class MediaMetricsProvider_SetHasWaitingForKey_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_SetHasWaitingForKey_Params_Data>;

    MediaMetricsProvider_SetHasWaitingForKey_Params_Data();
    ~MediaMetricsProvider_SetHasWaitingForKey_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetHasWaitingForKey_Params_Data) == 8, "Bad sizeof(MediaMetricsProvider_SetHasWaitingForKey_Params_Data)");
class MediaMetricsProvider_SetIsHardwareSecure_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_SetIsHardwareSecure_Params_Data>;

    MediaMetricsProvider_SetIsHardwareSecure_Params_Data();
    ~MediaMetricsProvider_SetIsHardwareSecure_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetIsHardwareSecure_Params_Data) == 8, "Bad sizeof(MediaMetricsProvider_SetIsHardwareSecure_Params_Data)");
class MediaMetricsProvider_SetContainerName_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t container_name;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_SetContainerName_Params_Data>;

    MediaMetricsProvider_SetContainerName_Params_Data();
    ~MediaMetricsProvider_SetContainerName_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetContainerName_Params_Data) == 16, "Bad sizeof(MediaMetricsProvider_SetContainerName_Params_Data)");
class MediaMetricsProvider_AcquireWatchTimeRecorder_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::PlaybackProperties_Data> properties;
    mojo::internal::Handle_Data recorder;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_AcquireWatchTimeRecorder_Params_Data>;

    MediaMetricsProvider_AcquireWatchTimeRecorder_Params_Data();
    ~MediaMetricsProvider_AcquireWatchTimeRecorder_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_AcquireWatchTimeRecorder_Params_Data) == 24, "Bad sizeof(MediaMetricsProvider_AcquireWatchTimeRecorder_Params_Data)");
class MediaMetricsProvider_AcquireVideoDecodeStatsRecorder_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data recorder;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_AcquireVideoDecodeStatsRecorder_Params_Data>;

    MediaMetricsProvider_AcquireVideoDecodeStatsRecorder_Params_Data();
    ~MediaMetricsProvider_AcquireVideoDecodeStatsRecorder_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_AcquireVideoDecodeStatsRecorder_Params_Data) == 16,
    "Bad sizeof(MediaMetricsProvider_AcquireVideoDecodeStatsRecorder_Params_Data)");
class MediaMetricsProvider_AcquireLearningTaskController_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> taskName;
    mojo::internal::Handle_Data controller;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_AcquireLearningTaskController_Params_Data>;

    MediaMetricsProvider_AcquireLearningTaskController_Params_Data();
    ~MediaMetricsProvider_AcquireLearningTaskController_Params_Data() = delete;
};
static_assert(
    sizeof(MediaMetricsProvider_AcquireLearningTaskController_Params_Data) == 24, "Bad sizeof(MediaMetricsProvider_AcquireLearningTaskController_Params_Data)");
class MediaMetricsProvider_AcquirePlaybackEventsRecorder_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_AcquirePlaybackEventsRecorder_Params_Data>;

    MediaMetricsProvider_AcquirePlaybackEventsRecorder_Params_Data();
    ~MediaMetricsProvider_AcquirePlaybackEventsRecorder_Params_Data() = delete;
};
static_assert(
    sizeof(MediaMetricsProvider_AcquirePlaybackEventsRecorder_Params_Data) == 16, "Bad sizeof(MediaMetricsProvider_AcquirePlaybackEventsRecorder_Params_Data)");
class MediaMetricsProvider_SetHasAudio_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t codec;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_SetHasAudio_Params_Data>;

    MediaMetricsProvider_SetHasAudio_Params_Data();
    ~MediaMetricsProvider_SetHasAudio_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetHasAudio_Params_Data) == 16, "Bad sizeof(MediaMetricsProvider_SetHasAudio_Params_Data)");
class MediaMetricsProvider_SetHasVideo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t codec;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_SetHasVideo_Params_Data>;

    MediaMetricsProvider_SetHasVideo_Params_Data();
    ~MediaMetricsProvider_SetHasVideo_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetHasVideo_Params_Data) == 16, "Bad sizeof(MediaMetricsProvider_SetHasVideo_Params_Data)");
class MediaMetricsProvider_SetVideoPipelineInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::VideoPipelineInfo_Data> info;

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_SetVideoPipelineInfo_Params_Data>;

    MediaMetricsProvider_SetVideoPipelineInfo_Params_Data();
    ~MediaMetricsProvider_SetVideoPipelineInfo_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetVideoPipelineInfo_Params_Data) == 16, "Bad sizeof(MediaMetricsProvider_SetVideoPipelineInfo_Params_Data)");
class MediaMetricsProvider_SetAudioPipelineInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::AudioPipelineInfo_Data> info;

private:
    friend class mojo::internal::MessageFragment<MediaMetricsProvider_SetAudioPipelineInfo_Params_Data>;

    MediaMetricsProvider_SetAudioPipelineInfo_Params_Data();
    ~MediaMetricsProvider_SetAudioPipelineInfo_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetAudioPipelineInfo_Params_Data) == 16, "Bad sizeof(MediaMetricsProvider_SetAudioPipelineInfo_Params_Data)");

} // namespace internal

class MediaMetricsProvider_Initialize_ParamsDataView {
public:
    MediaMetricsProvider_Initialize_ParamsDataView() = default;

    MediaMetricsProvider_Initialize_ParamsDataView(internal::MediaMetricsProvider_Initialize_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    bool is_mse() const
    {
        return data_->is_mse;
    }
    template <typename UserType> [[nodiscard]] bool ReadUrlScheme(UserType* output) const
    {
        auto data_value = data_->url_scheme;
        return mojo::internal::Deserialize<::media::mojom::MediaURLScheme>(data_value, output);
    }
    MediaURLScheme url_scheme() const
    {
