// media/mojo/mojom/media_player.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MEDIA_MOJO_MOJOM_MEDIA_PLAYER_MOJOM_PARAMS_DATA_H_
#define MEDIA_MOJO_MOJOM_MEDIA_PLAYER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media::mojom {
namespace internal {
class MediaPlayer_RequestPlay_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaPlayer_RequestPlay_Params_Data>;

    MediaPlayer_RequestPlay_Params_Data();
    ~MediaPlayer_RequestPlay_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayer_RequestPlay_Params_Data) == 8, "Bad sizeof(MediaPlayer_RequestPlay_Params_Data)");
class MediaPlayer_RequestPause_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t triggered_by_user : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaPlayer_RequestPause_Params_Data>;

    MediaPlayer_RequestPause_Params_Data();
    ~MediaPlayer_RequestPause_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayer_RequestPause_Params_Data) == 16, "Bad sizeof(MediaPlayer_RequestPause_Params_Data)");
class MediaPlayer_RequestSeekForward_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> seek_time;

private:
    friend class mojo::internal::MessageFragment<MediaPlayer_RequestSeekForward_Params_Data>;

    MediaPlayer_RequestSeekForward_Params_Data();
    ~MediaPlayer_RequestSeekForward_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayer_RequestSeekForward_Params_Data) == 16, "Bad sizeof(MediaPlayer_RequestSeekForward_Params_Data)");
class MediaPlayer_RequestSeekBackward_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> seek_time;

private:
    friend class mojo::internal::MessageFragment<MediaPlayer_RequestSeekBackward_Params_Data>;

    MediaPlayer_RequestSeekBackward_Params_Data();
    ~MediaPlayer_RequestSeekBackward_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayer_RequestSeekBackward_Params_Data) == 16, "Bad sizeof(MediaPlayer_RequestSeekBackward_Params_Data)");
class MediaPlayer_RequestSeekTo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> seek_time;

private:
    friend class mojo::internal::MessageFragment<MediaPlayer_RequestSeekTo_Params_Data>;

    MediaPlayer_RequestSeekTo_Params_Data();
    ~MediaPlayer_RequestSeekTo_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayer_RequestSeekTo_Params_Data) == 16, "Bad sizeof(MediaPlayer_RequestSeekTo_Params_Data)");
class MediaPlayer_RequestEnterPictureInPicture_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaPlayer_RequestEnterPictureInPicture_Params_Data>;

    MediaPlayer_RequestEnterPictureInPicture_Params_Data();
    ~MediaPlayer_RequestEnterPictureInPicture_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayer_RequestEnterPictureInPicture_Params_Data) == 8, "Bad sizeof(MediaPlayer_RequestEnterPictureInPicture_Params_Data)");
class MediaPlayer_RequestMute_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t mute : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaPlayer_RequestMute_Params_Data>;

    MediaPlayer_RequestMute_Params_Data();
    ~MediaPlayer_RequestMute_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayer_RequestMute_Params_Data) == 16, "Bad sizeof(MediaPlayer_RequestMute_Params_Data)");
class MediaPlayer_SetVolumeMultiplier_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    double multiplier;

private:
    friend class mojo::internal::MessageFragment<MediaPlayer_SetVolumeMultiplier_Params_Data>;

    MediaPlayer_SetVolumeMultiplier_Params_Data();
    ~MediaPlayer_SetVolumeMultiplier_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayer_SetVolumeMultiplier_Params_Data) == 16, "Bad sizeof(MediaPlayer_SetVolumeMultiplier_Params_Data)");
class MediaPlayer_SetPersistentState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t persistent : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaPlayer_SetPersistentState_Params_Data>;

    MediaPlayer_SetPersistentState_Params_Data();
    ~MediaPlayer_SetPersistentState_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayer_SetPersistentState_Params_Data) == 16, "Bad sizeof(MediaPlayer_SetPersistentState_Params_Data)");
class MediaPlayer_SetPowerExperimentState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t enabled : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaPlayer_SetPowerExperimentState_Params_Data>;

    MediaPlayer_SetPowerExperimentState_Params_Data();
    ~MediaPlayer_SetPowerExperimentState_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayer_SetPowerExperimentState_Params_Data) == 16, "Bad sizeof(MediaPlayer_SetPowerExperimentState_Params_Data)");
class MediaPlayer_SetAudioSinkId_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> sink_id;

private:
    friend class mojo::internal::MessageFragment<MediaPlayer_SetAudioSinkId_Params_Data>;

    MediaPlayer_SetAudioSinkId_Params_Data();
    ~MediaPlayer_SetAudioSinkId_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayer_SetAudioSinkId_Params_Data) == 16, "Bad sizeof(MediaPlayer_SetAudioSinkId_Params_Data)");
class MediaPlayer_SuspendForFrameClosed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaPlayer_SuspendForFrameClosed_Params_Data>;

    MediaPlayer_SuspendForFrameClosed_Params_Data();
    ~MediaPlayer_SuspendForFrameClosed_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayer_SuspendForFrameClosed_Params_Data) == 8, "Bad sizeof(MediaPlayer_SuspendForFrameClosed_Params_Data)");
class MediaPlayer_RequestMediaRemoting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaPlayer_RequestMediaRemoting_Params_Data>;

    MediaPlayer_RequestMediaRemoting_Params_Data();
    ~MediaPlayer_RequestMediaRemoting_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayer_RequestMediaRemoting_Params_Data) == 8, "Bad sizeof(MediaPlayer_RequestMediaRemoting_Params_Data)");
class MediaPlayer_RequestVisibility_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaPlayer_RequestVisibility_Params_Data>;

    MediaPlayer_RequestVisibility_Params_Data();
    ~MediaPlayer_RequestVisibility_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayer_RequestVisibility_Params_Data) == 8, "Bad sizeof(MediaPlayer_RequestVisibility_Params_Data)");
class MediaPlayer_RequestVisibility_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t has_sufficiently_visible_video : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaPlayer_RequestVisibility_ResponseParams_Data>;

    MediaPlayer_RequestVisibility_ResponseParams_Data();
    ~MediaPlayer_RequestVisibility_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaPlayer_RequestVisibility_ResponseParams_Data) == 16, "Bad sizeof(MediaPlayer_RequestVisibility_ResponseParams_Data)");
class MediaPlayerObserverClient_GetHasPlayedBefore_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaPlayerObserverClient_GetHasPlayedBefore_Params_Data>;

    MediaPlayerObserverClient_GetHasPlayedBefore_Params_Data();
    ~MediaPlayerObserverClient_GetHasPlayedBefore_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayerObserverClient_GetHasPlayedBefore_Params_Data) == 8, "Bad sizeof(MediaPlayerObserverClient_GetHasPlayedBefore_Params_Data)");
class MediaPlayerObserverClient_GetHasPlayedBefore_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t has_played_before : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaPlayerObserverClient_GetHasPlayedBefore_ResponseParams_Data>;

    MediaPlayerObserverClient_GetHasPlayedBefore_ResponseParams_Data();
    ~MediaPlayerObserverClient_GetHasPlayedBefore_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaPlayerObserverClient_GetHasPlayedBefore_ResponseParams_Data) == 16,
    "Bad sizeof(MediaPlayerObserverClient_GetHasPlayedBefore_ResponseParams_Data)");
class MediaPlayerObserver_OnMediaPlaying_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaPlayerObserver_OnMediaPlaying_Params_Data>;

    MediaPlayerObserver_OnMediaPlaying_Params_Data();
    ~MediaPlayerObserver_OnMediaPlaying_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayerObserver_OnMediaPlaying_Params_Data) == 8, "Bad sizeof(MediaPlayerObserver_OnMediaPlaying_Params_Data)");
class MediaPlayerObserver_OnMediaPaused_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t stream_ended : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaPlayerObserver_OnMediaPaused_Params_Data>;

    MediaPlayerObserver_OnMediaPaused_Params_Data();
    ~MediaPlayerObserver_OnMediaPaused_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayerObserver_OnMediaPaused_Params_Data) == 16, "Bad sizeof(MediaPlayerObserver_OnMediaPaused_Params_Data)");
class MediaPlayerObserver_OnMutedStatusChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t muted : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaPlayerObserver_OnMutedStatusChanged_Params_Data>;

    MediaPlayerObserver_OnMutedStatusChanged_Params_Data();
    ~MediaPlayerObserver_OnMutedStatusChanged_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayerObserver_OnMutedStatusChanged_Params_Data) == 16, "Bad sizeof(MediaPlayerObserver_OnMutedStatusChanged_Params_Data)");
class MediaPlayerObserver_OnMediaMetadataChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t has_audio : 1;
    uint8_t has_video : 1;
    uint8_t pad1_[3];
    int32_t content_type;

private:
    friend class mojo::internal::MessageFragment<MediaPlayerObserver_OnMediaMetadataChanged_Params_Data>;

    MediaPlayerObserver_OnMediaMetadataChanged_Params_Data();
    ~MediaPlayerObserver_OnMediaMetadataChanged_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayerObserver_OnMediaMetadataChanged_Params_Data) == 16, "Bad sizeof(MediaPlayerObserver_OnMediaMetadataChanged_Params_Data)");
class MediaPlayerObserver_OnMediaPositionStateChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media_session::mojom::internal::MediaPosition_Data> media_position;

private:
    friend class mojo::internal::MessageFragment<MediaPlayerObserver_OnMediaPositionStateChanged_Params_Data>;

    MediaPlayerObserver_OnMediaPositionStateChanged_Params_Data();
    ~MediaPlayerObserver_OnMediaPositionStateChanged_Params_Data() = delete;
};
static_assert(
    sizeof(MediaPlayerObserver_OnMediaPositionStateChanged_Params_Data) == 16, "Bad sizeof(MediaPlayerObserver_OnMediaPositionStateChanged_Params_Data)");
class MediaPlayerObserver_OnMediaEffectivelyFullscreenChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaPlayerObserver_OnMediaEffectivelyFullscreenChanged_Params_Data>;

    MediaPlayerObserver_OnMediaEffectivelyFullscreenChanged_Params_Data();
    ~MediaPlayerObserver_OnMediaEffectivelyFullscreenChanged_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayerObserver_OnMediaEffectivelyFullscreenChanged_Params_Data) == 16,
    "Bad sizeof(MediaPlayerObserver_OnMediaEffectivelyFullscreenChanged_Params_Data)");
class MediaPlayerObserver_OnMediaSizeChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> size;

private:
    friend class mojo::internal::MessageFragment<MediaPlayerObserver_OnMediaSizeChanged_Params_Data>;

    MediaPlayerObserver_OnMediaSizeChanged_Params_Data();
    ~MediaPlayerObserver_OnMediaSizeChanged_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayerObserver_OnMediaSizeChanged_Params_Data) == 16, "Bad sizeof(MediaPlayerObserver_OnMediaSizeChanged_Params_Data)");
class MediaPlayerObserver_OnPictureInPictureAvailabilityChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t available : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaPlayerObserver_OnPictureInPictureAvailabilityChanged_Params_Data>;

    MediaPlayerObserver_OnPictureInPictureAvailabilityChanged_Params_Data();
    ~MediaPlayerObserver_OnPictureInPictureAvailabilityChanged_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayerObserver_OnPictureInPictureAvailabilityChanged_Params_Data) == 16,
    "Bad sizeof(MediaPlayerObserver_OnPictureInPictureAvailabilityChanged_Params_Data)");
class MediaPlayerObserver_OnAudioOutputSinkChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> hashed_device_id;

private:
    friend class mojo::internal::MessageFragment<MediaPlayerObserver_OnAudioOutputSinkChanged_Params_Data>;

    MediaPlayerObserver_OnAudioOutputSinkChanged_Params_Data();
    ~MediaPlayerObserver_OnAudioOutputSinkChanged_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayerObserver_OnAudioOutputSinkChanged_Params_Data) == 16, "Bad sizeof(MediaPlayerObserver_OnAudioOutputSinkChanged_Params_Data)");
class MediaPlayerObserver_OnUseAudioServiceChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t uses_audio_service : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaPlayerObserver_OnUseAudioServiceChanged_Params_Data>;

    MediaPlayerObserver_OnUseAudioServiceChanged_Params_Data();
    ~MediaPlayerObserver_OnUseAudioServiceChanged_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayerObserver_OnUseAudioServiceChanged_Params_Data) == 16, "Bad sizeof(MediaPlayerObserver_OnUseAudioServiceChanged_Params_Data)");
class MediaPlayerObserver_OnAudioOutputSinkChangingDisabled_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaPlayerObserver_OnAudioOutputSinkChangingDisabled_Params_Data>;

    MediaPlayerObserver_OnAudioOutputSinkChangingDisabled_Params_Data();
    ~MediaPlayerObserver_OnAudioOutputSinkChangingDisabled_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayerObserver_OnAudioOutputSinkChangingDisabled_Params_Data) == 8,
    "Bad sizeof(MediaPlayerObserver_OnAudioOutputSinkChangingDisabled_Params_Data)");
class MediaPlayerObserver_OnRemotePlaybackMetadataChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media_session::mojom::internal::RemotePlaybackMetadata_Data> remote_playback_metadata;

private:
    friend class mojo::internal::MessageFragment<MediaPlayerObserver_OnRemotePlaybackMetadataChange_Params_Data>;

    MediaPlayerObserver_OnRemotePlaybackMetadataChange_Params_Data();
    ~MediaPlayerObserver_OnRemotePlaybackMetadataChange_Params_Data() = delete;
};
static_assert(
    sizeof(MediaPlayerObserver_OnRemotePlaybackMetadataChange_Params_Data) == 16, "Bad sizeof(MediaPlayerObserver_OnRemotePlaybackMetadataChange_Params_Data)");
class MediaPlayerObserver_OnVideoVisibilityChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t meets_visibility_threshold : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaPlayerObserver_OnVideoVisibilityChanged_Params_Data>;

    MediaPlayerObserver_OnVideoVisibilityChanged_Params_Data();
    ~MediaPlayerObserver_OnVideoVisibilityChanged_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayerObserver_OnVideoVisibilityChanged_Params_Data) == 16, "Bad sizeof(MediaPlayerObserver_OnVideoVisibilityChanged_Params_Data)");
class MediaPlayerHost_OnMediaPlayerAdded_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data player_remote;
    mojo::internal::AssociatedEndpointHandle_Data observer;
    int32_t player_id;

private:
    friend class mojo::internal::MessageFragment<MediaPlayerHost_OnMediaPlayerAdded_Params_Data>;

    MediaPlayerHost_OnMediaPlayerAdded_Params_Data();
    ~MediaPlayerHost_OnMediaPlayerAdded_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayerHost_OnMediaPlayerAdded_Params_Data) == 24, "Bad sizeof(MediaPlayerHost_OnMediaPlayerAdded_Params_Data)");

} // namespace internal

class MediaPlayer_RequestPlay_ParamsDataView {
public:
    MediaPlayer_RequestPlay_ParamsDataView() = default;

    MediaPlayer_RequestPlay_ParamsDataView(internal::MediaPlayer_RequestPlay_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::MediaPlayer_RequestPlay_Params_Data* data_ = nullptr;
};

class MediaPlayer_RequestPause_ParamsDataView {
public:
    MediaPlayer_RequestPause_ParamsDataView() = default;

    MediaPlayer_RequestPause_ParamsDataView(internal::MediaPlayer_RequestPause_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    bool triggered_by_user() const
    {
        return data_->triggered_by_user;
    }

private:
