// media/mojo/mojom/remoting.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MEDIA_MOJO_MOJOM_REMOTING_MOJOM_PARAMS_DATA_H_
#define MEDIA_MOJO_MOJOM_REMOTING_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media::mojom {
namespace internal {
class RemoterFactory_Create_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data source;
    mojo::internal::Handle_Data remoter;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<RemoterFactory_Create_Params_Data>;

    RemoterFactory_Create_Params_Data();
    ~RemoterFactory_Create_Params_Data() = delete;
};
static_assert(sizeof(RemoterFactory_Create_Params_Data) == 24, "Bad sizeof(RemoterFactory_Create_Params_Data)");
class RemotingDataStreamSender_SendFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::media::mojom::internal::DecoderBuffer_Data frame;

private:
    friend class mojo::internal::MessageFragment<RemotingDataStreamSender_SendFrame_Params_Data>;

    RemotingDataStreamSender_SendFrame_Params_Data();
    ~RemotingDataStreamSender_SendFrame_Params_Data() = delete;
};
static_assert(sizeof(RemotingDataStreamSender_SendFrame_Params_Data) == 24, "Bad sizeof(RemotingDataStreamSender_SendFrame_Params_Data)");
class RemotingDataStreamSender_SendFrame_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RemotingDataStreamSender_SendFrame_ResponseParams_Data>;

    RemotingDataStreamSender_SendFrame_ResponseParams_Data();
    ~RemotingDataStreamSender_SendFrame_ResponseParams_Data() = delete;
};
static_assert(sizeof(RemotingDataStreamSender_SendFrame_ResponseParams_Data) == 8, "Bad sizeof(RemotingDataStreamSender_SendFrame_ResponseParams_Data)");
class RemotingDataStreamSender_CancelInFlightData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RemotingDataStreamSender_CancelInFlightData_Params_Data>;

    RemotingDataStreamSender_CancelInFlightData_Params_Data();
    ~RemotingDataStreamSender_CancelInFlightData_Params_Data() = delete;
};
static_assert(sizeof(RemotingDataStreamSender_CancelInFlightData_Params_Data) == 8, "Bad sizeof(RemotingDataStreamSender_CancelInFlightData_Params_Data)");
class Remoter_Start_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<Remoter_Start_Params_Data>;

    Remoter_Start_Params_Data();
    ~Remoter_Start_Params_Data() = delete;
};
static_assert(sizeof(Remoter_Start_Params_Data) == 8, "Bad sizeof(Remoter_Start_Params_Data)");
class Remoter_StartWithPermissionAlreadyGranted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<Remoter_StartWithPermissionAlreadyGranted_Params_Data>;

    Remoter_StartWithPermissionAlreadyGranted_Params_Data();
    ~Remoter_StartWithPermissionAlreadyGranted_Params_Data() = delete;
};
static_assert(sizeof(Remoter_StartWithPermissionAlreadyGranted_Params_Data) == 8, "Bad sizeof(Remoter_StartWithPermissionAlreadyGranted_Params_Data)");
class Remoter_StartDataStreams_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data audio_pipe;
    mojo::internal::Handle_Data video_pipe;
    mojo::internal::Handle_Data audio_sender;
    mojo::internal::Handle_Data video_sender;

private:
    friend class mojo::internal::MessageFragment<Remoter_StartDataStreams_Params_Data>;

    Remoter_StartDataStreams_Params_Data();
    ~Remoter_StartDataStreams_Params_Data() = delete;
};
static_assert(sizeof(Remoter_StartDataStreams_Params_Data) == 24, "Bad sizeof(Remoter_StartDataStreams_Params_Data)");
class Remoter_Stop_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t reason;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Remoter_Stop_Params_Data>;

    Remoter_Stop_Params_Data();
    ~Remoter_Stop_Params_Data() = delete;
};
static_assert(sizeof(Remoter_Stop_Params_Data) == 16, "Bad sizeof(Remoter_Stop_Params_Data)");
class Remoter_SendMessageToSink_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> message;

private:
    friend class mojo::internal::MessageFragment<Remoter_SendMessageToSink_Params_Data>;

    Remoter_SendMessageToSink_Params_Data();
    ~Remoter_SendMessageToSink_Params_Data() = delete;
};
static_assert(sizeof(Remoter_SendMessageToSink_Params_Data) == 16, "Bad sizeof(Remoter_SendMessageToSink_Params_Data)");
class Remoter_EstimateTransmissionCapacity_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<Remoter_EstimateTransmissionCapacity_Params_Data>;

    Remoter_EstimateTransmissionCapacity_Params_Data();
    ~Remoter_EstimateTransmissionCapacity_Params_Data() = delete;
};
static_assert(sizeof(Remoter_EstimateTransmissionCapacity_Params_Data) == 8, "Bad sizeof(Remoter_EstimateTransmissionCapacity_Params_Data)");
class Remoter_EstimateTransmissionCapacity_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    double rate;

private:
    friend class mojo::internal::MessageFragment<Remoter_EstimateTransmissionCapacity_ResponseParams_Data>;

    Remoter_EstimateTransmissionCapacity_ResponseParams_Data();
    ~Remoter_EstimateTransmissionCapacity_ResponseParams_Data() = delete;
};
static_assert(sizeof(Remoter_EstimateTransmissionCapacity_ResponseParams_Data) == 16, "Bad sizeof(Remoter_EstimateTransmissionCapacity_ResponseParams_Data)");
class RemotingSource_OnSinkAvailable_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::RemotingSinkMetadata_Data> metadata;

private:
    friend class mojo::internal::MessageFragment<RemotingSource_OnSinkAvailable_Params_Data>;

    RemotingSource_OnSinkAvailable_Params_Data();
    ~RemotingSource_OnSinkAvailable_Params_Data() = delete;
};
static_assert(sizeof(RemotingSource_OnSinkAvailable_Params_Data) == 16, "Bad sizeof(RemotingSource_OnSinkAvailable_Params_Data)");
class RemotingSource_OnSinkGone_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RemotingSource_OnSinkGone_Params_Data>;

    RemotingSource_OnSinkGone_Params_Data();
    ~RemotingSource_OnSinkGone_Params_Data() = delete;
};
static_assert(sizeof(RemotingSource_OnSinkGone_Params_Data) == 8, "Bad sizeof(RemotingSource_OnSinkGone_Params_Data)");
class RemotingSource_OnStarted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RemotingSource_OnStarted_Params_Data>;

    RemotingSource_OnStarted_Params_Data();
    ~RemotingSource_OnStarted_Params_Data() = delete;
};
static_assert(sizeof(RemotingSource_OnStarted_Params_Data) == 8, "Bad sizeof(RemotingSource_OnStarted_Params_Data)");
class RemotingSource_OnStartFailed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t reason;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<RemotingSource_OnStartFailed_Params_Data>;

    RemotingSource_OnStartFailed_Params_Data();
    ~RemotingSource_OnStartFailed_Params_Data() = delete;
};
static_assert(sizeof(RemotingSource_OnStartFailed_Params_Data) == 16, "Bad sizeof(RemotingSource_OnStartFailed_Params_Data)");
class RemotingSource_OnMessageFromSink_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> message;

private:
    friend class mojo::internal::MessageFragment<RemotingSource_OnMessageFromSink_Params_Data>;

    RemotingSource_OnMessageFromSink_Params_Data();
    ~RemotingSource_OnMessageFromSink_Params_Data() = delete;
};
static_assert(sizeof(RemotingSource_OnMessageFromSink_Params_Data) == 16, "Bad sizeof(RemotingSource_OnMessageFromSink_Params_Data)");
class RemotingSource_OnStopped_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t reason;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<RemotingSource_OnStopped_Params_Data>;

    RemotingSource_OnStopped_Params_Data();
    ~RemotingSource_OnStopped_Params_Data() = delete;
};
static_assert(sizeof(RemotingSource_OnStopped_Params_Data) == 16, "Bad sizeof(RemotingSource_OnStopped_Params_Data)");
class Remotee_OnRemotingSinkReady_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data sink;

private:
    friend class mojo::internal::MessageFragment<Remotee_OnRemotingSinkReady_Params_Data>;

    Remotee_OnRemotingSinkReady_Params_Data();
    ~Remotee_OnRemotingSinkReady_Params_Data() = delete;
};
static_assert(sizeof(Remotee_OnRemotingSinkReady_Params_Data) == 16, "Bad sizeof(Remotee_OnRemotingSinkReady_Params_Data)");
class Remotee_SendMessageToSource_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> message;

private:
    friend class mojo::internal::MessageFragment<Remotee_SendMessageToSource_Params_Data>;

    Remotee_SendMessageToSource_Params_Data();
    ~Remotee_SendMessageToSource_Params_Data() = delete;
};
static_assert(sizeof(Remotee_SendMessageToSource_Params_Data) == 16, "Bad sizeof(Remotee_SendMessageToSource_Params_Data)");
class Remotee_StartDataStreams_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data audio_stream;
    mojo::internal::Interface_Data video_stream;

private:
    friend class mojo::internal::MessageFragment<Remotee_StartDataStreams_Params_Data>;

    Remotee_StartDataStreams_Params_Data();
    ~Remotee_StartDataStreams_Params_Data() = delete;
};
static_assert(sizeof(Remotee_StartDataStreams_Params_Data) == 24, "Bad sizeof(Remotee_StartDataStreams_Params_Data)");
class Remotee_OnFlushUntil_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t audio_frame_count;
    uint32_t video_frame_count;

private:
    friend class mojo::internal::MessageFragment<Remotee_OnFlushUntil_Params_Data>;

    Remotee_OnFlushUntil_Params_Data();
    ~Remotee_OnFlushUntil_Params_Data() = delete;
};
static_assert(sizeof(Remotee_OnFlushUntil_Params_Data) == 16, "Bad sizeof(Remotee_OnFlushUntil_Params_Data)");
class Remotee_OnVideoNaturalSizeChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> size;

private:
    friend class mojo::internal::MessageFragment<Remotee_OnVideoNaturalSizeChange_Params_Data>;

    Remotee_OnVideoNaturalSizeChange_Params_Data();
    ~Remotee_OnVideoNaturalSizeChange_Params_Data() = delete;
};
static_assert(sizeof(Remotee_OnVideoNaturalSizeChange_Params_Data) == 16, "Bad sizeof(Remotee_OnVideoNaturalSizeChange_Params_Data)");
class RemotingSink_OnMessageFromSource_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> message;

private:
    friend class mojo::internal::MessageFragment<RemotingSink_OnMessageFromSource_Params_Data>;

    RemotingSink_OnMessageFromSource_Params_Data();
    ~RemotingSink_OnMessageFromSource_Params_Data() = delete;
};
static_assert(sizeof(RemotingSink_OnMessageFromSource_Params_Data) == 16, "Bad sizeof(RemotingSink_OnMessageFromSource_Params_Data)");
class RemotingDataStreamReceiver_InitializeDataPipe_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data data_pipe;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<RemotingDataStreamReceiver_InitializeDataPipe_Params_Data>;

    RemotingDataStreamReceiver_InitializeDataPipe_Params_Data();
    ~RemotingDataStreamReceiver_InitializeDataPipe_Params_Data() = delete;
};
static_assert(sizeof(RemotingDataStreamReceiver_InitializeDataPipe_Params_Data) == 16, "Bad sizeof(RemotingDataStreamReceiver_InitializeDataPipe_Params_Data)");
class RemotingDataStreamReceiver_ReceiveFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t frame_count;
    uint8_t pad0_[4];
    ::media::mojom::internal::DecoderBuffer_Data buffer;

private:
    friend class mojo::internal::MessageFragment<RemotingDataStreamReceiver_ReceiveFrame_Params_Data>;

    RemotingDataStreamReceiver_ReceiveFrame_Params_Data();
    ~RemotingDataStreamReceiver_ReceiveFrame_Params_Data() = delete;
};
static_assert(sizeof(RemotingDataStreamReceiver_ReceiveFrame_Params_Data) == 32, "Bad sizeof(RemotingDataStreamReceiver_ReceiveFrame_Params_Data)");
class RemotingDataStreamReceiver_FlushUntil_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t frame_count;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<RemotingDataStreamReceiver_FlushUntil_Params_Data>;

    RemotingDataStreamReceiver_FlushUntil_Params_Data();
    ~RemotingDataStreamReceiver_FlushUntil_Params_Data() = delete;
};
static_assert(sizeof(RemotingDataStreamReceiver_FlushUntil_Params_Data) == 16, "Bad sizeof(RemotingDataStreamReceiver_FlushUntil_Params_Data)");

} // namespace internal

class RemoterFactory_Create_ParamsDataView {
public:
    RemoterFactory_Create_ParamsDataView() = default;

    RemoterFactory_Create_ParamsDataView(internal::RemoterFactory_Create_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeSource()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::media::mojom::RemotingSourceInterfaceBase>>(&data_->source, &result, message_);
        DCHECK(ret);
        return result;
    }
    template <typename UserType> UserType TakeRemoter()
    {
        UserType result;
