// media/mojo/mojom/renderer.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MEDIA_MOJO_MOJOM_RENDERER_MOJOM_PARAMS_DATA_H_
#define MEDIA_MOJO_MOJOM_RENDERER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media::mojom {
namespace internal {
class Renderer_Initialize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data client;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Interface_Data>> streams;
    mojo::internal::Pointer<internal::MediaUrlParams_Data> media_url_params;

private:
    friend class mojo::internal::MessageFragment<Renderer_Initialize_Params_Data>;

    Renderer_Initialize_Params_Data();
    ~Renderer_Initialize_Params_Data() = delete;
};
static_assert(sizeof(Renderer_Initialize_Params_Data) == 32, "Bad sizeof(Renderer_Initialize_Params_Data)");
class Renderer_Initialize_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<Renderer_Initialize_ResponseParams_Data>;

    Renderer_Initialize_ResponseParams_Data();
    ~Renderer_Initialize_ResponseParams_Data() = delete;
};
static_assert(sizeof(Renderer_Initialize_ResponseParams_Data) == 16, "Bad sizeof(Renderer_Initialize_ResponseParams_Data)");
class Renderer_Flush_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<Renderer_Flush_Params_Data>;

    Renderer_Flush_Params_Data();
    ~Renderer_Flush_Params_Data() = delete;
};
static_assert(sizeof(Renderer_Flush_Params_Data) == 8, "Bad sizeof(Renderer_Flush_Params_Data)");
class Renderer_Flush_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<Renderer_Flush_ResponseParams_Data>;

    Renderer_Flush_ResponseParams_Data();
    ~Renderer_Flush_ResponseParams_Data() = delete;
};
static_assert(sizeof(Renderer_Flush_ResponseParams_Data) == 8, "Bad sizeof(Renderer_Flush_ResponseParams_Data)");
class Renderer_StartPlayingFrom_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> time;

private:
    friend class mojo::internal::MessageFragment<Renderer_StartPlayingFrom_Params_Data>;

    Renderer_StartPlayingFrom_Params_Data();
    ~Renderer_StartPlayingFrom_Params_Data() = delete;
};
static_assert(sizeof(Renderer_StartPlayingFrom_Params_Data) == 16, "Bad sizeof(Renderer_StartPlayingFrom_Params_Data)");
class Renderer_SetPlaybackRate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    double playback_rate;

private:
    friend class mojo::internal::MessageFragment<Renderer_SetPlaybackRate_Params_Data>;

    Renderer_SetPlaybackRate_Params_Data();
    ~Renderer_SetPlaybackRate_Params_Data() = delete;
};
static_assert(sizeof(Renderer_SetPlaybackRate_Params_Data) == 16, "Bad sizeof(Renderer_SetPlaybackRate_Params_Data)");
class Renderer_SetVolume_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    float volume;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Renderer_SetVolume_Params_Data>;

    Renderer_SetVolume_Params_Data();
    ~Renderer_SetVolume_Params_Data() = delete;
};
static_assert(sizeof(Renderer_SetVolume_Params_Data) == 16, "Bad sizeof(Renderer_SetVolume_Params_Data)");
class Renderer_SetCdm_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> cdm_id;

private:
    friend class mojo::internal::MessageFragment<Renderer_SetCdm_Params_Data>;

    Renderer_SetCdm_Params_Data();
    ~Renderer_SetCdm_Params_Data() = delete;
};
static_assert(sizeof(Renderer_SetCdm_Params_Data) == 16, "Bad sizeof(Renderer_SetCdm_Params_Data)");
class Renderer_SetCdm_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<Renderer_SetCdm_ResponseParams_Data>;

    Renderer_SetCdm_ResponseParams_Data();
    ~Renderer_SetCdm_ResponseParams_Data() = delete;
};
static_assert(sizeof(Renderer_SetCdm_ResponseParams_Data) == 16, "Bad sizeof(Renderer_SetCdm_ResponseParams_Data)");
class Renderer_SetLatencyHint_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> latency_hint;

private:
    friend class mojo::internal::MessageFragment<Renderer_SetLatencyHint_Params_Data>;

    Renderer_SetLatencyHint_Params_Data();
    ~Renderer_SetLatencyHint_Params_Data() = delete;
};
static_assert(sizeof(Renderer_SetLatencyHint_Params_Data) == 16, "Bad sizeof(Renderer_SetLatencyHint_Params_Data)");
class RendererClient_OnTimeUpdate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> time;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> max_time;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeTicks_Data> capture_time;

private:
    friend class mojo::internal::MessageFragment<RendererClient_OnTimeUpdate_Params_Data>;

    RendererClient_OnTimeUpdate_Params_Data();
    ~RendererClient_OnTimeUpdate_Params_Data() = delete;
};
static_assert(sizeof(RendererClient_OnTimeUpdate_Params_Data) == 32, "Bad sizeof(RendererClient_OnTimeUpdate_Params_Data)");
class RendererClient_OnBufferingStateChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t state;
    int32_t reason;

private:
    friend class mojo::internal::MessageFragment<RendererClient_OnBufferingStateChange_Params_Data>;

    RendererClient_OnBufferingStateChange_Params_Data();
    ~RendererClient_OnBufferingStateChange_Params_Data() = delete;
};
static_assert(sizeof(RendererClient_OnBufferingStateChange_Params_Data) == 16, "Bad sizeof(RendererClient_OnBufferingStateChange_Params_Data)");
class RendererClient_OnEnded_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RendererClient_OnEnded_Params_Data>;

    RendererClient_OnEnded_Params_Data();
    ~RendererClient_OnEnded_Params_Data() = delete;
};
static_assert(sizeof(RendererClient_OnEnded_Params_Data) == 8, "Bad sizeof(RendererClient_OnEnded_Params_Data)");
class RendererClient_OnError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::PipelineStatus_Data> status;

private:
    friend class mojo::internal::MessageFragment<RendererClient_OnError_Params_Data>;

    RendererClient_OnError_Params_Data();
    ~RendererClient_OnError_Params_Data() = delete;
};
static_assert(sizeof(RendererClient_OnError_Params_Data) == 16, "Bad sizeof(RendererClient_OnError_Params_Data)");
class RendererClient_OnAudioConfigChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::AudioDecoderConfig_Data> config;

private:
    friend class mojo::internal::MessageFragment<RendererClient_OnAudioConfigChange_Params_Data>;

    RendererClient_OnAudioConfigChange_Params_Data();
    ~RendererClient_OnAudioConfigChange_Params_Data() = delete;
};
static_assert(sizeof(RendererClient_OnAudioConfigChange_Params_Data) == 16, "Bad sizeof(RendererClient_OnAudioConfigChange_Params_Data)");
class RendererClient_OnVideoConfigChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::VideoDecoderConfig_Data> config;

private:
    friend class mojo::internal::MessageFragment<RendererClient_OnVideoConfigChange_Params_Data>;

    RendererClient_OnVideoConfigChange_Params_Data();
    ~RendererClient_OnVideoConfigChange_Params_Data() = delete;
};
static_assert(sizeof(RendererClient_OnVideoConfigChange_Params_Data) == 16, "Bad sizeof(RendererClient_OnVideoConfigChange_Params_Data)");
class RendererClient_OnVideoNaturalSizeChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> size;

private:
    friend class mojo::internal::MessageFragment<RendererClient_OnVideoNaturalSizeChange_Params_Data>;

    RendererClient_OnVideoNaturalSizeChange_Params_Data();
    ~RendererClient_OnVideoNaturalSizeChange_Params_Data() = delete;
};
static_assert(sizeof(RendererClient_OnVideoNaturalSizeChange_Params_Data) == 16, "Bad sizeof(RendererClient_OnVideoNaturalSizeChange_Params_Data)");
class RendererClient_OnVideoOpacityChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t opaque : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<RendererClient_OnVideoOpacityChange_Params_Data>;

    RendererClient_OnVideoOpacityChange_Params_Data();
    ~RendererClient_OnVideoOpacityChange_Params_Data() = delete;
};
static_assert(sizeof(RendererClient_OnVideoOpacityChange_Params_Data) == 16, "Bad sizeof(RendererClient_OnVideoOpacityChange_Params_Data)");
class RendererClient_OnStatisticsUpdate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::PipelineStatistics_Data> stats;

private:
    friend class mojo::internal::MessageFragment<RendererClient_OnStatisticsUpdate_Params_Data>;

    RendererClient_OnStatisticsUpdate_Params_Data();
    ~RendererClient_OnStatisticsUpdate_Params_Data() = delete;
};
static_assert(sizeof(RendererClient_OnStatisticsUpdate_Params_Data) == 16, "Bad sizeof(RendererClient_OnStatisticsUpdate_Params_Data)");
class RendererClient_OnWaiting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t reason;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<RendererClient_OnWaiting_Params_Data>;

    RendererClient_OnWaiting_Params_Data();
    ~RendererClient_OnWaiting_Params_Data() = delete;
};
static_assert(sizeof(RendererClient_OnWaiting_Params_Data) == 16, "Bad sizeof(RendererClient_OnWaiting_Params_Data)");

} // namespace internal

class Renderer_Initialize_ParamsDataView {
public:
    Renderer_Initialize_ParamsDataView() = default;

    Renderer_Initialize_ParamsDataView(internal::Renderer_Initialize_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeClient()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<::media::mojom::RendererClientAssociatedPtrInfoDataView>(&data_->client, &result, message_);
        DCHECK(ret);
        return result;
    }
    inline void GetStreamsDataView(mojo::ArrayDataView<mojo::InterfacePtrDataView<::media::mojom::DemuxerStreamInterfaceBase>>* output);

    template <typename UserType> [[nodiscard]] bool ReadStreams(UserType* output)
    {

