// media/mojo/mojom/renderer_extensions.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MEDIA_MOJO_MOJOM_RENDERER_EXTENSIONS_MOJOM_PARAMS_DATA_H_
#define MEDIA_MOJO_MOJOM_RENDERER_EXTENSIONS_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media::mojom {
namespace internal {
class MediaPlayerRendererClientExtension_OnVideoSizeChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> size;

private:
    friend class mojo::internal::MessageFragment<MediaPlayerRendererClientExtension_OnVideoSizeChange_Params_Data>;

    MediaPlayerRendererClientExtension_OnVideoSizeChange_Params_Data();
    ~MediaPlayerRendererClientExtension_OnVideoSizeChange_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayerRendererClientExtension_OnVideoSizeChange_Params_Data) == 16,
    "Bad sizeof(MediaPlayerRendererClientExtension_OnVideoSizeChange_Params_Data)");
class MediaPlayerRendererClientExtension_OnDurationChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> duration;

private:
    friend class mojo::internal::MessageFragment<MediaPlayerRendererClientExtension_OnDurationChange_Params_Data>;

    MediaPlayerRendererClientExtension_OnDurationChange_Params_Data();
    ~MediaPlayerRendererClientExtension_OnDurationChange_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayerRendererClientExtension_OnDurationChange_Params_Data) == 16,
    "Bad sizeof(MediaPlayerRendererClientExtension_OnDurationChange_Params_Data)");
class MediaPlayerRendererExtension_InitiateScopedSurfaceRequest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaPlayerRendererExtension_InitiateScopedSurfaceRequest_Params_Data>;

    MediaPlayerRendererExtension_InitiateScopedSurfaceRequest_Params_Data();
    ~MediaPlayerRendererExtension_InitiateScopedSurfaceRequest_Params_Data() = delete;
};
static_assert(sizeof(MediaPlayerRendererExtension_InitiateScopedSurfaceRequest_Params_Data) == 8,
    "Bad sizeof(MediaPlayerRendererExtension_InitiateScopedSurfaceRequest_Params_Data)");
class MediaPlayerRendererExtension_InitiateScopedSurfaceRequest_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> request_token;

private:
    friend class mojo::internal::MessageFragment<MediaPlayerRendererExtension_InitiateScopedSurfaceRequest_ResponseParams_Data>;

    MediaPlayerRendererExtension_InitiateScopedSurfaceRequest_ResponseParams_Data();
    ~MediaPlayerRendererExtension_InitiateScopedSurfaceRequest_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaPlayerRendererExtension_InitiateScopedSurfaceRequest_ResponseParams_Data) == 16,
    "Bad sizeof(MediaPlayerRendererExtension_InitiateScopedSurfaceRequest_ResponseParams_Data)");
class FlingingRendererClientExtension_OnRemotePlayStateChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t state;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FlingingRendererClientExtension_OnRemotePlayStateChange_Params_Data>;

    FlingingRendererClientExtension_OnRemotePlayStateChange_Params_Data();
    ~FlingingRendererClientExtension_OnRemotePlayStateChange_Params_Data() = delete;
};
static_assert(sizeof(FlingingRendererClientExtension_OnRemotePlayStateChange_Params_Data) == 16,
    "Bad sizeof(FlingingRendererClientExtension_OnRemotePlayStateChange_Params_Data)");
class MediaFoundationRendererClientExtension_InitializeFramePool_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::FramePoolInitializationParameters_Data> pool_info;

private:
    friend class mojo::internal::MessageFragment<MediaFoundationRendererClientExtension_InitializeFramePool_Params_Data>;

    MediaFoundationRendererClientExtension_InitializeFramePool_Params_Data();
    ~MediaFoundationRendererClientExtension_InitializeFramePool_Params_Data() = delete;
};
static_assert(sizeof(MediaFoundationRendererClientExtension_InitializeFramePool_Params_Data) == 16,
    "Bad sizeof(MediaFoundationRendererClientExtension_InitializeFramePool_Params_Data)");
class MediaFoundationRendererClientExtension_OnFrameAvailable_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> frame_token;
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> size;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> timestamp;

private:
    friend class mojo::internal::MessageFragment<MediaFoundationRendererClientExtension_OnFrameAvailable_Params_Data>;

    MediaFoundationRendererClientExtension_OnFrameAvailable_Params_Data();
    ~MediaFoundationRendererClientExtension_OnFrameAvailable_Params_Data() = delete;
};
static_assert(sizeof(MediaFoundationRendererClientExtension_OnFrameAvailable_Params_Data) == 32,
    "Bad sizeof(MediaFoundationRendererClientExtension_OnFrameAvailable_Params_Data)");
class MediaFoundationRendererExtension_GetDCOMPSurface_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaFoundationRendererExtension_GetDCOMPSurface_Params_Data>;

    MediaFoundationRendererExtension_GetDCOMPSurface_Params_Data();
    ~MediaFoundationRendererExtension_GetDCOMPSurface_Params_Data() = delete;
};
static_assert(
    sizeof(MediaFoundationRendererExtension_GetDCOMPSurface_Params_Data) == 8, "Bad sizeof(MediaFoundationRendererExtension_GetDCOMPSurface_Params_Data)");
class MediaFoundationRendererExtension_GetDCOMPSurface_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> token;
    mojo::internal::Pointer<mojo::internal::String_Data> error;

private:
    friend class mojo::internal::MessageFragment<MediaFoundationRendererExtension_GetDCOMPSurface_ResponseParams_Data>;

    MediaFoundationRendererExtension_GetDCOMPSurface_ResponseParams_Data();
    ~MediaFoundationRendererExtension_GetDCOMPSurface_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaFoundationRendererExtension_GetDCOMPSurface_ResponseParams_Data) == 24,
    "Bad sizeof(MediaFoundationRendererExtension_GetDCOMPSurface_ResponseParams_Data)");
class MediaFoundationRendererExtension_SetVideoStreamEnabled_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t enabled : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaFoundationRendererExtension_SetVideoStreamEnabled_Params_Data>;

    MediaFoundationRendererExtension_SetVideoStreamEnabled_Params_Data();
    ~MediaFoundationRendererExtension_SetVideoStreamEnabled_Params_Data() = delete;
};
static_assert(sizeof(MediaFoundationRendererExtension_SetVideoStreamEnabled_Params_Data) == 16,
    "Bad sizeof(MediaFoundationRendererExtension_SetVideoStreamEnabled_Params_Data)");
class MediaFoundationRendererExtension_SetOutputRect_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> rect;

private:
    friend class mojo::internal::MessageFragment<MediaFoundationRendererExtension_SetOutputRect_Params_Data>;

    MediaFoundationRendererExtension_SetOutputRect_Params_Data();
    ~MediaFoundationRendererExtension_SetOutputRect_Params_Data() = delete;
};
static_assert(
    sizeof(MediaFoundationRendererExtension_SetOutputRect_Params_Data) == 16, "Bad sizeof(MediaFoundationRendererExtension_SetOutputRect_Params_Data)");
class MediaFoundationRendererExtension_SetOutputRect_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaFoundationRendererExtension_SetOutputRect_ResponseParams_Data>;

    MediaFoundationRendererExtension_SetOutputRect_ResponseParams_Data();
    ~MediaFoundationRendererExtension_SetOutputRect_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaFoundationRendererExtension_SetOutputRect_ResponseParams_Data) == 16,
    "Bad sizeof(MediaFoundationRendererExtension_SetOutputRect_ResponseParams_Data)");
class MediaFoundationRendererExtension_NotifyFrameReleased_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> frame_token;

private:
    friend class mojo::internal::MessageFragment<MediaFoundationRendererExtension_NotifyFrameReleased_Params_Data>;

    MediaFoundationRendererExtension_NotifyFrameReleased_Params_Data();
    ~MediaFoundationRendererExtension_NotifyFrameReleased_Params_Data() = delete;
};
static_assert(sizeof(MediaFoundationRendererExtension_NotifyFrameReleased_Params_Data) == 16,
    "Bad sizeof(MediaFoundationRendererExtension_NotifyFrameReleased_Params_Data)");
class MediaFoundationRendererExtension_RequestNextFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaFoundationRendererExtension_RequestNextFrame_Params_Data>;

    MediaFoundationRendererExtension_RequestNextFrame_Params_Data();
    ~MediaFoundationRendererExtension_RequestNextFrame_Params_Data() = delete;
};
static_assert(
    sizeof(MediaFoundationRendererExtension_RequestNextFrame_Params_Data) == 8, "Bad sizeof(MediaFoundationRendererExtension_RequestNextFrame_Params_Data)");
class MediaFoundationRendererExtension_SetMediaFoundationRenderingMode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t mode;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaFoundationRendererExtension_SetMediaFoundationRenderingMode_Params_Data>;

    MediaFoundationRendererExtension_SetMediaFoundationRenderingMode_Params_Data();
    ~MediaFoundationRendererExtension_SetMediaFoundationRenderingMode_Params_Data() = delete;
};
static_assert(sizeof(MediaFoundationRendererExtension_SetMediaFoundationRenderingMode_Params_Data) == 16,
    "Bad sizeof(MediaFoundationRendererExtension_SetMediaFoundationRenderingMode_Params_Data)");
class MediaFoundationRendererNotifier_MediaFoundationRendererCreated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data observer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaFoundationRendererNotifier_MediaFoundationRendererCreated_Params_Data>;

    MediaFoundationRendererNotifier_MediaFoundationRendererCreated_Params_Data();
    ~MediaFoundationRendererNotifier_MediaFoundationRendererCreated_Params_Data() = delete;
};
static_assert(sizeof(MediaFoundationRendererNotifier_MediaFoundationRendererCreated_Params_Data) == 16,
    "Bad sizeof(MediaFoundationRendererNotifier_MediaFoundationRendererCreated_Params_Data)");

} // namespace internal

class MediaPlayerRendererClientExtension_OnVideoSizeChange_ParamsDataView {
public:
    MediaPlayerRendererClientExtension_OnVideoSizeChange_ParamsDataView() = default;

    MediaPlayerRendererClientExtension_OnVideoSizeChange_ParamsDataView(
        internal::MediaPlayerRendererClientExtension_OnVideoSizeChange_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetSizeDataView(::gfx::mojom::SizeDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadSize(UserType* output)
    {

        auto* pointer = data_->size.Get();
        return mojo::internal::Deserialize<::gfx::mojom::SizeDataView>(pointer, output, message_);
