// media/mojo/mojom/speech_recognition.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MEDIA_MOJO_MOJOM_SPEECH_RECOGNITION_MOJOM_PARAMS_DATA_H_
#define MEDIA_MOJO_MOJOM_SPEECH_RECOGNITION_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media::mojom {
namespace internal {
class SpeechRecognitionContext_BindRecognizer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    mojo::internal::Interface_Data client;
    uint8_t pad1_[4];
    mojo::internal::Pointer<internal::SpeechRecognitionOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionContext_BindRecognizer_Params_Data>;

    SpeechRecognitionContext_BindRecognizer_Params_Data();
    ~SpeechRecognitionContext_BindRecognizer_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionContext_BindRecognizer_Params_Data) == 32, "Bad sizeof(SpeechRecognitionContext_BindRecognizer_Params_Data)");
class SpeechRecognitionContext_BindRecognizer_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_multichannel_supported : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionContext_BindRecognizer_ResponseParams_Data>;

    SpeechRecognitionContext_BindRecognizer_ResponseParams_Data();
    ~SpeechRecognitionContext_BindRecognizer_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(SpeechRecognitionContext_BindRecognizer_ResponseParams_Data) == 16, "Bad sizeof(SpeechRecognitionContext_BindRecognizer_ResponseParams_Data)");
class SpeechRecognitionContext_BindWebSpeechRecognizer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data session_receiver;
    mojo::internal::Interface_Data session_client;
    mojo::internal::Handle_Data audio_forwarder;
    int32_t channel_count;
    int32_t sample_rate;
    mojo::internal::Pointer<internal::SpeechRecognitionOptions_Data> options;
    uint8_t continuous : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionContext_BindWebSpeechRecognizer_Params_Data>;

    SpeechRecognitionContext_BindWebSpeechRecognizer_Params_Data();
    ~SpeechRecognitionContext_BindWebSpeechRecognizer_Params_Data() = delete;
};
static_assert(
    sizeof(SpeechRecognitionContext_BindWebSpeechRecognizer_Params_Data) == 48, "Bad sizeof(SpeechRecognitionContext_BindWebSpeechRecognizer_Params_Data)");
class SpeechRecognitionRecognizer_SendAudioToSpeechRecognitionService_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::AudioDataS16_Data> buffer;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionRecognizer_SendAudioToSpeechRecognitionService_Params_Data>;

    SpeechRecognitionRecognizer_SendAudioToSpeechRecognitionService_Params_Data();
    ~SpeechRecognitionRecognizer_SendAudioToSpeechRecognitionService_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionRecognizer_SendAudioToSpeechRecognitionService_Params_Data) == 16,
    "Bad sizeof(SpeechRecognitionRecognizer_SendAudioToSpeechRecognitionService_Params_Data)");
class SpeechRecognitionRecognizer_MarkDone_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionRecognizer_MarkDone_Params_Data>;

    SpeechRecognitionRecognizer_MarkDone_Params_Data();
    ~SpeechRecognitionRecognizer_MarkDone_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionRecognizer_MarkDone_Params_Data) == 8, "Bad sizeof(SpeechRecognitionRecognizer_MarkDone_Params_Data)");
class SpeechRecognitionRecognizer_OnLanguageChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> language;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionRecognizer_OnLanguageChanged_Params_Data>;

    SpeechRecognitionRecognizer_OnLanguageChanged_Params_Data();
    ~SpeechRecognitionRecognizer_OnLanguageChanged_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionRecognizer_OnLanguageChanged_Params_Data) == 16, "Bad sizeof(SpeechRecognitionRecognizer_OnLanguageChanged_Params_Data)");
class SpeechRecognitionRecognizer_OnMaskOffensiveWordsChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t mask_offensive_words : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionRecognizer_OnMaskOffensiveWordsChanged_Params_Data>;

    SpeechRecognitionRecognizer_OnMaskOffensiveWordsChanged_Params_Data();
    ~SpeechRecognitionRecognizer_OnMaskOffensiveWordsChanged_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionRecognizer_OnMaskOffensiveWordsChanged_Params_Data) == 16,
    "Bad sizeof(SpeechRecognitionRecognizer_OnMaskOffensiveWordsChanged_Params_Data)");
class SpeechRecognitionRecognizerClient_OnSpeechRecognitionRecognitionEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SpeechRecognitionResult_Data> result;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionRecognizerClient_OnSpeechRecognitionRecognitionEvent_Params_Data>;

    SpeechRecognitionRecognizerClient_OnSpeechRecognitionRecognitionEvent_Params_Data();
    ~SpeechRecognitionRecognizerClient_OnSpeechRecognitionRecognitionEvent_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionRecognizerClient_OnSpeechRecognitionRecognitionEvent_Params_Data) == 16,
    "Bad sizeof(SpeechRecognitionRecognizerClient_OnSpeechRecognitionRecognitionEvent_Params_Data)");
class SpeechRecognitionRecognizerClient_OnSpeechRecognitionRecognitionEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t continue_recognition : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionRecognizerClient_OnSpeechRecognitionRecognitionEvent_ResponseParams_Data>;

    SpeechRecognitionRecognizerClient_OnSpeechRecognitionRecognitionEvent_ResponseParams_Data();
    ~SpeechRecognitionRecognizerClient_OnSpeechRecognitionRecognitionEvent_ResponseParams_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionRecognizerClient_OnSpeechRecognitionRecognitionEvent_ResponseParams_Data) == 16,
    "Bad sizeof(SpeechRecognitionRecognizerClient_OnSpeechRecognitionRecognitionEvent_ResponseParams_Data)");
class SpeechRecognitionRecognizerClient_OnSpeechRecognitionStopped_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionRecognizerClient_OnSpeechRecognitionStopped_Params_Data>;

    SpeechRecognitionRecognizerClient_OnSpeechRecognitionStopped_Params_Data();
    ~SpeechRecognitionRecognizerClient_OnSpeechRecognitionStopped_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionRecognizerClient_OnSpeechRecognitionStopped_Params_Data) == 8,
    "Bad sizeof(SpeechRecognitionRecognizerClient_OnSpeechRecognitionStopped_Params_Data)");
class SpeechRecognitionRecognizerClient_OnSpeechRecognitionError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionRecognizerClient_OnSpeechRecognitionError_Params_Data>;

    SpeechRecognitionRecognizerClient_OnSpeechRecognitionError_Params_Data();
    ~SpeechRecognitionRecognizerClient_OnSpeechRecognitionError_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionRecognizerClient_OnSpeechRecognitionError_Params_Data) == 8,
    "Bad sizeof(SpeechRecognitionRecognizerClient_OnSpeechRecognitionError_Params_Data)");
class SpeechRecognitionRecognizerClient_OnLanguageIdentificationEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::LanguageIdentificationEvent_Data> event;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionRecognizerClient_OnLanguageIdentificationEvent_Params_Data>;

    SpeechRecognitionRecognizerClient_OnLanguageIdentificationEvent_Params_Data();
    ~SpeechRecognitionRecognizerClient_OnLanguageIdentificationEvent_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionRecognizerClient_OnLanguageIdentificationEvent_Params_Data) == 16,
    "Bad sizeof(SpeechRecognitionRecognizerClient_OnLanguageIdentificationEvent_Params_Data)");
class SpeechRecognitionBrowserObserver_SpeechRecognitionAvailabilityChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_speech_recognition_available : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionBrowserObserver_SpeechRecognitionAvailabilityChanged_Params_Data>;

    SpeechRecognitionBrowserObserver_SpeechRecognitionAvailabilityChanged_Params_Data();
    ~SpeechRecognitionBrowserObserver_SpeechRecognitionAvailabilityChanged_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionBrowserObserver_SpeechRecognitionAvailabilityChanged_Params_Data) == 16,
    "Bad sizeof(SpeechRecognitionBrowserObserver_SpeechRecognitionAvailabilityChanged_Params_Data)");
class SpeechRecognitionBrowserObserver_SpeechRecognitionLanguageChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> language;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionBrowserObserver_SpeechRecognitionLanguageChanged_Params_Data>;

    SpeechRecognitionBrowserObserver_SpeechRecognitionLanguageChanged_Params_Data();
    ~SpeechRecognitionBrowserObserver_SpeechRecognitionLanguageChanged_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionBrowserObserver_SpeechRecognitionLanguageChanged_Params_Data) == 16,
    "Bad sizeof(SpeechRecognitionBrowserObserver_SpeechRecognitionLanguageChanged_Params_Data)");
class SpeechRecognitionBrowserObserver_SpeechRecognitionMaskOffensiveWordsChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t mask_offensive_words : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionBrowserObserver_SpeechRecognitionMaskOffensiveWordsChanged_Params_Data>;

    SpeechRecognitionBrowserObserver_SpeechRecognitionMaskOffensiveWordsChanged_Params_Data();
    ~SpeechRecognitionBrowserObserver_SpeechRecognitionMaskOffensiveWordsChanged_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionBrowserObserver_SpeechRecognitionMaskOffensiveWordsChanged_Params_Data) == 16,
    "Bad sizeof(SpeechRecognitionBrowserObserver_SpeechRecognitionMaskOffensiveWordsChanged_Params_Data)");
class SpeechRecognitionSurface_Activate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionSurface_Activate_Params_Data>;

    SpeechRecognitionSurface_Activate_Params_Data();
    ~SpeechRecognitionSurface_Activate_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionSurface_Activate_Params_Data) == 8, "Bad sizeof(SpeechRecognitionSurface_Activate_Params_Data)");
class SpeechRecognitionSurface_GetBounds_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionSurface_GetBounds_Params_Data>;

    SpeechRecognitionSurface_GetBounds_Params_Data();
    ~SpeechRecognitionSurface_GetBounds_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionSurface_GetBounds_Params_Data) == 8, "Bad sizeof(SpeechRecognitionSurface_GetBounds_Params_Data)");
class SpeechRecognitionSurface_GetBounds_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> bounds;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionSurface_GetBounds_ResponseParams_Data>;

    SpeechRecognitionSurface_GetBounds_ResponseParams_Data();
    ~SpeechRecognitionSurface_GetBounds_ResponseParams_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionSurface_GetBounds_ResponseParams_Data) == 16, "Bad sizeof(SpeechRecognitionSurface_GetBounds_ResponseParams_Data)");
class SpeechRecognitionSurfaceClient_OnSessionEnded_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionSurfaceClient_OnSessionEnded_Params_Data>;

    SpeechRecognitionSurfaceClient_OnSessionEnded_Params_Data();
    ~SpeechRecognitionSurfaceClient_OnSessionEnded_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionSurfaceClient_OnSessionEnded_Params_Data) == 8, "Bad sizeof(SpeechRecognitionSurfaceClient_OnSessionEnded_Params_Data)");
class SpeechRecognitionSurfaceClient_OnFullscreenToggled_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionSurfaceClient_OnFullscreenToggled_Params_Data>;

    SpeechRecognitionSurfaceClient_OnFullscreenToggled_Params_Data();
    ~SpeechRecognitionSurfaceClient_OnFullscreenToggled_Params_Data() = delete;
};
static_assert(
    sizeof(SpeechRecognitionSurfaceClient_OnFullscreenToggled_Params_Data) == 8, "Bad sizeof(SpeechRecognitionSurfaceClient_OnFullscreenToggled_Params_Data)");
class SpeechRecognitionClientBrowserInterface_BindSpeechRecognitionBrowserObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data observer;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionClientBrowserInterface_BindSpeechRecognitionBrowserObserver_Params_Data>;

    SpeechRecognitionClientBrowserInterface_BindSpeechRecognitionBrowserObserver_Params_Data();
    ~SpeechRecognitionClientBrowserInterface_BindSpeechRecognitionBrowserObserver_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionClientBrowserInterface_BindSpeechRecognitionBrowserObserver_Params_Data) == 16,
    "Bad sizeof(SpeechRecognitionClientBrowserInterface_BindSpeechRecognitionBrowserObserver_Params_Data)");
class SpeechRecognitionClientBrowserInterface_BindRecognizerToRemoteClient_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data client;
    mojo::internal::Handle_Data surface_client;
    mojo::internal::Interface_Data surface;
    mojo::internal::Pointer<internal::SpeechRecognitionSurfaceMetadata_Data> metadata;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionClientBrowserInterface_BindRecognizerToRemoteClient_Params_Data>;

    SpeechRecognitionClientBrowserInterface_BindRecognizerToRemoteClient_Params_Data();
    ~SpeechRecognitionClientBrowserInterface_BindRecognizerToRemoteClient_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionClientBrowserInterface_BindRecognizerToRemoteClient_Params_Data) == 32,
    "Bad sizeof(SpeechRecognitionClientBrowserInterface_BindRecognizerToRemoteClient_Params_Data)");

} // namespace internal

class SpeechRecognitionContext_BindRecognizer_ParamsDataView {
public:
    SpeechRecognitionContext_BindRecognizer_ParamsDataView() = default;

    SpeechRecognitionContext_BindRecognizer_ParamsDataView(internal::SpeechRecognitionContext_BindRecognizer_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeReceiver()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::media::mojom::SpeechRecognitionRecognizerInterfaceBase>>(
            &data_->receiver, &result, message_);
        DCHECK(ret);
        return result;
    }
