// media/mojo/mojom/video_encode_accelerator.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MEDIA_MOJO_MOJOM_VIDEO_ENCODE_ACCELERATOR_MOJOM_PARAMS_DATA_H_
#define MEDIA_MOJO_MOJOM_VIDEO_ENCODE_ACCELERATOR_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media::mojom {
namespace internal {
class VideoEncodeAcceleratorProvider_CreateVideoEncodeAccelerator_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::EncodeCommandBufferId_Data> command_buffer_id;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<VideoEncodeAcceleratorProvider_CreateVideoEncodeAccelerator_Params_Data>;

    VideoEncodeAcceleratorProvider_CreateVideoEncodeAccelerator_Params_Data();
    ~VideoEncodeAcceleratorProvider_CreateVideoEncodeAccelerator_Params_Data() = delete;
};
static_assert(sizeof(VideoEncodeAcceleratorProvider_CreateVideoEncodeAccelerator_Params_Data) == 24,
    "Bad sizeof(VideoEncodeAcceleratorProvider_CreateVideoEncodeAccelerator_Params_Data)");
class VideoEncodeAcceleratorProvider_GetVideoEncodeAcceleratorSupportedProfiles_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<VideoEncodeAcceleratorProvider_GetVideoEncodeAcceleratorSupportedProfiles_Params_Data>;

    VideoEncodeAcceleratorProvider_GetVideoEncodeAcceleratorSupportedProfiles_Params_Data();
    ~VideoEncodeAcceleratorProvider_GetVideoEncodeAcceleratorSupportedProfiles_Params_Data() = delete;
};
static_assert(sizeof(VideoEncodeAcceleratorProvider_GetVideoEncodeAcceleratorSupportedProfiles_Params_Data) == 8,
    "Bad sizeof(VideoEncodeAcceleratorProvider_GetVideoEncodeAcceleratorSupportedProfiles_Params_Data)");
class VideoEncodeAcceleratorProvider_GetVideoEncodeAcceleratorSupportedProfiles_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::VideoEncodeAcceleratorSupportedProfile_Data>>> profiles;

private:
    friend class mojo::internal::MessageFragment<VideoEncodeAcceleratorProvider_GetVideoEncodeAcceleratorSupportedProfiles_ResponseParams_Data>;

    VideoEncodeAcceleratorProvider_GetVideoEncodeAcceleratorSupportedProfiles_ResponseParams_Data();
    ~VideoEncodeAcceleratorProvider_GetVideoEncodeAcceleratorSupportedProfiles_ResponseParams_Data() = delete;
};
static_assert(sizeof(VideoEncodeAcceleratorProvider_GetVideoEncodeAcceleratorSupportedProfiles_ResponseParams_Data) == 16,
    "Bad sizeof(VideoEncodeAcceleratorProvider_GetVideoEncodeAcceleratorSupportedProfiles_ResponseParams_Data)");
class VideoEncodeAccelerator_Initialize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::VideoEncodeAcceleratorConfig_Data> config;
    mojo::internal::AssociatedInterface_Data client;
    mojo::internal::Interface_Data media_log;

private:
    friend class mojo::internal::MessageFragment<VideoEncodeAccelerator_Initialize_Params_Data>;

    VideoEncodeAccelerator_Initialize_Params_Data();
    ~VideoEncodeAccelerator_Initialize_Params_Data() = delete;
};
static_assert(sizeof(VideoEncodeAccelerator_Initialize_Params_Data) == 32, "Bad sizeof(VideoEncodeAccelerator_Initialize_Params_Data)");
class VideoEncodeAccelerator_Initialize_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<VideoEncodeAccelerator_Initialize_ResponseParams_Data>;

    VideoEncodeAccelerator_Initialize_ResponseParams_Data();
    ~VideoEncodeAccelerator_Initialize_ResponseParams_Data() = delete;
};
static_assert(sizeof(VideoEncodeAccelerator_Initialize_ResponseParams_Data) == 16, "Bad sizeof(VideoEncodeAccelerator_Initialize_ResponseParams_Data)");
class VideoEncodeAccelerator_Encode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::VideoFrame_Data> frame;
    mojo::internal::Pointer<internal::VideoEncodeOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<VideoEncodeAccelerator_Encode_Params_Data>;

    VideoEncodeAccelerator_Encode_Params_Data();
    ~VideoEncodeAccelerator_Encode_Params_Data() = delete;
};
static_assert(sizeof(VideoEncodeAccelerator_Encode_Params_Data) == 24, "Bad sizeof(VideoEncodeAccelerator_Encode_Params_Data)");
class VideoEncodeAccelerator_Encode_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<VideoEncodeAccelerator_Encode_ResponseParams_Data>;

    VideoEncodeAccelerator_Encode_ResponseParams_Data();
    ~VideoEncodeAccelerator_Encode_ResponseParams_Data() = delete;
};
static_assert(sizeof(VideoEncodeAccelerator_Encode_ResponseParams_Data) == 8, "Bad sizeof(VideoEncodeAccelerator_Encode_ResponseParams_Data)");
class VideoEncodeAccelerator_UseOutputBitstreamBuffer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t bitstream_buffer_id;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnsafeSharedMemoryRegion_Data> region;

private:
    friend class mojo::internal::MessageFragment<VideoEncodeAccelerator_UseOutputBitstreamBuffer_Params_Data>;

    VideoEncodeAccelerator_UseOutputBitstreamBuffer_Params_Data();
    ~VideoEncodeAccelerator_UseOutputBitstreamBuffer_Params_Data() = delete;
};
static_assert(
    sizeof(VideoEncodeAccelerator_UseOutputBitstreamBuffer_Params_Data) == 24, "Bad sizeof(VideoEncodeAccelerator_UseOutputBitstreamBuffer_Params_Data)");
class VideoEncodeAccelerator_RequestEncodingParametersChangeWithLayers_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::VideoBitrateAllocation_Data> bitrate_allocation;
    uint32_t framerate;
    uint8_t pad1_[4];
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> size;

private:
    friend class mojo::internal::MessageFragment<VideoEncodeAccelerator_RequestEncodingParametersChangeWithLayers_Params_Data>;

    VideoEncodeAccelerator_RequestEncodingParametersChangeWithLayers_Params_Data();
    ~VideoEncodeAccelerator_RequestEncodingParametersChangeWithLayers_Params_Data() = delete;
};
static_assert(sizeof(VideoEncodeAccelerator_RequestEncodingParametersChangeWithLayers_Params_Data) == 32,
    "Bad sizeof(VideoEncodeAccelerator_RequestEncodingParametersChangeWithLayers_Params_Data)");
class VideoEncodeAccelerator_RequestEncodingParametersChangeWithBitrate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::Bitrate_Data bitrate;
    uint32_t framerate;
    uint8_t pad1_[4];
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> size;

private:
    friend class mojo::internal::MessageFragment<VideoEncodeAccelerator_RequestEncodingParametersChangeWithBitrate_Params_Data>;

    VideoEncodeAccelerator_RequestEncodingParametersChangeWithBitrate_Params_Data();
    ~VideoEncodeAccelerator_RequestEncodingParametersChangeWithBitrate_Params_Data() = delete;
};
static_assert(sizeof(VideoEncodeAccelerator_RequestEncodingParametersChangeWithBitrate_Params_Data) == 40,
    "Bad sizeof(VideoEncodeAccelerator_RequestEncodingParametersChangeWithBitrate_Params_Data)");
class VideoEncodeAccelerator_IsFlushSupported_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<VideoEncodeAccelerator_IsFlushSupported_Params_Data>;

    VideoEncodeAccelerator_IsFlushSupported_Params_Data();
    ~VideoEncodeAccelerator_IsFlushSupported_Params_Data() = delete;
};
static_assert(sizeof(VideoEncodeAccelerator_IsFlushSupported_Params_Data) == 8, "Bad sizeof(VideoEncodeAccelerator_IsFlushSupported_Params_Data)");
class VideoEncodeAccelerator_IsFlushSupported_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<VideoEncodeAccelerator_IsFlushSupported_ResponseParams_Data>;

    VideoEncodeAccelerator_IsFlushSupported_ResponseParams_Data();
    ~VideoEncodeAccelerator_IsFlushSupported_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(VideoEncodeAccelerator_IsFlushSupported_ResponseParams_Data) == 16, "Bad sizeof(VideoEncodeAccelerator_IsFlushSupported_ResponseParams_Data)");
class VideoEncodeAccelerator_Flush_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<VideoEncodeAccelerator_Flush_Params_Data>;

    VideoEncodeAccelerator_Flush_Params_Data();
    ~VideoEncodeAccelerator_Flush_Params_Data() = delete;
};
static_assert(sizeof(VideoEncodeAccelerator_Flush_Params_Data) == 8, "Bad sizeof(VideoEncodeAccelerator_Flush_Params_Data)");
class VideoEncodeAccelerator_Flush_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<VideoEncodeAccelerator_Flush_ResponseParams_Data>;

    VideoEncodeAccelerator_Flush_ResponseParams_Data();
    ~VideoEncodeAccelerator_Flush_ResponseParams_Data() = delete;
};
static_assert(sizeof(VideoEncodeAccelerator_Flush_ResponseParams_Data) == 16, "Bad sizeof(VideoEncodeAccelerator_Flush_ResponseParams_Data)");
class VideoEncodeAcceleratorClient_RequireBitstreamBuffers_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t input_count;
    uint32_t output_buffer_size;
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> input_coded_size;

private:
    friend class mojo::internal::MessageFragment<VideoEncodeAcceleratorClient_RequireBitstreamBuffers_Params_Data>;

    VideoEncodeAcceleratorClient_RequireBitstreamBuffers_Params_Data();
    ~VideoEncodeAcceleratorClient_RequireBitstreamBuffers_Params_Data() = delete;
};
static_assert(sizeof(VideoEncodeAcceleratorClient_RequireBitstreamBuffers_Params_Data) == 24,
    "Bad sizeof(VideoEncodeAcceleratorClient_RequireBitstreamBuffers_Params_Data)");
class VideoEncodeAcceleratorClient_BitstreamBufferReady_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t bitstream_buffer_id;
    uint8_t pad0_[4];
    mojo::internal::Pointer<internal::BitstreamBufferMetadata_Data> metadata;

private:
    friend class mojo::internal::MessageFragment<VideoEncodeAcceleratorClient_BitstreamBufferReady_Params_Data>;

    VideoEncodeAcceleratorClient_BitstreamBufferReady_Params_Data();
    ~VideoEncodeAcceleratorClient_BitstreamBufferReady_Params_Data() = delete;
};
static_assert(
    sizeof(VideoEncodeAcceleratorClient_BitstreamBufferReady_Params_Data) == 24, "Bad sizeof(VideoEncodeAcceleratorClient_BitstreamBufferReady_Params_Data)");
class VideoEncodeAcceleratorClient_NotifyErrorStatus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::EncoderStatus_Data> status;

private:
    friend class mojo::internal::MessageFragment<VideoEncodeAcceleratorClient_NotifyErrorStatus_Params_Data>;

    VideoEncodeAcceleratorClient_NotifyErrorStatus_Params_Data();
    ~VideoEncodeAcceleratorClient_NotifyErrorStatus_Params_Data() = delete;
};
static_assert(
    sizeof(VideoEncodeAcceleratorClient_NotifyErrorStatus_Params_Data) == 16, "Bad sizeof(VideoEncodeAcceleratorClient_NotifyErrorStatus_Params_Data)");
class VideoEncodeAcceleratorClient_NotifyEncoderInfoChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::VideoEncoderInfo_Data> info;

private:
    friend class mojo::internal::MessageFragment<VideoEncodeAcceleratorClient_NotifyEncoderInfoChange_Params_Data>;

    VideoEncodeAcceleratorClient_NotifyEncoderInfoChange_Params_Data();
    ~VideoEncodeAcceleratorClient_NotifyEncoderInfoChange_Params_Data() = delete;
};
static_assert(sizeof(VideoEncodeAcceleratorClient_NotifyEncoderInfoChange_Params_Data) == 16,
    "Bad sizeof(VideoEncodeAcceleratorClient_NotifyEncoderInfoChange_Params_Data)");

} // namespace internal

class VideoEncodeAcceleratorProvider_CreateVideoEncodeAccelerator_ParamsDataView {
public:
    VideoEncodeAcceleratorProvider_CreateVideoEncodeAccelerator_ParamsDataView() = default;

    VideoEncodeAcceleratorProvider_CreateVideoEncodeAccelerator_ParamsDataView(
        internal::VideoEncodeAcceleratorProvider_CreateVideoEncodeAccelerator_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetCommandBufferIdDataView(EncodeCommandBufferIdDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadCommandBufferId(UserType* output)
    {

