// media/mojo/mojom/video_decoder.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MEDIA_MOJO_MOJOM_VIDEO_DECODER_MOJOM_PARAMS_DATA_H_
#define MEDIA_MOJO_MOJOM_VIDEO_DECODER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media::mojom {
namespace internal {
class VideoFrameHandleReleaser_ReleaseVideoFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> release_token;
    mojo::internal::Pointer<::gpu::mojom::internal::SyncToken_Data> release_sync_token;

private:
    friend class mojo::internal::MessageFragment<VideoFrameHandleReleaser_ReleaseVideoFrame_Params_Data>;

    VideoFrameHandleReleaser_ReleaseVideoFrame_Params_Data();
    ~VideoFrameHandleReleaser_ReleaseVideoFrame_Params_Data() = delete;
};
static_assert(sizeof(VideoFrameHandleReleaser_ReleaseVideoFrame_Params_Data) == 24, "Bad sizeof(VideoFrameHandleReleaser_ReleaseVideoFrame_Params_Data)");
class VideoDecoder_GetSupportedConfigs_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<VideoDecoder_GetSupportedConfigs_Params_Data>;

    VideoDecoder_GetSupportedConfigs_Params_Data();
    ~VideoDecoder_GetSupportedConfigs_Params_Data() = delete;
};
static_assert(sizeof(VideoDecoder_GetSupportedConfigs_Params_Data) == 8, "Bad sizeof(VideoDecoder_GetSupportedConfigs_Params_Data)");
class VideoDecoder_GetSupportedConfigs_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::SupportedVideoDecoderConfig_Data>>> supported_configs;
    int32_t decoder_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<VideoDecoder_GetSupportedConfigs_ResponseParams_Data>;

    VideoDecoder_GetSupportedConfigs_ResponseParams_Data();
    ~VideoDecoder_GetSupportedConfigs_ResponseParams_Data() = delete;
};
static_assert(sizeof(VideoDecoder_GetSupportedConfigs_ResponseParams_Data) == 24, "Bad sizeof(VideoDecoder_GetSupportedConfigs_ResponseParams_Data)");
class VideoDecoder_Construct_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data client;
    mojo::internal::Interface_Data media_log;
    mojo::internal::Handle_Data video_frame_handle_releaser;
    mojo::internal::Handle_Data decoder_buffer_pipe;
    mojo::internal::Pointer<internal::CommandBufferId_Data> command_buffer_id;
    mojo::internal::Pointer<::gfx::mojom::internal::ColorSpace_Data> target_color_space;

private:
    friend class mojo::internal::MessageFragment<VideoDecoder_Construct_Params_Data>;

    VideoDecoder_Construct_Params_Data();
    ~VideoDecoder_Construct_Params_Data() = delete;
};
static_assert(sizeof(VideoDecoder_Construct_Params_Data) == 48, "Bad sizeof(VideoDecoder_Construct_Params_Data)");
class VideoDecoder_Initialize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::VideoDecoderConfig_Data> config;
    uint8_t low_delay : 1;
    uint8_t pad1_[7];
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> cdm_id;

private:
    friend class mojo::internal::MessageFragment<VideoDecoder_Initialize_Params_Data>;

    VideoDecoder_Initialize_Params_Data();
    ~VideoDecoder_Initialize_Params_Data() = delete;
};
static_assert(sizeof(VideoDecoder_Initialize_Params_Data) == 32, "Bad sizeof(VideoDecoder_Initialize_Params_Data)");
class VideoDecoder_Initialize_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::DecoderStatus_Data> status;
    uint8_t needs_bitstream_conversion : 1;
    uint8_t pad1_[3];
    int32_t max_decode_requests;
    int32_t decoder_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<VideoDecoder_Initialize_ResponseParams_Data>;

    VideoDecoder_Initialize_ResponseParams_Data();
    ~VideoDecoder_Initialize_ResponseParams_Data() = delete;
};
static_assert(sizeof(VideoDecoder_Initialize_ResponseParams_Data) == 32, "Bad sizeof(VideoDecoder_Initialize_ResponseParams_Data)");
class VideoDecoder_Decode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::media::mojom::internal::DecoderBuffer_Data buffer;

private:
    friend class mojo::internal::MessageFragment<VideoDecoder_Decode_Params_Data>;

    VideoDecoder_Decode_Params_Data();
    ~VideoDecoder_Decode_Params_Data() = delete;
};
static_assert(sizeof(VideoDecoder_Decode_Params_Data) == 24, "Bad sizeof(VideoDecoder_Decode_Params_Data)");
class VideoDecoder_Decode_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::DecoderStatus_Data> status;

private:
    friend class mojo::internal::MessageFragment<VideoDecoder_Decode_ResponseParams_Data>;

    VideoDecoder_Decode_ResponseParams_Data();
    ~VideoDecoder_Decode_ResponseParams_Data() = delete;
};
static_assert(sizeof(VideoDecoder_Decode_ResponseParams_Data) == 16, "Bad sizeof(VideoDecoder_Decode_ResponseParams_Data)");
class VideoDecoder_Reset_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<VideoDecoder_Reset_Params_Data>;

    VideoDecoder_Reset_Params_Data();
    ~VideoDecoder_Reset_Params_Data() = delete;
};
static_assert(sizeof(VideoDecoder_Reset_Params_Data) == 8, "Bad sizeof(VideoDecoder_Reset_Params_Data)");
class VideoDecoder_Reset_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<VideoDecoder_Reset_ResponseParams_Data>;

    VideoDecoder_Reset_ResponseParams_Data();
    ~VideoDecoder_Reset_ResponseParams_Data() = delete;
};
static_assert(sizeof(VideoDecoder_Reset_ResponseParams_Data) == 8, "Bad sizeof(VideoDecoder_Reset_ResponseParams_Data)");
class VideoDecoder_OnOverlayInfoChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::OverlayInfo_Data> overlay_info;

private:
    friend class mojo::internal::MessageFragment<VideoDecoder_OnOverlayInfoChanged_Params_Data>;

    VideoDecoder_OnOverlayInfoChanged_Params_Data();
    ~VideoDecoder_OnOverlayInfoChanged_Params_Data() = delete;
};
static_assert(sizeof(VideoDecoder_OnOverlayInfoChanged_Params_Data) == 16, "Bad sizeof(VideoDecoder_OnOverlayInfoChanged_Params_Data)");
class VideoDecoderClient_OnVideoFrameDecoded_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::VideoFrame_Data> frame;
    uint8_t can_read_without_stalling : 1;
    uint8_t pad1_[7];
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> release_token;

private:
    friend class mojo::internal::MessageFragment<VideoDecoderClient_OnVideoFrameDecoded_Params_Data>;

    VideoDecoderClient_OnVideoFrameDecoded_Params_Data();
    ~VideoDecoderClient_OnVideoFrameDecoded_Params_Data() = delete;
};
static_assert(sizeof(VideoDecoderClient_OnVideoFrameDecoded_Params_Data) == 32, "Bad sizeof(VideoDecoderClient_OnVideoFrameDecoded_Params_Data)");
class VideoDecoderClient_OnWaiting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t reason;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<VideoDecoderClient_OnWaiting_Params_Data>;

    VideoDecoderClient_OnWaiting_Params_Data();
    ~VideoDecoderClient_OnWaiting_Params_Data() = delete;
};
static_assert(sizeof(VideoDecoderClient_OnWaiting_Params_Data) == 16, "Bad sizeof(VideoDecoderClient_OnWaiting_Params_Data)");
class VideoDecoderClient_RequestOverlayInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t restart_for_transitions : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<VideoDecoderClient_RequestOverlayInfo_Params_Data>;

    VideoDecoderClient_RequestOverlayInfo_Params_Data();
    ~VideoDecoderClient_RequestOverlayInfo_Params_Data() = delete;
};
static_assert(sizeof(VideoDecoderClient_RequestOverlayInfo_Params_Data) == 16, "Bad sizeof(VideoDecoderClient_RequestOverlayInfo_Params_Data)");

} // namespace internal

class VideoFrameHandleReleaser_ReleaseVideoFrame_ParamsDataView {
public:
    VideoFrameHandleReleaser_ReleaseVideoFrame_ParamsDataView() = default;

    VideoFrameHandleReleaser_ReleaseVideoFrame_ParamsDataView(internal::VideoFrameHandleReleaser_ReleaseVideoFrame_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetReleaseTokenDataView(::mojo_base::mojom::UnguessableTokenDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadReleaseToken(UserType* output)
    {

        auto* pointer = data_->release_token.Get();
        return mojo::internal::Deserialize<::mojo_base::mojom::UnguessableTokenDataView>(pointer, output, message_);
    }
