// media/mojo/mojom/watch_time_recorder.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MEDIA_MOJO_MOJOM_WATCH_TIME_RECORDER_MOJOM_PARAMS_DATA_H_
#define MEDIA_MOJO_MOJOM_WATCH_TIME_RECORDER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media::mojom {
namespace internal {
class WatchTimeRecorder_RecordWatchTime_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t key;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> watch_time;

private:
    friend class mojo::internal::MessageFragment<WatchTimeRecorder_RecordWatchTime_Params_Data>;

    WatchTimeRecorder_RecordWatchTime_Params_Data();
    ~WatchTimeRecorder_RecordWatchTime_Params_Data() = delete;
};
static_assert(sizeof(WatchTimeRecorder_RecordWatchTime_Params_Data) == 24, "Bad sizeof(WatchTimeRecorder_RecordWatchTime_Params_Data)");
class WatchTimeRecorder_FinalizeWatchTime_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> watch_time_keys;

private:
    friend class mojo::internal::MessageFragment<WatchTimeRecorder_FinalizeWatchTime_Params_Data>;

    WatchTimeRecorder_FinalizeWatchTime_Params_Data();
    ~WatchTimeRecorder_FinalizeWatchTime_Params_Data() = delete;
};
static_assert(sizeof(WatchTimeRecorder_FinalizeWatchTime_Params_Data) == 16, "Bad sizeof(WatchTimeRecorder_FinalizeWatchTime_Params_Data)");
class WatchTimeRecorder_OnError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::PipelineStatus_Data> status;

private:
    friend class mojo::internal::MessageFragment<WatchTimeRecorder_OnError_Params_Data>;

    WatchTimeRecorder_OnError_Params_Data();
    ~WatchTimeRecorder_OnError_Params_Data() = delete;
};
static_assert(sizeof(WatchTimeRecorder_OnError_Params_Data) == 16, "Bad sizeof(WatchTimeRecorder_OnError_Params_Data)");
class WatchTimeRecorder_UpdateSecondaryProperties_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SecondaryPlaybackProperties_Data> secondary_properties;

private:
    friend class mojo::internal::MessageFragment<WatchTimeRecorder_UpdateSecondaryProperties_Params_Data>;

    WatchTimeRecorder_UpdateSecondaryProperties_Params_Data();
    ~WatchTimeRecorder_UpdateSecondaryProperties_Params_Data() = delete;
};
static_assert(sizeof(WatchTimeRecorder_UpdateSecondaryProperties_Params_Data) == 16, "Bad sizeof(WatchTimeRecorder_UpdateSecondaryProperties_Params_Data)");
class WatchTimeRecorder_SetAutoplayInitiated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t value : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<WatchTimeRecorder_SetAutoplayInitiated_Params_Data>;

    WatchTimeRecorder_SetAutoplayInitiated_Params_Data();
    ~WatchTimeRecorder_SetAutoplayInitiated_Params_Data() = delete;
};
static_assert(sizeof(WatchTimeRecorder_SetAutoplayInitiated_Params_Data) == 16, "Bad sizeof(WatchTimeRecorder_SetAutoplayInitiated_Params_Data)");
class WatchTimeRecorder_OnDurationChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> duration;

private:
    friend class mojo::internal::MessageFragment<WatchTimeRecorder_OnDurationChanged_Params_Data>;

    WatchTimeRecorder_OnDurationChanged_Params_Data();
    ~WatchTimeRecorder_OnDurationChanged_Params_Data() = delete;
};
static_assert(sizeof(WatchTimeRecorder_OnDurationChanged_Params_Data) == 16, "Bad sizeof(WatchTimeRecorder_OnDurationChanged_Params_Data)");
class WatchTimeRecorder_UpdateVideoDecodeStats_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t frames_decoded;
    uint32_t frames_dropped;

private:
    friend class mojo::internal::MessageFragment<WatchTimeRecorder_UpdateVideoDecodeStats_Params_Data>;

    WatchTimeRecorder_UpdateVideoDecodeStats_Params_Data();
    ~WatchTimeRecorder_UpdateVideoDecodeStats_Params_Data() = delete;
};
static_assert(sizeof(WatchTimeRecorder_UpdateVideoDecodeStats_Params_Data) == 16, "Bad sizeof(WatchTimeRecorder_UpdateVideoDecodeStats_Params_Data)");
class WatchTimeRecorder_UpdateUnderflowCount_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t total_count;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WatchTimeRecorder_UpdateUnderflowCount_Params_Data>;

    WatchTimeRecorder_UpdateUnderflowCount_Params_Data();
    ~WatchTimeRecorder_UpdateUnderflowCount_Params_Data() = delete;
};
static_assert(sizeof(WatchTimeRecorder_UpdateUnderflowCount_Params_Data) == 16, "Bad sizeof(WatchTimeRecorder_UpdateUnderflowCount_Params_Data)");
class WatchTimeRecorder_UpdateUnderflowDuration_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t total_completed_count;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> total_duration;

private:
    friend class mojo::internal::MessageFragment<WatchTimeRecorder_UpdateUnderflowDuration_Params_Data>;

    WatchTimeRecorder_UpdateUnderflowDuration_Params_Data();
    ~WatchTimeRecorder_UpdateUnderflowDuration_Params_Data() = delete;
};
static_assert(sizeof(WatchTimeRecorder_UpdateUnderflowDuration_Params_Data) == 24, "Bad sizeof(WatchTimeRecorder_UpdateUnderflowDuration_Params_Data)");

} // namespace internal

class WatchTimeRecorder_RecordWatchTime_ParamsDataView {
public:
    WatchTimeRecorder_RecordWatchTime_ParamsDataView() = default;

    WatchTimeRecorder_RecordWatchTime_ParamsDataView(internal::WatchTimeRecorder_RecordWatchTime_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadKey(UserType* output) const
    {
        auto data_value = data_->key;
        return mojo::internal::Deserialize<::media::mojom::WatchTimeKey>(data_value, output);
    }
    ::media::mojom::WatchTimeKey key() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::media::mojom::WatchTimeKey>(data_->key));
    }
    inline void GetWatchTimeDataView(::mojo_base::mojom::TimeDeltaDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadWatchTime(UserType* output)
    {

        auto* pointer = data_->watch_time.Get();
        return mojo::internal::Deserialize<::mojo_base::mojom::TimeDeltaDataView>(pointer, output, message_);
    }

private:
    internal::WatchTimeRecorder_RecordWatchTime_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class WatchTimeRecorder_FinalizeWatchTime_ParamsDataView {
public:
    WatchTimeRecorder_FinalizeWatchTime_ParamsDataView() = default;

    WatchTimeRecorder_FinalizeWatchTime_ParamsDataView(internal::WatchTimeRecorder_FinalizeWatchTime_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetWatchTimeKeysDataView(mojo::ArrayDataView<::media::mojom::WatchTimeKey>* output);

    template <typename UserType> [[nodiscard]] bool ReadWatchTimeKeys(UserType* output)
    {

        auto* pointer = data_->watch_time_keys.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<::media::mojom::WatchTimeKey>>(pointer, output, message_);
    }

private:
    internal::WatchTimeRecorder_FinalizeWatchTime_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class WatchTimeRecorder_OnError_ParamsDataView {
public:
    WatchTimeRecorder_OnError_ParamsDataView() = default;

    WatchTimeRecorder_OnError_ParamsDataView(internal::WatchTimeRecorder_OnError_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetStatusDataView(::media::mojom::PipelineStatusDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadStatus(UserType* output)
    {

        auto* pointer = data_->status.Get();
        return mojo::internal::Deserialize<::media::mojom::PipelineStatusDataView>(pointer, output, message_);
    }

private:
    internal::WatchTimeRecorder_OnError_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class WatchTimeRecorder_UpdateSecondaryProperties_ParamsDataView {
public:
    WatchTimeRecorder_UpdateSecondaryProperties_ParamsDataView() = default;

    WatchTimeRecorder_UpdateSecondaryProperties_ParamsDataView(internal::WatchTimeRecorder_UpdateSecondaryProperties_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetSecondaryPropertiesDataView(SecondaryPlaybackPropertiesDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadSecondaryProperties(UserType* output)
    {

        auto* pointer = data_->secondary_properties.Get();
        return mojo::internal::Deserialize<::media::mojom::SecondaryPlaybackPropertiesDataView>(pointer, output, message_);
    }

private:
    internal::WatchTimeRecorder_UpdateSecondaryProperties_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class WatchTimeRecorder_SetAutoplayInitiated_ParamsDataView {
public:
    WatchTimeRecorder_SetAutoplayInitiated_ParamsDataView() = default;

    WatchTimeRecorder_SetAutoplayInitiated_ParamsDataView(internal::WatchTimeRecorder_SetAutoplayInitiated_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    bool value() const
    {
        return data_->value;
    }

private:
    internal::WatchTimeRecorder_SetAutoplayInitiated_Params_Data* data_ = nullptr;
};

class WatchTimeRecorder_OnDurationChanged_ParamsDataView {
public:
    WatchTimeRecorder_OnDurationChanged_ParamsDataView() = default;

    WatchTimeRecorder_OnDurationChanged_ParamsDataView(internal::WatchTimeRecorder_OnDurationChanged_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetDurationDataView(::mojo_base::mojom::TimeDeltaDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadDuration(UserType* output)
    {

        auto* pointer = data_->duration.Get();
        return mojo::internal::Deserialize<::mojo_base::mojom::TimeDeltaDataView>(pointer, output, message_);
    }

private:
    internal::WatchTimeRecorder_OnDurationChanged_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class WatchTimeRecorder_UpdateVideoDecodeStats_ParamsDataView {
public:
    WatchTimeRecorder_UpdateVideoDecodeStats_ParamsDataView() = default;

    WatchTimeRecorder_UpdateVideoDecodeStats_ParamsDataView(internal::WatchTimeRecorder_UpdateVideoDecodeStats_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    uint32_t frames_decoded() const
    {
        return data_->frames_decoded;
    }
    uint32_t frames_dropped() const
    {
        return data_->frames_dropped;
    }

private:
    internal::WatchTimeRecorder_UpdateVideoDecodeStats_Params_Data* data_ = nullptr;
};

class WatchTimeRecorder_UpdateUnderflowCount_ParamsDataView {
public:
    WatchTimeRecorder_UpdateUnderflowCount_ParamsDataView() = default;

    WatchTimeRecorder_UpdateUnderflowCount_ParamsDataView(internal::WatchTimeRecorder_UpdateUnderflowCount_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    int32_t total_count() const
    {
        return data_->total_count;
    }

private:
    internal::WatchTimeRecorder_UpdateUnderflowCount_Params_Data* data_ = nullptr;
};

class WatchTimeRecorder_UpdateUnderflowDuration_ParamsDataView {
public:
    WatchTimeRecorder_UpdateUnderflowDuration_ParamsDataView() = default;

    WatchTimeRecorder_UpdateUnderflowDuration_ParamsDataView(internal::WatchTimeRecorder_UpdateUnderflowDuration_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    int32_t total_completed_count() const
    {
        return data_->total_completed_count;
    }
    inline void GetTotalDurationDataView(::mojo_base::mojom::TimeDeltaDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadTotalDuration(UserType* output)
    {

        auto* pointer = data_->total_duration.Get();
        return mojo::internal::Deserialize<::mojo_base::mojom::TimeDeltaDataView>(pointer, output, message_);
    }

private:
    internal::WatchTimeRecorder_UpdateUnderflowDuration_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

inline void WatchTimeRecorder_RecordWatchTime_ParamsDataView::GetWatchTimeDataView(::mojo_base::mojom::TimeDeltaDataView* output)
{
    auto pointer = data_->watch_time.Get();
    *output = ::mojo_base::mojom::TimeDeltaDataView(pointer, message_);
}

inline void WatchTimeRecorder_FinalizeWatchTime_ParamsDataView::GetWatchTimeKeysDataView(mojo::ArrayDataView<::media::mojom::WatchTimeKey>* output)
{
    auto pointer = data_->watch_time_keys.Get();
    *output = mojo::ArrayDataView<::media::mojom::WatchTimeKey>(pointer, message_);
}

inline void WatchTimeRecorder_OnError_ParamsDataView::GetStatusDataView(::media::mojom::PipelineStatusDataView* output)
{
    auto pointer = data_->status.Get();
    *output = ::media::mojom::PipelineStatusDataView(pointer, message_);
}

inline void WatchTimeRecorder_UpdateSecondaryProperties_ParamsDataView::GetSecondaryPropertiesDataView(SecondaryPlaybackPropertiesDataView* output)
{
    auto pointer = data_->secondary_properties.Get();
    *output = SecondaryPlaybackPropertiesDataView(pointer, message_);
}

inline void WatchTimeRecorder_OnDurationChanged_ParamsDataView::GetDurationDataView(::mojo_base::mojom::TimeDeltaDataView* output)
{
    auto pointer = data_->duration.Get();
    *output = ::mojo_base::mojom::TimeDeltaDataView(pointer, message_);
}

inline void WatchTimeRecorder_UpdateUnderflowDuration_ParamsDataView::GetTotalDurationDataView(::mojo_base::mojom::TimeDeltaDataView* output)
{
    auto pointer = data_->total_duration.Get();
    *output = ::mojo_base::mojom::TimeDeltaDataView(pointer, message_);
}

} // media::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // MEDIA_MOJO_MOJOM_WATCH_TIME_RECORDER_MOJOM_PARAMS_DATA_H_
