// components/services/filesystem/public/mojom/directory.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_SERVICES_FILESYSTEM_PUBLIC_MOJOM_DIRECTORY_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_SERVICES_FILESYSTEM_PUBLIC_MOJOM_DIRECTORY_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace filesystem::mojom {
namespace internal {
class Directory_Read_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<Directory_Read_Params_Data>;

    Directory_Read_Params_Data();
    ~Directory_Read_Params_Data() = delete;
};
static_assert(sizeof(Directory_Read_Params_Data) == 8, "Bad sizeof(Directory_Read_Params_Data)");
class Directory_Read_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::filesystem::mojom::internal::DirectoryEntry_Data>>> directory_contents;

private:
    friend class mojo::internal::MessageFragment<Directory_Read_ResponseParams_Data>;

    Directory_Read_ResponseParams_Data();
    ~Directory_Read_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_Read_ResponseParams_Data) == 24, "Bad sizeof(Directory_Read_ResponseParams_Data)");
class Directory_OpenFileHandle_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> path;
    uint32_t open_flags;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Directory_OpenFileHandle_Params_Data>;

    Directory_OpenFileHandle_Params_Data();
    ~Directory_OpenFileHandle_Params_Data() = delete;
};
static_assert(sizeof(Directory_OpenFileHandle_Params_Data) == 24, "Bad sizeof(Directory_OpenFileHandle_Params_Data)");
class Directory_OpenFileHandle_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::File_Data> file_handle;

private:
    friend class mojo::internal::MessageFragment<Directory_OpenFileHandle_ResponseParams_Data>;

    Directory_OpenFileHandle_ResponseParams_Data();
    ~Directory_OpenFileHandle_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_OpenFileHandle_ResponseParams_Data) == 24, "Bad sizeof(Directory_OpenFileHandle_ResponseParams_Data)");
class Directory_OpenFileHandles_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::FileOpenDetails_Data>>> files;

private:
    friend class mojo::internal::MessageFragment<Directory_OpenFileHandles_Params_Data>;

    Directory_OpenFileHandles_Params_Data();
    ~Directory_OpenFileHandles_Params_Data() = delete;
};
static_assert(sizeof(Directory_OpenFileHandles_Params_Data) == 16, "Bad sizeof(Directory_OpenFileHandles_Params_Data)");
class Directory_OpenFileHandles_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::FileOpenResult_Data>>> results;

private:
    friend class mojo::internal::MessageFragment<Directory_OpenFileHandles_ResponseParams_Data>;

    Directory_OpenFileHandles_ResponseParams_Data();
    ~Directory_OpenFileHandles_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_OpenFileHandles_ResponseParams_Data) == 16, "Bad sizeof(Directory_OpenFileHandles_ResponseParams_Data)");
class Directory_OpenDirectory_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> path;
    mojo::internal::Handle_Data directory;
    uint32_t open_flags;

private:
    friend class mojo::internal::MessageFragment<Directory_OpenDirectory_Params_Data>;

    Directory_OpenDirectory_Params_Data();
    ~Directory_OpenDirectory_Params_Data() = delete;
};
static_assert(sizeof(Directory_OpenDirectory_Params_Data) == 24, "Bad sizeof(Directory_OpenDirectory_Params_Data)");
class Directory_OpenDirectory_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Directory_OpenDirectory_ResponseParams_Data>;

    Directory_OpenDirectory_ResponseParams_Data();
    ~Directory_OpenDirectory_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_OpenDirectory_ResponseParams_Data) == 16, "Bad sizeof(Directory_OpenDirectory_ResponseParams_Data)");
class Directory_Rename_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> path;
    mojo::internal::Pointer<mojo::internal::String_Data> new_path;

private:
    friend class mojo::internal::MessageFragment<Directory_Rename_Params_Data>;

    Directory_Rename_Params_Data();
    ~Directory_Rename_Params_Data() = delete;
};
static_assert(sizeof(Directory_Rename_Params_Data) == 24, "Bad sizeof(Directory_Rename_Params_Data)");
class Directory_Rename_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Directory_Rename_ResponseParams_Data>;

    Directory_Rename_ResponseParams_Data();
    ~Directory_Rename_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_Rename_ResponseParams_Data) == 16, "Bad sizeof(Directory_Rename_ResponseParams_Data)");
class Directory_Replace_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> path;
    mojo::internal::Pointer<mojo::internal::String_Data> new_path;

private:
    friend class mojo::internal::MessageFragment<Directory_Replace_Params_Data>;

    Directory_Replace_Params_Data();
    ~Directory_Replace_Params_Data() = delete;
};
static_assert(sizeof(Directory_Replace_Params_Data) == 24, "Bad sizeof(Directory_Replace_Params_Data)");
class Directory_Replace_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Directory_Replace_ResponseParams_Data>;

    Directory_Replace_ResponseParams_Data();
    ~Directory_Replace_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_Replace_ResponseParams_Data) == 16, "Bad sizeof(Directory_Replace_ResponseParams_Data)");
class Directory_Delete_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> path;
    uint32_t delete_flags;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Directory_Delete_Params_Data>;

    Directory_Delete_Params_Data();
    ~Directory_Delete_Params_Data() = delete;
};
static_assert(sizeof(Directory_Delete_Params_Data) == 24, "Bad sizeof(Directory_Delete_Params_Data)");
class Directory_Delete_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Directory_Delete_ResponseParams_Data>;

    Directory_Delete_ResponseParams_Data();
    ~Directory_Delete_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_Delete_ResponseParams_Data) == 16, "Bad sizeof(Directory_Delete_ResponseParams_Data)");
class Directory_Exists_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> path;

private:
    friend class mojo::internal::MessageFragment<Directory_Exists_Params_Data>;

    Directory_Exists_Params_Data();
    ~Directory_Exists_Params_Data() = delete;
};
static_assert(sizeof(Directory_Exists_Params_Data) == 16, "Bad sizeof(Directory_Exists_Params_Data)");
class Directory_Exists_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t exists : 1;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<Directory_Exists_ResponseParams_Data>;

    Directory_Exists_ResponseParams_Data();
    ~Directory_Exists_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_Exists_ResponseParams_Data) == 16, "Bad sizeof(Directory_Exists_ResponseParams_Data)");
class Directory_IsWritable_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> path;

private:
    friend class mojo::internal::MessageFragment<Directory_IsWritable_Params_Data>;

    Directory_IsWritable_Params_Data();
    ~Directory_IsWritable_Params_Data() = delete;
};
static_assert(sizeof(Directory_IsWritable_Params_Data) == 16, "Bad sizeof(Directory_IsWritable_Params_Data)");
class Directory_IsWritable_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t is_writable : 1;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<Directory_IsWritable_ResponseParams_Data>;

    Directory_IsWritable_ResponseParams_Data();
    ~Directory_IsWritable_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_IsWritable_ResponseParams_Data) == 16, "Bad sizeof(Directory_IsWritable_ResponseParams_Data)");
class Directory_Flush_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<Directory_Flush_Params_Data>;

    Directory_Flush_Params_Data();
    ~Directory_Flush_Params_Data() = delete;
};
static_assert(sizeof(Directory_Flush_Params_Data) == 8, "Bad sizeof(Directory_Flush_Params_Data)");
class Directory_Flush_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Directory_Flush_ResponseParams_Data>;

    Directory_Flush_ResponseParams_Data();
    ~Directory_Flush_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_Flush_ResponseParams_Data) == 16, "Bad sizeof(Directory_Flush_ResponseParams_Data)");
class Directory_StatFile_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> path;

private:
    friend class mojo::internal::MessageFragment<Directory_StatFile_Params_Data>;

    Directory_StatFile_Params_Data();
    ~Directory_StatFile_Params_Data() = delete;
};
static_assert(sizeof(Directory_StatFile_Params_Data) == 16, "Bad sizeof(Directory_StatFile_Params_Data)");
class Directory_StatFile_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::filesystem::mojom::internal::FileInformation_Data> file_information;

private:
    friend class mojo::internal::MessageFragment<Directory_StatFile_ResponseParams_Data>;

    Directory_StatFile_ResponseParams_Data();
    ~Directory_StatFile_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_StatFile_ResponseParams_Data) == 24, "Bad sizeof(Directory_StatFile_ResponseParams_Data)");
class Directory_Clone_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data directory;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Directory_Clone_Params_Data>;

    Directory_Clone_Params_Data();
    ~Directory_Clone_Params_Data() = delete;
};
static_assert(sizeof(Directory_Clone_Params_Data) == 16, "Bad sizeof(Directory_Clone_Params_Data)");
class Directory_ReadEntireFile_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> path;

private:
    friend class mojo::internal::MessageFragment<Directory_ReadEntireFile_Params_Data>;

    Directory_ReadEntireFile_Params_Data();
    ~Directory_ReadEntireFile_Params_Data() = delete;
};
static_assert(sizeof(Directory_ReadEntireFile_Params_Data) == 16, "Bad sizeof(Directory_ReadEntireFile_Params_Data)");
class Directory_ReadEntireFile_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> data;

private:
    friend class mojo::internal::MessageFragment<Directory_ReadEntireFile_ResponseParams_Data>;

    Directory_ReadEntireFile_ResponseParams_Data();
    ~Directory_ReadEntireFile_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_ReadEntireFile_ResponseParams_Data) == 24, "Bad sizeof(Directory_ReadEntireFile_ResponseParams_Data)");
class Directory_WriteFile_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> path;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> data;

private:
    friend class mojo::internal::MessageFragment<Directory_WriteFile_Params_Data>;

    Directory_WriteFile_Params_Data();
    ~Directory_WriteFile_Params_Data() = delete;
};
static_assert(sizeof(Directory_WriteFile_Params_Data) == 24, "Bad sizeof(Directory_WriteFile_Params_Data)");
class Directory_WriteFile_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Directory_WriteFile_ResponseParams_Data>;

    Directory_WriteFile_ResponseParams_Data();
    ~Directory_WriteFile_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_WriteFile_ResponseParams_Data) == 16, "Bad sizeof(Directory_WriteFile_ResponseParams_Data)");

} // namespace internal

class Directory_Read_ParamsDataView {
public:
    Directory_Read_ParamsDataView() = default;

    Directory_Read_ParamsDataView(internal::Directory_Read_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::Directory_Read_Params_Data* data_ = nullptr;
};

class Directory_Read_ResponseParamsDataView {
public:
    Directory_Read_ResponseParamsDataView() = default;

    Directory_Read_ResponseParamsDataView(internal::Directory_Read_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadError(UserType* output) const
    {
        auto data_value = data_->error;
