// third_party/blink/public/mojom/payments/payment_request.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_PAYMENTS_PAYMENT_REQUEST_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_PAYMENTS_PAYMENT_REQUEST_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace payments::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequestClient_OnPaymentMethodChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> method_name;
    mojo::internal::Pointer<mojo::internal::String_Data> stringified_details;

private:
    friend class mojo::internal::MessageFragment<PaymentRequestClient_OnPaymentMethodChange_Params_Data>;

    PaymentRequestClient_OnPaymentMethodChange_Params_Data();
    ~PaymentRequestClient_OnPaymentMethodChange_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequestClient_OnPaymentMethodChange_Params_Data) == 24, "Bad sizeof(PaymentRequestClient_OnPaymentMethodChange_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequestClient_OnShippingAddressChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::payments::mojom::internal::PaymentAddress_Data> address;

private:
    friend class mojo::internal::MessageFragment<PaymentRequestClient_OnShippingAddressChange_Params_Data>;

    PaymentRequestClient_OnShippingAddressChange_Params_Data();
    ~PaymentRequestClient_OnShippingAddressChange_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequestClient_OnShippingAddressChange_Params_Data) == 16, "Bad sizeof(PaymentRequestClient_OnShippingAddressChange_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequestClient_OnShippingOptionChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> shipping_option_id;

private:
    friend class mojo::internal::MessageFragment<PaymentRequestClient_OnShippingOptionChange_Params_Data>;

    PaymentRequestClient_OnShippingOptionChange_Params_Data();
    ~PaymentRequestClient_OnShippingOptionChange_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequestClient_OnShippingOptionChange_Params_Data) == 16, "Bad sizeof(PaymentRequestClient_OnShippingOptionChange_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequestClient_OnPayerDetailChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PayerDetail_Data> detail;

private:
    friend class mojo::internal::MessageFragment<PaymentRequestClient_OnPayerDetailChange_Params_Data>;

    PaymentRequestClient_OnPayerDetailChange_Params_Data();
    ~PaymentRequestClient_OnPayerDetailChange_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequestClient_OnPayerDetailChange_Params_Data) == 16, "Bad sizeof(PaymentRequestClient_OnPayerDetailChange_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequestClient_OnPaymentResponse_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PaymentResponse_Data> response;

private:
    friend class mojo::internal::MessageFragment<PaymentRequestClient_OnPaymentResponse_Params_Data>;

    PaymentRequestClient_OnPaymentResponse_Params_Data();
    ~PaymentRequestClient_OnPaymentResponse_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequestClient_OnPaymentResponse_Params_Data) == 16, "Bad sizeof(PaymentRequestClient_OnPaymentResponse_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequestClient_OnError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<PaymentRequestClient_OnError_Params_Data>;

    PaymentRequestClient_OnError_Params_Data();
    ~PaymentRequestClient_OnError_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequestClient_OnError_Params_Data) == 24, "Bad sizeof(PaymentRequestClient_OnError_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequestClient_OnComplete_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PaymentRequestClient_OnComplete_Params_Data>;

    PaymentRequestClient_OnComplete_Params_Data();
    ~PaymentRequestClient_OnComplete_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequestClient_OnComplete_Params_Data) == 8, "Bad sizeof(PaymentRequestClient_OnComplete_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequestClient_OnAbort_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t aborted_successfully : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PaymentRequestClient_OnAbort_Params_Data>;

    PaymentRequestClient_OnAbort_Params_Data();
    ~PaymentRequestClient_OnAbort_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequestClient_OnAbort_Params_Data) == 16, "Bad sizeof(PaymentRequestClient_OnAbort_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequestClient_OnCanMakePayment_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PaymentRequestClient_OnCanMakePayment_Params_Data>;

    PaymentRequestClient_OnCanMakePayment_Params_Data();
    ~PaymentRequestClient_OnCanMakePayment_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequestClient_OnCanMakePayment_Params_Data) == 16, "Bad sizeof(PaymentRequestClient_OnCanMakePayment_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequestClient_OnHasEnrolledInstrument_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PaymentRequestClient_OnHasEnrolledInstrument_Params_Data>;

    PaymentRequestClient_OnHasEnrolledInstrument_Params_Data();
    ~PaymentRequestClient_OnHasEnrolledInstrument_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequestClient_OnHasEnrolledInstrument_Params_Data) == 16, "Bad sizeof(PaymentRequestClient_OnHasEnrolledInstrument_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequestClient_WarnNoFavicon_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PaymentRequestClient_WarnNoFavicon_Params_Data>;

    PaymentRequestClient_WarnNoFavicon_Params_Data();
    ~PaymentRequestClient_WarnNoFavicon_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequestClient_WarnNoFavicon_Params_Data) == 8, "Bad sizeof(PaymentRequestClient_WarnNoFavicon_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequestClient_AllowConnectToSource_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url_before_redirects;
    uint8_t did_follow_redirect : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PaymentRequestClient_AllowConnectToSource_Params_Data>;

    PaymentRequestClient_AllowConnectToSource_Params_Data();
    ~PaymentRequestClient_AllowConnectToSource_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequestClient_AllowConnectToSource_Params_Data) == 32, "Bad sizeof(PaymentRequestClient_AllowConnectToSource_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequestClient_AllowConnectToSource_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t allow : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PaymentRequestClient_AllowConnectToSource_ResponseParams_Data>;

    PaymentRequestClient_AllowConnectToSource_ResponseParams_Data();
    ~PaymentRequestClient_AllowConnectToSource_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(PaymentRequestClient_AllowConnectToSource_ResponseParams_Data) == 16, "Bad sizeof(PaymentRequestClient_AllowConnectToSource_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequest_Init_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data client;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::PaymentMethodData_Data>>> method_data;
    mojo::internal::Pointer<internal::PaymentDetails_Data> details;
    mojo::internal::Pointer<internal::PaymentOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<PaymentRequest_Init_Params_Data>;

    PaymentRequest_Init_Params_Data();
    ~PaymentRequest_Init_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequest_Init_Params_Data) == 40, "Bad sizeof(PaymentRequest_Init_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequest_Show_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t wait_for_updated_details : 1;
    uint8_t had_user_activation : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PaymentRequest_Show_Params_Data>;

    PaymentRequest_Show_Params_Data();
    ~PaymentRequest_Show_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequest_Show_Params_Data) == 16, "Bad sizeof(PaymentRequest_Show_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequest_UpdateWith_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PaymentDetails_Data> details;

private:
    friend class mojo::internal::MessageFragment<PaymentRequest_UpdateWith_Params_Data>;

    PaymentRequest_UpdateWith_Params_Data();
    ~PaymentRequest_UpdateWith_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequest_UpdateWith_Params_Data) == 16, "Bad sizeof(PaymentRequest_UpdateWith_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequest_OnPaymentDetailsNotUpdated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PaymentRequest_OnPaymentDetailsNotUpdated_Params_Data>;

    PaymentRequest_OnPaymentDetailsNotUpdated_Params_Data();
    ~PaymentRequest_OnPaymentDetailsNotUpdated_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequest_OnPaymentDetailsNotUpdated_Params_Data) == 8, "Bad sizeof(PaymentRequest_OnPaymentDetailsNotUpdated_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequest_Abort_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PaymentRequest_Abort_Params_Data>;

    PaymentRequest_Abort_Params_Data();
    ~PaymentRequest_Abort_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequest_Abort_Params_Data) == 8, "Bad sizeof(PaymentRequest_Abort_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequest_Complete_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PaymentRequest_Complete_Params_Data>;

    PaymentRequest_Complete_Params_Data();
    ~PaymentRequest_Complete_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequest_Complete_Params_Data) == 16, "Bad sizeof(PaymentRequest_Complete_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequest_Retry_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::payments::mojom::internal::PaymentValidationErrors_Data> errors;

private:
    friend class mojo::internal::MessageFragment<PaymentRequest_Retry_Params_Data>;

    PaymentRequest_Retry_Params_Data();
    ~PaymentRequest_Retry_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequest_Retry_Params_Data) == 16, "Bad sizeof(PaymentRequest_Retry_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequest_CanMakePayment_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PaymentRequest_CanMakePayment_Params_Data>;

    PaymentRequest_CanMakePayment_Params_Data();
    ~PaymentRequest_CanMakePayment_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequest_CanMakePayment_Params_Data) == 8, "Bad sizeof(PaymentRequest_CanMakePayment_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentRequest_HasEnrolledInstrument_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PaymentRequest_HasEnrolledInstrument_Params_Data>;

    PaymentRequest_HasEnrolledInstrument_Params_Data();
    ~PaymentRequest_HasEnrolledInstrument_Params_Data() = delete;
};
static_assert(sizeof(PaymentRequest_HasEnrolledInstrument_Params_Data) == 8, "Bad sizeof(PaymentRequest_HasEnrolledInstrument_Params_Data)");

} // namespace internal

class PaymentRequestClient_OnPaymentMethodChange_ParamsDataView {
public:
    PaymentRequestClient_OnPaymentMethodChange_ParamsDataView() = default;

    PaymentRequestClient_OnPaymentMethodChange_ParamsDataView(internal::PaymentRequestClient_OnPaymentMethodChange_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetMethodNameDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadMethodName(UserType* output)
    {

        auto* pointer = data_->method_name.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }
    inline void GetStringifiedDetailsDataView(mojo::StringDataView* output);

