// third_party/blink/public/mojom/payments/payment_app.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_PAYMENTS_PAYMENT_APP_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_PAYMENTS_PAYMENT_APP_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace payments::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentManager_Init_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> context_url;
    mojo::internal::Pointer<mojo::internal::String_Data> service_worker_scope;

private:
    friend class mojo::internal::MessageFragment<PaymentManager_Init_Params_Data>;

    PaymentManager_Init_Params_Data();
    ~PaymentManager_Init_Params_Data() = delete;
};
static_assert(sizeof(PaymentManager_Init_Params_Data) == 24, "Bad sizeof(PaymentManager_Init_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentManager_DeletePaymentInstrument_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> instrument_key;

private:
    friend class mojo::internal::MessageFragment<PaymentManager_DeletePaymentInstrument_Params_Data>;

    PaymentManager_DeletePaymentInstrument_Params_Data();
    ~PaymentManager_DeletePaymentInstrument_Params_Data() = delete;
};
static_assert(sizeof(PaymentManager_DeletePaymentInstrument_Params_Data) == 16, "Bad sizeof(PaymentManager_DeletePaymentInstrument_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentManager_DeletePaymentInstrument_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PaymentManager_DeletePaymentInstrument_ResponseParams_Data>;

    PaymentManager_DeletePaymentInstrument_ResponseParams_Data();
    ~PaymentManager_DeletePaymentInstrument_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(PaymentManager_DeletePaymentInstrument_ResponseParams_Data) == 16, "Bad sizeof(PaymentManager_DeletePaymentInstrument_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentManager_GetPaymentInstrument_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> instrument_key;

private:
    friend class mojo::internal::MessageFragment<PaymentManager_GetPaymentInstrument_Params_Data>;

    PaymentManager_GetPaymentInstrument_Params_Data();
    ~PaymentManager_GetPaymentInstrument_Params_Data() = delete;
};
static_assert(sizeof(PaymentManager_GetPaymentInstrument_Params_Data) == 16, "Bad sizeof(PaymentManager_GetPaymentInstrument_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentManager_GetPaymentInstrument_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PaymentInstrument_Data> instrument;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PaymentManager_GetPaymentInstrument_ResponseParams_Data>;

    PaymentManager_GetPaymentInstrument_ResponseParams_Data();
    ~PaymentManager_GetPaymentInstrument_ResponseParams_Data() = delete;
};
static_assert(sizeof(PaymentManager_GetPaymentInstrument_ResponseParams_Data) == 24, "Bad sizeof(PaymentManager_GetPaymentInstrument_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentManager_KeysOfPaymentInstruments_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PaymentManager_KeysOfPaymentInstruments_Params_Data>;

    PaymentManager_KeysOfPaymentInstruments_Params_Data();
    ~PaymentManager_KeysOfPaymentInstruments_Params_Data() = delete;
};
static_assert(sizeof(PaymentManager_KeysOfPaymentInstruments_Params_Data) == 8, "Bad sizeof(PaymentManager_KeysOfPaymentInstruments_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentManager_KeysOfPaymentInstruments_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> keys;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PaymentManager_KeysOfPaymentInstruments_ResponseParams_Data>;

    PaymentManager_KeysOfPaymentInstruments_ResponseParams_Data();
    ~PaymentManager_KeysOfPaymentInstruments_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(PaymentManager_KeysOfPaymentInstruments_ResponseParams_Data) == 24, "Bad sizeof(PaymentManager_KeysOfPaymentInstruments_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentManager_HasPaymentInstrument_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> instrument_key;

private:
    friend class mojo::internal::MessageFragment<PaymentManager_HasPaymentInstrument_Params_Data>;

    PaymentManager_HasPaymentInstrument_Params_Data();
    ~PaymentManager_HasPaymentInstrument_Params_Data() = delete;
};
static_assert(sizeof(PaymentManager_HasPaymentInstrument_Params_Data) == 16, "Bad sizeof(PaymentManager_HasPaymentInstrument_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentManager_HasPaymentInstrument_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PaymentManager_HasPaymentInstrument_ResponseParams_Data>;

    PaymentManager_HasPaymentInstrument_ResponseParams_Data();
    ~PaymentManager_HasPaymentInstrument_ResponseParams_Data() = delete;
};
static_assert(sizeof(PaymentManager_HasPaymentInstrument_ResponseParams_Data) == 16, "Bad sizeof(PaymentManager_HasPaymentInstrument_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentManager_SetPaymentInstrument_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> instrument_key;
    mojo::internal::Pointer<internal::PaymentInstrument_Data> instrument;

private:
    friend class mojo::internal::MessageFragment<PaymentManager_SetPaymentInstrument_Params_Data>;

    PaymentManager_SetPaymentInstrument_Params_Data();
    ~PaymentManager_SetPaymentInstrument_Params_Data() = delete;
};
static_assert(sizeof(PaymentManager_SetPaymentInstrument_Params_Data) == 24, "Bad sizeof(PaymentManager_SetPaymentInstrument_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentManager_SetPaymentInstrument_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PaymentManager_SetPaymentInstrument_ResponseParams_Data>;

    PaymentManager_SetPaymentInstrument_ResponseParams_Data();
    ~PaymentManager_SetPaymentInstrument_ResponseParams_Data() = delete;
};
static_assert(sizeof(PaymentManager_SetPaymentInstrument_ResponseParams_Data) == 16, "Bad sizeof(PaymentManager_SetPaymentInstrument_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentManager_ClearPaymentInstruments_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PaymentManager_ClearPaymentInstruments_Params_Data>;

    PaymentManager_ClearPaymentInstruments_Params_Data();
    ~PaymentManager_ClearPaymentInstruments_Params_Data() = delete;
};
static_assert(sizeof(PaymentManager_ClearPaymentInstruments_Params_Data) == 8, "Bad sizeof(PaymentManager_ClearPaymentInstruments_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentManager_ClearPaymentInstruments_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PaymentManager_ClearPaymentInstruments_ResponseParams_Data>;

    PaymentManager_ClearPaymentInstruments_ResponseParams_Data();
    ~PaymentManager_ClearPaymentInstruments_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(PaymentManager_ClearPaymentInstruments_ResponseParams_Data) == 16, "Bad sizeof(PaymentManager_ClearPaymentInstruments_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentManager_SetUserHint_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> user_hint;

private:
    friend class mojo::internal::MessageFragment<PaymentManager_SetUserHint_Params_Data>;

    PaymentManager_SetUserHint_Params_Data();
    ~PaymentManager_SetUserHint_Params_Data() = delete;
};
static_assert(sizeof(PaymentManager_SetUserHint_Params_Data) == 16, "Bad sizeof(PaymentManager_SetUserHint_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentManager_EnableDelegations_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> delegations;

private:
    friend class mojo::internal::MessageFragment<PaymentManager_EnableDelegations_Params_Data>;

    PaymentManager_EnableDelegations_Params_Data();
    ~PaymentManager_EnableDelegations_Params_Data() = delete;
};
static_assert(sizeof(PaymentManager_EnableDelegations_Params_Data) == 16, "Bad sizeof(PaymentManager_EnableDelegations_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentManager_EnableDelegations_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PaymentManager_EnableDelegations_ResponseParams_Data>;

    PaymentManager_EnableDelegations_ResponseParams_Data();
    ~PaymentManager_EnableDelegations_ResponseParams_Data() = delete;
};
static_assert(sizeof(PaymentManager_EnableDelegations_ResponseParams_Data) == 16, "Bad sizeof(PaymentManager_EnableDelegations_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentHandlerResponseCallback_OnResponseForAbortPayment_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t payment_aborted : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PaymentHandlerResponseCallback_OnResponseForAbortPayment_Params_Data>;

    PaymentHandlerResponseCallback_OnResponseForAbortPayment_Params_Data();
    ~PaymentHandlerResponseCallback_OnResponseForAbortPayment_Params_Data() = delete;
};
static_assert(sizeof(PaymentHandlerResponseCallback_OnResponseForAbortPayment_Params_Data) == 16,
    "Bad sizeof(PaymentHandlerResponseCallback_OnResponseForAbortPayment_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentHandlerResponseCallback_OnResponseForCanMakePayment_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CanMakePaymentResponse_Data> response;

private:
    friend class mojo::internal::MessageFragment<PaymentHandlerResponseCallback_OnResponseForCanMakePayment_Params_Data>;

    PaymentHandlerResponseCallback_OnResponseForCanMakePayment_Params_Data();
    ~PaymentHandlerResponseCallback_OnResponseForCanMakePayment_Params_Data() = delete;
};
static_assert(sizeof(PaymentHandlerResponseCallback_OnResponseForCanMakePayment_Params_Data) == 16,
    "Bad sizeof(PaymentHandlerResponseCallback_OnResponseForCanMakePayment_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PaymentHandlerResponseCallback_OnResponseForPaymentRequest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PaymentHandlerResponse_Data> response;

private:
    friend class mojo::internal::MessageFragment<PaymentHandlerResponseCallback_OnResponseForPaymentRequest_Params_Data>;

    PaymentHandlerResponseCallback_OnResponseForPaymentRequest_Params_Data();
    ~PaymentHandlerResponseCallback_OnResponseForPaymentRequest_Params_Data() = delete;
};
static_assert(sizeof(PaymentHandlerResponseCallback_OnResponseForPaymentRequest_Params_Data) == 16,
    "Bad sizeof(PaymentHandlerResponseCallback_OnResponseForPaymentRequest_Params_Data)");

} // namespace internal

class PaymentManager_Init_ParamsDataView {
public:
    PaymentManager_Init_ParamsDataView() = default;

    PaymentManager_Init_ParamsDataView(internal::PaymentManager_Init_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetContextUrlDataView(::url::mojom::UrlDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadContextUrl(UserType* output)
    {

        auto* pointer = data_->context_url.Get();
        return mojo::internal::Deserialize<::url::mojom::UrlDataView>(pointer, output, message_);
    }
    inline void GetServiceWorkerScopeDataView(mojo::StringDataView* output);

