// third_party/blink/public/mojom/file_system_access/file_system_access_file_handle.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_FILE_SYSTEM_ACCESS_FILE_SYSTEM_ACCESS_FILE_HANDLE_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_FILE_SYSTEM_ACCESS_FILE_SYSTEM_ACCESS_FILE_HANDLE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_GetPermissionStatus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t writable : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_GetPermissionStatus_Params_Data>;

    FileSystemAccessFileHandle_GetPermissionStatus_Params_Data();
    ~FileSystemAccessFileHandle_GetPermissionStatus_Params_Data() = delete;
};
static_assert(
    sizeof(FileSystemAccessFileHandle_GetPermissionStatus_Params_Data) == 16, "Bad sizeof(FileSystemAccessFileHandle_GetPermissionStatus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_GetPermissionStatus_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_GetPermissionStatus_ResponseParams_Data>;

    FileSystemAccessFileHandle_GetPermissionStatus_ResponseParams_Data();
    ~FileSystemAccessFileHandle_GetPermissionStatus_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_GetPermissionStatus_ResponseParams_Data) == 16,
    "Bad sizeof(FileSystemAccessFileHandle_GetPermissionStatus_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_RequestPermission_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t writable : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_RequestPermission_Params_Data>;

    FileSystemAccessFileHandle_RequestPermission_Params_Data();
    ~FileSystemAccessFileHandle_RequestPermission_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_RequestPermission_Params_Data) == 16, "Bad sizeof(FileSystemAccessFileHandle_RequestPermission_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_RequestPermission_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_RequestPermission_ResponseParams_Data>;

    FileSystemAccessFileHandle_RequestPermission_ResponseParams_Data();
    ~FileSystemAccessFileHandle_RequestPermission_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_RequestPermission_ResponseParams_Data) == 24,
    "Bad sizeof(FileSystemAccessFileHandle_RequestPermission_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_AsBlob_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_AsBlob_Params_Data>;

    FileSystemAccessFileHandle_AsBlob_Params_Data();
    ~FileSystemAccessFileHandle_AsBlob_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_AsBlob_Params_Data) == 8, "Bad sizeof(FileSystemAccessFileHandle_AsBlob_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_AsBlob_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FileInfo_Data> info;
    mojo::internal::Pointer<::blink::mojom::internal::SerializedBlob_Data> blob;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_AsBlob_ResponseParams_Data>;

    FileSystemAccessFileHandle_AsBlob_ResponseParams_Data();
    ~FileSystemAccessFileHandle_AsBlob_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_AsBlob_ResponseParams_Data) == 32, "Bad sizeof(FileSystemAccessFileHandle_AsBlob_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_CreateFileWriter_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t keep_existing_data : 1;
    uint8_t auto_close : 1;
    uint8_t pad1_[3];
    int32_t mode;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_CreateFileWriter_Params_Data>;

    FileSystemAccessFileHandle_CreateFileWriter_Params_Data();
    ~FileSystemAccessFileHandle_CreateFileWriter_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_CreateFileWriter_Params_Data) == 16, "Bad sizeof(FileSystemAccessFileHandle_CreateFileWriter_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_CreateFileWriter_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;
    mojo::internal::Interface_Data writer;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_CreateFileWriter_ResponseParams_Data>;

    FileSystemAccessFileHandle_CreateFileWriter_ResponseParams_Data();
    ~FileSystemAccessFileHandle_CreateFileWriter_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_CreateFileWriter_ResponseParams_Data) == 24,
    "Bad sizeof(FileSystemAccessFileHandle_CreateFileWriter_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_Rename_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> new_entry_name;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_Rename_Params_Data>;

    FileSystemAccessFileHandle_Rename_Params_Data();
    ~FileSystemAccessFileHandle_Rename_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_Rename_Params_Data) == 16, "Bad sizeof(FileSystemAccessFileHandle_Rename_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_Rename_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_Rename_ResponseParams_Data>;

    FileSystemAccessFileHandle_Rename_ResponseParams_Data();
    ~FileSystemAccessFileHandle_Rename_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_Rename_ResponseParams_Data) == 16, "Bad sizeof(FileSystemAccessFileHandle_Rename_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_Move_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data destination_directory;
    mojo::internal::Pointer<mojo::internal::String_Data> new_entry_name;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_Move_Params_Data>;

    FileSystemAccessFileHandle_Move_Params_Data();
    ~FileSystemAccessFileHandle_Move_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_Move_Params_Data) == 24, "Bad sizeof(FileSystemAccessFileHandle_Move_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_Move_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_Move_ResponseParams_Data>;

    FileSystemAccessFileHandle_Move_ResponseParams_Data();
    ~FileSystemAccessFileHandle_Move_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_Move_ResponseParams_Data) == 16, "Bad sizeof(FileSystemAccessFileHandle_Move_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_Remove_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_Remove_Params_Data>;

    FileSystemAccessFileHandle_Remove_Params_Data();
    ~FileSystemAccessFileHandle_Remove_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_Remove_Params_Data) == 8, "Bad sizeof(FileSystemAccessFileHandle_Remove_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_Remove_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_Remove_ResponseParams_Data>;

    FileSystemAccessFileHandle_Remove_ResponseParams_Data();
    ~FileSystemAccessFileHandle_Remove_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_Remove_ResponseParams_Data) == 16, "Bad sizeof(FileSystemAccessFileHandle_Remove_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_OpenAccessHandle_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t mode;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_OpenAccessHandle_Params_Data>;

    FileSystemAccessFileHandle_OpenAccessHandle_Params_Data();
    ~FileSystemAccessFileHandle_OpenAccessHandle_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_OpenAccessHandle_Params_Data) == 16, "Bad sizeof(FileSystemAccessFileHandle_OpenAccessHandle_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_OpenAccessHandle_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;
    internal::FileSystemAccessAccessHandleFile_Data file;
    mojo::internal::Interface_Data access_handle_host;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_OpenAccessHandle_ResponseParams_Data>;

    FileSystemAccessFileHandle_OpenAccessHandle_ResponseParams_Data();
    ~FileSystemAccessFileHandle_OpenAccessHandle_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_OpenAccessHandle_ResponseParams_Data) == 40,
    "Bad sizeof(FileSystemAccessFileHandle_OpenAccessHandle_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_IsSameEntry_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data other;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_IsSameEntry_Params_Data>;

    FileSystemAccessFileHandle_IsSameEntry_Params_Data();
    ~FileSystemAccessFileHandle_IsSameEntry_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_IsSameEntry_Params_Data) == 16, "Bad sizeof(FileSystemAccessFileHandle_IsSameEntry_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_IsSameEntry_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;
    uint8_t is_same : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_IsSameEntry_ResponseParams_Data>;

    FileSystemAccessFileHandle_IsSameEntry_ResponseParams_Data();
    ~FileSystemAccessFileHandle_IsSameEntry_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(FileSystemAccessFileHandle_IsSameEntry_ResponseParams_Data) == 24, "Bad sizeof(FileSystemAccessFileHandle_IsSameEntry_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_Transfer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data token;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_Transfer_Params_Data>;

    FileSystemAccessFileHandle_Transfer_Params_Data();
    ~FileSystemAccessFileHandle_Transfer_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_Transfer_Params_Data) == 16, "Bad sizeof(FileSystemAccessFileHandle_Transfer_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_GetUniqueId_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_GetUniqueId_Params_Data>;

    FileSystemAccessFileHandle_GetUniqueId_Params_Data();
    ~FileSystemAccessFileHandle_GetUniqueId_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_GetUniqueId_Params_Data) == 8, "Bad sizeof(FileSystemAccessFileHandle_GetUniqueId_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_GetUniqueId_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;
    mojo::internal::Pointer<mojo::internal::String_Data> id;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_GetUniqueId_ResponseParams_Data>;

    FileSystemAccessFileHandle_GetUniqueId_ResponseParams_Data();
    ~FileSystemAccessFileHandle_GetUniqueId_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(FileSystemAccessFileHandle_GetUniqueId_ResponseParams_Data) == 24, "Bad sizeof(FileSystemAccessFileHandle_GetUniqueId_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_GetCloudIdentifiers_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_GetCloudIdentifiers_Params_Data>;

    FileSystemAccessFileHandle_GetCloudIdentifiers_Params_Data();
    ~FileSystemAccessFileHandle_GetCloudIdentifiers_Params_Data() = delete;
};
static_assert(
    sizeof(FileSystemAccessFileHandle_GetCloudIdentifiers_Params_Data) == 8, "Bad sizeof(FileSystemAccessFileHandle_GetCloudIdentifiers_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessFileHandle_GetCloudIdentifiers_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessCloudIdentifier_Data>>>
        cloud_identifiers;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessFileHandle_GetCloudIdentifiers_ResponseParams_Data>;

    FileSystemAccessFileHandle_GetCloudIdentifiers_ResponseParams_Data();
    ~FileSystemAccessFileHandle_GetCloudIdentifiers_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemAccessFileHandle_GetCloudIdentifiers_ResponseParams_Data) == 24,
    "Bad sizeof(FileSystemAccessFileHandle_GetCloudIdentifiers_ResponseParams_Data)");

} // namespace internal

class FileSystemAccessFileHandle_GetPermissionStatus_ParamsDataView {
public:
    FileSystemAccessFileHandle_GetPermissionStatus_ParamsDataView() = default;

    FileSystemAccessFileHandle_GetPermissionStatus_ParamsDataView(
        internal::FileSystemAccessFileHandle_GetPermissionStatus_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    bool writable() const
    {
        return data_->writable;
    }

private:
    internal::FileSystemAccessFileHandle_GetPermissionStatus_Params_Data* data_ = nullptr;
};

class FileSystemAccessFileHandle_GetPermissionStatus_ResponseParamsDataView {
public:
    FileSystemAccessFileHandle_GetPermissionStatus_ResponseParamsDataView() = default;

