// third_party/blink/public/mojom/file_system_access/file_system_access_directory_handle.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_FILE_SYSTEM_ACCESS_FILE_SYSTEM_ACCESS_DIRECTORY_HANDLE_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_FILE_SYSTEM_ACCESS_FILE_SYSTEM_ACCESS_DIRECTORY_HANDLE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryEntriesListener_DidReadDirectory_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::FileSystemAccessEntry_Data>>> entries;
    uint8_t has_more_entries : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryEntriesListener_DidReadDirectory_Params_Data>;

    FileSystemAccessDirectoryEntriesListener_DidReadDirectory_Params_Data();
    ~FileSystemAccessDirectoryEntriesListener_DidReadDirectory_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryEntriesListener_DidReadDirectory_Params_Data) == 32,
    "Bad sizeof(FileSystemAccessDirectoryEntriesListener_DidReadDirectory_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_GetPermissionStatus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t writable : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_GetPermissionStatus_Params_Data>;

    FileSystemAccessDirectoryHandle_GetPermissionStatus_Params_Data();
    ~FileSystemAccessDirectoryHandle_GetPermissionStatus_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_GetPermissionStatus_Params_Data) == 16,
    "Bad sizeof(FileSystemAccessDirectoryHandle_GetPermissionStatus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_GetPermissionStatus_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_GetPermissionStatus_ResponseParams_Data>;

    FileSystemAccessDirectoryHandle_GetPermissionStatus_ResponseParams_Data();
    ~FileSystemAccessDirectoryHandle_GetPermissionStatus_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_GetPermissionStatus_ResponseParams_Data) == 16,
    "Bad sizeof(FileSystemAccessDirectoryHandle_GetPermissionStatus_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_RequestPermission_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t writable : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_RequestPermission_Params_Data>;

    FileSystemAccessDirectoryHandle_RequestPermission_Params_Data();
    ~FileSystemAccessDirectoryHandle_RequestPermission_Params_Data() = delete;
};
static_assert(
    sizeof(FileSystemAccessDirectoryHandle_RequestPermission_Params_Data) == 16, "Bad sizeof(FileSystemAccessDirectoryHandle_RequestPermission_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_RequestPermission_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_RequestPermission_ResponseParams_Data>;

    FileSystemAccessDirectoryHandle_RequestPermission_ResponseParams_Data();
    ~FileSystemAccessDirectoryHandle_RequestPermission_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_RequestPermission_ResponseParams_Data) == 24,
    "Bad sizeof(FileSystemAccessDirectoryHandle_RequestPermission_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_GetFile_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> basename;
    uint8_t create : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_GetFile_Params_Data>;

    FileSystemAccessDirectoryHandle_GetFile_Params_Data();
    ~FileSystemAccessDirectoryHandle_GetFile_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_GetFile_Params_Data) == 24, "Bad sizeof(FileSystemAccessDirectoryHandle_GetFile_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_GetFile_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;
    mojo::internal::Interface_Data file;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_GetFile_ResponseParams_Data>;

    FileSystemAccessDirectoryHandle_GetFile_ResponseParams_Data();
    ~FileSystemAccessDirectoryHandle_GetFile_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(FileSystemAccessDirectoryHandle_GetFile_ResponseParams_Data) == 24, "Bad sizeof(FileSystemAccessDirectoryHandle_GetFile_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_GetDirectory_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> basename;
    uint8_t create : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_GetDirectory_Params_Data>;

    FileSystemAccessDirectoryHandle_GetDirectory_Params_Data();
    ~FileSystemAccessDirectoryHandle_GetDirectory_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_GetDirectory_Params_Data) == 24, "Bad sizeof(FileSystemAccessDirectoryHandle_GetDirectory_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_GetDirectory_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;
    mojo::internal::Interface_Data directory;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_GetDirectory_ResponseParams_Data>;

    FileSystemAccessDirectoryHandle_GetDirectory_ResponseParams_Data();
    ~FileSystemAccessDirectoryHandle_GetDirectory_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_GetDirectory_ResponseParams_Data) == 24,
    "Bad sizeof(FileSystemAccessDirectoryHandle_GetDirectory_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_GetEntries_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data listener;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_GetEntries_Params_Data>;

    FileSystemAccessDirectoryHandle_GetEntries_Params_Data();
    ~FileSystemAccessDirectoryHandle_GetEntries_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_GetEntries_Params_Data) == 16, "Bad sizeof(FileSystemAccessDirectoryHandle_GetEntries_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_Rename_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> new_entry_name;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_Rename_Params_Data>;

    FileSystemAccessDirectoryHandle_Rename_Params_Data();
    ~FileSystemAccessDirectoryHandle_Rename_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_Rename_Params_Data) == 16, "Bad sizeof(FileSystemAccessDirectoryHandle_Rename_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_Rename_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_Rename_ResponseParams_Data>;

    FileSystemAccessDirectoryHandle_Rename_ResponseParams_Data();
    ~FileSystemAccessDirectoryHandle_Rename_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(FileSystemAccessDirectoryHandle_Rename_ResponseParams_Data) == 16, "Bad sizeof(FileSystemAccessDirectoryHandle_Rename_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_Move_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data destination_directory;
    mojo::internal::Pointer<mojo::internal::String_Data> new_entry_name;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_Move_Params_Data>;

    FileSystemAccessDirectoryHandle_Move_Params_Data();
    ~FileSystemAccessDirectoryHandle_Move_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_Move_Params_Data) == 24, "Bad sizeof(FileSystemAccessDirectoryHandle_Move_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_Move_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_Move_ResponseParams_Data>;

    FileSystemAccessDirectoryHandle_Move_ResponseParams_Data();
    ~FileSystemAccessDirectoryHandle_Move_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_Move_ResponseParams_Data) == 16, "Bad sizeof(FileSystemAccessDirectoryHandle_Move_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_Remove_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t recurse : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_Remove_Params_Data>;

    FileSystemAccessDirectoryHandle_Remove_Params_Data();
    ~FileSystemAccessDirectoryHandle_Remove_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_Remove_Params_Data) == 16, "Bad sizeof(FileSystemAccessDirectoryHandle_Remove_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_Remove_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_Remove_ResponseParams_Data>;

    FileSystemAccessDirectoryHandle_Remove_ResponseParams_Data();
    ~FileSystemAccessDirectoryHandle_Remove_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(FileSystemAccessDirectoryHandle_Remove_ResponseParams_Data) == 16, "Bad sizeof(FileSystemAccessDirectoryHandle_Remove_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_RemoveEntry_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> basename;
    uint8_t recurse : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_RemoveEntry_Params_Data>;

    FileSystemAccessDirectoryHandle_RemoveEntry_Params_Data();
    ~FileSystemAccessDirectoryHandle_RemoveEntry_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_RemoveEntry_Params_Data) == 24, "Bad sizeof(FileSystemAccessDirectoryHandle_RemoveEntry_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_RemoveEntry_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_RemoveEntry_ResponseParams_Data>;

    FileSystemAccessDirectoryHandle_RemoveEntry_ResponseParams_Data();
    ~FileSystemAccessDirectoryHandle_RemoveEntry_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_RemoveEntry_ResponseParams_Data) == 16,
    "Bad sizeof(FileSystemAccessDirectoryHandle_RemoveEntry_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_Resolve_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data possible_child;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_Resolve_Params_Data>;

    FileSystemAccessDirectoryHandle_Resolve_Params_Data();
    ~FileSystemAccessDirectoryHandle_Resolve_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_Resolve_Params_Data) == 16, "Bad sizeof(FileSystemAccessDirectoryHandle_Resolve_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_Resolve_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> path;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_Resolve_ResponseParams_Data>;

    FileSystemAccessDirectoryHandle_Resolve_ResponseParams_Data();
    ~FileSystemAccessDirectoryHandle_Resolve_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(FileSystemAccessDirectoryHandle_Resolve_ResponseParams_Data) == 24, "Bad sizeof(FileSystemAccessDirectoryHandle_Resolve_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_Transfer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data token;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_Transfer_Params_Data>;

    FileSystemAccessDirectoryHandle_Transfer_Params_Data();
    ~FileSystemAccessDirectoryHandle_Transfer_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_Transfer_Params_Data) == 16, "Bad sizeof(FileSystemAccessDirectoryHandle_Transfer_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_GetUniqueId_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_GetUniqueId_Params_Data>;

    FileSystemAccessDirectoryHandle_GetUniqueId_Params_Data();
    ~FileSystemAccessDirectoryHandle_GetUniqueId_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_GetUniqueId_Params_Data) == 8, "Bad sizeof(FileSystemAccessDirectoryHandle_GetUniqueId_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_GetUniqueId_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;
    mojo::internal::Pointer<mojo::internal::String_Data> id;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_GetUniqueId_ResponseParams_Data>;

    FileSystemAccessDirectoryHandle_GetUniqueId_ResponseParams_Data();
    ~FileSystemAccessDirectoryHandle_GetUniqueId_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_GetUniqueId_ResponseParams_Data) == 24,
    "Bad sizeof(FileSystemAccessDirectoryHandle_GetUniqueId_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_GetCloudIdentifiers_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_GetCloudIdentifiers_Params_Data>;

    FileSystemAccessDirectoryHandle_GetCloudIdentifiers_Params_Data();
    ~FileSystemAccessDirectoryHandle_GetCloudIdentifiers_Params_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_GetCloudIdentifiers_Params_Data) == 8,
    "Bad sizeof(FileSystemAccessDirectoryHandle_GetCloudIdentifiers_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FileSystemAccessDirectoryHandle_GetCloudIdentifiers_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessCloudIdentifier_Data>>>
        cloud_identifiers;

private:
    friend class mojo::internal::MessageFragment<FileSystemAccessDirectoryHandle_GetCloudIdentifiers_ResponseParams_Data>;

    FileSystemAccessDirectoryHandle_GetCloudIdentifiers_ResponseParams_Data();
    ~FileSystemAccessDirectoryHandle_GetCloudIdentifiers_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileSystemAccessDirectoryHandle_GetCloudIdentifiers_ResponseParams_Data) == 24,
    "Bad sizeof(FileSystemAccessDirectoryHandle_GetCloudIdentifiers_ResponseParams_Data)");

} // namespace internal

class FileSystemAccessDirectoryEntriesListener_DidReadDirectory_ParamsDataView {
public:
    FileSystemAccessDirectoryEntriesListener_DidReadDirectory_ParamsDataView() = default;

    FileSystemAccessDirectoryEntriesListener_DidReadDirectory_ParamsDataView(
        internal::FileSystemAccessDirectoryEntriesListener_DidReadDirectory_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetResultDataView(::blink::mojom::FileSystemAccessErrorDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadResult(UserType* output)
    {

        auto* pointer = data_->result.Get();
