// third_party/blink/public/mojom/buckets/bucket_manager_host.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_BUCKETS_BUCKET_MANAGER_HOST_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_BUCKETS_BUCKET_MANAGER_HOST_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_Persist_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<BucketHost_Persist_Params_Data>;

    BucketHost_Persist_Params_Data();
    ~BucketHost_Persist_Params_Data() = delete;
};
static_assert(sizeof(BucketHost_Persist_Params_Data) == 8, "Bad sizeof(BucketHost_Persist_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_Persist_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t persisted : 1;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<BucketHost_Persist_ResponseParams_Data>;

    BucketHost_Persist_ResponseParams_Data();
    ~BucketHost_Persist_ResponseParams_Data() = delete;
};
static_assert(sizeof(BucketHost_Persist_ResponseParams_Data) == 16, "Bad sizeof(BucketHost_Persist_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_Persisted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<BucketHost_Persisted_Params_Data>;

    BucketHost_Persisted_Params_Data();
    ~BucketHost_Persisted_Params_Data() = delete;
};
static_assert(sizeof(BucketHost_Persisted_Params_Data) == 8, "Bad sizeof(BucketHost_Persisted_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_Persisted_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t persisted : 1;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<BucketHost_Persisted_ResponseParams_Data>;

    BucketHost_Persisted_ResponseParams_Data();
    ~BucketHost_Persisted_ResponseParams_Data() = delete;
};
static_assert(sizeof(BucketHost_Persisted_ResponseParams_Data) == 16, "Bad sizeof(BucketHost_Persisted_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_Estimate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<BucketHost_Estimate_Params_Data>;

    BucketHost_Estimate_Params_Data();
    ~BucketHost_Estimate_Params_Data() = delete;
};
static_assert(sizeof(BucketHost_Estimate_Params_Data) == 8, "Bad sizeof(BucketHost_Estimate_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_Estimate_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t current_usage;
    int64_t current_quota;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<BucketHost_Estimate_ResponseParams_Data>;

    BucketHost_Estimate_ResponseParams_Data();
    ~BucketHost_Estimate_ResponseParams_Data() = delete;
};
static_assert(sizeof(BucketHost_Estimate_ResponseParams_Data) == 32, "Bad sizeof(BucketHost_Estimate_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_Durability_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<BucketHost_Durability_Params_Data>;

    BucketHost_Durability_Params_Data();
    ~BucketHost_Durability_Params_Data() = delete;
};
static_assert(sizeof(BucketHost_Durability_Params_Data) == 8, "Bad sizeof(BucketHost_Durability_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_Durability_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t durability;
    uint8_t success : 1;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<BucketHost_Durability_ResponseParams_Data>;

    BucketHost_Durability_ResponseParams_Data();
    ~BucketHost_Durability_ResponseParams_Data() = delete;
};
static_assert(sizeof(BucketHost_Durability_ResponseParams_Data) == 16, "Bad sizeof(BucketHost_Durability_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_SetExpires_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> expires;

private:
    friend class mojo::internal::MessageFragment<BucketHost_SetExpires_Params_Data>;

    BucketHost_SetExpires_Params_Data();
    ~BucketHost_SetExpires_Params_Data() = delete;
};
static_assert(sizeof(BucketHost_SetExpires_Params_Data) == 16, "Bad sizeof(BucketHost_SetExpires_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_SetExpires_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<BucketHost_SetExpires_ResponseParams_Data>;

    BucketHost_SetExpires_ResponseParams_Data();
    ~BucketHost_SetExpires_ResponseParams_Data() = delete;
};
static_assert(sizeof(BucketHost_SetExpires_ResponseParams_Data) == 16, "Bad sizeof(BucketHost_SetExpires_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_Expires_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<BucketHost_Expires_Params_Data>;

    BucketHost_Expires_Params_Data();
    ~BucketHost_Expires_Params_Data() = delete;
};
static_assert(sizeof(BucketHost_Expires_Params_Data) == 8, "Bad sizeof(BucketHost_Expires_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_Expires_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> expires;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<BucketHost_Expires_ResponseParams_Data>;

    BucketHost_Expires_ResponseParams_Data();
    ~BucketHost_Expires_ResponseParams_Data() = delete;
};
static_assert(sizeof(BucketHost_Expires_ResponseParams_Data) == 24, "Bad sizeof(BucketHost_Expires_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_GetIdbFactory_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data idb_factory;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<BucketHost_GetIdbFactory_Params_Data>;

    BucketHost_GetIdbFactory_Params_Data();
    ~BucketHost_GetIdbFactory_Params_Data() = delete;
};
static_assert(sizeof(BucketHost_GetIdbFactory_Params_Data) == 16, "Bad sizeof(BucketHost_GetIdbFactory_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_GetLockManager_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data lock_manager;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<BucketHost_GetLockManager_Params_Data>;

    BucketHost_GetLockManager_Params_Data();
    ~BucketHost_GetLockManager_Params_Data() = delete;
};
static_assert(sizeof(BucketHost_GetLockManager_Params_Data) == 16, "Bad sizeof(BucketHost_GetLockManager_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_GetCaches_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data cache_storage;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<BucketHost_GetCaches_Params_Data>;

    BucketHost_GetCaches_Params_Data();
    ~BucketHost_GetCaches_Params_Data() = delete;
};
static_assert(sizeof(BucketHost_GetCaches_Params_Data) == 16, "Bad sizeof(BucketHost_GetCaches_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_GetDirectory_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<BucketHost_GetDirectory_Params_Data>;

    BucketHost_GetDirectory_Params_Data();
    ~BucketHost_GetDirectory_Params_Data() = delete;
};
static_assert(sizeof(BucketHost_GetDirectory_Params_Data) == 8, "Bad sizeof(BucketHost_GetDirectory_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_GetDirectory_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;
    mojo::internal::Interface_Data directory;

private:
    friend class mojo::internal::MessageFragment<BucketHost_GetDirectory_ResponseParams_Data>;

    BucketHost_GetDirectory_ResponseParams_Data();
    ~BucketHost_GetDirectory_ResponseParams_Data() = delete;
};
static_assert(sizeof(BucketHost_GetDirectory_ResponseParams_Data) == 24, "Bad sizeof(BucketHost_GetDirectory_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_GetDirectoryForDevtools_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> directory_path_components;

private:
    friend class mojo::internal::MessageFragment<BucketHost_GetDirectoryForDevtools_Params_Data>;

    BucketHost_GetDirectoryForDevtools_Params_Data();
    ~BucketHost_GetDirectoryForDevtools_Params_Data() = delete;
};
static_assert(sizeof(BucketHost_GetDirectoryForDevtools_Params_Data) == 16, "Bad sizeof(BucketHost_GetDirectoryForDevtools_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketHost_GetDirectoryForDevtools_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;
    mojo::internal::Interface_Data directory;

private:
    friend class mojo::internal::MessageFragment<BucketHost_GetDirectoryForDevtools_ResponseParams_Data>;

    BucketHost_GetDirectoryForDevtools_ResponseParams_Data();
    ~BucketHost_GetDirectoryForDevtools_ResponseParams_Data() = delete;
};
static_assert(sizeof(BucketHost_GetDirectoryForDevtools_ResponseParams_Data) == 24, "Bad sizeof(BucketHost_GetDirectoryForDevtools_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketManagerHost_OpenBucket_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> name;
    mojo::internal::Pointer<internal::BucketPolicies_Data> policy;

private:
    friend class mojo::internal::MessageFragment<BucketManagerHost_OpenBucket_Params_Data>;

    BucketManagerHost_OpenBucket_Params_Data();
    ~BucketManagerHost_OpenBucket_Params_Data() = delete;
};
static_assert(sizeof(BucketManagerHost_OpenBucket_Params_Data) == 24, "Bad sizeof(BucketManagerHost_OpenBucket_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketManagerHost_OpenBucket_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data remote;
    int32_t error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<BucketManagerHost_OpenBucket_ResponseParams_Data>;

    BucketManagerHost_OpenBucket_ResponseParams_Data();
    ~BucketManagerHost_OpenBucket_ResponseParams_Data() = delete;
};
static_assert(sizeof(BucketManagerHost_OpenBucket_ResponseParams_Data) == 24, "Bad sizeof(BucketManagerHost_OpenBucket_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketManagerHost_GetBucketForDevtools_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> name;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<BucketManagerHost_GetBucketForDevtools_Params_Data>;

    BucketManagerHost_GetBucketForDevtools_Params_Data();
    ~BucketManagerHost_GetBucketForDevtools_Params_Data() = delete;
};
static_assert(sizeof(BucketManagerHost_GetBucketForDevtools_Params_Data) == 24, "Bad sizeof(BucketManagerHost_GetBucketForDevtools_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketManagerHost_Keys_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<BucketManagerHost_Keys_Params_Data>;

    BucketManagerHost_Keys_Params_Data();
    ~BucketManagerHost_Keys_Params_Data() = delete;
};
static_assert(sizeof(BucketManagerHost_Keys_Params_Data) == 8, "Bad sizeof(BucketManagerHost_Keys_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketManagerHost_Keys_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> buckets;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<BucketManagerHost_Keys_ResponseParams_Data>;

    BucketManagerHost_Keys_ResponseParams_Data();
    ~BucketManagerHost_Keys_ResponseParams_Data() = delete;
};
static_assert(sizeof(BucketManagerHost_Keys_ResponseParams_Data) == 24, "Bad sizeof(BucketManagerHost_Keys_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketManagerHost_DeleteBucket_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> name;

private:
    friend class mojo::internal::MessageFragment<BucketManagerHost_DeleteBucket_Params_Data>;

    BucketManagerHost_DeleteBucket_Params_Data();
    ~BucketManagerHost_DeleteBucket_Params_Data() = delete;
};
static_assert(sizeof(BucketManagerHost_DeleteBucket_Params_Data) == 16, "Bad sizeof(BucketManagerHost_DeleteBucket_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) BucketManagerHost_DeleteBucket_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<BucketManagerHost_DeleteBucket_ResponseParams_Data>;

    BucketManagerHost_DeleteBucket_ResponseParams_Data();
    ~BucketManagerHost_DeleteBucket_ResponseParams_Data() = delete;
};
static_assert(sizeof(BucketManagerHost_DeleteBucket_ResponseParams_Data) == 16, "Bad sizeof(BucketManagerHost_DeleteBucket_ResponseParams_Data)");

} // namespace internal

class BucketHost_Persist_ParamsDataView {
public:
    BucketHost_Persist_ParamsDataView() = default;

    BucketHost_Persist_ParamsDataView(internal::BucketHost_Persist_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::BucketHost_Persist_Params_Data* data_ = nullptr;
};

class BucketHost_Persist_ResponseParamsDataView {
public:
    BucketHost_Persist_ResponseParamsDataView() = default;

    BucketHost_Persist_ResponseParamsDataView(internal::BucketHost_Persist_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    bool persisted() const
    {
        return data_->persisted;
    }
    bool success() const
    {
