// media/capture/mojom/image_capture.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MEDIA_CAPTURE_MOJOM_IMAGE_CAPTURE_MOJOM_PARAMS_DATA_H_
#define MEDIA_CAPTURE_MOJOM_IMAGE_CAPTURE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media::mojom {
namespace internal {
class ImageCapture_GetPhotoState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> source_id;

private:
    friend class mojo::internal::MessageFragment<ImageCapture_GetPhotoState_Params_Data>;

    ImageCapture_GetPhotoState_Params_Data();
    ~ImageCapture_GetPhotoState_Params_Data() = delete;
};
static_assert(sizeof(ImageCapture_GetPhotoState_Params_Data) == 16, "Bad sizeof(ImageCapture_GetPhotoState_Params_Data)");
class ImageCapture_GetPhotoState_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PhotoState_Data> state;

private:
    friend class mojo::internal::MessageFragment<ImageCapture_GetPhotoState_ResponseParams_Data>;

    ImageCapture_GetPhotoState_ResponseParams_Data();
    ~ImageCapture_GetPhotoState_ResponseParams_Data() = delete;
};
static_assert(sizeof(ImageCapture_GetPhotoState_ResponseParams_Data) == 16, "Bad sizeof(ImageCapture_GetPhotoState_ResponseParams_Data)");
class ImageCapture_SetPhotoOptions_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> source_id;
    mojo::internal::Pointer<internal::PhotoSettings_Data> settings;

private:
    friend class mojo::internal::MessageFragment<ImageCapture_SetPhotoOptions_Params_Data>;

    ImageCapture_SetPhotoOptions_Params_Data();
    ~ImageCapture_SetPhotoOptions_Params_Data() = delete;
};
static_assert(sizeof(ImageCapture_SetPhotoOptions_Params_Data) == 24, "Bad sizeof(ImageCapture_SetPhotoOptions_Params_Data)");
class ImageCapture_SetPhotoOptions_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<ImageCapture_SetPhotoOptions_ResponseParams_Data>;

    ImageCapture_SetPhotoOptions_ResponseParams_Data();
    ~ImageCapture_SetPhotoOptions_ResponseParams_Data() = delete;
};
static_assert(sizeof(ImageCapture_SetPhotoOptions_ResponseParams_Data) == 16, "Bad sizeof(ImageCapture_SetPhotoOptions_ResponseParams_Data)");
class ImageCapture_TakePhoto_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> source_id;

private:
    friend class mojo::internal::MessageFragment<ImageCapture_TakePhoto_Params_Data>;

    ImageCapture_TakePhoto_Params_Data();
    ~ImageCapture_TakePhoto_Params_Data() = delete;
};
static_assert(sizeof(ImageCapture_TakePhoto_Params_Data) == 16, "Bad sizeof(ImageCapture_TakePhoto_Params_Data)");
class ImageCapture_TakePhoto_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::Blob_Data> blob;

private:
    friend class mojo::internal::MessageFragment<ImageCapture_TakePhoto_ResponseParams_Data>;

    ImageCapture_TakePhoto_ResponseParams_Data();
    ~ImageCapture_TakePhoto_ResponseParams_Data() = delete;
};
static_assert(sizeof(ImageCapture_TakePhoto_ResponseParams_Data) == 16, "Bad sizeof(ImageCapture_TakePhoto_ResponseParams_Data)");

} // namespace internal

class ImageCapture_GetPhotoState_ParamsDataView {
public:
    ImageCapture_GetPhotoState_ParamsDataView() = default;

    ImageCapture_GetPhotoState_ParamsDataView(internal::ImageCapture_GetPhotoState_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetSourceIdDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadSourceId(UserType* output)
    {

        auto* pointer = data_->source_id.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }

private:
    internal::ImageCapture_GetPhotoState_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class ImageCapture_GetPhotoState_ResponseParamsDataView {
public:
    ImageCapture_GetPhotoState_ResponseParamsDataView() = default;

    ImageCapture_GetPhotoState_ResponseParamsDataView(internal::ImageCapture_GetPhotoState_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetStateDataView(PhotoStateDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadState(UserType* output)
    {

        auto* pointer = data_->state.Get();
        return mojo::internal::Deserialize<::media::mojom::PhotoStateDataView>(pointer, output, message_);
    }

private:
    internal::ImageCapture_GetPhotoState_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class ImageCapture_SetPhotoOptions_ParamsDataView {
public:
    ImageCapture_SetPhotoOptions_ParamsDataView() = default;

    ImageCapture_SetPhotoOptions_ParamsDataView(internal::ImageCapture_SetPhotoOptions_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetSourceIdDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadSourceId(UserType* output)
    {

        auto* pointer = data_->source_id.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }
    inline void GetSettingsDataView(PhotoSettingsDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadSettings(UserType* output)
    {

        auto* pointer = data_->settings.Get();
        return mojo::internal::Deserialize<::media::mojom::PhotoSettingsDataView>(pointer, output, message_);
    }

private:
    internal::ImageCapture_SetPhotoOptions_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class ImageCapture_SetPhotoOptions_ResponseParamsDataView {
public:
    ImageCapture_SetPhotoOptions_ResponseParamsDataView() = default;

    ImageCapture_SetPhotoOptions_ResponseParamsDataView(internal::ImageCapture_SetPhotoOptions_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    bool success() const
    {
        return data_->success;
    }

private:
    internal::ImageCapture_SetPhotoOptions_ResponseParams_Data* data_ = nullptr;
};

class ImageCapture_TakePhoto_ParamsDataView {
public:
    ImageCapture_TakePhoto_ParamsDataView() = default;

    ImageCapture_TakePhoto_ParamsDataView(internal::ImageCapture_TakePhoto_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetSourceIdDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadSourceId(UserType* output)
    {

        auto* pointer = data_->source_id.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }

private:
    internal::ImageCapture_TakePhoto_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class ImageCapture_TakePhoto_ResponseParamsDataView {
public:
    ImageCapture_TakePhoto_ResponseParamsDataView() = default;

    ImageCapture_TakePhoto_ResponseParamsDataView(internal::ImageCapture_TakePhoto_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetBlobDataView(BlobDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadBlob(UserType* output)
    {

        auto* pointer = data_->blob.Get();
        return mojo::internal::Deserialize<::media::mojom::BlobDataView>(pointer, output, message_);
    }

private:
    internal::ImageCapture_TakePhoto_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

inline void ImageCapture_GetPhotoState_ParamsDataView::GetSourceIdDataView(mojo::StringDataView* output)
{
    auto pointer = data_->source_id.Get();
    *output = mojo::StringDataView(pointer, message_);
}

inline void ImageCapture_GetPhotoState_ResponseParamsDataView::GetStateDataView(PhotoStateDataView* output)
{
    auto pointer = data_->state.Get();
    *output = PhotoStateDataView(pointer, message_);
}

inline void ImageCapture_SetPhotoOptions_ParamsDataView::GetSourceIdDataView(mojo::StringDataView* output)
{
    auto pointer = data_->source_id.Get();
    *output = mojo::StringDataView(pointer, message_);
}
inline void ImageCapture_SetPhotoOptions_ParamsDataView::GetSettingsDataView(PhotoSettingsDataView* output)
{
    auto pointer = data_->settings.Get();
    *output = PhotoSettingsDataView(pointer, message_);
}

inline void ImageCapture_TakePhoto_ParamsDataView::GetSourceIdDataView(mojo::StringDataView* output)
{
    auto pointer = data_->source_id.Get();
    *output = mojo::StringDataView(pointer, message_);
}

inline void ImageCapture_TakePhoto_ResponseParamsDataView::GetBlobDataView(BlobDataView* output)
{
    auto pointer = data_->blob.Get();
    *output = BlobDataView(pointer, message_);
}

} // media::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // MEDIA_CAPTURE_MOJOM_IMAGE_CAPTURE_MOJOM_PARAMS_DATA_H_
