// media/capture/mojom/video_effects_manager.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MEDIA_CAPTURE_MOJOM_VIDEO_EFFECTS_MANAGER_MOJOM_PARAMS_DATA_H_
#define MEDIA_CAPTURE_MOJOM_VIDEO_EFFECTS_MANAGER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media::mojom {
namespace internal {
class VideoEffectsConfigurationObserver_OnConfigurationChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::VideoEffectsConfiguration_Data> configuration;

private:
    friend class mojo::internal::MessageFragment<VideoEffectsConfigurationObserver_OnConfigurationChanged_Params_Data>;

    VideoEffectsConfigurationObserver_OnConfigurationChanged_Params_Data();
    ~VideoEffectsConfigurationObserver_OnConfigurationChanged_Params_Data() = delete;
};
static_assert(sizeof(VideoEffectsConfigurationObserver_OnConfigurationChanged_Params_Data) == 16,
    "Bad sizeof(VideoEffectsConfigurationObserver_OnConfigurationChanged_Params_Data)");
class VideoEffectsManager_GetConfiguration_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<VideoEffectsManager_GetConfiguration_Params_Data>;

    VideoEffectsManager_GetConfiguration_Params_Data();
    ~VideoEffectsManager_GetConfiguration_Params_Data() = delete;
};
static_assert(sizeof(VideoEffectsManager_GetConfiguration_Params_Data) == 8, "Bad sizeof(VideoEffectsManager_GetConfiguration_Params_Data)");
class VideoEffectsManager_GetConfiguration_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::VideoEffectsConfiguration_Data> configuration;

private:
    friend class mojo::internal::MessageFragment<VideoEffectsManager_GetConfiguration_ResponseParams_Data>;

    VideoEffectsManager_GetConfiguration_ResponseParams_Data();
    ~VideoEffectsManager_GetConfiguration_ResponseParams_Data() = delete;
};
static_assert(sizeof(VideoEffectsManager_GetConfiguration_ResponseParams_Data) == 16, "Bad sizeof(VideoEffectsManager_GetConfiguration_ResponseParams_Data)");
class VideoEffectsManager_SetConfiguration_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::VideoEffectsConfiguration_Data> configuration;

private:
    friend class mojo::internal::MessageFragment<VideoEffectsManager_SetConfiguration_Params_Data>;

    VideoEffectsManager_SetConfiguration_Params_Data();
    ~VideoEffectsManager_SetConfiguration_Params_Data() = delete;
};
static_assert(sizeof(VideoEffectsManager_SetConfiguration_Params_Data) == 16, "Bad sizeof(VideoEffectsManager_SetConfiguration_Params_Data)");
class VideoEffectsManager_SetConfiguration_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<VideoEffectsManager_SetConfiguration_ResponseParams_Data>;

    VideoEffectsManager_SetConfiguration_ResponseParams_Data();
    ~VideoEffectsManager_SetConfiguration_ResponseParams_Data() = delete;
};
static_assert(sizeof(VideoEffectsManager_SetConfiguration_ResponseParams_Data) == 16, "Bad sizeof(VideoEffectsManager_SetConfiguration_ResponseParams_Data)");
class VideoEffectsManager_AddObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data observer;

private:
    friend class mojo::internal::MessageFragment<VideoEffectsManager_AddObserver_Params_Data>;

    VideoEffectsManager_AddObserver_Params_Data();
    ~VideoEffectsManager_AddObserver_Params_Data() = delete;
};
static_assert(sizeof(VideoEffectsManager_AddObserver_Params_Data) == 16, "Bad sizeof(VideoEffectsManager_AddObserver_Params_Data)");

} // namespace internal

class VideoEffectsConfigurationObserver_OnConfigurationChanged_ParamsDataView {
public:
    VideoEffectsConfigurationObserver_OnConfigurationChanged_ParamsDataView() = default;

    VideoEffectsConfigurationObserver_OnConfigurationChanged_ParamsDataView(
        internal::VideoEffectsConfigurationObserver_OnConfigurationChanged_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetConfigurationDataView(VideoEffectsConfigurationDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadConfiguration(UserType* output)
    {

        auto* pointer = data_->configuration.Get();
        return mojo::internal::Deserialize<::media::mojom::VideoEffectsConfigurationDataView>(pointer, output, message_);
    }

private:
    internal::VideoEffectsConfigurationObserver_OnConfigurationChanged_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class VideoEffectsManager_GetConfiguration_ParamsDataView {
public:
    VideoEffectsManager_GetConfiguration_ParamsDataView() = default;

    VideoEffectsManager_GetConfiguration_ParamsDataView(internal::VideoEffectsManager_GetConfiguration_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::VideoEffectsManager_GetConfiguration_Params_Data* data_ = nullptr;
};

class VideoEffectsManager_GetConfiguration_ResponseParamsDataView {
public:
    VideoEffectsManager_GetConfiguration_ResponseParamsDataView() = default;

    VideoEffectsManager_GetConfiguration_ResponseParamsDataView(
        internal::VideoEffectsManager_GetConfiguration_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetConfigurationDataView(VideoEffectsConfigurationDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadConfiguration(UserType* output)
    {

        auto* pointer = data_->configuration.Get();
        return mojo::internal::Deserialize<::media::mojom::VideoEffectsConfigurationDataView>(pointer, output, message_);
    }

private:
    internal::VideoEffectsManager_GetConfiguration_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class VideoEffectsManager_SetConfiguration_ParamsDataView {
public:
    VideoEffectsManager_SetConfiguration_ParamsDataView() = default;

    VideoEffectsManager_SetConfiguration_ParamsDataView(internal::VideoEffectsManager_SetConfiguration_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetConfigurationDataView(VideoEffectsConfigurationDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadConfiguration(UserType* output)
    {

        auto* pointer = data_->configuration.Get();
        return mojo::internal::Deserialize<::media::mojom::VideoEffectsConfigurationDataView>(pointer, output, message_);
    }

private:
    internal::VideoEffectsManager_SetConfiguration_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class VideoEffectsManager_SetConfiguration_ResponseParamsDataView {
public:
    VideoEffectsManager_SetConfiguration_ResponseParamsDataView() = default;

    VideoEffectsManager_SetConfiguration_ResponseParamsDataView(
        internal::VideoEffectsManager_SetConfiguration_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadResult(UserType* output) const
    {
        auto data_value = data_->result;
        return mojo::internal::Deserialize<::media::mojom::SetConfigurationResult>(data_value, output);
    }
    SetConfigurationResult result() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::media::mojom::SetConfigurationResult>(data_->result));
    }

private:
    internal::VideoEffectsManager_SetConfiguration_ResponseParams_Data* data_ = nullptr;
};

class VideoEffectsManager_AddObserver_ParamsDataView {
public:
    VideoEffectsManager_AddObserver_ParamsDataView() = default;

    VideoEffectsManager_AddObserver_ParamsDataView(internal::VideoEffectsManager_AddObserver_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeObserver()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::media::mojom::VideoEffectsConfigurationObserverInterfaceBase>>(
            &data_->observer, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::VideoEffectsManager_AddObserver_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

inline void VideoEffectsConfigurationObserver_OnConfigurationChanged_ParamsDataView::GetConfigurationDataView(VideoEffectsConfigurationDataView* output)
{
    auto pointer = data_->configuration.Get();
    *output = VideoEffectsConfigurationDataView(pointer, message_);
}

inline void VideoEffectsManager_GetConfiguration_ResponseParamsDataView::GetConfigurationDataView(VideoEffectsConfigurationDataView* output)
{
    auto pointer = data_->configuration.Get();
    *output = VideoEffectsConfigurationDataView(pointer, message_);
}

inline void VideoEffectsManager_SetConfiguration_ParamsDataView::GetConfigurationDataView(VideoEffectsConfigurationDataView* output)
{
    auto pointer = data_->configuration.Get();
    *output = VideoEffectsConfigurationDataView(pointer, message_);
}

} // media::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // MEDIA_CAPTURE_MOJOM_VIDEO_EFFECTS_MANAGER_MOJOM_PARAMS_DATA_H_
