// media/capture/mojom/video_capture.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MEDIA_CAPTURE_MOJOM_VIDEO_CAPTURE_MOJOM_PARAMS_DATA_H_
#define MEDIA_CAPTURE_MOJOM_VIDEO_CAPTURE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media::mojom {
namespace internal {
class VideoCaptureObserver_OnStateChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::VideoCaptureResult_Data result;

private:
    friend class mojo::internal::MessageFragment<VideoCaptureObserver_OnStateChanged_Params_Data>;

    VideoCaptureObserver_OnStateChanged_Params_Data();
    ~VideoCaptureObserver_OnStateChanged_Params_Data() = delete;
};
static_assert(sizeof(VideoCaptureObserver_OnStateChanged_Params_Data) == 24, "Bad sizeof(VideoCaptureObserver_OnStateChanged_Params_Data)");
class VideoCaptureObserver_OnNewBuffer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t buffer_id;
    uint8_t pad0_[4];
    ::media::mojom::internal::VideoBufferHandle_Data buffer_handle;

private:
    friend class mojo::internal::MessageFragment<VideoCaptureObserver_OnNewBuffer_Params_Data>;

    VideoCaptureObserver_OnNewBuffer_Params_Data();
    ~VideoCaptureObserver_OnNewBuffer_Params_Data() = delete;
};
static_assert(sizeof(VideoCaptureObserver_OnNewBuffer_Params_Data) == 32, "Bad sizeof(VideoCaptureObserver_OnNewBuffer_Params_Data)");
class VideoCaptureObserver_OnBufferReady_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::ReadyBuffer_Data> buffer;

private:
    friend class mojo::internal::MessageFragment<VideoCaptureObserver_OnBufferReady_Params_Data>;

    VideoCaptureObserver_OnBufferReady_Params_Data();
    ~VideoCaptureObserver_OnBufferReady_Params_Data() = delete;
};
static_assert(sizeof(VideoCaptureObserver_OnBufferReady_Params_Data) == 16, "Bad sizeof(VideoCaptureObserver_OnBufferReady_Params_Data)");
class VideoCaptureObserver_OnBufferDestroyed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t buffer_id;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<VideoCaptureObserver_OnBufferDestroyed_Params_Data>;

    VideoCaptureObserver_OnBufferDestroyed_Params_Data();
    ~VideoCaptureObserver_OnBufferDestroyed_Params_Data() = delete;
};
static_assert(sizeof(VideoCaptureObserver_OnBufferDestroyed_Params_Data) == 16, "Bad sizeof(VideoCaptureObserver_OnBufferDestroyed_Params_Data)");
class VideoCaptureObserver_OnFrameDropped_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t reason;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<VideoCaptureObserver_OnFrameDropped_Params_Data>;

    VideoCaptureObserver_OnFrameDropped_Params_Data();
    ~VideoCaptureObserver_OnFrameDropped_Params_Data() = delete;
};
static_assert(sizeof(VideoCaptureObserver_OnFrameDropped_Params_Data) == 16, "Bad sizeof(VideoCaptureObserver_OnFrameDropped_Params_Data)");
class VideoCaptureObserver_OnNewSubCaptureTargetVersion_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t sub_capture_target_version;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<VideoCaptureObserver_OnNewSubCaptureTargetVersion_Params_Data>;

    VideoCaptureObserver_OnNewSubCaptureTargetVersion_Params_Data();
    ~VideoCaptureObserver_OnNewSubCaptureTargetVersion_Params_Data() = delete;
};
static_assert(
    sizeof(VideoCaptureObserver_OnNewSubCaptureTargetVersion_Params_Data) == 16, "Bad sizeof(VideoCaptureObserver_OnNewSubCaptureTargetVersion_Params_Data)");
class VideoCaptureHost_Start_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> device_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> session_id;
    mojo::internal::Pointer<::media::mojom::internal::VideoCaptureParams_Data> params;
    mojo::internal::Interface_Data observer;

private:
    friend class mojo::internal::MessageFragment<VideoCaptureHost_Start_Params_Data>;

    VideoCaptureHost_Start_Params_Data();
    ~VideoCaptureHost_Start_Params_Data() = delete;
};
static_assert(sizeof(VideoCaptureHost_Start_Params_Data) == 40, "Bad sizeof(VideoCaptureHost_Start_Params_Data)");
class VideoCaptureHost_Stop_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> device_id;

private:
    friend class mojo::internal::MessageFragment<VideoCaptureHost_Stop_Params_Data>;

    VideoCaptureHost_Stop_Params_Data();
    ~VideoCaptureHost_Stop_Params_Data() = delete;
};
static_assert(sizeof(VideoCaptureHost_Stop_Params_Data) == 16, "Bad sizeof(VideoCaptureHost_Stop_Params_Data)");
class VideoCaptureHost_Pause_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> device_id;

private:
    friend class mojo::internal::MessageFragment<VideoCaptureHost_Pause_Params_Data>;

    VideoCaptureHost_Pause_Params_Data();
    ~VideoCaptureHost_Pause_Params_Data() = delete;
};
static_assert(sizeof(VideoCaptureHost_Pause_Params_Data) == 16, "Bad sizeof(VideoCaptureHost_Pause_Params_Data)");
class VideoCaptureHost_Resume_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> device_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> session_id;
    mojo::internal::Pointer<::media::mojom::internal::VideoCaptureParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<VideoCaptureHost_Resume_Params_Data>;

    VideoCaptureHost_Resume_Params_Data();
    ~VideoCaptureHost_Resume_Params_Data() = delete;
};
static_assert(sizeof(VideoCaptureHost_Resume_Params_Data) == 32, "Bad sizeof(VideoCaptureHost_Resume_Params_Data)");
class VideoCaptureHost_RequestRefreshFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> device_id;

private:
    friend class mojo::internal::MessageFragment<VideoCaptureHost_RequestRefreshFrame_Params_Data>;

    VideoCaptureHost_RequestRefreshFrame_Params_Data();
    ~VideoCaptureHost_RequestRefreshFrame_Params_Data() = delete;
};
static_assert(sizeof(VideoCaptureHost_RequestRefreshFrame_Params_Data) == 16, "Bad sizeof(VideoCaptureHost_RequestRefreshFrame_Params_Data)");
class VideoCaptureHost_ReleaseBuffer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> device_id;
    int32_t buffer_id;
    uint8_t pad1_[4];
    mojo::internal::Pointer<::media::mojom::internal::VideoCaptureFeedback_Data> feedback;

private:
    friend class mojo::internal::MessageFragment<VideoCaptureHost_ReleaseBuffer_Params_Data>;

    VideoCaptureHost_ReleaseBuffer_Params_Data();
    ~VideoCaptureHost_ReleaseBuffer_Params_Data() = delete;
};
static_assert(sizeof(VideoCaptureHost_ReleaseBuffer_Params_Data) == 32, "Bad sizeof(VideoCaptureHost_ReleaseBuffer_Params_Data)");
class VideoCaptureHost_GetDeviceSupportedFormats_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> device_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> session_id;

private:
    friend class mojo::internal::MessageFragment<VideoCaptureHost_GetDeviceSupportedFormats_Params_Data>;

    VideoCaptureHost_GetDeviceSupportedFormats_Params_Data();
    ~VideoCaptureHost_GetDeviceSupportedFormats_Params_Data() = delete;
};
static_assert(sizeof(VideoCaptureHost_GetDeviceSupportedFormats_Params_Data) == 24, "Bad sizeof(VideoCaptureHost_GetDeviceSupportedFormats_Params_Data)");
class VideoCaptureHost_GetDeviceSupportedFormats_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::media::mojom::internal::VideoCaptureFormat_Data>>> formats_supported;

private:
    friend class mojo::internal::MessageFragment<VideoCaptureHost_GetDeviceSupportedFormats_ResponseParams_Data>;

    VideoCaptureHost_GetDeviceSupportedFormats_ResponseParams_Data();
    ~VideoCaptureHost_GetDeviceSupportedFormats_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(VideoCaptureHost_GetDeviceSupportedFormats_ResponseParams_Data) == 16, "Bad sizeof(VideoCaptureHost_GetDeviceSupportedFormats_ResponseParams_Data)");
class VideoCaptureHost_GetDeviceFormatsInUse_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> device_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> session_id;

private:
    friend class mojo::internal::MessageFragment<VideoCaptureHost_GetDeviceFormatsInUse_Params_Data>;

    VideoCaptureHost_GetDeviceFormatsInUse_Params_Data();
    ~VideoCaptureHost_GetDeviceFormatsInUse_Params_Data() = delete;
};
static_assert(sizeof(VideoCaptureHost_GetDeviceFormatsInUse_Params_Data) == 24, "Bad sizeof(VideoCaptureHost_GetDeviceFormatsInUse_Params_Data)");
class VideoCaptureHost_GetDeviceFormatsInUse_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::media::mojom::internal::VideoCaptureFormat_Data>>> formats_in_use;

private:
    friend class mojo::internal::MessageFragment<VideoCaptureHost_GetDeviceFormatsInUse_ResponseParams_Data>;

    VideoCaptureHost_GetDeviceFormatsInUse_ResponseParams_Data();
    ~VideoCaptureHost_GetDeviceFormatsInUse_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(VideoCaptureHost_GetDeviceFormatsInUse_ResponseParams_Data) == 16, "Bad sizeof(VideoCaptureHost_GetDeviceFormatsInUse_ResponseParams_Data)");
class VideoCaptureHost_OnLog_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> device_id;
    mojo::internal::Pointer<mojo::internal::String_Data> message;

private:
    friend class mojo::internal::MessageFragment<VideoCaptureHost_OnLog_Params_Data>;

    VideoCaptureHost_OnLog_Params_Data();
    ~VideoCaptureHost_OnLog_Params_Data() = delete;
};
static_assert(sizeof(VideoCaptureHost_OnLog_Params_Data) == 24, "Bad sizeof(VideoCaptureHost_OnLog_Params_Data)");

} // namespace internal

class VideoCaptureObserver_OnStateChanged_ParamsDataView {
public:
    VideoCaptureObserver_OnStateChanged_ParamsDataView() = default;

    VideoCaptureObserver_OnStateChanged_ParamsDataView(internal::VideoCaptureObserver_OnStateChanged_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetResultDataView(VideoCaptureResultDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadResult(UserType* output)
    {

        auto* pointer = !data_->result.is_null() ? &data_->result : nullptr;
        return mojo::internal::Deserialize<::media::mojom::VideoCaptureResultDataView>(pointer, output, message_);
    }

private:
    internal::VideoCaptureObserver_OnStateChanged_Params_Data* data_ = nullptr;
