// ui/webui/resources/cr_components/history_embeddings/history_embeddings.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef UI_WEBUI_RESOURCES_CR_COMPONENTS_HISTORY_EMBEDDINGS_HISTORY_EMBEDDINGS_MOJOM_PARAMS_DATA_H_
#define UI_WEBUI_RESOURCES_CR_COMPONENTS_HISTORY_EMBEDDINGS_HISTORY_EMBEDDINGS_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace history_embeddings::mojom {
namespace internal {
class PageHandler_SetPage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data page;

private:
    friend class mojo::internal::MessageFragment<PageHandler_SetPage_Params_Data>;

    PageHandler_SetPage_Params_Data();
    ~PageHandler_SetPage_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_SetPage_Params_Data) == 16, "Bad sizeof(PageHandler_SetPage_Params_Data)");
class PageHandler_Search_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SearchQuery_Data> query;

private:
    friend class mojo::internal::MessageFragment<PageHandler_Search_Params_Data>;

    PageHandler_Search_Params_Data();
    ~PageHandler_Search_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_Search_Params_Data) == 16, "Bad sizeof(PageHandler_Search_Params_Data)");
class PageHandler_SendQualityLog_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint32_t>> selected_indices;
    uint32_t num_entered_chars;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PageHandler_SendQualityLog_Params_Data>;

    PageHandler_SendQualityLog_Params_Data();
    ~PageHandler_SendQualityLog_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_SendQualityLog_Params_Data) == 24, "Bad sizeof(PageHandler_SendQualityLog_Params_Data)");
class PageHandler_RecordSearchResultsMetrics_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t nonEmptyResults : 1;
    uint8_t userClickedResult : 1;
    uint8_t answerShown : 1;
    uint8_t answerCitationClicked : 1;
    uint8_t otherHistoryResultClicked : 1;
    uint8_t pad4_[3];
    uint32_t queryWordCount;

private:
    friend class mojo::internal::MessageFragment<PageHandler_RecordSearchResultsMetrics_Params_Data>;

    PageHandler_RecordSearchResultsMetrics_Params_Data();
    ~PageHandler_RecordSearchResultsMetrics_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_RecordSearchResultsMetrics_Params_Data) == 16, "Bad sizeof(PageHandler_RecordSearchResultsMetrics_Params_Data)");
class PageHandler_SetUserFeedback_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t feedback;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PageHandler_SetUserFeedback_Params_Data>;

    PageHandler_SetUserFeedback_Params_Data();
    ~PageHandler_SetUserFeedback_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_SetUserFeedback_Params_Data) == 16, "Bad sizeof(PageHandler_SetUserFeedback_Params_Data)");
class PageHandler_MaybeShowFeaturePromo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PageHandler_MaybeShowFeaturePromo_Params_Data>;

    PageHandler_MaybeShowFeaturePromo_Params_Data();
    ~PageHandler_MaybeShowFeaturePromo_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_MaybeShowFeaturePromo_Params_Data) == 8, "Bad sizeof(PageHandler_MaybeShowFeaturePromo_Params_Data)");
class PageHandler_OpenSettingsPage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PageHandler_OpenSettingsPage_Params_Data>;

    PageHandler_OpenSettingsPage_Params_Data();
    ~PageHandler_OpenSettingsPage_Params_Data() = delete;
};
static_assert(sizeof(PageHandler_OpenSettingsPage_Params_Data) == 8, "Bad sizeof(PageHandler_OpenSettingsPage_Params_Data)");
class Page_SearchResultChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SearchResult_Data> result;

private:
    friend class mojo::internal::MessageFragment<Page_SearchResultChanged_Params_Data>;

    Page_SearchResultChanged_Params_Data();
    ~Page_SearchResultChanged_Params_Data() = delete;
};
static_assert(sizeof(Page_SearchResultChanged_Params_Data) == 16, "Bad sizeof(Page_SearchResultChanged_Params_Data)");

} // namespace internal

class PageHandler_SetPage_ParamsDataView {
public:
    PageHandler_SetPage_ParamsDataView() = default;

    PageHandler_SetPage_ParamsDataView(internal::PageHandler_SetPage_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakePage()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::history_embeddings::mojom::PageInterfaceBase>>(&data_->page, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::PageHandler_SetPage_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class PageHandler_Search_ParamsDataView {
public:
    PageHandler_Search_ParamsDataView() = default;

    PageHandler_Search_ParamsDataView(internal::PageHandler_Search_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetQueryDataView(SearchQueryDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadQuery(UserType* output)
    {

        auto* pointer = data_->query.Get();
        return mojo::internal::Deserialize<::history_embeddings::mojom::SearchQueryDataView>(pointer, output, message_);
    }

private:
    internal::PageHandler_Search_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class PageHandler_SendQualityLog_ParamsDataView {
public:
    PageHandler_SendQualityLog_ParamsDataView() = default;

    PageHandler_SendQualityLog_ParamsDataView(internal::PageHandler_SendQualityLog_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetSelectedIndicesDataView(mojo::ArrayDataView<uint32_t>* output);

    template <typename UserType> [[nodiscard]] bool ReadSelectedIndices(UserType* output)
    {

        auto* pointer = data_->selected_indices.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<uint32_t>>(pointer, output, message_);
    }
    uint32_t num_entered_chars() const
    {
        return data_->num_entered_chars;
    }

private:
    internal::PageHandler_SendQualityLog_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class PageHandler_RecordSearchResultsMetrics_ParamsDataView {
public:
    PageHandler_RecordSearchResultsMetrics_ParamsDataView() = default;

    PageHandler_RecordSearchResultsMetrics_ParamsDataView(internal::PageHandler_RecordSearchResultsMetrics_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    bool nonEmptyResults() const
    {
        return data_->nonEmptyResults;
    }
    bool userClickedResult() const
    {
        return data_->userClickedResult;
    }
    bool answerShown() const
    {
        return data_->answerShown;
    }
    bool answerCitationClicked() const
    {
        return data_->answerCitationClicked;
    }
    bool otherHistoryResultClicked() const
    {
        return data_->otherHistoryResultClicked;
    }
    uint32_t queryWordCount() const
    {
        return data_->queryWordCount;
    }

private:
    internal::PageHandler_RecordSearchResultsMetrics_Params_Data* data_ = nullptr;
};

class PageHandler_SetUserFeedback_ParamsDataView {
public:
    PageHandler_SetUserFeedback_ParamsDataView() = default;

    PageHandler_SetUserFeedback_ParamsDataView(internal::PageHandler_SetUserFeedback_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadFeedback(UserType* output) const
    {
        auto data_value = data_->feedback;
        return mojo::internal::Deserialize<::history_embeddings::mojom::UserFeedback>(data_value, output);
    }
    UserFeedback feedback() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::history_embeddings::mojom::UserFeedback>(data_->feedback));
    }

private:
    internal::PageHandler_SetUserFeedback_Params_Data* data_ = nullptr;
};

class PageHandler_MaybeShowFeaturePromo_ParamsDataView {
public:
    PageHandler_MaybeShowFeaturePromo_ParamsDataView() = default;

    PageHandler_MaybeShowFeaturePromo_ParamsDataView(internal::PageHandler_MaybeShowFeaturePromo_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::PageHandler_MaybeShowFeaturePromo_Params_Data* data_ = nullptr;
};

class PageHandler_OpenSettingsPage_ParamsDataView {
public:
    PageHandler_OpenSettingsPage_ParamsDataView() = default;

    PageHandler_OpenSettingsPage_ParamsDataView(internal::PageHandler_OpenSettingsPage_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::PageHandler_OpenSettingsPage_Params_Data* data_ = nullptr;
};

class Page_SearchResultChanged_ParamsDataView {
public:
    Page_SearchResultChanged_ParamsDataView() = default;

    Page_SearchResultChanged_ParamsDataView(internal::Page_SearchResultChanged_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetResultDataView(SearchResultDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadResult(UserType* output)
    {

        auto* pointer = data_->result.Get();
        return mojo::internal::Deserialize<::history_embeddings::mojom::SearchResultDataView>(pointer, output, message_);
    }

private:
    internal::Page_SearchResultChanged_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

inline void PageHandler_Search_ParamsDataView::GetQueryDataView(SearchQueryDataView* output)
{
    auto pointer = data_->query.Get();
    *output = SearchQueryDataView(pointer, message_);
}

inline void PageHandler_SendQualityLog_ParamsDataView::GetSelectedIndicesDataView(mojo::ArrayDataView<uint32_t>* output)
{
    auto pointer = data_->selected_indices.Get();
    *output = mojo::ArrayDataView<uint32_t>(pointer, message_);
}

inline void Page_SearchResultChanged_ParamsDataView::GetResultDataView(SearchResultDataView* output)
{
    auto pointer = data_->result.Get();
    *output = SearchResultDataView(pointer, message_);
}

} // history_embeddings::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // UI_WEBUI_RESOURCES_CR_COMPONENTS_HISTORY_EMBEDDINGS_HISTORY_EMBEDDINGS_MOJOM_PARAMS_DATA_H_
