// third_party/blink/public/mojom/mediastream/media_devices.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_MEDIASTREAM_MEDIA_DEVICES_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_MEDIASTREAM_MEDIA_DEVICES_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaDevicesDispatcherHost_EnumerateDevices_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t request_audio_input : 1;
    uint8_t request_video_input : 1;
    uint8_t request_audio_output : 1;
    uint8_t request_video_input_capabilities : 1;
    uint8_t request_audio_input_capabilities : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaDevicesDispatcherHost_EnumerateDevices_Params_Data>;

    MediaDevicesDispatcherHost_EnumerateDevices_Params_Data();
    ~MediaDevicesDispatcherHost_EnumerateDevices_Params_Data() = delete;
};
static_assert(sizeof(MediaDevicesDispatcherHost_EnumerateDevices_Params_Data) == 16, "Bad sizeof(MediaDevicesDispatcherHost_EnumerateDevices_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaDevicesDispatcherHost_EnumerateDevices_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<
        mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::MediaDeviceInfo_Data>>>>>
        enumeration;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::VideoInputDeviceCapabilities_Data>>> video_input_device_capabilities;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::AudioInputDeviceCapabilities_Data>>> audio_input_device_capabilities;

private:
    friend class mojo::internal::MessageFragment<MediaDevicesDispatcherHost_EnumerateDevices_ResponseParams_Data>;

    MediaDevicesDispatcherHost_EnumerateDevices_ResponseParams_Data();
    ~MediaDevicesDispatcherHost_EnumerateDevices_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaDevicesDispatcherHost_EnumerateDevices_ResponseParams_Data) == 32,
    "Bad sizeof(MediaDevicesDispatcherHost_EnumerateDevices_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaDevicesDispatcherHost_GetVideoInputCapabilities_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaDevicesDispatcherHost_GetVideoInputCapabilities_Params_Data>;

    MediaDevicesDispatcherHost_GetVideoInputCapabilities_Params_Data();
    ~MediaDevicesDispatcherHost_GetVideoInputCapabilities_Params_Data() = delete;
};
static_assert(sizeof(MediaDevicesDispatcherHost_GetVideoInputCapabilities_Params_Data) == 8,
    "Bad sizeof(MediaDevicesDispatcherHost_GetVideoInputCapabilities_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaDevicesDispatcherHost_GetVideoInputCapabilities_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::VideoInputDeviceCapabilities_Data>>> video_input_device_capabilities;

private:
    friend class mojo::internal::MessageFragment<MediaDevicesDispatcherHost_GetVideoInputCapabilities_ResponseParams_Data>;

    MediaDevicesDispatcherHost_GetVideoInputCapabilities_ResponseParams_Data();
    ~MediaDevicesDispatcherHost_GetVideoInputCapabilities_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaDevicesDispatcherHost_GetVideoInputCapabilities_ResponseParams_Data) == 16,
    "Bad sizeof(MediaDevicesDispatcherHost_GetVideoInputCapabilities_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaDevicesDispatcherHost_GetAllVideoInputDeviceFormats_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> device_id;

private:
    friend class mojo::internal::MessageFragment<MediaDevicesDispatcherHost_GetAllVideoInputDeviceFormats_Params_Data>;

    MediaDevicesDispatcherHost_GetAllVideoInputDeviceFormats_Params_Data();
    ~MediaDevicesDispatcherHost_GetAllVideoInputDeviceFormats_Params_Data() = delete;
};
static_assert(sizeof(MediaDevicesDispatcherHost_GetAllVideoInputDeviceFormats_Params_Data) == 16,
    "Bad sizeof(MediaDevicesDispatcherHost_GetAllVideoInputDeviceFormats_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaDevicesDispatcherHost_GetAllVideoInputDeviceFormats_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::media::mojom::internal::VideoCaptureFormat_Data>>> formats;

private:
    friend class mojo::internal::MessageFragment<MediaDevicesDispatcherHost_GetAllVideoInputDeviceFormats_ResponseParams_Data>;

    MediaDevicesDispatcherHost_GetAllVideoInputDeviceFormats_ResponseParams_Data();
    ~MediaDevicesDispatcherHost_GetAllVideoInputDeviceFormats_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaDevicesDispatcherHost_GetAllVideoInputDeviceFormats_ResponseParams_Data) == 16,
    "Bad sizeof(MediaDevicesDispatcherHost_GetAllVideoInputDeviceFormats_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaDevicesDispatcherHost_GetAvailableVideoInputDeviceFormats_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> device_id;

private:
    friend class mojo::internal::MessageFragment<MediaDevicesDispatcherHost_GetAvailableVideoInputDeviceFormats_Params_Data>;

    MediaDevicesDispatcherHost_GetAvailableVideoInputDeviceFormats_Params_Data();
    ~MediaDevicesDispatcherHost_GetAvailableVideoInputDeviceFormats_Params_Data() = delete;
};
static_assert(sizeof(MediaDevicesDispatcherHost_GetAvailableVideoInputDeviceFormats_Params_Data) == 16,
    "Bad sizeof(MediaDevicesDispatcherHost_GetAvailableVideoInputDeviceFormats_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaDevicesDispatcherHost_GetAvailableVideoInputDeviceFormats_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::media::mojom::internal::VideoCaptureFormat_Data>>> formats;

private:
    friend class mojo::internal::MessageFragment<MediaDevicesDispatcherHost_GetAvailableVideoInputDeviceFormats_ResponseParams_Data>;

    MediaDevicesDispatcherHost_GetAvailableVideoInputDeviceFormats_ResponseParams_Data();
    ~MediaDevicesDispatcherHost_GetAvailableVideoInputDeviceFormats_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaDevicesDispatcherHost_GetAvailableVideoInputDeviceFormats_ResponseParams_Data) == 16,
    "Bad sizeof(MediaDevicesDispatcherHost_GetAvailableVideoInputDeviceFormats_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaDevicesDispatcherHost_GetAudioInputCapabilities_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaDevicesDispatcherHost_GetAudioInputCapabilities_Params_Data>;

    MediaDevicesDispatcherHost_GetAudioInputCapabilities_Params_Data();
    ~MediaDevicesDispatcherHost_GetAudioInputCapabilities_Params_Data() = delete;
};
static_assert(sizeof(MediaDevicesDispatcherHost_GetAudioInputCapabilities_Params_Data) == 8,
    "Bad sizeof(MediaDevicesDispatcherHost_GetAudioInputCapabilities_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaDevicesDispatcherHost_GetAudioInputCapabilities_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::AudioInputDeviceCapabilities_Data>>> audio_input_device_capabilities;

private:
    friend class mojo::internal::MessageFragment<MediaDevicesDispatcherHost_GetAudioInputCapabilities_ResponseParams_Data>;

    MediaDevicesDispatcherHost_GetAudioInputCapabilities_ResponseParams_Data();
    ~MediaDevicesDispatcherHost_GetAudioInputCapabilities_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaDevicesDispatcherHost_GetAudioInputCapabilities_ResponseParams_Data) == 16,
    "Bad sizeof(MediaDevicesDispatcherHost_GetAudioInputCapabilities_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaDevicesDispatcherHost_AddMediaDevicesListener_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t subscribe_audio_input : 1;
    uint8_t subscribe_video_input : 1;
    uint8_t subscribe_audio_output : 1;
    uint8_t pad2_[3];
    mojo::internal::Interface_Data listener;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaDevicesDispatcherHost_AddMediaDevicesListener_Params_Data>;

    MediaDevicesDispatcherHost_AddMediaDevicesListener_Params_Data();
    ~MediaDevicesDispatcherHost_AddMediaDevicesListener_Params_Data() = delete;
};
static_assert(
    sizeof(MediaDevicesDispatcherHost_AddMediaDevicesListener_Params_Data) == 24, "Bad sizeof(MediaDevicesDispatcherHost_AddMediaDevicesListener_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaDevicesDispatcherHost_SetCaptureHandleConfig_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::CaptureHandleConfig_Data> config;

private:
    friend class mojo::internal::MessageFragment<MediaDevicesDispatcherHost_SetCaptureHandleConfig_Params_Data>;

    MediaDevicesDispatcherHost_SetCaptureHandleConfig_Params_Data();
    ~MediaDevicesDispatcherHost_SetCaptureHandleConfig_Params_Data() = delete;
};
static_assert(
    sizeof(MediaDevicesDispatcherHost_SetCaptureHandleConfig_Params_Data) == 16, "Bad sizeof(MediaDevicesDispatcherHost_SetCaptureHandleConfig_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaDevicesDispatcherHost_CloseFocusWindowOfOpportunity_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> label;

private:
    friend class mojo::internal::MessageFragment<MediaDevicesDispatcherHost_CloseFocusWindowOfOpportunity_Params_Data>;

    MediaDevicesDispatcherHost_CloseFocusWindowOfOpportunity_Params_Data();
    ~MediaDevicesDispatcherHost_CloseFocusWindowOfOpportunity_Params_Data() = delete;
};
static_assert(sizeof(MediaDevicesDispatcherHost_CloseFocusWindowOfOpportunity_Params_Data) == 16,
    "Bad sizeof(MediaDevicesDispatcherHost_CloseFocusWindowOfOpportunity_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaDevicesDispatcherHost_ProduceSubCaptureTargetId_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaDevicesDispatcherHost_ProduceSubCaptureTargetId_Params_Data>;

    MediaDevicesDispatcherHost_ProduceSubCaptureTargetId_Params_Data();
    ~MediaDevicesDispatcherHost_ProduceSubCaptureTargetId_Params_Data() = delete;
};
static_assert(sizeof(MediaDevicesDispatcherHost_ProduceSubCaptureTargetId_Params_Data) == 16,
    "Bad sizeof(MediaDevicesDispatcherHost_ProduceSubCaptureTargetId_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaDevicesDispatcherHost_ProduceSubCaptureTargetId_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> id;

private:
    friend class mojo::internal::MessageFragment<MediaDevicesDispatcherHost_ProduceSubCaptureTargetId_ResponseParams_Data>;

    MediaDevicesDispatcherHost_ProduceSubCaptureTargetId_ResponseParams_Data();
    ~MediaDevicesDispatcherHost_ProduceSubCaptureTargetId_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaDevicesDispatcherHost_ProduceSubCaptureTargetId_ResponseParams_Data) == 16,
    "Bad sizeof(MediaDevicesDispatcherHost_ProduceSubCaptureTargetId_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaDevicesDispatcherHost_SelectAudioOutput_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> device_id;

private:
    friend class mojo::internal::MessageFragment<MediaDevicesDispatcherHost_SelectAudioOutput_Params_Data>;

    MediaDevicesDispatcherHost_SelectAudioOutput_Params_Data();
    ~MediaDevicesDispatcherHost_SelectAudioOutput_Params_Data() = delete;
};
static_assert(sizeof(MediaDevicesDispatcherHost_SelectAudioOutput_Params_Data) == 16, "Bad sizeof(MediaDevicesDispatcherHost_SelectAudioOutput_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaDevicesDispatcherHost_SelectAudioOutput_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SelectAudioOutputResult_Data> result;

private:
    friend class mojo::internal::MessageFragment<MediaDevicesDispatcherHost_SelectAudioOutput_ResponseParams_Data>;

    MediaDevicesDispatcherHost_SelectAudioOutput_ResponseParams_Data();
    ~MediaDevicesDispatcherHost_SelectAudioOutput_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaDevicesDispatcherHost_SelectAudioOutput_ResponseParams_Data) == 16,
    "Bad sizeof(MediaDevicesDispatcherHost_SelectAudioOutput_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaDevicesListener_OnDevicesChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t type;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::MediaDeviceInfo_Data>>> device_infos;

private:
    friend class mojo::internal::MessageFragment<MediaDevicesListener_OnDevicesChanged_Params_Data>;

    MediaDevicesListener_OnDevicesChanged_Params_Data();
    ~MediaDevicesListener_OnDevicesChanged_Params_Data() = delete;
};
static_assert(sizeof(MediaDevicesListener_OnDevicesChanged_Params_Data) == 24, "Bad sizeof(MediaDevicesListener_OnDevicesChanged_Params_Data)");

} // namespace internal

class MediaDevicesDispatcherHost_EnumerateDevices_ParamsDataView {
public:
    MediaDevicesDispatcherHost_EnumerateDevices_ParamsDataView() = default;

    MediaDevicesDispatcherHost_EnumerateDevices_ParamsDataView(internal::MediaDevicesDispatcherHost_EnumerateDevices_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    bool request_audio_input() const
    {
        return data_->request_audio_input;
    }
    bool request_video_input() const
    {
        return data_->request_video_input;
    }
    bool request_audio_output() const
    {
        return data_->request_audio_output;
    }
    bool request_video_input_capabilities() const
    {
        return data_->request_video_input_capabilities;
    }
