// third_party/blink/public/mojom/widget/platform_widget.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_WIDGET_PLATFORM_WIDGET_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_WIDGET_PLATFORM_WIDGET_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetCompositor_VisualStateRequest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WidgetCompositor_VisualStateRequest_Params_Data>;

    WidgetCompositor_VisualStateRequest_Params_Data();
    ~WidgetCompositor_VisualStateRequest_Params_Data() = delete;
};
static_assert(sizeof(WidgetCompositor_VisualStateRequest_Params_Data) == 8, "Bad sizeof(WidgetCompositor_VisualStateRequest_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetCompositor_VisualStateRequest_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WidgetCompositor_VisualStateRequest_ResponseParams_Data>;

    WidgetCompositor_VisualStateRequest_ResponseParams_Data();
    ~WidgetCompositor_VisualStateRequest_ResponseParams_Data() = delete;
};
static_assert(sizeof(WidgetCompositor_VisualStateRequest_ResponseParams_Data) == 8, "Bad sizeof(WidgetCompositor_VisualStateRequest_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetHost_SetCursor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::ui::mojom::internal::Cursor_Data> cursor;

private:
    friend class mojo::internal::MessageFragment<WidgetHost_SetCursor_Params_Data>;

    WidgetHost_SetCursor_Params_Data();
    ~WidgetHost_SetCursor_Params_Data() = delete;
};
static_assert(sizeof(WidgetHost_SetCursor_Params_Data) == 16, "Bad sizeof(WidgetHost_SetCursor_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetHost_UpdateTooltipUnderCursor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> tooltip_text;
    int32_t text_direction_hint;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WidgetHost_UpdateTooltipUnderCursor_Params_Data>;

    WidgetHost_UpdateTooltipUnderCursor_Params_Data();
    ~WidgetHost_UpdateTooltipUnderCursor_Params_Data() = delete;
};
static_assert(sizeof(WidgetHost_UpdateTooltipUnderCursor_Params_Data) == 24, "Bad sizeof(WidgetHost_UpdateTooltipUnderCursor_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetHost_UpdateTooltipFromKeyboard_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> tooltip_text;
    int32_t text_direction_hint;
    uint8_t pad1_[4];
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> bounds;

private:
    friend class mojo::internal::MessageFragment<WidgetHost_UpdateTooltipFromKeyboard_Params_Data>;

    WidgetHost_UpdateTooltipFromKeyboard_Params_Data();
    ~WidgetHost_UpdateTooltipFromKeyboard_Params_Data() = delete;
};
static_assert(sizeof(WidgetHost_UpdateTooltipFromKeyboard_Params_Data) == 32, "Bad sizeof(WidgetHost_UpdateTooltipFromKeyboard_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetHost_ClearKeyboardTriggeredTooltip_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WidgetHost_ClearKeyboardTriggeredTooltip_Params_Data>;

    WidgetHost_ClearKeyboardTriggeredTooltip_Params_Data();
    ~WidgetHost_ClearKeyboardTriggeredTooltip_Params_Data() = delete;
};
static_assert(sizeof(WidgetHost_ClearKeyboardTriggeredTooltip_Params_Data) == 8, "Bad sizeof(WidgetHost_ClearKeyboardTriggeredTooltip_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetHost_TextInputStateChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::ui::mojom::internal::TextInputState_Data> state;

private:
    friend class mojo::internal::MessageFragment<WidgetHost_TextInputStateChanged_Params_Data>;

    WidgetHost_TextInputStateChanged_Params_Data();
    ~WidgetHost_TextInputStateChanged_Params_Data() = delete;
};
static_assert(sizeof(WidgetHost_TextInputStateChanged_Params_Data) == 16, "Bad sizeof(WidgetHost_TextInputStateChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetHost_SelectionBoundsChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> anchor_rect;
    int32_t anchor_dir;
    int32_t focus_dir;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> focus_rect;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> bounding_box_rect;
    uint8_t is_anchor_first : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<WidgetHost_SelectionBoundsChanged_Params_Data>;

    WidgetHost_SelectionBoundsChanged_Params_Data();
    ~WidgetHost_SelectionBoundsChanged_Params_Data() = delete;
};
static_assert(sizeof(WidgetHost_SelectionBoundsChanged_Params_Data) == 48, "Bad sizeof(WidgetHost_SelectionBoundsChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetHost_CreateFrameSink_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data compositor_frame_sink_receiver;
    mojo::internal::Interface_Data compositor_frame_sink_client;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WidgetHost_CreateFrameSink_Params_Data>;

    WidgetHost_CreateFrameSink_Params_Data();
    ~WidgetHost_CreateFrameSink_Params_Data() = delete;
};
static_assert(sizeof(WidgetHost_CreateFrameSink_Params_Data) == 24, "Bad sizeof(WidgetHost_CreateFrameSink_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetHost_RegisterRenderFrameMetadataObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data render_frame_metadata_observer_client_receiver;
    mojo::internal::Interface_Data render_frame_metadata_observer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WidgetHost_RegisterRenderFrameMetadataObserver_Params_Data>;

    WidgetHost_RegisterRenderFrameMetadataObserver_Params_Data();
    ~WidgetHost_RegisterRenderFrameMetadataObserver_Params_Data() = delete;
};
static_assert(
    sizeof(WidgetHost_RegisterRenderFrameMetadataObserver_Params_Data) == 24, "Bad sizeof(WidgetHost_RegisterRenderFrameMetadataObserver_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) Widget_ForceRedraw_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<Widget_ForceRedraw_Params_Data>;

    Widget_ForceRedraw_Params_Data();
    ~Widget_ForceRedraw_Params_Data() = delete;
};
static_assert(sizeof(Widget_ForceRedraw_Params_Data) == 8, "Bad sizeof(Widget_ForceRedraw_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) Widget_ForceRedraw_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<Widget_ForceRedraw_ResponseParams_Data>;

    Widget_ForceRedraw_ResponseParams_Data();
    ~Widget_ForceRedraw_ResponseParams_Data() = delete;
};
static_assert(sizeof(Widget_ForceRedraw_ResponseParams_Data) == 8, "Bad sizeof(Widget_ForceRedraw_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) Widget_UpdateVisualProperties_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::VisualProperties_Data> visual_properties;

private:
    friend class mojo::internal::MessageFragment<Widget_UpdateVisualProperties_Params_Data>;

    Widget_UpdateVisualProperties_Params_Data();
    ~Widget_UpdateVisualProperties_Params_Data() = delete;
};
static_assert(sizeof(Widget_UpdateVisualProperties_Params_Data) == 16, "Bad sizeof(Widget_UpdateVisualProperties_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) Widget_UpdateScreenRects_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> widget_screen_rect;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> window_screen_rect;

private:
    friend class mojo::internal::MessageFragment<Widget_UpdateScreenRects_Params_Data>;

    Widget_UpdateScreenRects_Params_Data();
    ~Widget_UpdateScreenRects_Params_Data() = delete;
};
static_assert(sizeof(Widget_UpdateScreenRects_Params_Data) == 24, "Bad sizeof(Widget_UpdateScreenRects_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) Widget_UpdateScreenRects_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<Widget_UpdateScreenRects_ResponseParams_Data>;

    Widget_UpdateScreenRects_ResponseParams_Data();
    ~Widget_UpdateScreenRects_ResponseParams_Data() = delete;
};
static_assert(sizeof(Widget_UpdateScreenRects_ResponseParams_Data) == 8, "Bad sizeof(Widget_UpdateScreenRects_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) Widget_WasHidden_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<Widget_WasHidden_Params_Data>;

    Widget_WasHidden_Params_Data();
    ~Widget_WasHidden_Params_Data() = delete;
};
static_assert(sizeof(Widget_WasHidden_Params_Data) == 8, "Bad sizeof(Widget_WasHidden_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) Widget_WasShown_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t was_evicted : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<::blink::mojom::internal::RecordContentToVisibleTimeRequest_Data> record_tab_switch_time_request;

private:
    friend class mojo::internal::MessageFragment<Widget_WasShown_Params_Data>;

    Widget_WasShown_Params_Data();
    ~Widget_WasShown_Params_Data() = delete;
};
static_assert(sizeof(Widget_WasShown_Params_Data) == 24, "Bad sizeof(Widget_WasShown_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) Widget_RequestSuccessfulPresentationTimeForNextFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::RecordContentToVisibleTimeRequest_Data> visible_time_request;

private:
    friend class mojo::internal::MessageFragment<Widget_RequestSuccessfulPresentationTimeForNextFrame_Params_Data>;

    Widget_RequestSuccessfulPresentationTimeForNextFrame_Params_Data();
    ~Widget_RequestSuccessfulPresentationTimeForNextFrame_Params_Data() = delete;
};
static_assert(sizeof(Widget_RequestSuccessfulPresentationTimeForNextFrame_Params_Data) == 16,
    "Bad sizeof(Widget_RequestSuccessfulPresentationTimeForNextFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) Widget_CancelSuccessfulPresentationTimeRequest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<Widget_CancelSuccessfulPresentationTimeRequest_Params_Data>;

    Widget_CancelSuccessfulPresentationTimeRequest_Params_Data();
    ~Widget_CancelSuccessfulPresentationTimeRequest_Params_Data() = delete;
};
static_assert(
    sizeof(Widget_CancelSuccessfulPresentationTimeRequest_Params_Data) == 8, "Bad sizeof(Widget_CancelSuccessfulPresentationTimeRequest_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) Widget_SetupRenderInputRouterConnections_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data browser_client;
    mojo::internal::Handle_Data viz_client;

private:
    friend class mojo::internal::MessageFragment<Widget_SetupRenderInputRouterConnections_Params_Data>;

    Widget_SetupRenderInputRouterConnections_Params_Data();
    ~Widget_SetupRenderInputRouterConnections_Params_Data() = delete;
};
static_assert(sizeof(Widget_SetupRenderInputRouterConnections_Params_Data) == 16, "Bad sizeof(Widget_SetupRenderInputRouterConnections_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RenderInputRouterClient_GetWidgetInputHandler_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data request;
    mojo::internal::Interface_Data host;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<RenderInputRouterClient_GetWidgetInputHandler_Params_Data>;

    RenderInputRouterClient_GetWidgetInputHandler_Params_Data();
    ~RenderInputRouterClient_GetWidgetInputHandler_Params_Data() = delete;
};
static_assert(sizeof(RenderInputRouterClient_GetWidgetInputHandler_Params_Data) == 24, "Bad sizeof(RenderInputRouterClient_GetWidgetInputHandler_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RenderInputRouterClient_ShowContextMenu_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t source_type;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> location;

private:
    friend class mojo::internal::MessageFragment<RenderInputRouterClient_ShowContextMenu_Params_Data>;

    RenderInputRouterClient_ShowContextMenu_Params_Data();
    ~RenderInputRouterClient_ShowContextMenu_Params_Data() = delete;
};
static_assert(sizeof(RenderInputRouterClient_ShowContextMenu_Params_Data) == 24, "Bad sizeof(RenderInputRouterClient_ShowContextMenu_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RenderInputRouterClient_BindInputTargetClient_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data host;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<RenderInputRouterClient_BindInputTargetClient_Params_Data>;

    RenderInputRouterClient_BindInputTargetClient_Params_Data();
    ~RenderInputRouterClient_BindInputTargetClient_Params_Data() = delete;
};
static_assert(sizeof(RenderInputRouterClient_BindInputTargetClient_Params_Data) == 16, "Bad sizeof(RenderInputRouterClient_BindInputTargetClient_Params_Data)");

} // namespace internal

class WidgetCompositor_VisualStateRequest_ParamsDataView {
public:
    WidgetCompositor_VisualStateRequest_ParamsDataView() = default;

    WidgetCompositor_VisualStateRequest_ParamsDataView(internal::WidgetCompositor_VisualStateRequest_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::WidgetCompositor_VisualStateRequest_Params_Data* data_ = nullptr;
};

class WidgetCompositor_VisualStateRequest_ResponseParamsDataView {
public:
    WidgetCompositor_VisualStateRequest_ResponseParamsDataView() = default;

    WidgetCompositor_VisualStateRequest_ResponseParamsDataView(internal::WidgetCompositor_VisualStateRequest_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

