// components/commerce/core/internals/mojom/commerce_internals.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_COMMERCE_CORE_INTERNALS_MOJOM_COMMERCE_INTERNALS_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_COMMERCE_CORE_INTERNALS_MOJOM_COMMERCE_INTERNALS_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace commerce::mojom {
namespace internal {
class CommerceInternalsHandlerFactory_CreateCommerceInternalsHandler_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data page;
    mojo::internal::Handle_Data handler;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CommerceInternalsHandlerFactory_CreateCommerceInternalsHandler_Params_Data>;

    CommerceInternalsHandlerFactory_CreateCommerceInternalsHandler_Params_Data();
    ~CommerceInternalsHandlerFactory_CreateCommerceInternalsHandler_Params_Data() = delete;
};
static_assert(sizeof(CommerceInternalsHandlerFactory_CreateCommerceInternalsHandler_Params_Data) == 24,
    "Bad sizeof(CommerceInternalsHandlerFactory_CreateCommerceInternalsHandler_Params_Data)");
class CommerceInternalsHandler_GetIsShoppingListEligible_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CommerceInternalsHandler_GetIsShoppingListEligible_Params_Data>;

    CommerceInternalsHandler_GetIsShoppingListEligible_Params_Data();
    ~CommerceInternalsHandler_GetIsShoppingListEligible_Params_Data() = delete;
};
static_assert(
    sizeof(CommerceInternalsHandler_GetIsShoppingListEligible_Params_Data) == 8, "Bad sizeof(CommerceInternalsHandler_GetIsShoppingListEligible_Params_Data)");
class CommerceInternalsHandler_GetIsShoppingListEligible_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t eligible : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<CommerceInternalsHandler_GetIsShoppingListEligible_ResponseParams_Data>;

    CommerceInternalsHandler_GetIsShoppingListEligible_ResponseParams_Data();
    ~CommerceInternalsHandler_GetIsShoppingListEligible_ResponseParams_Data() = delete;
};
static_assert(sizeof(CommerceInternalsHandler_GetIsShoppingListEligible_ResponseParams_Data) == 16,
    "Bad sizeof(CommerceInternalsHandler_GetIsShoppingListEligible_ResponseParams_Data)");
class CommerceInternalsHandler_ResetPriceTrackingEmailPref_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CommerceInternalsHandler_ResetPriceTrackingEmailPref_Params_Data>;

    CommerceInternalsHandler_ResetPriceTrackingEmailPref_Params_Data();
    ~CommerceInternalsHandler_ResetPriceTrackingEmailPref_Params_Data() = delete;
};
static_assert(sizeof(CommerceInternalsHandler_ResetPriceTrackingEmailPref_Params_Data) == 8,
    "Bad sizeof(CommerceInternalsHandler_ResetPriceTrackingEmailPref_Params_Data)");
class CommerceInternalsHandler_GetProductInfoForUrl_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<CommerceInternalsHandler_GetProductInfoForUrl_Params_Data>;

    CommerceInternalsHandler_GetProductInfoForUrl_Params_Data();
    ~CommerceInternalsHandler_GetProductInfoForUrl_Params_Data() = delete;
};
static_assert(sizeof(CommerceInternalsHandler_GetProductInfoForUrl_Params_Data) == 16, "Bad sizeof(CommerceInternalsHandler_GetProductInfoForUrl_Params_Data)");
class CommerceInternalsHandler_GetProductInfoForUrl_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::shopping_service::mojom::internal::ProductInfo_Data> info;

private:
    friend class mojo::internal::MessageFragment<CommerceInternalsHandler_GetProductInfoForUrl_ResponseParams_Data>;

    CommerceInternalsHandler_GetProductInfoForUrl_ResponseParams_Data();
    ~CommerceInternalsHandler_GetProductInfoForUrl_ResponseParams_Data() = delete;
};
static_assert(sizeof(CommerceInternalsHandler_GetProductInfoForUrl_ResponseParams_Data) == 16,
    "Bad sizeof(CommerceInternalsHandler_GetProductInfoForUrl_ResponseParams_Data)");
class CommerceInternalsHandler_GetSubscriptionDetails_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CommerceInternalsHandler_GetSubscriptionDetails_Params_Data>;

    CommerceInternalsHandler_GetSubscriptionDetails_Params_Data();
    ~CommerceInternalsHandler_GetSubscriptionDetails_Params_Data() = delete;
};
static_assert(
    sizeof(CommerceInternalsHandler_GetSubscriptionDetails_Params_Data) == 8, "Bad sizeof(CommerceInternalsHandler_GetSubscriptionDetails_Params_Data)");
class CommerceInternalsHandler_GetSubscriptionDetails_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::Subscription_Data>>> subscriptions;

private:
    friend class mojo::internal::MessageFragment<CommerceInternalsHandler_GetSubscriptionDetails_ResponseParams_Data>;

    CommerceInternalsHandler_GetSubscriptionDetails_ResponseParams_Data();
    ~CommerceInternalsHandler_GetSubscriptionDetails_ResponseParams_Data() = delete;
};
static_assert(sizeof(CommerceInternalsHandler_GetSubscriptionDetails_ResponseParams_Data) == 16,
    "Bad sizeof(CommerceInternalsHandler_GetSubscriptionDetails_ResponseParams_Data)");
class CommerceInternalsHandler_GetProductSpecificationsDetails_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CommerceInternalsHandler_GetProductSpecificationsDetails_Params_Data>;

    CommerceInternalsHandler_GetProductSpecificationsDetails_Params_Data();
    ~CommerceInternalsHandler_GetProductSpecificationsDetails_Params_Data() = delete;
};
static_assert(sizeof(CommerceInternalsHandler_GetProductSpecificationsDetails_Params_Data) == 8,
    "Bad sizeof(CommerceInternalsHandler_GetProductSpecificationsDetails_Params_Data)");
class CommerceInternalsHandler_GetProductSpecificationsDetails_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::ProductSpecificationsSet_Data>>> product_specifications_set;

private:
    friend class mojo::internal::MessageFragment<CommerceInternalsHandler_GetProductSpecificationsDetails_ResponseParams_Data>;

    CommerceInternalsHandler_GetProductSpecificationsDetails_ResponseParams_Data();
    ~CommerceInternalsHandler_GetProductSpecificationsDetails_ResponseParams_Data() = delete;
};
static_assert(sizeof(CommerceInternalsHandler_GetProductSpecificationsDetails_ResponseParams_Data) == 16,
    "Bad sizeof(CommerceInternalsHandler_GetProductSpecificationsDetails_ResponseParams_Data)");
class CommerceInternalsHandler_ResetProductSpecifications_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CommerceInternalsHandler_ResetProductSpecifications_Params_Data>;

    CommerceInternalsHandler_ResetProductSpecifications_Params_Data();
    ~CommerceInternalsHandler_ResetProductSpecifications_Params_Data() = delete;
};
static_assert(sizeof(CommerceInternalsHandler_ResetProductSpecifications_Params_Data) == 8,
    "Bad sizeof(CommerceInternalsHandler_ResetProductSpecifications_Params_Data)");
class CommerceInternalsHandler_GetShoppingEligibilityDetails_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CommerceInternalsHandler_GetShoppingEligibilityDetails_Params_Data>;

    CommerceInternalsHandler_GetShoppingEligibilityDetails_Params_Data();
    ~CommerceInternalsHandler_GetShoppingEligibilityDetails_Params_Data() = delete;
};
static_assert(sizeof(CommerceInternalsHandler_GetShoppingEligibilityDetails_Params_Data) == 8,
    "Bad sizeof(CommerceInternalsHandler_GetShoppingEligibilityDetails_Params_Data)");
class CommerceInternalsHandler_GetShoppingEligibilityDetails_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::ShoppingEligibilityDetails_Data> details;

private:
    friend class mojo::internal::MessageFragment<CommerceInternalsHandler_GetShoppingEligibilityDetails_ResponseParams_Data>;

    CommerceInternalsHandler_GetShoppingEligibilityDetails_ResponseParams_Data();
    ~CommerceInternalsHandler_GetShoppingEligibilityDetails_ResponseParams_Data() = delete;
};
static_assert(sizeof(CommerceInternalsHandler_GetShoppingEligibilityDetails_ResponseParams_Data) == 16,
    "Bad sizeof(CommerceInternalsHandler_GetShoppingEligibilityDetails_ResponseParams_Data)");
class CommerceInternalsPage_OnShoppingListEligibilityChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t eligible : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<CommerceInternalsPage_OnShoppingListEligibilityChanged_Params_Data>;

    CommerceInternalsPage_OnShoppingListEligibilityChanged_Params_Data();
    ~CommerceInternalsPage_OnShoppingListEligibilityChanged_Params_Data() = delete;
};
static_assert(sizeof(CommerceInternalsPage_OnShoppingListEligibilityChanged_Params_Data) == 16,
    "Bad sizeof(CommerceInternalsPage_OnShoppingListEligibilityChanged_Params_Data)");

} // namespace internal

class CommerceInternalsHandlerFactory_CreateCommerceInternalsHandler_ParamsDataView {
public:
    CommerceInternalsHandlerFactory_CreateCommerceInternalsHandler_ParamsDataView() = default;

    CommerceInternalsHandlerFactory_CreateCommerceInternalsHandler_ParamsDataView(
        internal::CommerceInternalsHandlerFactory_CreateCommerceInternalsHandler_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakePage()
    {
        UserType result;
        bool ret
            = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::commerce::mojom::CommerceInternalsPageInterfaceBase>>(&data_->page, &result, message_);
        DCHECK(ret);
        return result;
    }
    template <typename UserType> UserType TakeHandler()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::commerce::mojom::CommerceInternalsHandlerInterfaceBase>>(
            &data_->handler, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::CommerceInternalsHandlerFactory_CreateCommerceInternalsHandler_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class CommerceInternalsHandler_GetIsShoppingListEligible_ParamsDataView {
public:
    CommerceInternalsHandler_GetIsShoppingListEligible_ParamsDataView() = default;

    CommerceInternalsHandler_GetIsShoppingListEligible_ParamsDataView(
        internal::CommerceInternalsHandler_GetIsShoppingListEligible_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::CommerceInternalsHandler_GetIsShoppingListEligible_Params_Data* data_ = nullptr;
};

class CommerceInternalsHandler_GetIsShoppingListEligible_ResponseParamsDataView {
public:
    CommerceInternalsHandler_GetIsShoppingListEligible_ResponseParamsDataView() = default;

    CommerceInternalsHandler_GetIsShoppingListEligible_ResponseParamsDataView(
        internal::CommerceInternalsHandler_GetIsShoppingListEligible_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    bool eligible() const
    {
        return data_->eligible;
    }

private:
    internal::CommerceInternalsHandler_GetIsShoppingListEligible_ResponseParams_Data* data_ = nullptr;
};

class CommerceInternalsHandler_ResetPriceTrackingEmailPref_ParamsDataView {
public:
    CommerceInternalsHandler_ResetPriceTrackingEmailPref_ParamsDataView() = default;

    CommerceInternalsHandler_ResetPriceTrackingEmailPref_ParamsDataView(
        internal::CommerceInternalsHandler_ResetPriceTrackingEmailPref_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::CommerceInternalsHandler_ResetPriceTrackingEmailPref_Params_Data* data_ = nullptr;
};

class CommerceInternalsHandler_GetProductInfoForUrl_ParamsDataView {
public:
    CommerceInternalsHandler_GetProductInfoForUrl_ParamsDataView() = default;

    CommerceInternalsHandler_GetProductInfoForUrl_ParamsDataView(
        internal::CommerceInternalsHandler_GetProductInfoForUrl_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetUrlDataView(::url::mojom::UrlDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadUrl(UserType* output)
    {

        auto* pointer = data_->url.Get();
        return mojo::internal::Deserialize<::url::mojom::UrlDataView>(pointer, output, message_);
    }

private:
    internal::CommerceInternalsHandler_GetProductInfoForUrl_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class CommerceInternalsHandler_GetProductInfoForUrl_ResponseParamsDataView {
public:
    CommerceInternalsHandler_GetProductInfoForUrl_ResponseParamsDataView() = default;

    CommerceInternalsHandler_GetProductInfoForUrl_ResponseParamsDataView(
        internal::CommerceInternalsHandler_GetProductInfoForUrl_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetInfoDataView(::shopping_service::mojom::ProductInfoDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadInfo(UserType* output)
    {

        auto* pointer = data_->info.Get();
        return mojo::internal::Deserialize<::shopping_service::mojom::ProductInfoDataView>(pointer, output, message_);
    }

private:
    internal::CommerceInternalsHandler_GetProductInfoForUrl_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class CommerceInternalsHandler_GetSubscriptionDetails_ParamsDataView {
public:
    CommerceInternalsHandler_GetSubscriptionDetails_ParamsDataView() = default;

    CommerceInternalsHandler_GetSubscriptionDetails_ParamsDataView(
        internal::CommerceInternalsHandler_GetSubscriptionDetails_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::CommerceInternalsHandler_GetSubscriptionDetails_Params_Data* data_ = nullptr;
};

class CommerceInternalsHandler_GetSubscriptionDetails_ResponseParamsDataView {
public:
    CommerceInternalsHandler_GetSubscriptionDetails_ResponseParamsDataView() = default;

    CommerceInternalsHandler_GetSubscriptionDetails_ResponseParamsDataView(
        internal::CommerceInternalsHandler_GetSubscriptionDetails_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetSubscriptionsDataView(mojo::ArrayDataView<SubscriptionDataView>* output);

    template <typename UserType> [[nodiscard]] bool ReadSubscriptions(UserType* output)
    {

        auto* pointer = data_->subscriptions.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<::commerce::mojom::SubscriptionDataView>>(pointer, output, message_);
    }

private:
    internal::CommerceInternalsHandler_GetSubscriptionDetails_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class CommerceInternalsHandler_GetProductSpecificationsDetails_ParamsDataView {
public:
    CommerceInternalsHandler_GetProductSpecificationsDetails_ParamsDataView() = default;

    CommerceInternalsHandler_GetProductSpecificationsDetails_ParamsDataView(
        internal::CommerceInternalsHandler_GetProductSpecificationsDetails_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::CommerceInternalsHandler_GetProductSpecificationsDetails_Params_Data* data_ = nullptr;
};

class CommerceInternalsHandler_GetProductSpecificationsDetails_ResponseParamsDataView {
public:
    CommerceInternalsHandler_GetProductSpecificationsDetails_ResponseParamsDataView() = default;

    CommerceInternalsHandler_GetProductSpecificationsDetails_ResponseParamsDataView(
        internal::CommerceInternalsHandler_GetProductSpecificationsDetails_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetProductSpecificationsSetDataView(mojo::ArrayDataView<ProductSpecificationsSetDataView>* output);

    template <typename UserType> [[nodiscard]] bool ReadProductSpecificationsSet(UserType* output)
    {

        auto* pointer = data_->product_specifications_set.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<::commerce::mojom::ProductSpecificationsSetDataView>>(pointer, output, message_);
    }

private:
    internal::CommerceInternalsHandler_GetProductSpecificationsDetails_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class CommerceInternalsHandler_ResetProductSpecifications_ParamsDataView {
public:
    CommerceInternalsHandler_ResetProductSpecifications_ParamsDataView() = default;

    CommerceInternalsHandler_ResetProductSpecifications_ParamsDataView(
        internal::CommerceInternalsHandler_ResetProductSpecifications_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::CommerceInternalsHandler_ResetProductSpecifications_Params_Data* data_ = nullptr;
};

class CommerceInternalsHandler_GetShoppingEligibilityDetails_ParamsDataView {
public:
    CommerceInternalsHandler_GetShoppingEligibilityDetails_ParamsDataView() = default;

    CommerceInternalsHandler_GetShoppingEligibilityDetails_ParamsDataView(
        internal::CommerceInternalsHandler_GetShoppingEligibilityDetails_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::CommerceInternalsHandler_GetShoppingEligibilityDetails_Params_Data* data_ = nullptr;
};

class CommerceInternalsHandler_GetShoppingEligibilityDetails_ResponseParamsDataView {
public:
    CommerceInternalsHandler_GetShoppingEligibilityDetails_ResponseParamsDataView() = default;

    CommerceInternalsHandler_GetShoppingEligibilityDetails_ResponseParamsDataView(
        internal::CommerceInternalsHandler_GetShoppingEligibilityDetails_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetDetailsDataView(ShoppingEligibilityDetailsDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadDetails(UserType* output)
    {

        auto* pointer = data_->details.Get();
        return mojo::internal::Deserialize<::commerce::mojom::ShoppingEligibilityDetailsDataView>(pointer, output, message_);
    }

private:
    internal::CommerceInternalsHandler_GetShoppingEligibilityDetails_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class CommerceInternalsPage_OnShoppingListEligibilityChanged_ParamsDataView {
public:
    CommerceInternalsPage_OnShoppingListEligibilityChanged_ParamsDataView() = default;

    CommerceInternalsPage_OnShoppingListEligibilityChanged_ParamsDataView(
        internal::CommerceInternalsPage_OnShoppingListEligibilityChanged_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    bool eligible() const
    {
        return data_->eligible;
    }

private:
    internal::CommerceInternalsPage_OnShoppingListEligibilityChanged_Params_Data* data_ = nullptr;
};

inline void CommerceInternalsHandler_GetProductInfoForUrl_ParamsDataView::GetUrlDataView(::url::mojom::UrlDataView* output)
{
    auto pointer = data_->url.Get();
    *output = ::url::mojom::UrlDataView(pointer, message_);
}

inline void CommerceInternalsHandler_GetProductInfoForUrl_ResponseParamsDataView::GetInfoDataView(::shopping_service::mojom::ProductInfoDataView* output)
{
    auto pointer = data_->info.Get();
    *output = ::shopping_service::mojom::ProductInfoDataView(pointer, message_);
}

inline void CommerceInternalsHandler_GetSubscriptionDetails_ResponseParamsDataView::GetSubscriptionsDataView(mojo::ArrayDataView<SubscriptionDataView>* output)
{
    auto pointer = data_->subscriptions.Get();
    *output = mojo::ArrayDataView<SubscriptionDataView>(pointer, message_);
}

inline void CommerceInternalsHandler_GetProductSpecificationsDetails_ResponseParamsDataView::GetProductSpecificationsSetDataView(
    mojo::ArrayDataView<ProductSpecificationsSetDataView>* output)
{
    auto pointer = data_->product_specifications_set.Get();
    *output = mojo::ArrayDataView<ProductSpecificationsSetDataView>(pointer, message_);
}

inline void CommerceInternalsHandler_GetShoppingEligibilityDetails_ResponseParamsDataView::GetDetailsDataView(ShoppingEligibilityDetailsDataView* output)
{
    auto pointer = data_->details.Get();
    *output = ShoppingEligibilityDetailsDataView(pointer, message_);
}

} // commerce::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // COMPONENTS_COMMERCE_CORE_INTERNALS_MOJOM_COMMERCE_INTERNALS_MOJOM_PARAMS_DATA_H_
