// components/services/storage/public/mojom/filesystem/directory.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_SERVICES_STORAGE_PUBLIC_MOJOM_FILESYSTEM_DIRECTORY_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_SERVICES_STORAGE_PUBLIC_MOJOM_FILESYSTEM_DIRECTORY_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace storage::mojom {
namespace internal {
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) FileLock_Release_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FileLock_Release_Params_Data>;

    FileLock_Release_Params_Data();
    ~FileLock_Release_Params_Data() = delete;
};
static_assert(sizeof(FileLock_Release_Params_Data) == 8, "Bad sizeof(FileLock_Release_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) FileLock_Release_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileLock_Release_ResponseParams_Data>;

    FileLock_Release_ResponseParams_Data();
    ~FileLock_Release_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileLock_Release_ResponseParams_Data) == 16, "Bad sizeof(FileLock_Release_ResponseParams_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_Clone_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Directory_Clone_Params_Data>;

    Directory_Clone_Params_Data();
    ~Directory_Clone_Params_Data() = delete;
};
static_assert(sizeof(Directory_Clone_Params_Data) == 16, "Bad sizeof(Directory_Clone_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_PathExists_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::StrictRelativePath_Data> path;

private:
    friend class mojo::internal::MessageFragment<Directory_PathExists_Params_Data>;

    Directory_PathExists_Params_Data();
    ~Directory_PathExists_Params_Data() = delete;
};
static_assert(sizeof(Directory_PathExists_Params_Data) == 16, "Bad sizeof(Directory_PathExists_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_PathExists_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t exists : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<Directory_PathExists_ResponseParams_Data>;

    Directory_PathExists_ResponseParams_Data();
    ~Directory_PathExists_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_PathExists_ResponseParams_Data) == 16, "Bad sizeof(Directory_PathExists_ResponseParams_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_GetEntries_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::StrictRelativePath_Data> path;
    int32_t mode;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Directory_GetEntries_Params_Data>;

    Directory_GetEntries_Params_Data();
    ~Directory_GetEntries_Params_Data() = delete;
};
static_assert(sizeof(Directory_GetEntries_Params_Data) == 24, "Bad sizeof(Directory_GetEntries_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_GetEntries_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data>>> entries;

private:
    friend class mojo::internal::MessageFragment<Directory_GetEntries_ResponseParams_Data>;

    Directory_GetEntries_ResponseParams_Data();
    ~Directory_GetEntries_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_GetEntries_ResponseParams_Data) == 24, "Bad sizeof(Directory_GetEntries_ResponseParams_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_OpenFile_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::StrictRelativePath_Data> path;
    int32_t mode;
    int32_t read_access;
    int32_t write_access;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Directory_OpenFile_Params_Data>;

    Directory_OpenFile_Params_Data();
    ~Directory_OpenFile_Params_Data() = delete;
};
static_assert(sizeof(Directory_OpenFile_Params_Data) == 32, "Bad sizeof(Directory_OpenFile_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_OpenFile_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::File_Data> file;

private:
    friend class mojo::internal::MessageFragment<Directory_OpenFile_ResponseParams_Data>;

    Directory_OpenFile_ResponseParams_Data();
    ~Directory_OpenFile_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_OpenFile_ResponseParams_Data) == 24, "Bad sizeof(Directory_OpenFile_ResponseParams_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_CreateDirectory_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::StrictRelativePath_Data> path;

private:
    friend class mojo::internal::MessageFragment<Directory_CreateDirectory_Params_Data>;

    Directory_CreateDirectory_Params_Data();
    ~Directory_CreateDirectory_Params_Data() = delete;
};
static_assert(sizeof(Directory_CreateDirectory_Params_Data) == 16, "Bad sizeof(Directory_CreateDirectory_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_CreateDirectory_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Directory_CreateDirectory_ResponseParams_Data>;

    Directory_CreateDirectory_ResponseParams_Data();
    ~Directory_CreateDirectory_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_CreateDirectory_ResponseParams_Data) == 16, "Bad sizeof(Directory_CreateDirectory_ResponseParams_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_DeleteFile_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::StrictRelativePath_Data> path;

private:
    friend class mojo::internal::MessageFragment<Directory_DeleteFile_Params_Data>;

    Directory_DeleteFile_Params_Data();
    ~Directory_DeleteFile_Params_Data() = delete;
};
static_assert(sizeof(Directory_DeleteFile_Params_Data) == 16, "Bad sizeof(Directory_DeleteFile_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_DeleteFile_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<Directory_DeleteFile_ResponseParams_Data>;

    Directory_DeleteFile_ResponseParams_Data();
    ~Directory_DeleteFile_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_DeleteFile_ResponseParams_Data) == 16, "Bad sizeof(Directory_DeleteFile_ResponseParams_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_GetFileInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::StrictRelativePath_Data> path;

private:
    friend class mojo::internal::MessageFragment<Directory_GetFileInfo_Params_Data>;

    Directory_GetFileInfo_Params_Data();
    ~Directory_GetFileInfo_Params_Data() = delete;
};
static_assert(sizeof(Directory_GetFileInfo_Params_Data) == 16, "Bad sizeof(Directory_GetFileInfo_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_GetFileInfo_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FileInfo_Data> info;

private:
    friend class mojo::internal::MessageFragment<Directory_GetFileInfo_ResponseParams_Data>;

    Directory_GetFileInfo_ResponseParams_Data();
    ~Directory_GetFileInfo_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_GetFileInfo_ResponseParams_Data) == 16, "Bad sizeof(Directory_GetFileInfo_ResponseParams_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_GetPathAccess_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::StrictRelativePath_Data> path;

private:
    friend class mojo::internal::MessageFragment<Directory_GetPathAccess_Params_Data>;

    Directory_GetPathAccess_Params_Data();
    ~Directory_GetPathAccess_Params_Data() = delete;
};
static_assert(sizeof(Directory_GetPathAccess_Params_Data) == 16, "Bad sizeof(Directory_GetPathAccess_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_GetPathAccess_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PathAccessInfo_Data> info;

private:
    friend class mojo::internal::MessageFragment<Directory_GetPathAccess_ResponseParams_Data>;

    Directory_GetPathAccess_ResponseParams_Data();
    ~Directory_GetPathAccess_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_GetPathAccess_ResponseParams_Data) == 16, "Bad sizeof(Directory_GetPathAccess_ResponseParams_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_RenameFile_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::StrictRelativePath_Data> old_path;
    mojo::internal::Pointer<internal::StrictRelativePath_Data> new_path;

private:
    friend class mojo::internal::MessageFragment<Directory_RenameFile_Params_Data>;

    Directory_RenameFile_Params_Data();
    ~Directory_RenameFile_Params_Data() = delete;
};
static_assert(sizeof(Directory_RenameFile_Params_Data) == 24, "Bad sizeof(Directory_RenameFile_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_RenameFile_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Directory_RenameFile_ResponseParams_Data>;

    Directory_RenameFile_ResponseParams_Data();
    ~Directory_RenameFile_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_RenameFile_ResponseParams_Data) == 16, "Bad sizeof(Directory_RenameFile_ResponseParams_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_LockFile_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::StrictRelativePath_Data> path;

private:
    friend class mojo::internal::MessageFragment<Directory_LockFile_Params_Data>;

    Directory_LockFile_Params_Data();
    ~Directory_LockFile_Params_Data() = delete;
};
static_assert(sizeof(Directory_LockFile_Params_Data) == 16, "Bad sizeof(Directory_LockFile_Params_Data)");
class COMPONENT_EXPORT(STORAGE_SERVICE_FILESYSTEM_MOJOM_SHARED) Directory_LockFile_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    mojo::internal::Interface_Data lock;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Directory_LockFile_ResponseParams_Data>;

    Directory_LockFile_ResponseParams_Data();
    ~Directory_LockFile_ResponseParams_Data() = delete;
};
static_assert(sizeof(Directory_LockFile_ResponseParams_Data) == 24, "Bad sizeof(Directory_LockFile_ResponseParams_Data)");

} // namespace internal

class FileLock_Release_ParamsDataView {
public:
    FileLock_Release_ParamsDataView() = default;

    FileLock_Release_ParamsDataView(internal::FileLock_Release_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::FileLock_Release_Params_Data* data_ = nullptr;
};

class FileLock_Release_ResponseParamsDataView {
public:
    FileLock_Release_ResponseParamsDataView() = default;

    FileLock_Release_ResponseParamsDataView(internal::FileLock_Release_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadError(UserType* output) const
    {
        auto data_value = data_->error;
