// third_party/blink/public/mojom/webid/federated_auth_request.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_WEBID_FEDERATED_AUTH_REQUEST_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_WEBID_FEDERATED_AUTH_REQUEST_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FederatedAuthRequest_RequestToken_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::IdentityProviderGetParameters_Data>>> idp_get_params;
    int32_t requirement;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FederatedAuthRequest_RequestToken_Params_Data>;

    FederatedAuthRequest_RequestToken_Params_Data();
    ~FederatedAuthRequest_RequestToken_Params_Data() = delete;
};
static_assert(sizeof(FederatedAuthRequest_RequestToken_Params_Data) == 24, "Bad sizeof(FederatedAuthRequest_RequestToken_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FederatedAuthRequest_RequestToken_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t is_auto_selected : 1;
    uint8_t pad1_[3];
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> selected_identity_provider_config_url;
    mojo::internal::Pointer<mojo::internal::String_Data> token;
    mojo::internal::Pointer<internal::TokenError_Data> error;

private:
    friend class mojo::internal::MessageFragment<FederatedAuthRequest_RequestToken_ResponseParams_Data>;

    FederatedAuthRequest_RequestToken_ResponseParams_Data();
    ~FederatedAuthRequest_RequestToken_ResponseParams_Data() = delete;
};
static_assert(sizeof(FederatedAuthRequest_RequestToken_ResponseParams_Data) == 40, "Bad sizeof(FederatedAuthRequest_RequestToken_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FederatedAuthRequest_RequestUserInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::IdentityProviderConfig_Data> provider;

private:
    friend class mojo::internal::MessageFragment<FederatedAuthRequest_RequestUserInfo_Params_Data>;

    FederatedAuthRequest_RequestUserInfo_Params_Data();
    ~FederatedAuthRequest_RequestUserInfo_Params_Data() = delete;
};
static_assert(sizeof(FederatedAuthRequest_RequestUserInfo_Params_Data) == 16, "Bad sizeof(FederatedAuthRequest_RequestUserInfo_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FederatedAuthRequest_RequestUserInfo_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::IdentityUserInfo_Data>>> user_info;

private:
    friend class mojo::internal::MessageFragment<FederatedAuthRequest_RequestUserInfo_ResponseParams_Data>;

    FederatedAuthRequest_RequestUserInfo_ResponseParams_Data();
    ~FederatedAuthRequest_RequestUserInfo_ResponseParams_Data() = delete;
};
static_assert(sizeof(FederatedAuthRequest_RequestUserInfo_ResponseParams_Data) == 24, "Bad sizeof(FederatedAuthRequest_RequestUserInfo_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FederatedAuthRequest_CancelTokenRequest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FederatedAuthRequest_CancelTokenRequest_Params_Data>;

    FederatedAuthRequest_CancelTokenRequest_Params_Data();
    ~FederatedAuthRequest_CancelTokenRequest_Params_Data() = delete;
};
static_assert(sizeof(FederatedAuthRequest_CancelTokenRequest_Params_Data) == 8, "Bad sizeof(FederatedAuthRequest_CancelTokenRequest_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FederatedAuthRequest_ResolveTokenRequest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> account_id;
    mojo::internal::Pointer<mojo::internal::String_Data> token;

private:
    friend class mojo::internal::MessageFragment<FederatedAuthRequest_ResolveTokenRequest_Params_Data>;

    FederatedAuthRequest_ResolveTokenRequest_Params_Data();
    ~FederatedAuthRequest_ResolveTokenRequest_Params_Data() = delete;
};
static_assert(sizeof(FederatedAuthRequest_ResolveTokenRequest_Params_Data) == 24, "Bad sizeof(FederatedAuthRequest_ResolveTokenRequest_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FederatedAuthRequest_ResolveTokenRequest_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FederatedAuthRequest_ResolveTokenRequest_ResponseParams_Data>;

    FederatedAuthRequest_ResolveTokenRequest_ResponseParams_Data();
    ~FederatedAuthRequest_ResolveTokenRequest_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(FederatedAuthRequest_ResolveTokenRequest_ResponseParams_Data) == 16, "Bad sizeof(FederatedAuthRequest_ResolveTokenRequest_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FederatedAuthRequest_SetIdpSigninStatus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> origin;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FederatedAuthRequest_SetIdpSigninStatus_Params_Data>;

    FederatedAuthRequest_SetIdpSigninStatus_Params_Data();
    ~FederatedAuthRequest_SetIdpSigninStatus_Params_Data() = delete;
};
static_assert(sizeof(FederatedAuthRequest_SetIdpSigninStatus_Params_Data) == 24, "Bad sizeof(FederatedAuthRequest_SetIdpSigninStatus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FederatedAuthRequest_RegisterIdP_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<FederatedAuthRequest_RegisterIdP_Params_Data>;

    FederatedAuthRequest_RegisterIdP_Params_Data();
    ~FederatedAuthRequest_RegisterIdP_Params_Data() = delete;
};
static_assert(sizeof(FederatedAuthRequest_RegisterIdP_Params_Data) == 16, "Bad sizeof(FederatedAuthRequest_RegisterIdP_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FederatedAuthRequest_RegisterIdP_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FederatedAuthRequest_RegisterIdP_ResponseParams_Data>;

    FederatedAuthRequest_RegisterIdP_ResponseParams_Data();
    ~FederatedAuthRequest_RegisterIdP_ResponseParams_Data() = delete;
};
static_assert(sizeof(FederatedAuthRequest_RegisterIdP_ResponseParams_Data) == 16, "Bad sizeof(FederatedAuthRequest_RegisterIdP_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FederatedAuthRequest_UnregisterIdP_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<FederatedAuthRequest_UnregisterIdP_Params_Data>;

    FederatedAuthRequest_UnregisterIdP_Params_Data();
    ~FederatedAuthRequest_UnregisterIdP_Params_Data() = delete;
};
static_assert(sizeof(FederatedAuthRequest_UnregisterIdP_Params_Data) == 16, "Bad sizeof(FederatedAuthRequest_UnregisterIdP_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FederatedAuthRequest_UnregisterIdP_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FederatedAuthRequest_UnregisterIdP_ResponseParams_Data>;

    FederatedAuthRequest_UnregisterIdP_ResponseParams_Data();
    ~FederatedAuthRequest_UnregisterIdP_ResponseParams_Data() = delete;
};
static_assert(sizeof(FederatedAuthRequest_UnregisterIdP_ResponseParams_Data) == 16, "Bad sizeof(FederatedAuthRequest_UnregisterIdP_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FederatedAuthRequest_CloseModalDialogView_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FederatedAuthRequest_CloseModalDialogView_Params_Data>;

    FederatedAuthRequest_CloseModalDialogView_Params_Data();
    ~FederatedAuthRequest_CloseModalDialogView_Params_Data() = delete;
};
static_assert(sizeof(FederatedAuthRequest_CloseModalDialogView_Params_Data) == 8, "Bad sizeof(FederatedAuthRequest_CloseModalDialogView_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FederatedAuthRequest_PreventSilentAccess_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FederatedAuthRequest_PreventSilentAccess_Params_Data>;

    FederatedAuthRequest_PreventSilentAccess_Params_Data();
    ~FederatedAuthRequest_PreventSilentAccess_Params_Data() = delete;
};
static_assert(sizeof(FederatedAuthRequest_PreventSilentAccess_Params_Data) == 8, "Bad sizeof(FederatedAuthRequest_PreventSilentAccess_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FederatedAuthRequest_PreventSilentAccess_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FederatedAuthRequest_PreventSilentAccess_ResponseParams_Data>;

    FederatedAuthRequest_PreventSilentAccess_ResponseParams_Data();
    ~FederatedAuthRequest_PreventSilentAccess_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(FederatedAuthRequest_PreventSilentAccess_ResponseParams_Data) == 8, "Bad sizeof(FederatedAuthRequest_PreventSilentAccess_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FederatedAuthRequest_Disconnect_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::IdentityCredentialDisconnectOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<FederatedAuthRequest_Disconnect_Params_Data>;

    FederatedAuthRequest_Disconnect_Params_Data();
    ~FederatedAuthRequest_Disconnect_Params_Data() = delete;
};
static_assert(sizeof(FederatedAuthRequest_Disconnect_Params_Data) == 16, "Bad sizeof(FederatedAuthRequest_Disconnect_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FederatedAuthRequest_Disconnect_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FederatedAuthRequest_Disconnect_ResponseParams_Data>;

    FederatedAuthRequest_Disconnect_ResponseParams_Data();
    ~FederatedAuthRequest_Disconnect_ResponseParams_Data() = delete;
};
static_assert(sizeof(FederatedAuthRequest_Disconnect_ResponseParams_Data) == 16, "Bad sizeof(FederatedAuthRequest_Disconnect_ResponseParams_Data)");

} // namespace internal

class FederatedAuthRequest_RequestToken_ParamsDataView {
public:
    FederatedAuthRequest_RequestToken_ParamsDataView() = default;

    FederatedAuthRequest_RequestToken_ParamsDataView(internal::FederatedAuthRequest_RequestToken_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetIdpGetParamsDataView(mojo::ArrayDataView<IdentityProviderGetParametersDataView>* output);

    template <typename UserType> [[nodiscard]] bool ReadIdpGetParams(UserType* output)
    {

        auto* pointer = data_->idp_get_params.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<::blink::mojom::IdentityProviderGetParametersDataView>>(pointer, output, message_);
    }
