// third_party/blink/public/mojom/storage_access/storage_access_handle.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_STORAGE_ACCESS_STORAGE_ACCESS_HANDLE_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_STORAGE_ACCESS_STORAGE_ACCESS_HANDLE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageAccessHandle_BindIndexedDB_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<StorageAccessHandle_BindIndexedDB_Params_Data>;

    StorageAccessHandle_BindIndexedDB_Params_Data();
    ~StorageAccessHandle_BindIndexedDB_Params_Data() = delete;
};
static_assert(sizeof(StorageAccessHandle_BindIndexedDB_Params_Data) == 16, "Bad sizeof(StorageAccessHandle_BindIndexedDB_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageAccessHandle_BindLocks_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<StorageAccessHandle_BindLocks_Params_Data>;

    StorageAccessHandle_BindLocks_Params_Data();
    ~StorageAccessHandle_BindLocks_Params_Data() = delete;
};
static_assert(sizeof(StorageAccessHandle_BindLocks_Params_Data) == 16, "Bad sizeof(StorageAccessHandle_BindLocks_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageAccessHandle_BindCaches_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<StorageAccessHandle_BindCaches_Params_Data>;

    StorageAccessHandle_BindCaches_Params_Data();
    ~StorageAccessHandle_BindCaches_Params_Data() = delete;
};
static_assert(sizeof(StorageAccessHandle_BindCaches_Params_Data) == 16, "Bad sizeof(StorageAccessHandle_BindCaches_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageAccessHandle_GetDirectory_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<StorageAccessHandle_GetDirectory_Params_Data>;

    StorageAccessHandle_GetDirectory_Params_Data();
    ~StorageAccessHandle_GetDirectory_Params_Data() = delete;
};
static_assert(sizeof(StorageAccessHandle_GetDirectory_Params_Data) == 8, "Bad sizeof(StorageAccessHandle_GetDirectory_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageAccessHandle_GetDirectory_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FileSystemAccessError_Data> result;
    mojo::internal::Interface_Data directory;

private:
    friend class mojo::internal::MessageFragment<StorageAccessHandle_GetDirectory_ResponseParams_Data>;

    StorageAccessHandle_GetDirectory_ResponseParams_Data();
    ~StorageAccessHandle_GetDirectory_ResponseParams_Data() = delete;
};
static_assert(sizeof(StorageAccessHandle_GetDirectory_ResponseParams_Data) == 24, "Bad sizeof(StorageAccessHandle_GetDirectory_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageAccessHandle_Estimate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<StorageAccessHandle_Estimate_Params_Data>;

    StorageAccessHandle_Estimate_Params_Data();
    ~StorageAccessHandle_Estimate_Params_Data() = delete;
};
static_assert(sizeof(StorageAccessHandle_Estimate_Params_Data) == 8, "Bad sizeof(StorageAccessHandle_Estimate_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageAccessHandle_Estimate_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t current_usage;
    int64_t current_quota;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<StorageAccessHandle_Estimate_ResponseParams_Data>;

    StorageAccessHandle_Estimate_ResponseParams_Data();
    ~StorageAccessHandle_Estimate_ResponseParams_Data() = delete;
};
static_assert(sizeof(StorageAccessHandle_Estimate_ResponseParams_Data) == 32, "Bad sizeof(StorageAccessHandle_Estimate_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageAccessHandle_BindBlobStorage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedEndpointHandle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<StorageAccessHandle_BindBlobStorage_Params_Data>;

    StorageAccessHandle_BindBlobStorage_Params_Data();
    ~StorageAccessHandle_BindBlobStorage_Params_Data() = delete;
};
static_assert(sizeof(StorageAccessHandle_BindBlobStorage_Params_Data) == 16, "Bad sizeof(StorageAccessHandle_BindBlobStorage_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageAccessHandle_BindBroadcastChannel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedEndpointHandle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<StorageAccessHandle_BindBroadcastChannel_Params_Data>;

    StorageAccessHandle_BindBroadcastChannel_Params_Data();
    ~StorageAccessHandle_BindBroadcastChannel_Params_Data() = delete;
};
static_assert(sizeof(StorageAccessHandle_BindBroadcastChannel_Params_Data) == 16, "Bad sizeof(StorageAccessHandle_BindBroadcastChannel_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageAccessHandle_BindSharedWorker_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<StorageAccessHandle_BindSharedWorker_Params_Data>;

    StorageAccessHandle_BindSharedWorker_Params_Data();
    ~StorageAccessHandle_BindSharedWorker_Params_Data() = delete;
};
static_assert(sizeof(StorageAccessHandle_BindSharedWorker_Params_Data) == 16, "Bad sizeof(StorageAccessHandle_BindSharedWorker_Params_Data)");

} // namespace internal

class StorageAccessHandle_BindIndexedDB_ParamsDataView {
public:
    StorageAccessHandle_BindIndexedDB_ParamsDataView() = default;

    StorageAccessHandle_BindIndexedDB_ParamsDataView(internal::StorageAccessHandle_BindIndexedDB_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeReceiver()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::blink::mojom::IDBFactoryInterfaceBase>>(&data_->receiver, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::StorageAccessHandle_BindIndexedDB_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class StorageAccessHandle_BindLocks_ParamsDataView {
public:
    StorageAccessHandle_BindLocks_ParamsDataView() = default;

    StorageAccessHandle_BindLocks_ParamsDataView(internal::StorageAccessHandle_BindLocks_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeReceiver()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::blink::mojom::LockManagerInterfaceBase>>(&data_->receiver, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::StorageAccessHandle_BindLocks_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class StorageAccessHandle_BindCaches_ParamsDataView {
public:
    StorageAccessHandle_BindCaches_ParamsDataView() = default;

    StorageAccessHandle_BindCaches_ParamsDataView(internal::StorageAccessHandle_BindCaches_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeReceiver()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::blink::mojom::CacheStorageInterfaceBase>>(&data_->receiver, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::StorageAccessHandle_BindCaches_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class StorageAccessHandle_GetDirectory_ParamsDataView {
public:
    StorageAccessHandle_GetDirectory_ParamsDataView() = default;

    StorageAccessHandle_GetDirectory_ParamsDataView(internal::StorageAccessHandle_GetDirectory_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::StorageAccessHandle_GetDirectory_Params_Data* data_ = nullptr;
};

class StorageAccessHandle_GetDirectory_ResponseParamsDataView {
public:
    StorageAccessHandle_GetDirectory_ResponseParamsDataView() = default;

    StorageAccessHandle_GetDirectory_ResponseParamsDataView(internal::StorageAccessHandle_GetDirectory_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetResultDataView(::blink::mojom::FileSystemAccessErrorDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadResult(UserType* output)
    {

        auto* pointer = data_->result.Get();
        return mojo::internal::Deserialize<::blink::mojom::FileSystemAccessErrorDataView>(pointer, output, message_);
    }
    template <typename UserType> UserType TakeDirectory()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::blink::mojom::FileSystemAccessDirectoryHandleInterfaceBase>>(
            &data_->directory, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::StorageAccessHandle_GetDirectory_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class StorageAccessHandle_Estimate_ParamsDataView {
public:
    StorageAccessHandle_Estimate_ParamsDataView() = default;

    StorageAccessHandle_Estimate_ParamsDataView(internal::StorageAccessHandle_Estimate_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::StorageAccessHandle_Estimate_Params_Data* data_ = nullptr;
};

class StorageAccessHandle_Estimate_ResponseParamsDataView {
public:
    StorageAccessHandle_Estimate_ResponseParamsDataView() = default;

    StorageAccessHandle_Estimate_ResponseParamsDataView(internal::StorageAccessHandle_Estimate_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    int64_t current_usage() const
    {
        return data_->current_usage;
    }
    int64_t current_quota() const
    {
        return data_->current_quota;
    }
    bool success() const
    {
        return data_->success;
    }

private:
    internal::StorageAccessHandle_Estimate_ResponseParams_Data* data_ = nullptr;
};

class StorageAccessHandle_BindBlobStorage_ParamsDataView {
public:
    StorageAccessHandle_BindBlobStorage_ParamsDataView() = default;

    StorageAccessHandle_BindBlobStorage_ParamsDataView(internal::StorageAccessHandle_BindBlobStorage_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeReceiver()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<::blink::mojom::BlobURLStoreAssociatedRequestDataView>(&data_->receiver, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::StorageAccessHandle_BindBlobStorage_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class StorageAccessHandle_BindBroadcastChannel_ParamsDataView {
public:
    StorageAccessHandle_BindBroadcastChannel_ParamsDataView() = default;

    StorageAccessHandle_BindBroadcastChannel_ParamsDataView(internal::StorageAccessHandle_BindBroadcastChannel_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeReceiver()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<::blink::mojom::BroadcastChannelProviderAssociatedRequestDataView>(&data_->receiver, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::StorageAccessHandle_BindBroadcastChannel_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class StorageAccessHandle_BindSharedWorker_ParamsDataView {
public:
    StorageAccessHandle_BindSharedWorker_ParamsDataView() = default;

    StorageAccessHandle_BindSharedWorker_ParamsDataView(internal::StorageAccessHandle_BindSharedWorker_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeReceiver()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::blink::mojom::SharedWorkerConnectorInterfaceBase>>(
            &data_->receiver, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::StorageAccessHandle_BindSharedWorker_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

inline void StorageAccessHandle_GetDirectory_ResponseParamsDataView::GetResultDataView(::blink::mojom::FileSystemAccessErrorDataView* output)
{
    auto pointer = data_->result.Get();
    *output = ::blink::mojom::FileSystemAccessErrorDataView(pointer, message_);
}

} // blink::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // THIRD_PARTY_BLINK_PUBLIC_MOJOM_STORAGE_ACCESS_STORAGE_ACCESS_HANDLE_MOJOM_PARAMS_DATA_H_
