// components/services/print_compositor/public/mojom/print_compositor.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_SERVICES_PRINT_COMPOSITOR_PUBLIC_MOJOM_PRINT_COMPOSITOR_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_SERVICES_PRINT_COMPOSITOR_PUBLIC_MOJOM_PRINT_COMPOSITOR_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace printing::mojom {
namespace internal {
class PrintCompositor_NotifyUnavailableSubframe_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t frame_guid;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_NotifyUnavailableSubframe_Params_Data>;

    PrintCompositor_NotifyUnavailableSubframe_Params_Data();
    ~PrintCompositor_NotifyUnavailableSubframe_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_NotifyUnavailableSubframe_Params_Data) == 16, "Bad sizeof(PrintCompositor_NotifyUnavailableSubframe_Params_Data)");
class PrintCompositor_AddSubframeContent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t frame_guid;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> serialized_content;
    mojo::internal::Pointer<mojo::internal::Map_Data<uint32_t, uint64_t>> subframe_content_info;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_AddSubframeContent_Params_Data>;

    PrintCompositor_AddSubframeContent_Params_Data();
    ~PrintCompositor_AddSubframeContent_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_AddSubframeContent_Params_Data) == 32, "Bad sizeof(PrintCompositor_AddSubframeContent_Params_Data)");
class PrintCompositor_SetAccessibilityTree_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::ax::mojom::internal::AXTreeUpdate_Data> accessibility_tree;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_SetAccessibilityTree_Params_Data>;

    PrintCompositor_SetAccessibilityTree_Params_Data();
    ~PrintCompositor_SetAccessibilityTree_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_SetAccessibilityTree_Params_Data) == 16, "Bad sizeof(PrintCompositor_SetAccessibilityTree_Params_Data)");
class PrintCompositor_CompositePage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t frame_guid;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> sk_region;
    mojo::internal::Pointer<mojo::internal::Map_Data<uint32_t, uint64_t>> subframe_content_info;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_CompositePage_Params_Data>;

    PrintCompositor_CompositePage_Params_Data();
    ~PrintCompositor_CompositePage_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_CompositePage_Params_Data) == 32, "Bad sizeof(PrintCompositor_CompositePage_Params_Data)");
class PrintCompositor_CompositePage_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> document_region;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_CompositePage_ResponseParams_Data>;

    PrintCompositor_CompositePage_ResponseParams_Data();
    ~PrintCompositor_CompositePage_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintCompositor_CompositePage_ResponseParams_Data) == 24, "Bad sizeof(PrintCompositor_CompositePage_ResponseParams_Data)");
class PrintCompositor_CompositeDocument_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t frame_guid;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> sk_region;
    mojo::internal::Pointer<mojo::internal::Map_Data<uint32_t, uint64_t>> subframe_content_info;
    int32_t document_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_CompositeDocument_Params_Data>;

    PrintCompositor_CompositeDocument_Params_Data();
    ~PrintCompositor_CompositeDocument_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_CompositeDocument_Params_Data) == 40, "Bad sizeof(PrintCompositor_CompositeDocument_Params_Data)");
class PrintCompositor_CompositeDocument_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> document_region;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_CompositeDocument_ResponseParams_Data>;

    PrintCompositor_CompositeDocument_ResponseParams_Data();
    ~PrintCompositor_CompositeDocument_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintCompositor_CompositeDocument_ResponseParams_Data) == 24, "Bad sizeof(PrintCompositor_CompositeDocument_ResponseParams_Data)");
class PrintCompositor_PrepareToCompositeDocument_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t document_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_PrepareToCompositeDocument_Params_Data>;

    PrintCompositor_PrepareToCompositeDocument_Params_Data();
    ~PrintCompositor_PrepareToCompositeDocument_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_PrepareToCompositeDocument_Params_Data) == 16, "Bad sizeof(PrintCompositor_PrepareToCompositeDocument_Params_Data)");
class PrintCompositor_PrepareToCompositeDocument_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_PrepareToCompositeDocument_ResponseParams_Data>;

    PrintCompositor_PrepareToCompositeDocument_ResponseParams_Data();
    ~PrintCompositor_PrepareToCompositeDocument_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(PrintCompositor_PrepareToCompositeDocument_ResponseParams_Data) == 16, "Bad sizeof(PrintCompositor_PrepareToCompositeDocument_ResponseParams_Data)");
class PrintCompositor_FinishDocumentComposition_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t pages_count;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_FinishDocumentComposition_Params_Data>;

    PrintCompositor_FinishDocumentComposition_Params_Data();
    ~PrintCompositor_FinishDocumentComposition_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_FinishDocumentComposition_Params_Data) == 16, "Bad sizeof(PrintCompositor_FinishDocumentComposition_Params_Data)");
class PrintCompositor_FinishDocumentComposition_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> document_region;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_FinishDocumentComposition_ResponseParams_Data>;

    PrintCompositor_FinishDocumentComposition_ResponseParams_Data();
    ~PrintCompositor_FinishDocumentComposition_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(PrintCompositor_FinishDocumentComposition_ResponseParams_Data) == 24, "Bad sizeof(PrintCompositor_FinishDocumentComposition_ResponseParams_Data)");
class PrintCompositor_SetWebContentsURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_SetWebContentsURL_Params_Data>;

    PrintCompositor_SetWebContentsURL_Params_Data();
    ~PrintCompositor_SetWebContentsURL_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_SetWebContentsURL_Params_Data) == 16, "Bad sizeof(PrintCompositor_SetWebContentsURL_Params_Data)");
class PrintCompositor_SetUserAgent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> user_agent;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_SetUserAgent_Params_Data>;

    PrintCompositor_SetUserAgent_Params_Data();
    ~PrintCompositor_SetUserAgent_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_SetUserAgent_Params_Data) == 16, "Bad sizeof(PrintCompositor_SetUserAgent_Params_Data)");
class PrintCompositor_SetGenerateDocumentOutline_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t generate_document_outline;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_SetGenerateDocumentOutline_Params_Data>;

    PrintCompositor_SetGenerateDocumentOutline_Params_Data();
    ~PrintCompositor_SetGenerateDocumentOutline_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_SetGenerateDocumentOutline_Params_Data) == 16, "Bad sizeof(PrintCompositor_SetGenerateDocumentOutline_Params_Data)");
class PrintCompositor_SetTitle_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> title;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_SetTitle_Params_Data>;

    PrintCompositor_SetTitle_Params_Data();
    ~PrintCompositor_SetTitle_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_SetTitle_Params_Data) == 16, "Bad sizeof(PrintCompositor_SetTitle_Params_Data)");
class PrintCompositor_SetWatermarkText_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> watermark_text;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_SetWatermarkText_Params_Data>;

    PrintCompositor_SetWatermarkText_Params_Data();
    ~PrintCompositor_SetWatermarkText_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_SetWatermarkText_Params_Data) == 16, "Bad sizeof(PrintCompositor_SetWatermarkText_Params_Data)");

} // namespace internal

class PrintCompositor_NotifyUnavailableSubframe_ParamsDataView {
public:
    PrintCompositor_NotifyUnavailableSubframe_ParamsDataView() = default;

    PrintCompositor_NotifyUnavailableSubframe_ParamsDataView(internal::PrintCompositor_NotifyUnavailableSubframe_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    uint64_t frame_guid() const
    {
        return data_->frame_guid;
    }

private:
    internal::PrintCompositor_NotifyUnavailableSubframe_Params_Data* data_ = nullptr;
};

class PrintCompositor_AddSubframeContent_ParamsDataView {
public:
    PrintCompositor_AddSubframeContent_ParamsDataView() = default;

