// third_party/blink/public/mojom/permissions/permission.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_PERMISSIONS_PERMISSION_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_PERMISSIONS_PERMISSION_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PermissionObserver_OnPermissionStatusChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PermissionObserver_OnPermissionStatusChange_Params_Data>;

    PermissionObserver_OnPermissionStatusChange_Params_Data();
    ~PermissionObserver_OnPermissionStatusChange_Params_Data() = delete;
};
static_assert(sizeof(PermissionObserver_OnPermissionStatusChange_Params_Data) == 16, "Bad sizeof(PermissionObserver_OnPermissionStatusChange_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) EmbeddedPermissionControlClient_OnEmbeddedPermissionControlRegistered_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t allow : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> statuses;

private:
    friend class mojo::internal::MessageFragment<EmbeddedPermissionControlClient_OnEmbeddedPermissionControlRegistered_Params_Data>;

    EmbeddedPermissionControlClient_OnEmbeddedPermissionControlRegistered_Params_Data();
    ~EmbeddedPermissionControlClient_OnEmbeddedPermissionControlRegistered_Params_Data() = delete;
};
static_assert(sizeof(EmbeddedPermissionControlClient_OnEmbeddedPermissionControlRegistered_Params_Data) == 24,
    "Bad sizeof(EmbeddedPermissionControlClient_OnEmbeddedPermissionControlRegistered_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PermissionService_HasPermission_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PermissionDescriptor_Data> permission;

private:
    friend class mojo::internal::MessageFragment<PermissionService_HasPermission_Params_Data>;

    PermissionService_HasPermission_Params_Data();
    ~PermissionService_HasPermission_Params_Data() = delete;
};
static_assert(sizeof(PermissionService_HasPermission_Params_Data) == 16, "Bad sizeof(PermissionService_HasPermission_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PermissionService_HasPermission_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PermissionService_HasPermission_ResponseParams_Data>;

    PermissionService_HasPermission_ResponseParams_Data();
    ~PermissionService_HasPermission_ResponseParams_Data() = delete;
};
static_assert(sizeof(PermissionService_HasPermission_ResponseParams_Data) == 16, "Bad sizeof(PermissionService_HasPermission_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PermissionService_RegisterPageEmbeddedPermissionControl_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::PermissionDescriptor_Data>>> permissions;
    mojo::internal::Interface_Data client;

private:
    friend class mojo::internal::MessageFragment<PermissionService_RegisterPageEmbeddedPermissionControl_Params_Data>;

    PermissionService_RegisterPageEmbeddedPermissionControl_Params_Data();
    ~PermissionService_RegisterPageEmbeddedPermissionControl_Params_Data() = delete;
};
static_assert(sizeof(PermissionService_RegisterPageEmbeddedPermissionControl_Params_Data) == 24,
    "Bad sizeof(PermissionService_RegisterPageEmbeddedPermissionControl_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PermissionService_RequestPageEmbeddedPermission_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::EmbeddedPermissionRequestDescriptor_Data> descriptor;

private:
    friend class mojo::internal::MessageFragment<PermissionService_RequestPageEmbeddedPermission_Params_Data>;

    PermissionService_RequestPageEmbeddedPermission_Params_Data();
    ~PermissionService_RequestPageEmbeddedPermission_Params_Data() = delete;
};
static_assert(
    sizeof(PermissionService_RequestPageEmbeddedPermission_Params_Data) == 16, "Bad sizeof(PermissionService_RequestPageEmbeddedPermission_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PermissionService_RequestPageEmbeddedPermission_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PermissionService_RequestPageEmbeddedPermission_ResponseParams_Data>;

    PermissionService_RequestPageEmbeddedPermission_ResponseParams_Data();
    ~PermissionService_RequestPageEmbeddedPermission_ResponseParams_Data() = delete;
};
static_assert(sizeof(PermissionService_RequestPageEmbeddedPermission_ResponseParams_Data) == 16,
    "Bad sizeof(PermissionService_RequestPageEmbeddedPermission_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PermissionService_RequestPermission_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PermissionDescriptor_Data> permission;
    uint8_t user_gesture : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PermissionService_RequestPermission_Params_Data>;

    PermissionService_RequestPermission_Params_Data();
    ~PermissionService_RequestPermission_Params_Data() = delete;
};
static_assert(sizeof(PermissionService_RequestPermission_Params_Data) == 24, "Bad sizeof(PermissionService_RequestPermission_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PermissionService_RequestPermission_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PermissionService_RequestPermission_ResponseParams_Data>;

    PermissionService_RequestPermission_ResponseParams_Data();
    ~PermissionService_RequestPermission_ResponseParams_Data() = delete;
};
static_assert(sizeof(PermissionService_RequestPermission_ResponseParams_Data) == 16, "Bad sizeof(PermissionService_RequestPermission_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PermissionService_RequestPermissions_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::PermissionDescriptor_Data>>> permission;
    uint8_t user_gesture : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PermissionService_RequestPermissions_Params_Data>;

    PermissionService_RequestPermissions_Params_Data();
    ~PermissionService_RequestPermissions_Params_Data() = delete;
};
static_assert(sizeof(PermissionService_RequestPermissions_Params_Data) == 24, "Bad sizeof(PermissionService_RequestPermissions_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PermissionService_RequestPermissions_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> statuses;

private:
    friend class mojo::internal::MessageFragment<PermissionService_RequestPermissions_ResponseParams_Data>;

    PermissionService_RequestPermissions_ResponseParams_Data();
    ~PermissionService_RequestPermissions_ResponseParams_Data() = delete;
};
static_assert(sizeof(PermissionService_RequestPermissions_ResponseParams_Data) == 16, "Bad sizeof(PermissionService_RequestPermissions_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PermissionService_RevokePermission_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PermissionDescriptor_Data> permission;

private:
    friend class mojo::internal::MessageFragment<PermissionService_RevokePermission_Params_Data>;

    PermissionService_RevokePermission_Params_Data();
    ~PermissionService_RevokePermission_Params_Data() = delete;
};
static_assert(sizeof(PermissionService_RevokePermission_Params_Data) == 16, "Bad sizeof(PermissionService_RevokePermission_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PermissionService_RevokePermission_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PermissionService_RevokePermission_ResponseParams_Data>;

    PermissionService_RevokePermission_ResponseParams_Data();
    ~PermissionService_RevokePermission_ResponseParams_Data() = delete;
};
static_assert(sizeof(PermissionService_RevokePermission_ResponseParams_Data) == 16, "Bad sizeof(PermissionService_RevokePermission_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PermissionService_AddPermissionObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PermissionDescriptor_Data> permission;
    int32_t last_known_status;
    mojo::internal::Interface_Data observer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PermissionService_AddPermissionObserver_Params_Data>;

    PermissionService_AddPermissionObserver_Params_Data();
    ~PermissionService_AddPermissionObserver_Params_Data() = delete;
};
static_assert(sizeof(PermissionService_AddPermissionObserver_Params_Data) == 32, "Bad sizeof(PermissionService_AddPermissionObserver_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PermissionService_AddPageEmbeddedPermissionObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PermissionDescriptor_Data> permission;
    int32_t last_known_status;
    mojo::internal::Interface_Data observer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PermissionService_AddPageEmbeddedPermissionObserver_Params_Data>;

    PermissionService_AddPageEmbeddedPermissionObserver_Params_Data();
    ~PermissionService_AddPageEmbeddedPermissionObserver_Params_Data() = delete;
};
static_assert(sizeof(PermissionService_AddPageEmbeddedPermissionObserver_Params_Data) == 32,
    "Bad sizeof(PermissionService_AddPageEmbeddedPermissionObserver_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PermissionService_NotifyEventListener_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PermissionDescriptor_Data> permission;
    mojo::internal::Pointer<mojo::internal::String_Data> event_type;
    uint8_t is_added : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PermissionService_NotifyEventListener_Params_Data>;

    PermissionService_NotifyEventListener_Params_Data();
    ~PermissionService_NotifyEventListener_Params_Data() = delete;
};
static_assert(sizeof(PermissionService_NotifyEventListener_Params_Data) == 32, "Bad sizeof(PermissionService_NotifyEventListener_Params_Data)");

} // namespace internal

class PermissionObserver_OnPermissionStatusChange_ParamsDataView {
public:
    PermissionObserver_OnPermissionStatusChange_ParamsDataView() = default;

    PermissionObserver_OnPermissionStatusChange_ParamsDataView(internal::PermissionObserver_OnPermissionStatusChange_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadStatus(UserType* output) const
    {
        auto data_value = data_->status;
        return mojo::internal::Deserialize<::blink::mojom::PermissionStatus>(data_value, output);
    }
    ::blink::mojom::PermissionStatus status() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::blink::mojom::PermissionStatus>(data_->status));
    }

