// third_party/blink/public/mojom/interest_group/ad_auction_service.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_INTEREST_GROUP_AD_AUCTION_SERVICE_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_INTEREST_GROUP_AD_AUCTION_SERVICE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AbortableAdAuction_ResolvedPromiseParam_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::AuctionAdConfigAuctionId_Data auction;
    int32_t field;
    uint8_t pad1_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> json_value;

private:
    friend class mojo::internal::MessageFragment<AbortableAdAuction_ResolvedPromiseParam_Params_Data>;

    AbortableAdAuction_ResolvedPromiseParam_Params_Data();
    ~AbortableAdAuction_ResolvedPromiseParam_Params_Data() = delete;
};
static_assert(sizeof(AbortableAdAuction_ResolvedPromiseParam_Params_Data) == 40, "Bad sizeof(AbortableAdAuction_ResolvedPromiseParam_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AbortableAdAuction_ResolvedPerBuyerSignalsPromise_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::AuctionAdConfigAuctionId_Data auction;
    mojo::internal::Pointer<
        mojo::internal::Map_Data<mojo::internal::Pointer<::url::mojom::internal::Origin_Data>, mojo::internal::Pointer<mojo::internal::String_Data>>>
        per_buyer_signals;

private:
    friend class mojo::internal::MessageFragment<AbortableAdAuction_ResolvedPerBuyerSignalsPromise_Params_Data>;

    AbortableAdAuction_ResolvedPerBuyerSignalsPromise_Params_Data();
    ~AbortableAdAuction_ResolvedPerBuyerSignalsPromise_Params_Data() = delete;
};
static_assert(
    sizeof(AbortableAdAuction_ResolvedPerBuyerSignalsPromise_Params_Data) == 32, "Bad sizeof(AbortableAdAuction_ResolvedPerBuyerSignalsPromise_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AbortableAdAuction_ResolvedBuyerTimeoutsPromise_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::AuctionAdConfigAuctionId_Data auction;
    int32_t field;
    uint8_t pad1_[4];
    mojo::internal::Pointer<::blink::mojom::internal::AuctionAdConfigBuyerTimeouts_Data> buyer_timeouts;

private:
    friend class mojo::internal::MessageFragment<AbortableAdAuction_ResolvedBuyerTimeoutsPromise_Params_Data>;

    AbortableAdAuction_ResolvedBuyerTimeoutsPromise_Params_Data();
    ~AbortableAdAuction_ResolvedBuyerTimeoutsPromise_Params_Data() = delete;
};
static_assert(
    sizeof(AbortableAdAuction_ResolvedBuyerTimeoutsPromise_Params_Data) == 40, "Bad sizeof(AbortableAdAuction_ResolvedBuyerTimeoutsPromise_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AbortableAdAuction_ResolvedBuyerCurrenciesPromise_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::AuctionAdConfigAuctionId_Data auction;
    mojo::internal::Pointer<::blink::mojom::internal::AuctionAdConfigBuyerCurrencies_Data> per_buyer_currencies;

private:
    friend class mojo::internal::MessageFragment<AbortableAdAuction_ResolvedBuyerCurrenciesPromise_Params_Data>;

    AbortableAdAuction_ResolvedBuyerCurrenciesPromise_Params_Data();
    ~AbortableAdAuction_ResolvedBuyerCurrenciesPromise_Params_Data() = delete;
};
static_assert(
    sizeof(AbortableAdAuction_ResolvedBuyerCurrenciesPromise_Params_Data) == 32, "Bad sizeof(AbortableAdAuction_ResolvedBuyerCurrenciesPromise_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AbortableAdAuction_ResolvedDirectFromSellerSignalsPromise_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::AuctionAdConfigAuctionId_Data auction;
    mojo::internal::Pointer<::blink::mojom::internal::DirectFromSellerSignals_Data> direct_from_seller_signals;

private:
    friend class mojo::internal::MessageFragment<AbortableAdAuction_ResolvedDirectFromSellerSignalsPromise_Params_Data>;

    AbortableAdAuction_ResolvedDirectFromSellerSignalsPromise_Params_Data();
    ~AbortableAdAuction_ResolvedDirectFromSellerSignalsPromise_Params_Data() = delete;
};
static_assert(sizeof(AbortableAdAuction_ResolvedDirectFromSellerSignalsPromise_Params_Data) == 32,
    "Bad sizeof(AbortableAdAuction_ResolvedDirectFromSellerSignalsPromise_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AbortableAdAuction_ResolvedDirectFromSellerSignalsHeaderAdSlotPromise_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::AuctionAdConfigAuctionId_Data auction;
    mojo::internal::Pointer<mojo::internal::String_Data> direct_from_seller_signals_header_ad_slot;

private:
    friend class mojo::internal::MessageFragment<AbortableAdAuction_ResolvedDirectFromSellerSignalsHeaderAdSlotPromise_Params_Data>;

    AbortableAdAuction_ResolvedDirectFromSellerSignalsHeaderAdSlotPromise_Params_Data();
    ~AbortableAdAuction_ResolvedDirectFromSellerSignalsHeaderAdSlotPromise_Params_Data() = delete;
};
static_assert(sizeof(AbortableAdAuction_ResolvedDirectFromSellerSignalsHeaderAdSlotPromise_Params_Data) == 32,
    "Bad sizeof(AbortableAdAuction_ResolvedDirectFromSellerSignalsHeaderAdSlotPromise_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AbortableAdAuction_ResolvedDeprecatedRenderURLReplacementsPromise_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::AuctionAdConfigAuctionId_Data auction;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::blink::mojom::internal::AdKeywordReplacement_Data>>>
        deprecated_render_url_replacements;

private:
    friend class mojo::internal::MessageFragment<AbortableAdAuction_ResolvedDeprecatedRenderURLReplacementsPromise_Params_Data>;

    AbortableAdAuction_ResolvedDeprecatedRenderURLReplacementsPromise_Params_Data();
    ~AbortableAdAuction_ResolvedDeprecatedRenderURLReplacementsPromise_Params_Data() = delete;
};
static_assert(sizeof(AbortableAdAuction_ResolvedDeprecatedRenderURLReplacementsPromise_Params_Data) == 32,
    "Bad sizeof(AbortableAdAuction_ResolvedDeprecatedRenderURLReplacementsPromise_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AbortableAdAuction_ResolvedAuctionAdResponsePromise_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::AuctionAdConfigAuctionId_Data auction;
    ::mojo_base::mojom::internal::BigBuffer_Data result;

private:
    friend class mojo::internal::MessageFragment<AbortableAdAuction_ResolvedAuctionAdResponsePromise_Params_Data>;

    AbortableAdAuction_ResolvedAuctionAdResponsePromise_Params_Data();
    ~AbortableAdAuction_ResolvedAuctionAdResponsePromise_Params_Data() = delete;
};
static_assert(sizeof(AbortableAdAuction_ResolvedAuctionAdResponsePromise_Params_Data) == 40,
    "Bad sizeof(AbortableAdAuction_ResolvedAuctionAdResponsePromise_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AbortableAdAuction_ResolvedAdditionalBids_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::AuctionAdConfigAuctionId_Data auction;

private:
    friend class mojo::internal::MessageFragment<AbortableAdAuction_ResolvedAdditionalBids_Params_Data>;

    AbortableAdAuction_ResolvedAdditionalBids_Params_Data();
    ~AbortableAdAuction_ResolvedAdditionalBids_Params_Data() = delete;
};
static_assert(sizeof(AbortableAdAuction_ResolvedAdditionalBids_Params_Data) == 24, "Bad sizeof(AbortableAdAuction_ResolvedAdditionalBids_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AbortableAdAuction_Abort_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AbortableAdAuction_Abort_Params_Data>;

    AbortableAdAuction_Abort_Params_Data();
    ~AbortableAdAuction_Abort_Params_Data() = delete;
};
static_assert(sizeof(AbortableAdAuction_Abort_Params_Data) == 8, "Bad sizeof(AbortableAdAuction_Abort_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_CreateAdRequest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::AdRequestConfig_Data> config;

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_CreateAdRequest_Params_Data>;

    AdAuctionService_CreateAdRequest_Params_Data();
    ~AdAuctionService_CreateAdRequest_Params_Data() = delete;
};
static_assert(sizeof(AdAuctionService_CreateAdRequest_Params_Data) == 16, "Bad sizeof(AdAuctionService_CreateAdRequest_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_CreateAdRequest_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> ads_guid;

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_CreateAdRequest_ResponseParams_Data>;

    AdAuctionService_CreateAdRequest_ResponseParams_Data();
    ~AdAuctionService_CreateAdRequest_ResponseParams_Data() = delete;
};
static_assert(sizeof(AdAuctionService_CreateAdRequest_ResponseParams_Data) == 16, "Bad sizeof(AdAuctionService_CreateAdRequest_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_FinalizeAd_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> ads_guid;
    mojo::internal::Pointer<::blink::mojom::internal::AuctionAdConfig_Data> config;

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_FinalizeAd_Params_Data>;

    AdAuctionService_FinalizeAd_Params_Data();
    ~AdAuctionService_FinalizeAd_Params_Data() = delete;
};
static_assert(sizeof(AdAuctionService_FinalizeAd_Params_Data) == 24, "Bad sizeof(AdAuctionService_FinalizeAd_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_FinalizeAd_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> ad_display_url;

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_FinalizeAd_ResponseParams_Data>;

    AdAuctionService_FinalizeAd_ResponseParams_Data();
    ~AdAuctionService_FinalizeAd_ResponseParams_Data() = delete;
};
static_assert(sizeof(AdAuctionService_FinalizeAd_ResponseParams_Data) == 16, "Bad sizeof(AdAuctionService_FinalizeAd_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_RunAdAuction_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::AuctionAdConfig_Data> config;
    mojo::internal::Handle_Data abort_receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_RunAdAuction_Params_Data>;

    AdAuctionService_RunAdAuction_Params_Data();
    ~AdAuctionService_RunAdAuction_Params_Data() = delete;
};
static_assert(sizeof(AdAuctionService_RunAdAuction_Params_Data) == 24, "Bad sizeof(AdAuctionService_RunAdAuction_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_RunAdAuction_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t aborted_by_script : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<::blink::mojom::internal::FencedFrameConfig_Data> config;

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_RunAdAuction_ResponseParams_Data>;

    AdAuctionService_RunAdAuction_ResponseParams_Data();
    ~AdAuctionService_RunAdAuction_ResponseParams_Data() = delete;
};
static_assert(sizeof(AdAuctionService_RunAdAuction_ResponseParams_Data) == 24, "Bad sizeof(AdAuctionService_RunAdAuction_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_JoinInterestGroup_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::InterestGroup_Data> group;

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_JoinInterestGroup_Params_Data>;

    AdAuctionService_JoinInterestGroup_Params_Data();
    ~AdAuctionService_JoinInterestGroup_Params_Data() = delete;
};
static_assert(sizeof(AdAuctionService_JoinInterestGroup_Params_Data) == 16, "Bad sizeof(AdAuctionService_JoinInterestGroup_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_JoinInterestGroup_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t failed_well_known_check : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_JoinInterestGroup_ResponseParams_Data>;

    AdAuctionService_JoinInterestGroup_ResponseParams_Data();
    ~AdAuctionService_JoinInterestGroup_ResponseParams_Data() = delete;
};
static_assert(sizeof(AdAuctionService_JoinInterestGroup_ResponseParams_Data) == 16, "Bad sizeof(AdAuctionService_JoinInterestGroup_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_LeaveInterestGroup_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> owner;
    mojo::internal::Pointer<mojo::internal::String_Data> name;

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_LeaveInterestGroup_Params_Data>;

    AdAuctionService_LeaveInterestGroup_Params_Data();
    ~AdAuctionService_LeaveInterestGroup_Params_Data() = delete;
};
static_assert(sizeof(AdAuctionService_LeaveInterestGroup_Params_Data) == 24, "Bad sizeof(AdAuctionService_LeaveInterestGroup_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_LeaveInterestGroup_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t failed_well_known_check : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_LeaveInterestGroup_ResponseParams_Data>;

    AdAuctionService_LeaveInterestGroup_ResponseParams_Data();
    ~AdAuctionService_LeaveInterestGroup_ResponseParams_Data() = delete;
};
static_assert(sizeof(AdAuctionService_LeaveInterestGroup_ResponseParams_Data) == 16, "Bad sizeof(AdAuctionService_LeaveInterestGroup_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_LeaveInterestGroupForDocument_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_LeaveInterestGroupForDocument_Params_Data>;

    AdAuctionService_LeaveInterestGroupForDocument_Params_Data();
    ~AdAuctionService_LeaveInterestGroupForDocument_Params_Data() = delete;
};
static_assert(
    sizeof(AdAuctionService_LeaveInterestGroupForDocument_Params_Data) == 8, "Bad sizeof(AdAuctionService_LeaveInterestGroupForDocument_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_ClearOriginJoinedInterestGroups_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> owner;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> interest_groups_to_keep;

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_ClearOriginJoinedInterestGroups_Params_Data>;

    AdAuctionService_ClearOriginJoinedInterestGroups_Params_Data();
    ~AdAuctionService_ClearOriginJoinedInterestGroups_Params_Data() = delete;
};
static_assert(
    sizeof(AdAuctionService_ClearOriginJoinedInterestGroups_Params_Data) == 24, "Bad sizeof(AdAuctionService_ClearOriginJoinedInterestGroups_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_ClearOriginJoinedInterestGroups_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t failed_well_known_check : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_ClearOriginJoinedInterestGroups_ResponseParams_Data>;

    AdAuctionService_ClearOriginJoinedInterestGroups_ResponseParams_Data();
    ~AdAuctionService_ClearOriginJoinedInterestGroups_ResponseParams_Data() = delete;
};
static_assert(sizeof(AdAuctionService_ClearOriginJoinedInterestGroups_ResponseParams_Data) == 16,
    "Bad sizeof(AdAuctionService_ClearOriginJoinedInterestGroups_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_UpdateAdInterestGroups_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_UpdateAdInterestGroups_Params_Data>;

    AdAuctionService_UpdateAdInterestGroups_Params_Data();
    ~AdAuctionService_UpdateAdInterestGroups_Params_Data() = delete;
};
static_assert(sizeof(AdAuctionService_UpdateAdInterestGroups_Params_Data) == 8, "Bad sizeof(AdAuctionService_UpdateAdInterestGroups_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_DeprecatedGetURLFromURN_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> uuid_url;
    uint8_t send_reports : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_DeprecatedGetURLFromURN_Params_Data>;

    AdAuctionService_DeprecatedGetURLFromURN_Params_Data();
    ~AdAuctionService_DeprecatedGetURLFromURN_Params_Data() = delete;
};
static_assert(sizeof(AdAuctionService_DeprecatedGetURLFromURN_Params_Data) == 24, "Bad sizeof(AdAuctionService_DeprecatedGetURLFromURN_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_DeprecatedGetURLFromURN_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> decoded_url;

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_DeprecatedGetURLFromURN_ResponseParams_Data>;

    AdAuctionService_DeprecatedGetURLFromURN_ResponseParams_Data();
    ~AdAuctionService_DeprecatedGetURLFromURN_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(AdAuctionService_DeprecatedGetURLFromURN_ResponseParams_Data) == 16, "Bad sizeof(AdAuctionService_DeprecatedGetURLFromURN_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_DeprecatedReplaceInURN_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> uuid_url;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::blink::mojom::internal::AdKeywordReplacement_Data>>> replacements;

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_DeprecatedReplaceInURN_Params_Data>;

    AdAuctionService_DeprecatedReplaceInURN_Params_Data();
    ~AdAuctionService_DeprecatedReplaceInURN_Params_Data() = delete;
};
static_assert(sizeof(AdAuctionService_DeprecatedReplaceInURN_Params_Data) == 24, "Bad sizeof(AdAuctionService_DeprecatedReplaceInURN_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_DeprecatedReplaceInURN_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_DeprecatedReplaceInURN_ResponseParams_Data>;

    AdAuctionService_DeprecatedReplaceInURN_ResponseParams_Data();
    ~AdAuctionService_DeprecatedReplaceInURN_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(AdAuctionService_DeprecatedReplaceInURN_ResponseParams_Data) == 8, "Bad sizeof(AdAuctionService_DeprecatedReplaceInURN_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_GetInterestGroupAdAuctionData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> seller;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> coordinator;
    mojo::internal::Pointer<::blink::mojom::internal::AuctionDataConfig_Data> config;

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_GetInterestGroupAdAuctionData_Params_Data>;

    AdAuctionService_GetInterestGroupAdAuctionData_Params_Data();
    ~AdAuctionService_GetInterestGroupAdAuctionData_Params_Data() = delete;
};
static_assert(
    sizeof(AdAuctionService_GetInterestGroupAdAuctionData_Params_Data) == 32, "Bad sizeof(AdAuctionService_GetInterestGroupAdAuctionData_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AdAuctionService_GetInterestGroupAdAuctionData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::mojo_base::mojom::internal::BigBuffer_Data request;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Uuid_Data> request_id;
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<AdAuctionService_GetInterestGroupAdAuctionData_ResponseParams_Data>;

    AdAuctionService_GetInterestGroupAdAuctionData_ResponseParams_Data();
    ~AdAuctionService_GetInterestGroupAdAuctionData_ResponseParams_Data() = delete;
};
static_assert(sizeof(AdAuctionService_GetInterestGroupAdAuctionData_ResponseParams_Data) == 40,
    "Bad sizeof(AdAuctionService_GetInterestGroupAdAuctionData_ResponseParams_Data)");

} // namespace internal

class AbortableAdAuction_ResolvedPromiseParam_ParamsDataView {
public:
    AbortableAdAuction_ResolvedPromiseParam_ParamsDataView() = default;

    AbortableAdAuction_ResolvedPromiseParam_ParamsDataView(internal::AbortableAdAuction_ResolvedPromiseParam_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetAuctionDataView(AuctionAdConfigAuctionIdDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadAuction(UserType* output)
    {

        auto* pointer = !data_->auction.is_null() ? &data_->auction : nullptr;
        return mojo::internal::Deserialize<::blink::mojom::AuctionAdConfigAuctionIdDataView>(pointer, output, message_);
    }
