// services/on_device_model/public/mojom/on_device_model_service.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_ON_DEVICE_MODEL_PUBLIC_MOJOM_ON_DEVICE_MODEL_SERVICE_MOJOM_PARAMS_DATA_H_
#define SERVICES_ON_DEVICE_MODEL_PUBLIC_MOJOM_ON_DEVICE_MODEL_SERVICE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace on_device_model::mojom {
namespace internal {
class PlatformModelProgressObserver_Progress_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    double progress;

private:
    friend class mojo::internal::MessageFragment<PlatformModelProgressObserver_Progress_Params_Data>;

    PlatformModelProgressObserver_Progress_Params_Data();
    ~PlatformModelProgressObserver_Progress_Params_Data() = delete;
};
static_assert(sizeof(PlatformModelProgressObserver_Progress_Params_Data) == 16, "Bad sizeof(PlatformModelProgressObserver_Progress_Params_Data)");
class OnDeviceModelService_LoadModel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::LoadModelParams_Data> params;
    mojo::internal::Handle_Data model;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<OnDeviceModelService_LoadModel_Params_Data>;

    OnDeviceModelService_LoadModel_Params_Data();
    ~OnDeviceModelService_LoadModel_Params_Data() = delete;
};
static_assert(sizeof(OnDeviceModelService_LoadModel_Params_Data) == 24, "Bad sizeof(OnDeviceModelService_LoadModel_Params_Data)");
class OnDeviceModelService_LoadModel_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<OnDeviceModelService_LoadModel_ResponseParams_Data>;

    OnDeviceModelService_LoadModel_ResponseParams_Data();
    ~OnDeviceModelService_LoadModel_ResponseParams_Data() = delete;
};
static_assert(sizeof(OnDeviceModelService_LoadModel_ResponseParams_Data) == 16, "Bad sizeof(OnDeviceModelService_LoadModel_ResponseParams_Data)");
class OnDeviceModelService_LoadTextSafetyModel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::TextSafetyModelParams_Data> params;
    mojo::internal::Handle_Data model;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<OnDeviceModelService_LoadTextSafetyModel_Params_Data>;

    OnDeviceModelService_LoadTextSafetyModel_Params_Data();
    ~OnDeviceModelService_LoadTextSafetyModel_Params_Data() = delete;
};
static_assert(sizeof(OnDeviceModelService_LoadTextSafetyModel_Params_Data) == 24, "Bad sizeof(OnDeviceModelService_LoadTextSafetyModel_Params_Data)");
class OnDeviceModelService_GetEstimatedPerformanceClass_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<OnDeviceModelService_GetEstimatedPerformanceClass_Params_Data>;

    OnDeviceModelService_GetEstimatedPerformanceClass_Params_Data();
    ~OnDeviceModelService_GetEstimatedPerformanceClass_Params_Data() = delete;
};
static_assert(
    sizeof(OnDeviceModelService_GetEstimatedPerformanceClass_Params_Data) == 8, "Bad sizeof(OnDeviceModelService_GetEstimatedPerformanceClass_Params_Data)");
class OnDeviceModelService_GetEstimatedPerformanceClass_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t performance_class;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<OnDeviceModelService_GetEstimatedPerformanceClass_ResponseParams_Data>;

    OnDeviceModelService_GetEstimatedPerformanceClass_ResponseParams_Data();
    ~OnDeviceModelService_GetEstimatedPerformanceClass_ResponseParams_Data() = delete;
};
static_assert(sizeof(OnDeviceModelService_GetEstimatedPerformanceClass_ResponseParams_Data) == 16,
    "Bad sizeof(OnDeviceModelService_GetEstimatedPerformanceClass_ResponseParams_Data)");
class OnDeviceModelPlatformService_LoadPlatformModel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Uuid_Data> uuid;
    mojo::internal::Handle_Data model;
    mojo::internal::Interface_Data progress_observer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<OnDeviceModelPlatformService_LoadPlatformModel_Params_Data>;

    OnDeviceModelPlatformService_LoadPlatformModel_Params_Data();
    ~OnDeviceModelPlatformService_LoadPlatformModel_Params_Data() = delete;
};
static_assert(
    sizeof(OnDeviceModelPlatformService_LoadPlatformModel_Params_Data) == 32, "Bad sizeof(OnDeviceModelPlatformService_LoadPlatformModel_Params_Data)");
class OnDeviceModelPlatformService_LoadPlatformModel_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<OnDeviceModelPlatformService_LoadPlatformModel_ResponseParams_Data>;

    OnDeviceModelPlatformService_LoadPlatformModel_ResponseParams_Data();
    ~OnDeviceModelPlatformService_LoadPlatformModel_ResponseParams_Data() = delete;
};
static_assert(sizeof(OnDeviceModelPlatformService_LoadPlatformModel_ResponseParams_Data) == 16,
    "Bad sizeof(OnDeviceModelPlatformService_LoadPlatformModel_ResponseParams_Data)");
class OnDeviceModelPlatformService_GetPlatformModelState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Uuid_Data> uuid;

private:
    friend class mojo::internal::MessageFragment<OnDeviceModelPlatformService_GetPlatformModelState_Params_Data>;

    OnDeviceModelPlatformService_GetPlatformModelState_Params_Data();
    ~OnDeviceModelPlatformService_GetPlatformModelState_Params_Data() = delete;
};
static_assert(
    sizeof(OnDeviceModelPlatformService_GetPlatformModelState_Params_Data) == 16, "Bad sizeof(OnDeviceModelPlatformService_GetPlatformModelState_Params_Data)");
class OnDeviceModelPlatformService_GetPlatformModelState_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<OnDeviceModelPlatformService_GetPlatformModelState_ResponseParams_Data>;

    OnDeviceModelPlatformService_GetPlatformModelState_ResponseParams_Data();
    ~OnDeviceModelPlatformService_GetPlatformModelState_ResponseParams_Data() = delete;
};
static_assert(sizeof(OnDeviceModelPlatformService_GetPlatformModelState_ResponseParams_Data) == 16,
    "Bad sizeof(OnDeviceModelPlatformService_GetPlatformModelState_ResponseParams_Data)");
class OnDeviceModelPlatformService_GetEstimatedPerformanceClass_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<OnDeviceModelPlatformService_GetEstimatedPerformanceClass_Params_Data>;

    OnDeviceModelPlatformService_GetEstimatedPerformanceClass_Params_Data();
    ~OnDeviceModelPlatformService_GetEstimatedPerformanceClass_Params_Data() = delete;
};
static_assert(sizeof(OnDeviceModelPlatformService_GetEstimatedPerformanceClass_Params_Data) == 8,
    "Bad sizeof(OnDeviceModelPlatformService_GetEstimatedPerformanceClass_Params_Data)");
class OnDeviceModelPlatformService_GetEstimatedPerformanceClass_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t performance_class;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<OnDeviceModelPlatformService_GetEstimatedPerformanceClass_ResponseParams_Data>;

    OnDeviceModelPlatformService_GetEstimatedPerformanceClass_ResponseParams_Data();
    ~OnDeviceModelPlatformService_GetEstimatedPerformanceClass_ResponseParams_Data() = delete;
};
static_assert(sizeof(OnDeviceModelPlatformService_GetEstimatedPerformanceClass_ResponseParams_Data) == 16,
    "Bad sizeof(OnDeviceModelPlatformService_GetEstimatedPerformanceClass_ResponseParams_Data)");
class OnDeviceModelPlatformService_FormatInput_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Uuid_Data> uuid;
    int32_t feature;
    uint8_t pad1_[4];
    mojo::internal::Pointer<
        mojo::internal::Map_Data<mojo::internal::Pointer<mojo::internal::String_Data>, mojo::internal::Pointer<mojo::internal::String_Data>>>
        fields;

private:
    friend class mojo::internal::MessageFragment<OnDeviceModelPlatformService_FormatInput_Params_Data>;

    OnDeviceModelPlatformService_FormatInput_Params_Data();
    ~OnDeviceModelPlatformService_FormatInput_Params_Data() = delete;
};
static_assert(sizeof(OnDeviceModelPlatformService_FormatInput_Params_Data) == 32, "Bad sizeof(OnDeviceModelPlatformService_FormatInput_Params_Data)");
class OnDeviceModelPlatformService_FormatInput_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> result;

private:
    friend class mojo::internal::MessageFragment<OnDeviceModelPlatformService_FormatInput_ResponseParams_Data>;

    OnDeviceModelPlatformService_FormatInput_ResponseParams_Data();
    ~OnDeviceModelPlatformService_FormatInput_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(OnDeviceModelPlatformService_FormatInput_ResponseParams_Data) == 16, "Bad sizeof(OnDeviceModelPlatformService_FormatInput_ResponseParams_Data)");
class OnDeviceModelPlatformService_ValidateSafetyResult_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t safety_feature;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> text;
    mojo::internal::Pointer<::on_device_model::mojom::internal::SafetyInfo_Data> safety_info;

private:
    friend class mojo::internal::MessageFragment<OnDeviceModelPlatformService_ValidateSafetyResult_Params_Data>;

    OnDeviceModelPlatformService_ValidateSafetyResult_Params_Data();
    ~OnDeviceModelPlatformService_ValidateSafetyResult_Params_Data() = delete;
};
static_assert(
    sizeof(OnDeviceModelPlatformService_ValidateSafetyResult_Params_Data) == 32, "Bad sizeof(OnDeviceModelPlatformService_ValidateSafetyResult_Params_Data)");
class OnDeviceModelPlatformService_ValidateSafetyResult_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<OnDeviceModelPlatformService_ValidateSafetyResult_ResponseParams_Data>;

    OnDeviceModelPlatformService_ValidateSafetyResult_ResponseParams_Data();
    ~OnDeviceModelPlatformService_ValidateSafetyResult_ResponseParams_Data() = delete;
};
static_assert(sizeof(OnDeviceModelPlatformService_ValidateSafetyResult_ResponseParams_Data) == 16,
    "Bad sizeof(OnDeviceModelPlatformService_ValidateSafetyResult_ResponseParams_Data)");

} // namespace internal

class PlatformModelProgressObserver_Progress_ParamsDataView {
public:
    PlatformModelProgressObserver_Progress_ParamsDataView() = default;

    PlatformModelProgressObserver_Progress_ParamsDataView(internal::PlatformModelProgressObserver_Progress_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    double progress() const
    {
        return data_->progress;
    }

private:
    internal::PlatformModelProgressObserver_Progress_Params_Data* data_ = nullptr;
};

class OnDeviceModelService_LoadModel_ParamsDataView {
public:
    OnDeviceModelService_LoadModel_ParamsDataView() = default;

