// services/on_device_model/public/mojom/on_device_model.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_ON_DEVICE_MODEL_PUBLIC_MOJOM_ON_DEVICE_MODEL_MOJOM_PARAMS_DATA_H_
#define SERVICES_ON_DEVICE_MODEL_PUBLIC_MOJOM_ON_DEVICE_MODEL_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace on_device_model::mojom {
namespace internal {
class StreamingResponder_OnResponse_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::ResponseChunk_Data> chunk;

private:
    friend class mojo::internal::MessageFragment<StreamingResponder_OnResponse_Params_Data>;

    StreamingResponder_OnResponse_Params_Data();
    ~StreamingResponder_OnResponse_Params_Data() = delete;
};
static_assert(sizeof(StreamingResponder_OnResponse_Params_Data) == 16, "Bad sizeof(StreamingResponder_OnResponse_Params_Data)");
class StreamingResponder_OnComplete_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::ResponseSummary_Data> summary;

private:
    friend class mojo::internal::MessageFragment<StreamingResponder_OnComplete_Params_Data>;

    StreamingResponder_OnComplete_Params_Data();
    ~StreamingResponder_OnComplete_Params_Data() = delete;
};
static_assert(sizeof(StreamingResponder_OnComplete_Params_Data) == 16, "Bad sizeof(StreamingResponder_OnComplete_Params_Data)");
class ContextClient_OnComplete_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t tokens_processed;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ContextClient_OnComplete_Params_Data>;

    ContextClient_OnComplete_Params_Data();
    ~ContextClient_OnComplete_Params_Data() = delete;
};
static_assert(sizeof(ContextClient_OnComplete_Params_Data) == 16, "Bad sizeof(ContextClient_OnComplete_Params_Data)");
class Session_AddContext_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::InputOptions_Data> input;
    mojo::internal::Interface_Data client;

private:
    friend class mojo::internal::MessageFragment<Session_AddContext_Params_Data>;

    Session_AddContext_Params_Data();
    ~Session_AddContext_Params_Data() = delete;
};
static_assert(sizeof(Session_AddContext_Params_Data) == 24, "Bad sizeof(Session_AddContext_Params_Data)");
class Session_Execute_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::InputOptions_Data> input;
    mojo::internal::Interface_Data response;

private:
    friend class mojo::internal::MessageFragment<Session_Execute_Params_Data>;

    Session_Execute_Params_Data();
    ~Session_Execute_Params_Data() = delete;
};
static_assert(sizeof(Session_Execute_Params_Data) == 24, "Bad sizeof(Session_Execute_Params_Data)");
class Session_GetSizeInTokens_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::Input_Data> input;

private:
    friend class mojo::internal::MessageFragment<Session_GetSizeInTokens_Params_Data>;

    Session_GetSizeInTokens_Params_Data();
    ~Session_GetSizeInTokens_Params_Data() = delete;
};
static_assert(sizeof(Session_GetSizeInTokens_Params_Data) == 16, "Bad sizeof(Session_GetSizeInTokens_Params_Data)");
class Session_GetSizeInTokens_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t size;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Session_GetSizeInTokens_ResponseParams_Data>;

    Session_GetSizeInTokens_ResponseParams_Data();
    ~Session_GetSizeInTokens_ResponseParams_Data() = delete;
};
static_assert(sizeof(Session_GetSizeInTokens_ResponseParams_Data) == 16, "Bad sizeof(Session_GetSizeInTokens_ResponseParams_Data)");
class Session_GetSizeInTokensDeprecated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> text;

private:
    friend class mojo::internal::MessageFragment<Session_GetSizeInTokensDeprecated_Params_Data>;

    Session_GetSizeInTokensDeprecated_Params_Data();
    ~Session_GetSizeInTokensDeprecated_Params_Data() = delete;
};
static_assert(sizeof(Session_GetSizeInTokensDeprecated_Params_Data) == 16, "Bad sizeof(Session_GetSizeInTokensDeprecated_Params_Data)");
class Session_GetSizeInTokensDeprecated_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t size;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Session_GetSizeInTokensDeprecated_ResponseParams_Data>;

    Session_GetSizeInTokensDeprecated_ResponseParams_Data();
    ~Session_GetSizeInTokensDeprecated_ResponseParams_Data() = delete;
};
static_assert(sizeof(Session_GetSizeInTokensDeprecated_ResponseParams_Data) == 16, "Bad sizeof(Session_GetSizeInTokensDeprecated_ResponseParams_Data)");
class Session_Score_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> text;

private:
    friend class mojo::internal::MessageFragment<Session_Score_Params_Data>;

    Session_Score_Params_Data();
    ~Session_Score_Params_Data() = delete;
};
static_assert(sizeof(Session_Score_Params_Data) == 16, "Bad sizeof(Session_Score_Params_Data)");
class Session_Score_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    float probability;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Session_Score_ResponseParams_Data>;

    Session_Score_ResponseParams_Data();
    ~Session_Score_ResponseParams_Data() = delete;
};
static_assert(sizeof(Session_Score_ResponseParams_Data) == 16, "Bad sizeof(Session_Score_ResponseParams_Data)");
class Session_Clone_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data session;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Session_Clone_Params_Data>;

    Session_Clone_Params_Data();
    ~Session_Clone_Params_Data() = delete;
};
static_assert(sizeof(Session_Clone_Params_Data) == 16, "Bad sizeof(Session_Clone_Params_Data)");
class OnDeviceModel_StartSession_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data session;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<OnDeviceModel_StartSession_Params_Data>;

    OnDeviceModel_StartSession_Params_Data();
    ~OnDeviceModel_StartSession_Params_Data() = delete;
};
static_assert(sizeof(OnDeviceModel_StartSession_Params_Data) == 16, "Bad sizeof(OnDeviceModel_StartSession_Params_Data)");
class OnDeviceModel_ClassifyTextSafety_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> text;

private:
    friend class mojo::internal::MessageFragment<OnDeviceModel_ClassifyTextSafety_Params_Data>;

    OnDeviceModel_ClassifyTextSafety_Params_Data();
    ~OnDeviceModel_ClassifyTextSafety_Params_Data() = delete;
};
static_assert(sizeof(OnDeviceModel_ClassifyTextSafety_Params_Data) == 16, "Bad sizeof(OnDeviceModel_ClassifyTextSafety_Params_Data)");
class OnDeviceModel_ClassifyTextSafety_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SafetyInfo_Data> safety_info;

private:
    friend class mojo::internal::MessageFragment<OnDeviceModel_ClassifyTextSafety_ResponseParams_Data>;

    OnDeviceModel_ClassifyTextSafety_ResponseParams_Data();
    ~OnDeviceModel_ClassifyTextSafety_ResponseParams_Data() = delete;
};
static_assert(sizeof(OnDeviceModel_ClassifyTextSafety_ResponseParams_Data) == 16, "Bad sizeof(OnDeviceModel_ClassifyTextSafety_ResponseParams_Data)");
class OnDeviceModel_DetectLanguage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> text;

private:
    friend class mojo::internal::MessageFragment<OnDeviceModel_DetectLanguage_Params_Data>;

    OnDeviceModel_DetectLanguage_Params_Data();
    ~OnDeviceModel_DetectLanguage_Params_Data() = delete;
};
static_assert(sizeof(OnDeviceModel_DetectLanguage_Params_Data) == 16, "Bad sizeof(OnDeviceModel_DetectLanguage_Params_Data)");
class OnDeviceModel_DetectLanguage_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::LanguageDetectionResult_Data> result;

private:
    friend class mojo::internal::MessageFragment<OnDeviceModel_DetectLanguage_ResponseParams_Data>;

    OnDeviceModel_DetectLanguage_ResponseParams_Data();
    ~OnDeviceModel_DetectLanguage_ResponseParams_Data() = delete;
};
static_assert(sizeof(OnDeviceModel_DetectLanguage_ResponseParams_Data) == 16, "Bad sizeof(OnDeviceModel_DetectLanguage_ResponseParams_Data)");
class OnDeviceModel_LoadAdaptation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::LoadAdaptationParams_Data> params;
    mojo::internal::Handle_Data model;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<OnDeviceModel_LoadAdaptation_Params_Data>;

    OnDeviceModel_LoadAdaptation_Params_Data();
    ~OnDeviceModel_LoadAdaptation_Params_Data() = delete;
};
static_assert(sizeof(OnDeviceModel_LoadAdaptation_Params_Data) == 24, "Bad sizeof(OnDeviceModel_LoadAdaptation_Params_Data)");
class OnDeviceModel_LoadAdaptation_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<OnDeviceModel_LoadAdaptation_ResponseParams_Data>;

    OnDeviceModel_LoadAdaptation_ResponseParams_Data();
    ~OnDeviceModel_LoadAdaptation_ResponseParams_Data() = delete;
};
static_assert(sizeof(OnDeviceModel_LoadAdaptation_ResponseParams_Data) == 16, "Bad sizeof(OnDeviceModel_LoadAdaptation_ResponseParams_Data)");
class TextSafetyModel_ClassifyTextSafety_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> text;

private:
    friend class mojo::internal::MessageFragment<TextSafetyModel_ClassifyTextSafety_Params_Data>;

    TextSafetyModel_ClassifyTextSafety_Params_Data();
    ~TextSafetyModel_ClassifyTextSafety_Params_Data() = delete;
};
static_assert(sizeof(TextSafetyModel_ClassifyTextSafety_Params_Data) == 16, "Bad sizeof(TextSafetyModel_ClassifyTextSafety_Params_Data)");
class TextSafetyModel_ClassifyTextSafety_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SafetyInfo_Data> safety_info;

private:
    friend class mojo::internal::MessageFragment<TextSafetyModel_ClassifyTextSafety_ResponseParams_Data>;

    TextSafetyModel_ClassifyTextSafety_ResponseParams_Data();
    ~TextSafetyModel_ClassifyTextSafety_ResponseParams_Data() = delete;
};
static_assert(sizeof(TextSafetyModel_ClassifyTextSafety_ResponseParams_Data) == 16, "Bad sizeof(TextSafetyModel_ClassifyTextSafety_ResponseParams_Data)");
class TextSafetyModel_DetectLanguage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> text;

private:
    friend class mojo::internal::MessageFragment<TextSafetyModel_DetectLanguage_Params_Data>;

    TextSafetyModel_DetectLanguage_Params_Data();
    ~TextSafetyModel_DetectLanguage_Params_Data() = delete;
};
static_assert(sizeof(TextSafetyModel_DetectLanguage_Params_Data) == 16, "Bad sizeof(TextSafetyModel_DetectLanguage_Params_Data)");
class TextSafetyModel_DetectLanguage_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::LanguageDetectionResult_Data> result;

private:
    friend class mojo::internal::MessageFragment<TextSafetyModel_DetectLanguage_ResponseParams_Data>;

    TextSafetyModel_DetectLanguage_ResponseParams_Data();
    ~TextSafetyModel_DetectLanguage_ResponseParams_Data() = delete;
};
static_assert(sizeof(TextSafetyModel_DetectLanguage_ResponseParams_Data) == 16, "Bad sizeof(TextSafetyModel_DetectLanguage_ResponseParams_Data)");

} // namespace internal

class StreamingResponder_OnResponse_ParamsDataView {
public:
    StreamingResponder_OnResponse_ParamsDataView() = default;

    StreamingResponder_OnResponse_ParamsDataView(internal::StreamingResponder_OnResponse_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetChunkDataView(ResponseChunkDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadChunk(UserType* output)
    {

        auto* pointer = data_->chunk.Get();
        return mojo::internal::Deserialize<::on_device_model::mojom::ResponseChunkDataView>(pointer, output, message_);
    }

private:
    internal::StreamingResponder_OnResponse_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

