// third_party/blink/public/mojom/speech/speech_synthesis.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_SPEECH_SPEECH_SYNTHESIS_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_SPEECH_SPEECH_SYNTHESIS_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechSynthesisVoiceListObserver_OnSetVoiceList_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::SpeechSynthesisVoice_Data>>> voice_list;

private:
    friend class mojo::internal::MessageFragment<SpeechSynthesisVoiceListObserver_OnSetVoiceList_Params_Data>;

    SpeechSynthesisVoiceListObserver_OnSetVoiceList_Params_Data();
    ~SpeechSynthesisVoiceListObserver_OnSetVoiceList_Params_Data() = delete;
};
static_assert(
    sizeof(SpeechSynthesisVoiceListObserver_OnSetVoiceList_Params_Data) == 16, "Bad sizeof(SpeechSynthesisVoiceListObserver_OnSetVoiceList_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechSynthesisClient_OnStartedSpeaking_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechSynthesisClient_OnStartedSpeaking_Params_Data>;

    SpeechSynthesisClient_OnStartedSpeaking_Params_Data();
    ~SpeechSynthesisClient_OnStartedSpeaking_Params_Data() = delete;
};
static_assert(sizeof(SpeechSynthesisClient_OnStartedSpeaking_Params_Data) == 8, "Bad sizeof(SpeechSynthesisClient_OnStartedSpeaking_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechSynthesisClient_OnFinishedSpeaking_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SpeechSynthesisClient_OnFinishedSpeaking_Params_Data>;

    SpeechSynthesisClient_OnFinishedSpeaking_Params_Data();
    ~SpeechSynthesisClient_OnFinishedSpeaking_Params_Data() = delete;
};
static_assert(sizeof(SpeechSynthesisClient_OnFinishedSpeaking_Params_Data) == 16, "Bad sizeof(SpeechSynthesisClient_OnFinishedSpeaking_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechSynthesisClient_OnPausedSpeaking_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechSynthesisClient_OnPausedSpeaking_Params_Data>;

    SpeechSynthesisClient_OnPausedSpeaking_Params_Data();
    ~SpeechSynthesisClient_OnPausedSpeaking_Params_Data() = delete;
};
static_assert(sizeof(SpeechSynthesisClient_OnPausedSpeaking_Params_Data) == 8, "Bad sizeof(SpeechSynthesisClient_OnPausedSpeaking_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechSynthesisClient_OnResumedSpeaking_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechSynthesisClient_OnResumedSpeaking_Params_Data>;

    SpeechSynthesisClient_OnResumedSpeaking_Params_Data();
    ~SpeechSynthesisClient_OnResumedSpeaking_Params_Data() = delete;
};
static_assert(sizeof(SpeechSynthesisClient_OnResumedSpeaking_Params_Data) == 8, "Bad sizeof(SpeechSynthesisClient_OnResumedSpeaking_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechSynthesisClient_OnEncounteredWordBoundary_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t char_index;
    uint32_t char_length;

private:
    friend class mojo::internal::MessageFragment<SpeechSynthesisClient_OnEncounteredWordBoundary_Params_Data>;

    SpeechSynthesisClient_OnEncounteredWordBoundary_Params_Data();
    ~SpeechSynthesisClient_OnEncounteredWordBoundary_Params_Data() = delete;
};
static_assert(
    sizeof(SpeechSynthesisClient_OnEncounteredWordBoundary_Params_Data) == 16, "Bad sizeof(SpeechSynthesisClient_OnEncounteredWordBoundary_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechSynthesisClient_OnEncounteredSentenceBoundary_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t char_index;
    uint32_t char_length;

private:
    friend class mojo::internal::MessageFragment<SpeechSynthesisClient_OnEncounteredSentenceBoundary_Params_Data>;

    SpeechSynthesisClient_OnEncounteredSentenceBoundary_Params_Data();
    ~SpeechSynthesisClient_OnEncounteredSentenceBoundary_Params_Data() = delete;
};
static_assert(sizeof(SpeechSynthesisClient_OnEncounteredSentenceBoundary_Params_Data) == 16,
    "Bad sizeof(SpeechSynthesisClient_OnEncounteredSentenceBoundary_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechSynthesisClient_OnEncounteredSpeakingError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechSynthesisClient_OnEncounteredSpeakingError_Params_Data>;

    SpeechSynthesisClient_OnEncounteredSpeakingError_Params_Data();
    ~SpeechSynthesisClient_OnEncounteredSpeakingError_Params_Data() = delete;
};
static_assert(
    sizeof(SpeechSynthesisClient_OnEncounteredSpeakingError_Params_Data) == 8, "Bad sizeof(SpeechSynthesisClient_OnEncounteredSpeakingError_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechSynthesis_AddVoiceListObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data observer;

private:
    friend class mojo::internal::MessageFragment<SpeechSynthesis_AddVoiceListObserver_Params_Data>;

    SpeechSynthesis_AddVoiceListObserver_Params_Data();
    ~SpeechSynthesis_AddVoiceListObserver_Params_Data() = delete;
};
static_assert(sizeof(SpeechSynthesis_AddVoiceListObserver_Params_Data) == 16, "Bad sizeof(SpeechSynthesis_AddVoiceListObserver_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechSynthesis_Speak_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SpeechSynthesisUtterance_Data> utterance;
    mojo::internal::Interface_Data client;

private:
    friend class mojo::internal::MessageFragment<SpeechSynthesis_Speak_Params_Data>;

    SpeechSynthesis_Speak_Params_Data();
    ~SpeechSynthesis_Speak_Params_Data() = delete;
};
static_assert(sizeof(SpeechSynthesis_Speak_Params_Data) == 24, "Bad sizeof(SpeechSynthesis_Speak_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechSynthesis_Pause_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechSynthesis_Pause_Params_Data>;

    SpeechSynthesis_Pause_Params_Data();
    ~SpeechSynthesis_Pause_Params_Data() = delete;
};
static_assert(sizeof(SpeechSynthesis_Pause_Params_Data) == 8, "Bad sizeof(SpeechSynthesis_Pause_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechSynthesis_Resume_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechSynthesis_Resume_Params_Data>;

    SpeechSynthesis_Resume_Params_Data();
    ~SpeechSynthesis_Resume_Params_Data() = delete;
};
static_assert(sizeof(SpeechSynthesis_Resume_Params_Data) == 8, "Bad sizeof(SpeechSynthesis_Resume_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechSynthesis_Cancel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechSynthesis_Cancel_Params_Data>;

    SpeechSynthesis_Cancel_Params_Data();
    ~SpeechSynthesis_Cancel_Params_Data() = delete;
};
static_assert(sizeof(SpeechSynthesis_Cancel_Params_Data) == 8, "Bad sizeof(SpeechSynthesis_Cancel_Params_Data)");

} // namespace internal

class SpeechSynthesisVoiceListObserver_OnSetVoiceList_ParamsDataView {
public:
    SpeechSynthesisVoiceListObserver_OnSetVoiceList_ParamsDataView() = default;

    SpeechSynthesisVoiceListObserver_OnSetVoiceList_ParamsDataView(
        internal::SpeechSynthesisVoiceListObserver_OnSetVoiceList_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetVoiceListDataView(mojo::ArrayDataView<SpeechSynthesisVoiceDataView>* output);

    template <typename UserType> [[nodiscard]] bool ReadVoiceList(UserType* output)
    {

        auto* pointer = data_->voice_list.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<::blink::mojom::SpeechSynthesisVoiceDataView>>(pointer, output, message_);
    }

private:
    internal::SpeechSynthesisVoiceListObserver_OnSetVoiceList_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class SpeechSynthesisClient_OnStartedSpeaking_ParamsDataView {
public:
    SpeechSynthesisClient_OnStartedSpeaking_ParamsDataView() = default;

    SpeechSynthesisClient_OnStartedSpeaking_ParamsDataView(internal::SpeechSynthesisClient_OnStartedSpeaking_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::SpeechSynthesisClient_OnStartedSpeaking_Params_Data* data_ = nullptr;
};

class SpeechSynthesisClient_OnFinishedSpeaking_ParamsDataView {
public:
    SpeechSynthesisClient_OnFinishedSpeaking_ParamsDataView() = default;

    SpeechSynthesisClient_OnFinishedSpeaking_ParamsDataView(internal::SpeechSynthesisClient_OnFinishedSpeaking_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadErrorCode(UserType* output) const
    {
        auto data_value = data_->error_code;
        return mojo::internal::Deserialize<::blink::mojom::SpeechSynthesisErrorCode>(data_value, output);
    }
    SpeechSynthesisErrorCode error_code() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::blink::mojom::SpeechSynthesisErrorCode>(data_->error_code));
    }

private:
    internal::SpeechSynthesisClient_OnFinishedSpeaking_Params_Data* data_ = nullptr;
};

class SpeechSynthesisClient_OnPausedSpeaking_ParamsDataView {
public:
    SpeechSynthesisClient_OnPausedSpeaking_ParamsDataView() = default;

    SpeechSynthesisClient_OnPausedSpeaking_ParamsDataView(internal::SpeechSynthesisClient_OnPausedSpeaking_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::SpeechSynthesisClient_OnPausedSpeaking_Params_Data* data_ = nullptr;
};

class SpeechSynthesisClient_OnResumedSpeaking_ParamsDataView {
public:
    SpeechSynthesisClient_OnResumedSpeaking_ParamsDataView() = default;

    SpeechSynthesisClient_OnResumedSpeaking_ParamsDataView(internal::SpeechSynthesisClient_OnResumedSpeaking_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::SpeechSynthesisClient_OnResumedSpeaking_Params_Data* data_ = nullptr;
};

class SpeechSynthesisClient_OnEncounteredWordBoundary_ParamsDataView {
public:
    SpeechSynthesisClient_OnEncounteredWordBoundary_ParamsDataView() = default;

    SpeechSynthesisClient_OnEncounteredWordBoundary_ParamsDataView(
        internal::SpeechSynthesisClient_OnEncounteredWordBoundary_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    uint32_t char_index() const
    {
        return data_->char_index;
    }
    uint32_t char_length() const
    {
        return data_->char_length;
    }

private:
    internal::SpeechSynthesisClient_OnEncounteredWordBoundary_Params_Data* data_ = nullptr;
};

class SpeechSynthesisClient_OnEncounteredSentenceBoundary_ParamsDataView {
public:
    SpeechSynthesisClient_OnEncounteredSentenceBoundary_ParamsDataView() = default;

    SpeechSynthesisClient_OnEncounteredSentenceBoundary_ParamsDataView(
        internal::SpeechSynthesisClient_OnEncounteredSentenceBoundary_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    uint32_t char_index() const
    {
        return data_->char_index;
    }
    uint32_t char_length() const
    {
        return data_->char_length;
    }

private:
    internal::SpeechSynthesisClient_OnEncounteredSentenceBoundary_Params_Data* data_ = nullptr;
};

class SpeechSynthesisClient_OnEncounteredSpeakingError_ParamsDataView {
public:
    SpeechSynthesisClient_OnEncounteredSpeakingError_ParamsDataView() = default;

    SpeechSynthesisClient_OnEncounteredSpeakingError_ParamsDataView(
        internal::SpeechSynthesisClient_OnEncounteredSpeakingError_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::SpeechSynthesisClient_OnEncounteredSpeakingError_Params_Data* data_ = nullptr;
};

class SpeechSynthesis_AddVoiceListObserver_ParamsDataView {
public:
    SpeechSynthesis_AddVoiceListObserver_ParamsDataView() = default;

    SpeechSynthesis_AddVoiceListObserver_ParamsDataView(internal::SpeechSynthesis_AddVoiceListObserver_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeObserver()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::blink::mojom::SpeechSynthesisVoiceListObserverInterfaceBase>>(
            &data_->observer, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::SpeechSynthesis_AddVoiceListObserver_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class SpeechSynthesis_Speak_ParamsDataView {
public:
    SpeechSynthesis_Speak_ParamsDataView() = default;

    SpeechSynthesis_Speak_ParamsDataView(internal::SpeechSynthesis_Speak_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetUtteranceDataView(SpeechSynthesisUtteranceDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadUtterance(UserType* output)
    {

        auto* pointer = data_->utterance.Get();
        return mojo::internal::Deserialize<::blink::mojom::SpeechSynthesisUtteranceDataView>(pointer, output, message_);
    }
    template <typename UserType> UserType TakeClient()
    {
        UserType result;
        bool ret
            = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::blink::mojom::SpeechSynthesisClientInterfaceBase>>(&data_->client, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::SpeechSynthesis_Speak_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class SpeechSynthesis_Pause_ParamsDataView {
public:
    SpeechSynthesis_Pause_ParamsDataView() = default;

    SpeechSynthesis_Pause_ParamsDataView(internal::SpeechSynthesis_Pause_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::SpeechSynthesis_Pause_Params_Data* data_ = nullptr;
};

class SpeechSynthesis_Resume_ParamsDataView {
public:
    SpeechSynthesis_Resume_ParamsDataView() = default;

    SpeechSynthesis_Resume_ParamsDataView(internal::SpeechSynthesis_Resume_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::SpeechSynthesis_Resume_Params_Data* data_ = nullptr;
};

class SpeechSynthesis_Cancel_ParamsDataView {
public:
    SpeechSynthesis_Cancel_ParamsDataView() = default;

    SpeechSynthesis_Cancel_ParamsDataView(internal::SpeechSynthesis_Cancel_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::SpeechSynthesis_Cancel_Params_Data* data_ = nullptr;
};

inline void SpeechSynthesisVoiceListObserver_OnSetVoiceList_ParamsDataView::GetVoiceListDataView(mojo::ArrayDataView<SpeechSynthesisVoiceDataView>* output)
{
    auto pointer = data_->voice_list.Get();
    *output = mojo::ArrayDataView<SpeechSynthesisVoiceDataView>(pointer, message_);
}

inline void SpeechSynthesis_Speak_ParamsDataView::GetUtteranceDataView(SpeechSynthesisUtteranceDataView* output)
{
    auto pointer = data_->utterance.Get();
    *output = SpeechSynthesisUtteranceDataView(pointer, message_);
}

} // blink::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // THIRD_PARTY_BLINK_PUBLIC_MOJOM_SPEECH_SPEECH_SYNTHESIS_MOJOM_PARAMS_DATA_H_
