// third_party/blink/public/mojom/input/input_handler.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_INPUT_INPUT_HANDLER_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_INPUT_INPUT_HANDLER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandlerHost_SetTouchActionFromMain_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t touch_action;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandlerHost_SetTouchActionFromMain_Params_Data>;

    WidgetInputHandlerHost_SetTouchActionFromMain_Params_Data();
    ~WidgetInputHandlerHost_SetTouchActionFromMain_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandlerHost_SetTouchActionFromMain_Params_Data) == 16, "Bad sizeof(WidgetInputHandlerHost_SetTouchActionFromMain_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandlerHost_SetPanAction_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t pan_action;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandlerHost_SetPanAction_Params_Data>;

    WidgetInputHandlerHost_SetPanAction_Params_Data();
    ~WidgetInputHandlerHost_SetPanAction_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandlerHost_SetPanAction_Params_Data) == 16, "Bad sizeof(WidgetInputHandlerHost_SetPanAction_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandlerHost_DidOverscroll_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::DidOverscrollParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandlerHost_DidOverscroll_Params_Data>;

    WidgetInputHandlerHost_DidOverscroll_Params_Data();
    ~WidgetInputHandlerHost_DidOverscroll_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandlerHost_DidOverscroll_Params_Data) == 16, "Bad sizeof(WidgetInputHandlerHost_DidOverscroll_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandlerHost_DidStartScrollingViewport_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandlerHost_DidStartScrollingViewport_Params_Data>;

    WidgetInputHandlerHost_DidStartScrollingViewport_Params_Data();
    ~WidgetInputHandlerHost_DidStartScrollingViewport_Params_Data() = delete;
};
static_assert(
    sizeof(WidgetInputHandlerHost_DidStartScrollingViewport_Params_Data) == 8, "Bad sizeof(WidgetInputHandlerHost_DidStartScrollingViewport_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandlerHost_ImeCancelComposition_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandlerHost_ImeCancelComposition_Params_Data>;

    WidgetInputHandlerHost_ImeCancelComposition_Params_Data();
    ~WidgetInputHandlerHost_ImeCancelComposition_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandlerHost_ImeCancelComposition_Params_Data) == 8, "Bad sizeof(WidgetInputHandlerHost_ImeCancelComposition_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandlerHost_ImeCompositionRangeChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Range_Data> range;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data>>> character_bounds;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data>>> line_bounds;

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandlerHost_ImeCompositionRangeChanged_Params_Data>;

    WidgetInputHandlerHost_ImeCompositionRangeChanged_Params_Data();
    ~WidgetInputHandlerHost_ImeCompositionRangeChanged_Params_Data() = delete;
};
static_assert(
    sizeof(WidgetInputHandlerHost_ImeCompositionRangeChanged_Params_Data) == 32, "Bad sizeof(WidgetInputHandlerHost_ImeCompositionRangeChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandlerHost_SetMouseCapture_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t capture : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandlerHost_SetMouseCapture_Params_Data>;

    WidgetInputHandlerHost_SetMouseCapture_Params_Data();
    ~WidgetInputHandlerHost_SetMouseCapture_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandlerHost_SetMouseCapture_Params_Data) == 16, "Bad sizeof(WidgetInputHandlerHost_SetMouseCapture_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandlerHost_SetAutoscrollSelectionActiveInMainFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t autoscroll_selection : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandlerHost_SetAutoscrollSelectionActiveInMainFrame_Params_Data>;

    WidgetInputHandlerHost_SetAutoscrollSelectionActiveInMainFrame_Params_Data();
    ~WidgetInputHandlerHost_SetAutoscrollSelectionActiveInMainFrame_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandlerHost_SetAutoscrollSelectionActiveInMainFrame_Params_Data) == 16,
    "Bad sizeof(WidgetInputHandlerHost_SetAutoscrollSelectionActiveInMainFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandlerHost_RequestMouseLock_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t from_user_gesture : 1;
    uint8_t unadjusted_movement : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandlerHost_RequestMouseLock_Params_Data>;

    WidgetInputHandlerHost_RequestMouseLock_Params_Data();
    ~WidgetInputHandlerHost_RequestMouseLock_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandlerHost_RequestMouseLock_Params_Data) == 16, "Bad sizeof(WidgetInputHandlerHost_RequestMouseLock_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandlerHost_RequestMouseLock_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    mojo::internal::Interface_Data context;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandlerHost_RequestMouseLock_ResponseParams_Data>;

    WidgetInputHandlerHost_RequestMouseLock_ResponseParams_Data();
    ~WidgetInputHandlerHost_RequestMouseLock_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(WidgetInputHandlerHost_RequestMouseLock_ResponseParams_Data) == 24, "Bad sizeof(WidgetInputHandlerHost_RequestMouseLock_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_AddImeTextSpansToExistingText_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t start;
    uint32_t end;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::ui::mojom::internal::ImeTextSpan_Data>>> ime_text_spans;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_AddImeTextSpansToExistingText_Params_Data>;

    FrameWidgetInputHandler_AddImeTextSpansToExistingText_Params_Data();
    ~FrameWidgetInputHandler_AddImeTextSpansToExistingText_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_AddImeTextSpansToExistingText_Params_Data) == 24,
    "Bad sizeof(FrameWidgetInputHandler_AddImeTextSpansToExistingText_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_ClearImeTextSpansByType_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t start;
    uint32_t end;
    int32_t type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_ClearImeTextSpansByType_Params_Data>;

    FrameWidgetInputHandler_ClearImeTextSpansByType_Params_Data();
    ~FrameWidgetInputHandler_ClearImeTextSpansByType_Params_Data() = delete;
};
static_assert(
    sizeof(FrameWidgetInputHandler_ClearImeTextSpansByType_Params_Data) == 24, "Bad sizeof(FrameWidgetInputHandler_ClearImeTextSpansByType_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_SetCompositionFromExistingText_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t start;
    int32_t end;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::ui::mojom::internal::ImeTextSpan_Data>>> ime_text_spans;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_SetCompositionFromExistingText_Params_Data>;

    FrameWidgetInputHandler_SetCompositionFromExistingText_Params_Data();
    ~FrameWidgetInputHandler_SetCompositionFromExistingText_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_SetCompositionFromExistingText_Params_Data) == 24,
    "Bad sizeof(FrameWidgetInputHandler_SetCompositionFromExistingText_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_ExtendSelectionAndDelete_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t before;
    int32_t after;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_ExtendSelectionAndDelete_Params_Data>;

    FrameWidgetInputHandler_ExtendSelectionAndDelete_Params_Data();
    ~FrameWidgetInputHandler_ExtendSelectionAndDelete_Params_Data() = delete;
};
static_assert(
    sizeof(FrameWidgetInputHandler_ExtendSelectionAndDelete_Params_Data) == 16, "Bad sizeof(FrameWidgetInputHandler_ExtendSelectionAndDelete_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_ExtendSelectionAndReplace_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t before;
    uint32_t after;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> replacement_text;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_ExtendSelectionAndReplace_Params_Data>;

    FrameWidgetInputHandler_ExtendSelectionAndReplace_Params_Data();
    ~FrameWidgetInputHandler_ExtendSelectionAndReplace_Params_Data() = delete;
};
static_assert(
    sizeof(FrameWidgetInputHandler_ExtendSelectionAndReplace_Params_Data) == 24, "Bad sizeof(FrameWidgetInputHandler_ExtendSelectionAndReplace_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_DeleteSurroundingText_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t before;
    int32_t after;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_DeleteSurroundingText_Params_Data>;

    FrameWidgetInputHandler_DeleteSurroundingText_Params_Data();
    ~FrameWidgetInputHandler_DeleteSurroundingText_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_DeleteSurroundingText_Params_Data) == 16, "Bad sizeof(FrameWidgetInputHandler_DeleteSurroundingText_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_DeleteSurroundingTextInCodePoints_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t before;
    int32_t after;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_DeleteSurroundingTextInCodePoints_Params_Data>;

    FrameWidgetInputHandler_DeleteSurroundingTextInCodePoints_Params_Data();
    ~FrameWidgetInputHandler_DeleteSurroundingTextInCodePoints_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_DeleteSurroundingTextInCodePoints_Params_Data) == 16,
    "Bad sizeof(FrameWidgetInputHandler_DeleteSurroundingTextInCodePoints_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_SetEditableSelectionOffsets_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t start;
    int32_t end;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_SetEditableSelectionOffsets_Params_Data>;

    FrameWidgetInputHandler_SetEditableSelectionOffsets_Params_Data();
    ~FrameWidgetInputHandler_SetEditableSelectionOffsets_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_SetEditableSelectionOffsets_Params_Data) == 16,
    "Bad sizeof(FrameWidgetInputHandler_SetEditableSelectionOffsets_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_HandleStylusWritingGestureAction_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::StylusWritingGestureData_Data> gesture_data;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_HandleStylusWritingGestureAction_Params_Data>;

    FrameWidgetInputHandler_HandleStylusWritingGestureAction_Params_Data();
    ~FrameWidgetInputHandler_HandleStylusWritingGestureAction_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_HandleStylusWritingGestureAction_Params_Data) == 16,
    "Bad sizeof(FrameWidgetInputHandler_HandleStylusWritingGestureAction_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_HandleStylusWritingGestureAction_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_HandleStylusWritingGestureAction_ResponseParams_Data>;

    FrameWidgetInputHandler_HandleStylusWritingGestureAction_ResponseParams_Data();
    ~FrameWidgetInputHandler_HandleStylusWritingGestureAction_ResponseParams_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_HandleStylusWritingGestureAction_ResponseParams_Data) == 16,
    "Bad sizeof(FrameWidgetInputHandler_HandleStylusWritingGestureAction_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_ExecuteEditCommand_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> command;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> value;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_ExecuteEditCommand_Params_Data>;

    FrameWidgetInputHandler_ExecuteEditCommand_Params_Data();
    ~FrameWidgetInputHandler_ExecuteEditCommand_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_ExecuteEditCommand_Params_Data) == 24, "Bad sizeof(FrameWidgetInputHandler_ExecuteEditCommand_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_Undo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_Undo_Params_Data>;

    FrameWidgetInputHandler_Undo_Params_Data();
    ~FrameWidgetInputHandler_Undo_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_Undo_Params_Data) == 8, "Bad sizeof(FrameWidgetInputHandler_Undo_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_Redo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_Redo_Params_Data>;

    FrameWidgetInputHandler_Redo_Params_Data();
    ~FrameWidgetInputHandler_Redo_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_Redo_Params_Data) == 8, "Bad sizeof(FrameWidgetInputHandler_Redo_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_Cut_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_Cut_Params_Data>;

    FrameWidgetInputHandler_Cut_Params_Data();
    ~FrameWidgetInputHandler_Cut_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_Cut_Params_Data) == 8, "Bad sizeof(FrameWidgetInputHandler_Cut_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_Copy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_Copy_Params_Data>;

    FrameWidgetInputHandler_Copy_Params_Data();
    ~FrameWidgetInputHandler_Copy_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_Copy_Params_Data) == 8, "Bad sizeof(FrameWidgetInputHandler_Copy_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_CopyToFindPboard_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_CopyToFindPboard_Params_Data>;

    FrameWidgetInputHandler_CopyToFindPboard_Params_Data();
    ~FrameWidgetInputHandler_CopyToFindPboard_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_CopyToFindPboard_Params_Data) == 8, "Bad sizeof(FrameWidgetInputHandler_CopyToFindPboard_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_CenterSelection_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_CenterSelection_Params_Data>;

    FrameWidgetInputHandler_CenterSelection_Params_Data();
    ~FrameWidgetInputHandler_CenterSelection_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_CenterSelection_Params_Data) == 8, "Bad sizeof(FrameWidgetInputHandler_CenterSelection_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_Paste_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_Paste_Params_Data>;

    FrameWidgetInputHandler_Paste_Params_Data();
    ~FrameWidgetInputHandler_Paste_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_Paste_Params_Data) == 8, "Bad sizeof(FrameWidgetInputHandler_Paste_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_PasteAndMatchStyle_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_PasteAndMatchStyle_Params_Data>;

    FrameWidgetInputHandler_PasteAndMatchStyle_Params_Data();
    ~FrameWidgetInputHandler_PasteAndMatchStyle_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_PasteAndMatchStyle_Params_Data) == 8, "Bad sizeof(FrameWidgetInputHandler_PasteAndMatchStyle_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_Delete_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_Delete_Params_Data>;

    FrameWidgetInputHandler_Delete_Params_Data();
    ~FrameWidgetInputHandler_Delete_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_Delete_Params_Data) == 8, "Bad sizeof(FrameWidgetInputHandler_Delete_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_SelectAll_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_SelectAll_Params_Data>;

    FrameWidgetInputHandler_SelectAll_Params_Data();
    ~FrameWidgetInputHandler_SelectAll_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_SelectAll_Params_Data) == 8, "Bad sizeof(FrameWidgetInputHandler_SelectAll_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_CollapseSelection_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_CollapseSelection_Params_Data>;

    FrameWidgetInputHandler_CollapseSelection_Params_Data();
    ~FrameWidgetInputHandler_CollapseSelection_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_CollapseSelection_Params_Data) == 8, "Bad sizeof(FrameWidgetInputHandler_CollapseSelection_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_Replace_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> word;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_Replace_Params_Data>;

    FrameWidgetInputHandler_Replace_Params_Data();
    ~FrameWidgetInputHandler_Replace_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_Replace_Params_Data) == 16, "Bad sizeof(FrameWidgetInputHandler_Replace_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_ReplaceMisspelling_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> word;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_ReplaceMisspelling_Params_Data>;

    FrameWidgetInputHandler_ReplaceMisspelling_Params_Data();
    ~FrameWidgetInputHandler_ReplaceMisspelling_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_ReplaceMisspelling_Params_Data) == 16, "Bad sizeof(FrameWidgetInputHandler_ReplaceMisspelling_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_SelectRange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> base;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> extent;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_SelectRange_Params_Data>;

    FrameWidgetInputHandler_SelectRange_Params_Data();
    ~FrameWidgetInputHandler_SelectRange_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_SelectRange_Params_Data) == 24, "Bad sizeof(FrameWidgetInputHandler_SelectRange_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_AdjustSelectionByCharacterOffset_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t start;
    int32_t end;
    int32_t behavior;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_AdjustSelectionByCharacterOffset_Params_Data>;

    FrameWidgetInputHandler_AdjustSelectionByCharacterOffset_Params_Data();
    ~FrameWidgetInputHandler_AdjustSelectionByCharacterOffset_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_AdjustSelectionByCharacterOffset_Params_Data) == 24,
    "Bad sizeof(FrameWidgetInputHandler_AdjustSelectionByCharacterOffset_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_SelectAroundCaret_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t granularity;
    uint8_t should_show_handle : 1;
    uint8_t should_show_context_menu : 1;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_SelectAroundCaret_Params_Data>;

    FrameWidgetInputHandler_SelectAroundCaret_Params_Data();
    ~FrameWidgetInputHandler_SelectAroundCaret_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_SelectAroundCaret_Params_Data) == 16, "Bad sizeof(FrameWidgetInputHandler_SelectAroundCaret_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_SelectAroundCaret_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SelectAroundCaretResult_Data> result;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_SelectAroundCaret_ResponseParams_Data>;

    FrameWidgetInputHandler_SelectAroundCaret_ResponseParams_Data();
    ~FrameWidgetInputHandler_SelectAroundCaret_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(FrameWidgetInputHandler_SelectAroundCaret_ResponseParams_Data) == 16, "Bad sizeof(FrameWidgetInputHandler_SelectAroundCaret_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_MoveRangeSelectionExtent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> extent;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_MoveRangeSelectionExtent_Params_Data>;

    FrameWidgetInputHandler_MoveRangeSelectionExtent_Params_Data();
    ~FrameWidgetInputHandler_MoveRangeSelectionExtent_Params_Data() = delete;
};
static_assert(
    sizeof(FrameWidgetInputHandler_MoveRangeSelectionExtent_Params_Data) == 16, "Bad sizeof(FrameWidgetInputHandler_MoveRangeSelectionExtent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_ScrollFocusedEditableNodeIntoView_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_ScrollFocusedEditableNodeIntoView_Params_Data>;

    FrameWidgetInputHandler_ScrollFocusedEditableNodeIntoView_Params_Data();
    ~FrameWidgetInputHandler_ScrollFocusedEditableNodeIntoView_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_ScrollFocusedEditableNodeIntoView_Params_Data) == 8,
    "Bad sizeof(FrameWidgetInputHandler_ScrollFocusedEditableNodeIntoView_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_WaitForPageScaleAnimationForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_WaitForPageScaleAnimationForTesting_Params_Data>;

    FrameWidgetInputHandler_WaitForPageScaleAnimationForTesting_Params_Data();
    ~FrameWidgetInputHandler_WaitForPageScaleAnimationForTesting_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_WaitForPageScaleAnimationForTesting_Params_Data) == 8,
    "Bad sizeof(FrameWidgetInputHandler_WaitForPageScaleAnimationForTesting_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_WaitForPageScaleAnimationForTesting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_WaitForPageScaleAnimationForTesting_ResponseParams_Data>;

    FrameWidgetInputHandler_WaitForPageScaleAnimationForTesting_ResponseParams_Data();
    ~FrameWidgetInputHandler_WaitForPageScaleAnimationForTesting_ResponseParams_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_WaitForPageScaleAnimationForTesting_ResponseParams_Data) == 8,
    "Bad sizeof(FrameWidgetInputHandler_WaitForPageScaleAnimationForTesting_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetInputHandler_MoveCaret_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> point;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetInputHandler_MoveCaret_Params_Data>;

    FrameWidgetInputHandler_MoveCaret_Params_Data();
    ~FrameWidgetInputHandler_MoveCaret_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetInputHandler_MoveCaret_Params_Data) == 16, "Bad sizeof(FrameWidgetInputHandler_MoveCaret_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandler_SetFocus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t state;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandler_SetFocus_Params_Data>;

    WidgetInputHandler_SetFocus_Params_Data();
    ~WidgetInputHandler_SetFocus_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandler_SetFocus_Params_Data) == 16, "Bad sizeof(WidgetInputHandler_SetFocus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandler_MouseCaptureLost_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandler_MouseCaptureLost_Params_Data>;

    WidgetInputHandler_MouseCaptureLost_Params_Data();
    ~WidgetInputHandler_MouseCaptureLost_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandler_MouseCaptureLost_Params_Data) == 8, "Bad sizeof(WidgetInputHandler_MouseCaptureLost_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandler_SetEditCommandsForNextKeyEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::EditCommand_Data>>> commands;

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandler_SetEditCommandsForNextKeyEvent_Params_Data>;

    WidgetInputHandler_SetEditCommandsForNextKeyEvent_Params_Data();
    ~WidgetInputHandler_SetEditCommandsForNextKeyEvent_Params_Data() = delete;
};
static_assert(
    sizeof(WidgetInputHandler_SetEditCommandsForNextKeyEvent_Params_Data) == 16, "Bad sizeof(WidgetInputHandler_SetEditCommandsForNextKeyEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandler_CursorVisibilityChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t visible : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandler_CursorVisibilityChanged_Params_Data>;

    WidgetInputHandler_CursorVisibilityChanged_Params_Data();
    ~WidgetInputHandler_CursorVisibilityChanged_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandler_CursorVisibilityChanged_Params_Data) == 16, "Bad sizeof(WidgetInputHandler_CursorVisibilityChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandler_ImeSetComposition_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> text;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::ui::mojom::internal::ImeTextSpan_Data>>> ime_text_spans;
    mojo::internal::Pointer<::gfx::mojom::internal::Range_Data> range;
    int32_t start;
    int32_t end;

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandler_ImeSetComposition_Params_Data>;

    WidgetInputHandler_ImeSetComposition_Params_Data();
    ~WidgetInputHandler_ImeSetComposition_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandler_ImeSetComposition_Params_Data) == 40, "Bad sizeof(WidgetInputHandler_ImeSetComposition_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandler_ImeSetComposition_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandler_ImeSetComposition_ResponseParams_Data>;

    WidgetInputHandler_ImeSetComposition_ResponseParams_Data();
    ~WidgetInputHandler_ImeSetComposition_ResponseParams_Data() = delete;
};
static_assert(sizeof(WidgetInputHandler_ImeSetComposition_ResponseParams_Data) == 8, "Bad sizeof(WidgetInputHandler_ImeSetComposition_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandler_ImeCommitText_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> text;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::ui::mojom::internal::ImeTextSpan_Data>>> ime_text_spans;
    mojo::internal::Pointer<::gfx::mojom::internal::Range_Data> range;
    int32_t relative_cursor_position;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandler_ImeCommitText_Params_Data>;

    WidgetInputHandler_ImeCommitText_Params_Data();
    ~WidgetInputHandler_ImeCommitText_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandler_ImeCommitText_Params_Data) == 40, "Bad sizeof(WidgetInputHandler_ImeCommitText_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandler_ImeCommitText_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandler_ImeCommitText_ResponseParams_Data>;

    WidgetInputHandler_ImeCommitText_ResponseParams_Data();
    ~WidgetInputHandler_ImeCommitText_ResponseParams_Data() = delete;
};
static_assert(sizeof(WidgetInputHandler_ImeCommitText_ResponseParams_Data) == 8, "Bad sizeof(WidgetInputHandler_ImeCommitText_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandler_ImeFinishComposingText_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t keep_selection : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandler_ImeFinishComposingText_Params_Data>;

    WidgetInputHandler_ImeFinishComposingText_Params_Data();
    ~WidgetInputHandler_ImeFinishComposingText_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandler_ImeFinishComposingText_Params_Data) == 16, "Bad sizeof(WidgetInputHandler_ImeFinishComposingText_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandler_RequestTextInputStateUpdate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandler_RequestTextInputStateUpdate_Params_Data>;

    WidgetInputHandler_RequestTextInputStateUpdate_Params_Data();
    ~WidgetInputHandler_RequestTextInputStateUpdate_Params_Data() = delete;
};
static_assert(
    sizeof(WidgetInputHandler_RequestTextInputStateUpdate_Params_Data) == 8, "Bad sizeof(WidgetInputHandler_RequestTextInputStateUpdate_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandler_RequestCompositionUpdates_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t immediate_request : 1;
    uint8_t monitor_request : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandler_RequestCompositionUpdates_Params_Data>;

    WidgetInputHandler_RequestCompositionUpdates_Params_Data();
    ~WidgetInputHandler_RequestCompositionUpdates_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandler_RequestCompositionUpdates_Params_Data) == 16, "Bad sizeof(WidgetInputHandler_RequestCompositionUpdates_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandler_DispatchEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::Event_Data> event;

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandler_DispatchEvent_Params_Data>;

    WidgetInputHandler_DispatchEvent_Params_Data();
    ~WidgetInputHandler_DispatchEvent_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandler_DispatchEvent_Params_Data) == 16, "Bad sizeof(WidgetInputHandler_DispatchEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandler_DispatchEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t source;
    int32_t state;
    mojo::internal::Pointer<::ui::mojom::internal::LatencyInfo_Data> updated_latency;
    mojo::internal::Pointer<internal::DidOverscrollParams_Data> overscroll;
    mojo::internal::Pointer<internal::TouchActionOptional_Data> touch_action;

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandler_DispatchEvent_ResponseParams_Data>;

    WidgetInputHandler_DispatchEvent_ResponseParams_Data();
    ~WidgetInputHandler_DispatchEvent_ResponseParams_Data() = delete;
};
static_assert(sizeof(WidgetInputHandler_DispatchEvent_ResponseParams_Data) == 40, "Bad sizeof(WidgetInputHandler_DispatchEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandler_DispatchNonBlockingEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::Event_Data> event;

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandler_DispatchNonBlockingEvent_Params_Data>;

    WidgetInputHandler_DispatchNonBlockingEvent_Params_Data();
    ~WidgetInputHandler_DispatchNonBlockingEvent_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandler_DispatchNonBlockingEvent_Params_Data) == 16, "Bad sizeof(WidgetInputHandler_DispatchNonBlockingEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandler_WaitForInputProcessed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandler_WaitForInputProcessed_Params_Data>;

    WidgetInputHandler_WaitForInputProcessed_Params_Data();
    ~WidgetInputHandler_WaitForInputProcessed_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandler_WaitForInputProcessed_Params_Data) == 8, "Bad sizeof(WidgetInputHandler_WaitForInputProcessed_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandler_WaitForInputProcessed_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandler_WaitForInputProcessed_ResponseParams_Data>;

    WidgetInputHandler_WaitForInputProcessed_ResponseParams_Data();
    ~WidgetInputHandler_WaitForInputProcessed_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(WidgetInputHandler_WaitForInputProcessed_ResponseParams_Data) == 8, "Bad sizeof(WidgetInputHandler_WaitForInputProcessed_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandler_GetFrameWidgetInputHandler_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedEndpointHandle_Data interface_request;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandler_GetFrameWidgetInputHandler_Params_Data>;

    WidgetInputHandler_GetFrameWidgetInputHandler_Params_Data();
    ~WidgetInputHandler_GetFrameWidgetInputHandler_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandler_GetFrameWidgetInputHandler_Params_Data) == 16, "Bad sizeof(WidgetInputHandler_GetFrameWidgetInputHandler_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WidgetInputHandler_UpdateBrowserControlsState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t constraints;
    int32_t current;
    uint8_t animate : 1;
    uint8_t pad2_[7];
    mojo::internal::Pointer<::cc::mojom::internal::BrowserControlsOffsetTagsInfo_Data> offset_tags_info;

private:
    friend class mojo::internal::MessageFragment<WidgetInputHandler_UpdateBrowserControlsState_Params_Data>;

    WidgetInputHandler_UpdateBrowserControlsState_Params_Data();
    ~WidgetInputHandler_UpdateBrowserControlsState_Params_Data() = delete;
};
static_assert(sizeof(WidgetInputHandler_UpdateBrowserControlsState_Params_Data) == 32, "Bad sizeof(WidgetInputHandler_UpdateBrowserControlsState_Params_Data)");

} // namespace internal

class WidgetInputHandlerHost_SetTouchActionFromMain_ParamsDataView {
public:
    WidgetInputHandlerHost_SetTouchActionFromMain_ParamsDataView() = default;

    WidgetInputHandlerHost_SetTouchActionFromMain_ParamsDataView(
        internal::WidgetInputHandlerHost_SetTouchActionFromMain_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadTouchAction(UserType* output) const
    {
        auto data_value = data_->touch_action;
        return mojo::internal::Deserialize<::cc::mojom::TouchAction>(data_value, output);
    }
    ::cc::mojom::TouchAction touch_action() const
    {
