// components/services/paint_preview_compositor/public/mojom/paint_preview_compositor.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_SERVICES_PAINT_PREVIEW_COMPOSITOR_PUBLIC_MOJOM_PAINT_PREVIEW_COMPOSITOR_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_SERVICES_PAINT_PREVIEW_COMPOSITOR_PUBLIC_MOJOM_PAINT_PREVIEW_COMPOSITOR_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace paint_preview::mojom {
namespace internal {
class PaintPreviewCompositor_BeginSeparatedFrameComposite_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PaintPreviewBeginCompositeRequest_Data> request;

private:
    friend class mojo::internal::MessageFragment<PaintPreviewCompositor_BeginSeparatedFrameComposite_Params_Data>;

    PaintPreviewCompositor_BeginSeparatedFrameComposite_Params_Data();
    ~PaintPreviewCompositor_BeginSeparatedFrameComposite_Params_Data() = delete;
};
static_assert(sizeof(PaintPreviewCompositor_BeginSeparatedFrameComposite_Params_Data) == 16,
    "Bad sizeof(PaintPreviewCompositor_BeginSeparatedFrameComposite_Params_Data)");
class PaintPreviewCompositor_BeginSeparatedFrameComposite_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<internal::PaintPreviewBeginCompositeResponse_Data> response;

private:
    friend class mojo::internal::MessageFragment<PaintPreviewCompositor_BeginSeparatedFrameComposite_ResponseParams_Data>;

    PaintPreviewCompositor_BeginSeparatedFrameComposite_ResponseParams_Data();
    ~PaintPreviewCompositor_BeginSeparatedFrameComposite_ResponseParams_Data() = delete;
};
static_assert(sizeof(PaintPreviewCompositor_BeginSeparatedFrameComposite_ResponseParams_Data) == 24,
    "Bad sizeof(PaintPreviewCompositor_BeginSeparatedFrameComposite_ResponseParams_Data)");
class PaintPreviewCompositor_BitmapForSeparatedFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> frame_guid;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> clip_rect;
    float scale_factor;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PaintPreviewCompositor_BitmapForSeparatedFrame_Params_Data>;

    PaintPreviewCompositor_BitmapForSeparatedFrame_Params_Data();
    ~PaintPreviewCompositor_BitmapForSeparatedFrame_Params_Data() = delete;
};
static_assert(
    sizeof(PaintPreviewCompositor_BitmapForSeparatedFrame_Params_Data) == 32, "Bad sizeof(PaintPreviewCompositor_BitmapForSeparatedFrame_Params_Data)");
class PaintPreviewCompositor_BitmapForSeparatedFrame_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::skia::mojom::internal::BitmapN32_Data> bitmap;

private:
    friend class mojo::internal::MessageFragment<PaintPreviewCompositor_BitmapForSeparatedFrame_ResponseParams_Data>;

    PaintPreviewCompositor_BitmapForSeparatedFrame_ResponseParams_Data();
    ~PaintPreviewCompositor_BitmapForSeparatedFrame_ResponseParams_Data() = delete;
};
static_assert(sizeof(PaintPreviewCompositor_BitmapForSeparatedFrame_ResponseParams_Data) == 24,
    "Bad sizeof(PaintPreviewCompositor_BitmapForSeparatedFrame_ResponseParams_Data)");
class PaintPreviewCompositor_BeginMainFrameComposite_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PaintPreviewBeginCompositeRequest_Data> request;

private:
    friend class mojo::internal::MessageFragment<PaintPreviewCompositor_BeginMainFrameComposite_Params_Data>;

    PaintPreviewCompositor_BeginMainFrameComposite_Params_Data();
    ~PaintPreviewCompositor_BeginMainFrameComposite_Params_Data() = delete;
};
static_assert(
    sizeof(PaintPreviewCompositor_BeginMainFrameComposite_Params_Data) == 16, "Bad sizeof(PaintPreviewCompositor_BeginMainFrameComposite_Params_Data)");
class PaintPreviewCompositor_BeginMainFrameComposite_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<internal::PaintPreviewBeginCompositeResponse_Data> response;

private:
    friend class mojo::internal::MessageFragment<PaintPreviewCompositor_BeginMainFrameComposite_ResponseParams_Data>;

    PaintPreviewCompositor_BeginMainFrameComposite_ResponseParams_Data();
    ~PaintPreviewCompositor_BeginMainFrameComposite_ResponseParams_Data() = delete;
};
static_assert(sizeof(PaintPreviewCompositor_BeginMainFrameComposite_ResponseParams_Data) == 24,
    "Bad sizeof(PaintPreviewCompositor_BeginMainFrameComposite_ResponseParams_Data)");
class PaintPreviewCompositor_BitmapForMainFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> clip_rect;
    float scale_factor;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PaintPreviewCompositor_BitmapForMainFrame_Params_Data>;

    PaintPreviewCompositor_BitmapForMainFrame_Params_Data();
    ~PaintPreviewCompositor_BitmapForMainFrame_Params_Data() = delete;
};
static_assert(sizeof(PaintPreviewCompositor_BitmapForMainFrame_Params_Data) == 24, "Bad sizeof(PaintPreviewCompositor_BitmapForMainFrame_Params_Data)");
class PaintPreviewCompositor_BitmapForMainFrame_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::skia::mojom::internal::BitmapN32_Data> bitmap;

private:
    friend class mojo::internal::MessageFragment<PaintPreviewCompositor_BitmapForMainFrame_ResponseParams_Data>;

    PaintPreviewCompositor_BitmapForMainFrame_ResponseParams_Data();
    ~PaintPreviewCompositor_BitmapForMainFrame_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(PaintPreviewCompositor_BitmapForMainFrame_ResponseParams_Data) == 24, "Bad sizeof(PaintPreviewCompositor_BitmapForMainFrame_ResponseParams_Data)");
class PaintPreviewCompositor_SetRootFrameUrl_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<PaintPreviewCompositor_SetRootFrameUrl_Params_Data>;

    PaintPreviewCompositor_SetRootFrameUrl_Params_Data();
    ~PaintPreviewCompositor_SetRootFrameUrl_Params_Data() = delete;
};
static_assert(sizeof(PaintPreviewCompositor_SetRootFrameUrl_Params_Data) == 16, "Bad sizeof(PaintPreviewCompositor_SetRootFrameUrl_Params_Data)");
class PaintPreviewCompositorCollection_SetDiscardableSharedMemoryManager_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data manager;

private:
    friend class mojo::internal::MessageFragment<PaintPreviewCompositorCollection_SetDiscardableSharedMemoryManager_Params_Data>;

    PaintPreviewCompositorCollection_SetDiscardableSharedMemoryManager_Params_Data();
    ~PaintPreviewCompositorCollection_SetDiscardableSharedMemoryManager_Params_Data() = delete;
};
static_assert(sizeof(PaintPreviewCompositorCollection_SetDiscardableSharedMemoryManager_Params_Data) == 16,
    "Bad sizeof(PaintPreviewCompositorCollection_SetDiscardableSharedMemoryManager_Params_Data)");
class PaintPreviewCompositorCollection_CreateCompositor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data compositor;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PaintPreviewCompositorCollection_CreateCompositor_Params_Data>;

    PaintPreviewCompositorCollection_CreateCompositor_Params_Data();
    ~PaintPreviewCompositorCollection_CreateCompositor_Params_Data() = delete;
};
static_assert(
    sizeof(PaintPreviewCompositorCollection_CreateCompositor_Params_Data) == 16, "Bad sizeof(PaintPreviewCompositorCollection_CreateCompositor_Params_Data)");
class PaintPreviewCompositorCollection_CreateCompositor_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> compositor_id;

private:
    friend class mojo::internal::MessageFragment<PaintPreviewCompositorCollection_CreateCompositor_ResponseParams_Data>;

    PaintPreviewCompositorCollection_CreateCompositor_ResponseParams_Data();
    ~PaintPreviewCompositorCollection_CreateCompositor_ResponseParams_Data() = delete;
};
static_assert(sizeof(PaintPreviewCompositorCollection_CreateCompositor_ResponseParams_Data) == 16,
    "Bad sizeof(PaintPreviewCompositorCollection_CreateCompositor_ResponseParams_Data)");
class PaintPreviewCompositorCollection_OnMemoryPressure_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t memory_pressure_level;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PaintPreviewCompositorCollection_OnMemoryPressure_Params_Data>;

    PaintPreviewCompositorCollection_OnMemoryPressure_Params_Data();
    ~PaintPreviewCompositorCollection_OnMemoryPressure_Params_Data() = delete;
};
static_assert(
    sizeof(PaintPreviewCompositorCollection_OnMemoryPressure_Params_Data) == 16, "Bad sizeof(PaintPreviewCompositorCollection_OnMemoryPressure_Params_Data)");
class PaintPreviewCompositorCollection_ListCompositors_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PaintPreviewCompositorCollection_ListCompositors_Params_Data>;

    PaintPreviewCompositorCollection_ListCompositors_Params_Data();
    ~PaintPreviewCompositorCollection_ListCompositors_Params_Data() = delete;
};
static_assert(
    sizeof(PaintPreviewCompositorCollection_ListCompositors_Params_Data) == 8, "Bad sizeof(PaintPreviewCompositorCollection_ListCompositors_Params_Data)");
class PaintPreviewCompositorCollection_ListCompositors_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data>>> compositor_ids;

private:
    friend class mojo::internal::MessageFragment<PaintPreviewCompositorCollection_ListCompositors_ResponseParams_Data>;

    PaintPreviewCompositorCollection_ListCompositors_ResponseParams_Data();
    ~PaintPreviewCompositorCollection_ListCompositors_ResponseParams_Data() = delete;
};
static_assert(sizeof(PaintPreviewCompositorCollection_ListCompositors_ResponseParams_Data) == 16,
    "Bad sizeof(PaintPreviewCompositorCollection_ListCompositors_ResponseParams_Data)");

} // namespace internal

class PaintPreviewCompositor_BeginSeparatedFrameComposite_ParamsDataView {
public:
    PaintPreviewCompositor_BeginSeparatedFrameComposite_ParamsDataView() = default;

    PaintPreviewCompositor_BeginSeparatedFrameComposite_ParamsDataView(
        internal::PaintPreviewCompositor_BeginSeparatedFrameComposite_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetRequestDataView(PaintPreviewBeginCompositeRequestDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadRequest(UserType* output)
    {

        auto* pointer = data_->request.Get();
