// components/media_router/common/mojom/media_router.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_MEDIA_ROUTER_COMMON_MOJOM_MEDIA_ROUTER_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_MEDIA_ROUTER_COMMON_MOJOM_MEDIA_ROUTER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media_router::mojom {
namespace internal {
class MediaRouteProvider_CreateRoute_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> media_source;
    mojo::internal::Pointer<mojo::internal::String_Data> sink_id;
    mojo::internal::Pointer<mojo::internal::String_Data> original_presentation_id;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> origin;
    int32_t frame_tree_node_id;
    uint8_t pad4_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> timeout;

private:
    friend class mojo::internal::MessageFragment<MediaRouteProvider_CreateRoute_Params_Data>;

    MediaRouteProvider_CreateRoute_Params_Data();
    ~MediaRouteProvider_CreateRoute_Params_Data() = delete;
};
static_assert(sizeof(MediaRouteProvider_CreateRoute_Params_Data) == 56, "Bad sizeof(MediaRouteProvider_CreateRoute_Params_Data)");
class MediaRouteProvider_CreateRoute_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::MediaRoute_Data> route;
    mojo::internal::Pointer<internal::RoutePresentationConnection_Data> connection;
    mojo::internal::Pointer<mojo::internal::String_Data> error_text;
    int32_t result_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaRouteProvider_CreateRoute_ResponseParams_Data>;

    MediaRouteProvider_CreateRoute_ResponseParams_Data();
    ~MediaRouteProvider_CreateRoute_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaRouteProvider_CreateRoute_ResponseParams_Data) == 40, "Bad sizeof(MediaRouteProvider_CreateRoute_ResponseParams_Data)");
class MediaRouteProvider_JoinRoute_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> media_source;
    mojo::internal::Pointer<mojo::internal::String_Data> presentation_id;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> origin;
    int32_t frame_tree_node_id;
    uint8_t pad3_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> timeout;

private:
    friend class mojo::internal::MessageFragment<MediaRouteProvider_JoinRoute_Params_Data>;

    MediaRouteProvider_JoinRoute_Params_Data();
    ~MediaRouteProvider_JoinRoute_Params_Data() = delete;
};
static_assert(sizeof(MediaRouteProvider_JoinRoute_Params_Data) == 48, "Bad sizeof(MediaRouteProvider_JoinRoute_Params_Data)");
class MediaRouteProvider_JoinRoute_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::MediaRoute_Data> route;
    mojo::internal::Pointer<internal::RoutePresentationConnection_Data> connection;
    mojo::internal::Pointer<mojo::internal::String_Data> error_text;
    int32_t result_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaRouteProvider_JoinRoute_ResponseParams_Data>;

    MediaRouteProvider_JoinRoute_ResponseParams_Data();
    ~MediaRouteProvider_JoinRoute_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaRouteProvider_JoinRoute_ResponseParams_Data) == 40, "Bad sizeof(MediaRouteProvider_JoinRoute_ResponseParams_Data)");
class MediaRouteProvider_TerminateRoute_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> route_id;

private:
    friend class mojo::internal::MessageFragment<MediaRouteProvider_TerminateRoute_Params_Data>;

    MediaRouteProvider_TerminateRoute_Params_Data();
    ~MediaRouteProvider_TerminateRoute_Params_Data() = delete;
};
static_assert(sizeof(MediaRouteProvider_TerminateRoute_Params_Data) == 16, "Bad sizeof(MediaRouteProvider_TerminateRoute_Params_Data)");
class MediaRouteProvider_TerminateRoute_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> error_text;
    int32_t result_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaRouteProvider_TerminateRoute_ResponseParams_Data>;

    MediaRouteProvider_TerminateRoute_ResponseParams_Data();
    ~MediaRouteProvider_TerminateRoute_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaRouteProvider_TerminateRoute_ResponseParams_Data) == 24, "Bad sizeof(MediaRouteProvider_TerminateRoute_ResponseParams_Data)");
class MediaRouteProvider_SendRouteMessage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> media_route_id;
    mojo::internal::Pointer<mojo::internal::String_Data> message;

private:
    friend class mojo::internal::MessageFragment<MediaRouteProvider_SendRouteMessage_Params_Data>;

    MediaRouteProvider_SendRouteMessage_Params_Data();
    ~MediaRouteProvider_SendRouteMessage_Params_Data() = delete;
};
static_assert(sizeof(MediaRouteProvider_SendRouteMessage_Params_Data) == 24, "Bad sizeof(MediaRouteProvider_SendRouteMessage_Params_Data)");
class MediaRouteProvider_SendRouteBinaryMessage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> media_route_id;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> data;

private:
    friend class mojo::internal::MessageFragment<MediaRouteProvider_SendRouteBinaryMessage_Params_Data>;

    MediaRouteProvider_SendRouteBinaryMessage_Params_Data();
    ~MediaRouteProvider_SendRouteBinaryMessage_Params_Data() = delete;
};
static_assert(sizeof(MediaRouteProvider_SendRouteBinaryMessage_Params_Data) == 24, "Bad sizeof(MediaRouteProvider_SendRouteBinaryMessage_Params_Data)");
class MediaRouteProvider_StartObservingMediaSinks_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> media_source;

private:
    friend class mojo::internal::MessageFragment<MediaRouteProvider_StartObservingMediaSinks_Params_Data>;

    MediaRouteProvider_StartObservingMediaSinks_Params_Data();
    ~MediaRouteProvider_StartObservingMediaSinks_Params_Data() = delete;
};
static_assert(sizeof(MediaRouteProvider_StartObservingMediaSinks_Params_Data) == 16, "Bad sizeof(MediaRouteProvider_StartObservingMediaSinks_Params_Data)");
class MediaRouteProvider_StopObservingMediaSinks_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> media_source;

private:
    friend class mojo::internal::MessageFragment<MediaRouteProvider_StopObservingMediaSinks_Params_Data>;

    MediaRouteProvider_StopObservingMediaSinks_Params_Data();
    ~MediaRouteProvider_StopObservingMediaSinks_Params_Data() = delete;
};
static_assert(sizeof(MediaRouteProvider_StopObservingMediaSinks_Params_Data) == 16, "Bad sizeof(MediaRouteProvider_StopObservingMediaSinks_Params_Data)");
class MediaRouteProvider_StartObservingMediaRoutes_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaRouteProvider_StartObservingMediaRoutes_Params_Data>;

    MediaRouteProvider_StartObservingMediaRoutes_Params_Data();
    ~MediaRouteProvider_StartObservingMediaRoutes_Params_Data() = delete;
};
static_assert(sizeof(MediaRouteProvider_StartObservingMediaRoutes_Params_Data) == 8, "Bad sizeof(MediaRouteProvider_StartObservingMediaRoutes_Params_Data)");
class MediaRouteProvider_DetachRoute_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> route_id;

private:
    friend class mojo::internal::MessageFragment<MediaRouteProvider_DetachRoute_Params_Data>;

    MediaRouteProvider_DetachRoute_Params_Data();
    ~MediaRouteProvider_DetachRoute_Params_Data() = delete;
};
static_assert(sizeof(MediaRouteProvider_DetachRoute_Params_Data) == 16, "Bad sizeof(MediaRouteProvider_DetachRoute_Params_Data)");
class MediaRouteProvider_EnableMdnsDiscovery_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaRouteProvider_EnableMdnsDiscovery_Params_Data>;

    MediaRouteProvider_EnableMdnsDiscovery_Params_Data();
    ~MediaRouteProvider_EnableMdnsDiscovery_Params_Data() = delete;
};
static_assert(sizeof(MediaRouteProvider_EnableMdnsDiscovery_Params_Data) == 8, "Bad sizeof(MediaRouteProvider_EnableMdnsDiscovery_Params_Data)");
class MediaRouteProvider_DiscoverSinksNow_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaRouteProvider_DiscoverSinksNow_Params_Data>;

    MediaRouteProvider_DiscoverSinksNow_Params_Data();
    ~MediaRouteProvider_DiscoverSinksNow_Params_Data() = delete;
};
static_assert(sizeof(MediaRouteProvider_DiscoverSinksNow_Params_Data) == 8, "Bad sizeof(MediaRouteProvider_DiscoverSinksNow_Params_Data)");
class MediaRouteProvider_BindMediaController_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> route_id;
    mojo::internal::Handle_Data media_controller;
    mojo::internal::Interface_Data observer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaRouteProvider_BindMediaController_Params_Data>;

    MediaRouteProvider_BindMediaController_Params_Data();
    ~MediaRouteProvider_BindMediaController_Params_Data() = delete;
};
static_assert(sizeof(MediaRouteProvider_BindMediaController_Params_Data) == 32, "Bad sizeof(MediaRouteProvider_BindMediaController_Params_Data)");
class MediaRouteProvider_BindMediaController_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaRouteProvider_BindMediaController_ResponseParams_Data>;

    MediaRouteProvider_BindMediaController_ResponseParams_Data();
    ~MediaRouteProvider_BindMediaController_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(MediaRouteProvider_BindMediaController_ResponseParams_Data) == 16, "Bad sizeof(MediaRouteProvider_BindMediaController_ResponseParams_Data)");
class MediaRouteProvider_GetState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaRouteProvider_GetState_Params_Data>;

    MediaRouteProvider_GetState_Params_Data();
    ~MediaRouteProvider_GetState_Params_Data() = delete;
};
static_assert(sizeof(MediaRouteProvider_GetState_Params_Data) == 8, "Bad sizeof(MediaRouteProvider_GetState_Params_Data)");
class MediaRouteProvider_GetState_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::ProviderState_Data state;

private:
    friend class mojo::internal::MessageFragment<MediaRouteProvider_GetState_ResponseParams_Data>;

    MediaRouteProvider_GetState_ResponseParams_Data();
    ~MediaRouteProvider_GetState_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaRouteProvider_GetState_ResponseParams_Data) == 24, "Bad sizeof(MediaRouteProvider_GetState_ResponseParams_Data)");
class MediaRouter_RegisterMediaRouteProvider_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t provider_id;
    mojo::internal::Interface_Data media_router_provider;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaRouter_RegisterMediaRouteProvider_Params_Data>;

    MediaRouter_RegisterMediaRouteProvider_Params_Data();
    ~MediaRouter_RegisterMediaRouteProvider_Params_Data() = delete;
};
static_assert(sizeof(MediaRouter_RegisterMediaRouteProvider_Params_Data) == 24, "Bad sizeof(MediaRouter_RegisterMediaRouteProvider_Params_Data)");
class MediaRouter_OnSinksReceived_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t provider_id;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> media_source;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::MediaSink_Data>>> sinks;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Origin_Data>>> origins;

private:
    friend class mojo::internal::MessageFragment<MediaRouter_OnSinksReceived_Params_Data>;

    MediaRouter_OnSinksReceived_Params_Data();
    ~MediaRouter_OnSinksReceived_Params_Data() = delete;
};
static_assert(sizeof(MediaRouter_OnSinksReceived_Params_Data) == 40, "Bad sizeof(MediaRouter_OnSinksReceived_Params_Data)");
class MediaRouter_OnIssue_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::Issue_Data> issue;

private:
    friend class mojo::internal::MessageFragment<MediaRouter_OnIssue_Params_Data>;

    MediaRouter_OnIssue_Params_Data();
    ~MediaRouter_OnIssue_Params_Data() = delete;
};
static_assert(sizeof(MediaRouter_OnIssue_Params_Data) == 16, "Bad sizeof(MediaRouter_OnIssue_Params_Data)");
class MediaRouter_ClearTopIssueForSink_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> sink_id;

private:
    friend class mojo::internal::MessageFragment<MediaRouter_ClearTopIssueForSink_Params_Data>;

    MediaRouter_ClearTopIssueForSink_Params_Data();
    ~MediaRouter_ClearTopIssueForSink_Params_Data() = delete;
};
static_assert(sizeof(MediaRouter_ClearTopIssueForSink_Params_Data) == 16, "Bad sizeof(MediaRouter_ClearTopIssueForSink_Params_Data)");
class MediaRouter_OnRoutesUpdated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t provider_id;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::MediaRoute_Data>>> routes;

private:
    friend class mojo::internal::MessageFragment<MediaRouter_OnRoutesUpdated_Params_Data>;

    MediaRouter_OnRoutesUpdated_Params_Data();
    ~MediaRouter_OnRoutesUpdated_Params_Data() = delete;
};
static_assert(sizeof(MediaRouter_OnRoutesUpdated_Params_Data) == 24, "Bad sizeof(MediaRouter_OnRoutesUpdated_Params_Data)");
class MediaRouter_OnPresentationConnectionStateChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> route_id;
    int32_t state;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaRouter_OnPresentationConnectionStateChanged_Params_Data>;

    MediaRouter_OnPresentationConnectionStateChanged_Params_Data();
    ~MediaRouter_OnPresentationConnectionStateChanged_Params_Data() = delete;
};
static_assert(
    sizeof(MediaRouter_OnPresentationConnectionStateChanged_Params_Data) == 24, "Bad sizeof(MediaRouter_OnPresentationConnectionStateChanged_Params_Data)");
class MediaRouter_OnPresentationConnectionClosed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> route_id;
    int32_t reason;
    uint8_t pad1_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> message;

private:
    friend class mojo::internal::MessageFragment<MediaRouter_OnPresentationConnectionClosed_Params_Data>;

    MediaRouter_OnPresentationConnectionClosed_Params_Data();
    ~MediaRouter_OnPresentationConnectionClosed_Params_Data() = delete;
};
static_assert(sizeof(MediaRouter_OnPresentationConnectionClosed_Params_Data) == 32, "Bad sizeof(MediaRouter_OnPresentationConnectionClosed_Params_Data)");
class MediaRouter_OnRouteMessagesReceived_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> route_id;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::RouteMessage_Data>>> messages;

private:
    friend class mojo::internal::MessageFragment<MediaRouter_OnRouteMessagesReceived_Params_Data>;

    MediaRouter_OnRouteMessagesReceived_Params_Data();
    ~MediaRouter_OnRouteMessagesReceived_Params_Data() = delete;
};
static_assert(sizeof(MediaRouter_OnRouteMessagesReceived_Params_Data) == 24, "Bad sizeof(MediaRouter_OnRouteMessagesReceived_Params_Data)");
class MediaRouter_GetMediaSinkServiceStatus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaRouter_GetMediaSinkServiceStatus_Params_Data>;

    MediaRouter_GetMediaSinkServiceStatus_Params_Data();
    ~MediaRouter_GetMediaSinkServiceStatus_Params_Data() = delete;
};
static_assert(sizeof(MediaRouter_GetMediaSinkServiceStatus_Params_Data) == 8, "Bad sizeof(MediaRouter_GetMediaSinkServiceStatus_Params_Data)");
class MediaRouter_GetMediaSinkServiceStatus_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> status;

private:
    friend class mojo::internal::MessageFragment<MediaRouter_GetMediaSinkServiceStatus_ResponseParams_Data>;

    MediaRouter_GetMediaSinkServiceStatus_ResponseParams_Data();
    ~MediaRouter_GetMediaSinkServiceStatus_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaRouter_GetMediaSinkServiceStatus_ResponseParams_Data) == 16, "Bad sizeof(MediaRouter_GetMediaSinkServiceStatus_ResponseParams_Data)");
class MediaRouter_GetLogger_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaRouter_GetLogger_Params_Data>;

    MediaRouter_GetLogger_Params_Data();
    ~MediaRouter_GetLogger_Params_Data() = delete;
};
static_assert(sizeof(MediaRouter_GetLogger_Params_Data) == 16, "Bad sizeof(MediaRouter_GetLogger_Params_Data)");
class MediaRouter_GetDebugger_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaRouter_GetDebugger_Params_Data>;

    MediaRouter_GetDebugger_Params_Data();
    ~MediaRouter_GetDebugger_Params_Data() = delete;
};
static_assert(sizeof(MediaRouter_GetDebugger_Params_Data) == 16, "Bad sizeof(MediaRouter_GetDebugger_Params_Data)");
class MediaRouter_GetLogsAsString_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaRouter_GetLogsAsString_Params_Data>;

    MediaRouter_GetLogsAsString_Params_Data();
    ~MediaRouter_GetLogsAsString_Params_Data() = delete;
};
static_assert(sizeof(MediaRouter_GetLogsAsString_Params_Data) == 8, "Bad sizeof(MediaRouter_GetLogsAsString_Params_Data)");
class MediaRouter_GetLogsAsString_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> logs;

private:
    friend class mojo::internal::MessageFragment<MediaRouter_GetLogsAsString_ResponseParams_Data>;

    MediaRouter_GetLogsAsString_ResponseParams_Data();
    ~MediaRouter_GetLogsAsString_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaRouter_GetLogsAsString_ResponseParams_Data) == 16, "Bad sizeof(MediaRouter_GetLogsAsString_ResponseParams_Data)");

} // namespace internal

class MediaRouteProvider_CreateRoute_ParamsDataView {
public:
    MediaRouteProvider_CreateRoute_ParamsDataView() = default;

    MediaRouteProvider_CreateRoute_ParamsDataView(internal::MediaRouteProvider_CreateRoute_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetMediaSourceDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadMediaSource(UserType* output)
    {

        auto* pointer = data_->media_source.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }
    inline void GetSinkIdDataView(mojo::StringDataView* output);

