// components/media_router/common/mojom/media_controller.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_MEDIA_ROUTER_COMMON_MOJOM_MEDIA_CONTROLLER_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_MEDIA_ROUTER_COMMON_MOJOM_MEDIA_CONTROLLER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media_router::mojom {
namespace internal {
class MediaController_Play_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_Play_Params_Data>;

    MediaController_Play_Params_Data();
    ~MediaController_Play_Params_Data() = delete;
};
static_assert(sizeof(MediaController_Play_Params_Data) == 8, "Bad sizeof(MediaController_Play_Params_Data)");
class MediaController_Pause_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_Pause_Params_Data>;

    MediaController_Pause_Params_Data();
    ~MediaController_Pause_Params_Data() = delete;
};
static_assert(sizeof(MediaController_Pause_Params_Data) == 8, "Bad sizeof(MediaController_Pause_Params_Data)");
class MediaController_SetMute_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t mute : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaController_SetMute_Params_Data>;

    MediaController_SetMute_Params_Data();
    ~MediaController_SetMute_Params_Data() = delete;
};
static_assert(sizeof(MediaController_SetMute_Params_Data) == 16, "Bad sizeof(MediaController_SetMute_Params_Data)");
class MediaController_SetVolume_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    float volume;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaController_SetVolume_Params_Data>;

    MediaController_SetVolume_Params_Data();
    ~MediaController_SetVolume_Params_Data() = delete;
};
static_assert(sizeof(MediaController_SetVolume_Params_Data) == 16, "Bad sizeof(MediaController_SetVolume_Params_Data)");
class MediaController_Seek_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> time;

private:
    friend class mojo::internal::MessageFragment<MediaController_Seek_Params_Data>;

    MediaController_Seek_Params_Data();
    ~MediaController_Seek_Params_Data() = delete;
};
static_assert(sizeof(MediaController_Seek_Params_Data) == 16, "Bad sizeof(MediaController_Seek_Params_Data)");
class MediaController_NextTrack_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_NextTrack_Params_Data>;

    MediaController_NextTrack_Params_Data();
    ~MediaController_NextTrack_Params_Data() = delete;
};
static_assert(sizeof(MediaController_NextTrack_Params_Data) == 8, "Bad sizeof(MediaController_NextTrack_Params_Data)");
class MediaController_PreviousTrack_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_PreviousTrack_Params_Data>;

    MediaController_PreviousTrack_Params_Data();
    ~MediaController_PreviousTrack_Params_Data() = delete;
};
static_assert(sizeof(MediaController_PreviousTrack_Params_Data) == 8, "Bad sizeof(MediaController_PreviousTrack_Params_Data)");

} // namespace internal

class MediaController_Play_ParamsDataView {
public:
    MediaController_Play_ParamsDataView() = default;

    MediaController_Play_ParamsDataView(internal::MediaController_Play_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::MediaController_Play_Params_Data* data_ = nullptr;
};

class MediaController_Pause_ParamsDataView {
public:
    MediaController_Pause_ParamsDataView() = default;

    MediaController_Pause_ParamsDataView(internal::MediaController_Pause_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::MediaController_Pause_Params_Data* data_ = nullptr;
};

class MediaController_SetMute_ParamsDataView {
public:
    MediaController_SetMute_ParamsDataView() = default;

    MediaController_SetMute_ParamsDataView(internal::MediaController_SetMute_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    bool mute() const
    {
        return data_->mute;
    }

private:
    internal::MediaController_SetMute_Params_Data* data_ = nullptr;
};

class MediaController_SetVolume_ParamsDataView {
public:
    MediaController_SetVolume_ParamsDataView() = default;

    MediaController_SetVolume_ParamsDataView(internal::MediaController_SetVolume_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    float volume() const
    {
        return data_->volume;
    }

private:
    internal::MediaController_SetVolume_Params_Data* data_ = nullptr;
};

class MediaController_Seek_ParamsDataView {
public:
    MediaController_Seek_ParamsDataView() = default;

    MediaController_Seek_ParamsDataView(internal::MediaController_Seek_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetTimeDataView(::mojo_base::mojom::TimeDeltaDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadTime(UserType* output)
    {

        auto* pointer = data_->time.Get();
        return mojo::internal::Deserialize<::mojo_base::mojom::TimeDeltaDataView>(pointer, output, message_);
    }

private:
    internal::MediaController_Seek_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class MediaController_NextTrack_ParamsDataView {
public:
    MediaController_NextTrack_ParamsDataView() = default;

    MediaController_NextTrack_ParamsDataView(internal::MediaController_NextTrack_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::MediaController_NextTrack_Params_Data* data_ = nullptr;
};

class MediaController_PreviousTrack_ParamsDataView {
public:
    MediaController_PreviousTrack_ParamsDataView() = default;

    MediaController_PreviousTrack_ParamsDataView(internal::MediaController_PreviousTrack_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::MediaController_PreviousTrack_Params_Data* data_ = nullptr;
};

inline void MediaController_Seek_ParamsDataView::GetTimeDataView(::mojo_base::mojom::TimeDeltaDataView* output)
{
    auto pointer = data_->time.Get();
    *output = ::mojo_base::mojom::TimeDeltaDataView(pointer, message_);
}

} // media_router::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // COMPONENTS_MEDIA_ROUTER_COMMON_MOJOM_MEDIA_CONTROLLER_MOJOM_PARAMS_DATA_H_
