// services/accessibility/public/mojom/automation_client.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_ACCESSIBILITY_PUBLIC_MOJOM_AUTOMATION_CLIENT_MOJOM_PARAMS_DATA_H_
#define SERVICES_ACCESSIBILITY_PUBLIC_MOJOM_AUTOMATION_CLIENT_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace ax::mojom {
namespace internal {
class AutomationClient_Enable_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AutomationClient_Enable_Params_Data>;

    AutomationClient_Enable_Params_Data();
    ~AutomationClient_Enable_Params_Data() = delete;
};
static_assert(sizeof(AutomationClient_Enable_Params_Data) == 8, "Bad sizeof(AutomationClient_Enable_Params_Data)");
class AutomationClient_Enable_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::ax::mojom::internal::AXTreeID_Data desktop_id;

private:
    friend class mojo::internal::MessageFragment<AutomationClient_Enable_ResponseParams_Data>;

    AutomationClient_Enable_ResponseParams_Data();
    ~AutomationClient_Enable_ResponseParams_Data() = delete;
};
static_assert(sizeof(AutomationClient_Enable_ResponseParams_Data) == 24, "Bad sizeof(AutomationClient_Enable_ResponseParams_Data)");
class AutomationClient_Disable_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AutomationClient_Disable_Params_Data>;

    AutomationClient_Disable_Params_Data();
    ~AutomationClient_Disable_Params_Data() = delete;
};
static_assert(sizeof(AutomationClient_Disable_Params_Data) == 8, "Bad sizeof(AutomationClient_Disable_Params_Data)");
class AutomationClient_EnableChildTree_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::ax::mojom::internal::AXTreeID_Data tree_id;

private:
    friend class mojo::internal::MessageFragment<AutomationClient_EnableChildTree_Params_Data>;

    AutomationClient_EnableChildTree_Params_Data();
    ~AutomationClient_EnableChildTree_Params_Data() = delete;
};
static_assert(sizeof(AutomationClient_EnableChildTree_Params_Data) == 24, "Bad sizeof(AutomationClient_EnableChildTree_Params_Data)");
class AutomationClient_PerformAction_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::ax::mojom::internal::AXActionData_Data> action_data;

private:
    friend class mojo::internal::MessageFragment<AutomationClient_PerformAction_Params_Data>;

    AutomationClient_PerformAction_Params_Data();
    ~AutomationClient_PerformAction_Params_Data() = delete;
};
static_assert(sizeof(AutomationClient_PerformAction_Params_Data) == 16, "Bad sizeof(AutomationClient_PerformAction_Params_Data)");

} // namespace internal

class AutomationClient_Enable_ParamsDataView {
public:
    AutomationClient_Enable_ParamsDataView() = default;

    AutomationClient_Enable_ParamsDataView(internal::AutomationClient_Enable_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::AutomationClient_Enable_Params_Data* data_ = nullptr;
};

class AutomationClient_Enable_ResponseParamsDataView {
public:
    AutomationClient_Enable_ResponseParamsDataView() = default;

    AutomationClient_Enable_ResponseParamsDataView(internal::AutomationClient_Enable_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetDesktopIdDataView(::ax::mojom::AXTreeIDDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadDesktopId(UserType* output)
    {

        auto* pointer = !data_->desktop_id.is_null() ? &data_->desktop_id : nullptr;
        return mojo::internal::Deserialize<::ax::mojom::AXTreeIDDataView>(pointer, output, message_);
    }

private:
    internal::AutomationClient_Enable_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class AutomationClient_Disable_ParamsDataView {
public:
    AutomationClient_Disable_ParamsDataView() = default;

    AutomationClient_Disable_ParamsDataView(internal::AutomationClient_Disable_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::AutomationClient_Disable_Params_Data* data_ = nullptr;
};

class AutomationClient_EnableChildTree_ParamsDataView {
public:
    AutomationClient_EnableChildTree_ParamsDataView() = default;

    AutomationClient_EnableChildTree_ParamsDataView(internal::AutomationClient_EnableChildTree_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetTreeIdDataView(::ax::mojom::AXTreeIDDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadTreeId(UserType* output)
    {

        auto* pointer = !data_->tree_id.is_null() ? &data_->tree_id : nullptr;
        return mojo::internal::Deserialize<::ax::mojom::AXTreeIDDataView>(pointer, output, message_);
    }

private:
    internal::AutomationClient_EnableChildTree_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class AutomationClient_PerformAction_ParamsDataView {
public:
    AutomationClient_PerformAction_ParamsDataView() = default;

    AutomationClient_PerformAction_ParamsDataView(internal::AutomationClient_PerformAction_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetActionDataDataView(::ax::mojom::AXActionDataDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadActionData(UserType* output)
    {

        auto* pointer = data_->action_data.Get();
        return mojo::internal::Deserialize<::ax::mojom::AXActionDataDataView>(pointer, output, message_);
    }

private:
    internal::AutomationClient_PerformAction_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

inline void AutomationClient_Enable_ResponseParamsDataView::GetDesktopIdDataView(::ax::mojom::AXTreeIDDataView* output)
{
    auto pointer = &data_->desktop_id;
    *output = ::ax::mojom::AXTreeIDDataView(pointer, message_);
}

inline void AutomationClient_EnableChildTree_ParamsDataView::GetTreeIdDataView(::ax::mojom::AXTreeIDDataView* output)
{
    auto pointer = &data_->tree_id;
    *output = ::ax::mojom::AXTreeIDDataView(pointer, message_);
}

inline void AutomationClient_PerformAction_ParamsDataView::GetActionDataDataView(::ax::mojom::AXActionDataDataView* output)
{
    auto pointer = data_->action_data.Get();
    *output = ::ax::mojom::AXActionDataDataView(pointer, message_);
}

} // ax::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // SERVICES_ACCESSIBILITY_PUBLIC_MOJOM_AUTOMATION_CLIENT_MOJOM_PARAMS_DATA_H_
