// services/network/public/mojom/cookie_manager.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_NETWORK_PUBLIC_MOJOM_COOKIE_MANAGER_MOJOM_PARAMS_DATA_H_
#define SERVICES_NETWORK_PUBLIC_MOJOM_COOKIE_MANAGER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace network::mojom {
namespace internal {
class CookieChangeListener_OnCookieChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CookieChangeInfo_Data> change;

private:
    friend class mojo::internal::MessageFragment<CookieChangeListener_OnCookieChange_Params_Data>;

    CookieChangeListener_OnCookieChange_Params_Data();
    ~CookieChangeListener_OnCookieChange_Params_Data() = delete;
};
static_assert(sizeof(CookieChangeListener_OnCookieChange_Params_Data) == 16, "Bad sizeof(CookieChangeListener_OnCookieChange_Params_Data)");
class CookieManager_GetAllCookies_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CookieManager_GetAllCookies_Params_Data>;

    CookieManager_GetAllCookies_Params_Data();
    ~CookieManager_GetAllCookies_Params_Data() = delete;
};
static_assert(sizeof(CookieManager_GetAllCookies_Params_Data) == 8, "Bad sizeof(CookieManager_GetAllCookies_Params_Data)");
class CookieManager_GetAllCookies_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::CanonicalCookie_Data>>> cookies;

private:
    friend class mojo::internal::MessageFragment<CookieManager_GetAllCookies_ResponseParams_Data>;

    CookieManager_GetAllCookies_ResponseParams_Data();
    ~CookieManager_GetAllCookies_ResponseParams_Data() = delete;
};
static_assert(sizeof(CookieManager_GetAllCookies_ResponseParams_Data) == 16, "Bad sizeof(CookieManager_GetAllCookies_ResponseParams_Data)");
class CookieManager_GetAllCookiesWithAccessSemantics_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CookieManager_GetAllCookiesWithAccessSemantics_Params_Data>;

    CookieManager_GetAllCookiesWithAccessSemantics_Params_Data();
    ~CookieManager_GetAllCookiesWithAccessSemantics_Params_Data() = delete;
};
static_assert(
    sizeof(CookieManager_GetAllCookiesWithAccessSemantics_Params_Data) == 8, "Bad sizeof(CookieManager_GetAllCookiesWithAccessSemantics_Params_Data)");
class CookieManager_GetAllCookiesWithAccessSemantics_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::CanonicalCookie_Data>>> cookies;
    mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> access_semantics_list;

private:
    friend class mojo::internal::MessageFragment<CookieManager_GetAllCookiesWithAccessSemantics_ResponseParams_Data>;

    CookieManager_GetAllCookiesWithAccessSemantics_ResponseParams_Data();
    ~CookieManager_GetAllCookiesWithAccessSemantics_ResponseParams_Data() = delete;
};
static_assert(sizeof(CookieManager_GetAllCookiesWithAccessSemantics_ResponseParams_Data) == 24,
    "Bad sizeof(CookieManager_GetAllCookiesWithAccessSemantics_ResponseParams_Data)");
class CookieManager_GetCookieList_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<internal::CookieOptions_Data> cookie_options;
    mojo::internal::Pointer<::network::mojom::internal::CookiePartitionKeyCollection_Data> cookie_partition_key_collection;

private:
    friend class mojo::internal::MessageFragment<CookieManager_GetCookieList_Params_Data>;

    CookieManager_GetCookieList_Params_Data();
    ~CookieManager_GetCookieList_Params_Data() = delete;
};
static_assert(sizeof(CookieManager_GetCookieList_Params_Data) == 32, "Bad sizeof(CookieManager_GetCookieList_Params_Data)");
class CookieManager_GetCookieList_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::CookieWithAccessResult_Data>>> cookies;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::CookieWithAccessResult_Data>>> excluded_cookies;

private:
    friend class mojo::internal::MessageFragment<CookieManager_GetCookieList_ResponseParams_Data>;

    CookieManager_GetCookieList_ResponseParams_Data();
    ~CookieManager_GetCookieList_ResponseParams_Data() = delete;
};
static_assert(sizeof(CookieManager_GetCookieList_ResponseParams_Data) == 24, "Bad sizeof(CookieManager_GetCookieList_ResponseParams_Data)");
class CookieManager_SetCanonicalCookie_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CanonicalCookie_Data> cookie;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> source_url;
    mojo::internal::Pointer<internal::CookieOptions_Data> cookie_options;

private:
    friend class mojo::internal::MessageFragment<CookieManager_SetCanonicalCookie_Params_Data>;

    CookieManager_SetCanonicalCookie_Params_Data();
    ~CookieManager_SetCanonicalCookie_Params_Data() = delete;
};
static_assert(sizeof(CookieManager_SetCanonicalCookie_Params_Data) == 32, "Bad sizeof(CookieManager_SetCanonicalCookie_Params_Data)");
class CookieManager_SetCanonicalCookie_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CookieAccessResult_Data> access_result;

private:
    friend class mojo::internal::MessageFragment<CookieManager_SetCanonicalCookie_ResponseParams_Data>;

    CookieManager_SetCanonicalCookie_ResponseParams_Data();
    ~CookieManager_SetCanonicalCookie_ResponseParams_Data() = delete;
};
static_assert(sizeof(CookieManager_SetCanonicalCookie_ResponseParams_Data) == 16, "Bad sizeof(CookieManager_SetCanonicalCookie_ResponseParams_Data)");
class CookieManager_DeleteCanonicalCookie_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CanonicalCookie_Data> cookie;

private:
    friend class mojo::internal::MessageFragment<CookieManager_DeleteCanonicalCookie_Params_Data>;

    CookieManager_DeleteCanonicalCookie_Params_Data();
    ~CookieManager_DeleteCanonicalCookie_Params_Data() = delete;
};
static_assert(sizeof(CookieManager_DeleteCanonicalCookie_Params_Data) == 16, "Bad sizeof(CookieManager_DeleteCanonicalCookie_Params_Data)");
class CookieManager_DeleteCanonicalCookie_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<CookieManager_DeleteCanonicalCookie_ResponseParams_Data>;

    CookieManager_DeleteCanonicalCookie_ResponseParams_Data();
    ~CookieManager_DeleteCanonicalCookie_ResponseParams_Data() = delete;
};
static_assert(sizeof(CookieManager_DeleteCanonicalCookie_ResponseParams_Data) == 16, "Bad sizeof(CookieManager_DeleteCanonicalCookie_ResponseParams_Data)");
class CookieManager_DeleteCookies_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CookieDeletionFilter_Data> filter;

private:
    friend class mojo::internal::MessageFragment<CookieManager_DeleteCookies_Params_Data>;

    CookieManager_DeleteCookies_Params_Data();
    ~CookieManager_DeleteCookies_Params_Data() = delete;
};
static_assert(sizeof(CookieManager_DeleteCookies_Params_Data) == 16, "Bad sizeof(CookieManager_DeleteCookies_Params_Data)");
class CookieManager_DeleteCookies_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t num_deleted;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CookieManager_DeleteCookies_ResponseParams_Data>;

    CookieManager_DeleteCookies_ResponseParams_Data();
    ~CookieManager_DeleteCookies_ResponseParams_Data() = delete;
};
static_assert(sizeof(CookieManager_DeleteCookies_ResponseParams_Data) == 16, "Bad sizeof(CookieManager_DeleteCookies_ResponseParams_Data)");
class CookieManager_DeleteSessionOnlyCookies_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CookieManager_DeleteSessionOnlyCookies_Params_Data>;

    CookieManager_DeleteSessionOnlyCookies_Params_Data();
    ~CookieManager_DeleteSessionOnlyCookies_Params_Data() = delete;
};
static_assert(sizeof(CookieManager_DeleteSessionOnlyCookies_Params_Data) == 8, "Bad sizeof(CookieManager_DeleteSessionOnlyCookies_Params_Data)");
class CookieManager_DeleteSessionOnlyCookies_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t num_deleted;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CookieManager_DeleteSessionOnlyCookies_ResponseParams_Data>;

    CookieManager_DeleteSessionOnlyCookies_ResponseParams_Data();
    ~CookieManager_DeleteSessionOnlyCookies_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(CookieManager_DeleteSessionOnlyCookies_ResponseParams_Data) == 16, "Bad sizeof(CookieManager_DeleteSessionOnlyCookies_ResponseParams_Data)");
class CookieManager_DeleteStaleSessionOnlyCookies_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CookieManager_DeleteStaleSessionOnlyCookies_Params_Data>;

    CookieManager_DeleteStaleSessionOnlyCookies_Params_Data();
    ~CookieManager_DeleteStaleSessionOnlyCookies_Params_Data() = delete;
};
static_assert(sizeof(CookieManager_DeleteStaleSessionOnlyCookies_Params_Data) == 8, "Bad sizeof(CookieManager_DeleteStaleSessionOnlyCookies_Params_Data)");
class CookieManager_DeleteStaleSessionOnlyCookies_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t num_deleted;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CookieManager_DeleteStaleSessionOnlyCookies_ResponseParams_Data>;

    CookieManager_DeleteStaleSessionOnlyCookies_ResponseParams_Data();
    ~CookieManager_DeleteStaleSessionOnlyCookies_ResponseParams_Data() = delete;
};
static_assert(sizeof(CookieManager_DeleteStaleSessionOnlyCookies_ResponseParams_Data) == 16,
    "Bad sizeof(CookieManager_DeleteStaleSessionOnlyCookies_ResponseParams_Data)");
class CookieManager_AddCookieChangeListener_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<mojo::internal::String_Data> name;
    mojo::internal::Interface_Data listener;

private:
    friend class mojo::internal::MessageFragment<CookieManager_AddCookieChangeListener_Params_Data>;

    CookieManager_AddCookieChangeListener_Params_Data();
    ~CookieManager_AddCookieChangeListener_Params_Data() = delete;
};
static_assert(sizeof(CookieManager_AddCookieChangeListener_Params_Data) == 32, "Bad sizeof(CookieManager_AddCookieChangeListener_Params_Data)");
class CookieManager_AddGlobalChangeListener_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data notification_pointer;

private:
    friend class mojo::internal::MessageFragment<CookieManager_AddGlobalChangeListener_Params_Data>;

    CookieManager_AddGlobalChangeListener_Params_Data();
    ~CookieManager_AddGlobalChangeListener_Params_Data() = delete;
};
static_assert(sizeof(CookieManager_AddGlobalChangeListener_Params_Data) == 16, "Bad sizeof(CookieManager_AddGlobalChangeListener_Params_Data)");
class CookieManager_CloneInterface_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data new_interface;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CookieManager_CloneInterface_Params_Data>;

    CookieManager_CloneInterface_Params_Data();
    ~CookieManager_CloneInterface_Params_Data() = delete;
};
static_assert(sizeof(CookieManager_CloneInterface_Params_Data) == 16, "Bad sizeof(CookieManager_CloneInterface_Params_Data)");
class CookieManager_FlushCookieStore_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CookieManager_FlushCookieStore_Params_Data>;

    CookieManager_FlushCookieStore_Params_Data();
    ~CookieManager_FlushCookieStore_Params_Data() = delete;
};
static_assert(sizeof(CookieManager_FlushCookieStore_Params_Data) == 8, "Bad sizeof(CookieManager_FlushCookieStore_Params_Data)");
class CookieManager_FlushCookieStore_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CookieManager_FlushCookieStore_ResponseParams_Data>;

    CookieManager_FlushCookieStore_ResponseParams_Data();
    ~CookieManager_FlushCookieStore_ResponseParams_Data() = delete;
};
static_assert(sizeof(CookieManager_FlushCookieStore_ResponseParams_Data) == 8, "Bad sizeof(CookieManager_FlushCookieStore_ResponseParams_Data)");
class CookieManager_AllowFileSchemeCookies_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t allow : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<CookieManager_AllowFileSchemeCookies_Params_Data>;

    CookieManager_AllowFileSchemeCookies_Params_Data();
    ~CookieManager_AllowFileSchemeCookies_Params_Data() = delete;
};
static_assert(sizeof(CookieManager_AllowFileSchemeCookies_Params_Data) == 16, "Bad sizeof(CookieManager_AllowFileSchemeCookies_Params_Data)");
class CookieManager_AllowFileSchemeCookies_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<CookieManager_AllowFileSchemeCookies_ResponseParams_Data>;

    CookieManager_AllowFileSchemeCookies_ResponseParams_Data();
    ~CookieManager_AllowFileSchemeCookies_ResponseParams_Data() = delete;
};
static_assert(sizeof(CookieManager_AllowFileSchemeCookies_ResponseParams_Data) == 16, "Bad sizeof(CookieManager_AllowFileSchemeCookies_ResponseParams_Data)");
class CookieManager_SetContentSettings_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t content_settings_type;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::content_settings::mojom::internal::ContentSettingPatternSource_Data>>>
        settings;

private:
    friend class mojo::internal::MessageFragment<CookieManager_SetContentSettings_Params_Data>;

    CookieManager_SetContentSettings_Params_Data();
    ~CookieManager_SetContentSettings_Params_Data() = delete;
};
static_assert(sizeof(CookieManager_SetContentSettings_Params_Data) == 24, "Bad sizeof(CookieManager_SetContentSettings_Params_Data)");
class CookieManager_SetContentSettings_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CookieManager_SetContentSettings_ResponseParams_Data>;

    CookieManager_SetContentSettings_ResponseParams_Data();
    ~CookieManager_SetContentSettings_ResponseParams_Data() = delete;
};
static_assert(sizeof(CookieManager_SetContentSettings_ResponseParams_Data) == 8, "Bad sizeof(CookieManager_SetContentSettings_ResponseParams_Data)");
class CookieManager_SetForceKeepSessionState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CookieManager_SetForceKeepSessionState_Params_Data>;

    CookieManager_SetForceKeepSessionState_Params_Data();
    ~CookieManager_SetForceKeepSessionState_Params_Data() = delete;
};
static_assert(sizeof(CookieManager_SetForceKeepSessionState_Params_Data) == 8, "Bad sizeof(CookieManager_SetForceKeepSessionState_Params_Data)");
class CookieManager_BlockThirdPartyCookies_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t block : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<CookieManager_BlockThirdPartyCookies_Params_Data>;

    CookieManager_BlockThirdPartyCookies_Params_Data();
    ~CookieManager_BlockThirdPartyCookies_Params_Data() = delete;
};
static_assert(sizeof(CookieManager_BlockThirdPartyCookies_Params_Data) == 16, "Bad sizeof(CookieManager_BlockThirdPartyCookies_Params_Data)");
class CookieManager_SetMitigationsEnabledFor3pcd_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t enable : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<CookieManager_SetMitigationsEnabledFor3pcd_Params_Data>;

    CookieManager_SetMitigationsEnabledFor3pcd_Params_Data();
    ~CookieManager_SetMitigationsEnabledFor3pcd_Params_Data() = delete;
};
static_assert(sizeof(CookieManager_SetMitigationsEnabledFor3pcd_Params_Data) == 16, "Bad sizeof(CookieManager_SetMitigationsEnabledFor3pcd_Params_Data)");
class CookieManager_SetTrackingProtectionEnabledFor3pcd_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t enable : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<CookieManager_SetTrackingProtectionEnabledFor3pcd_Params_Data>;

    CookieManager_SetTrackingProtectionEnabledFor3pcd_Params_Data();
    ~CookieManager_SetTrackingProtectionEnabledFor3pcd_Params_Data() = delete;
};
static_assert(
    sizeof(CookieManager_SetTrackingProtectionEnabledFor3pcd_Params_Data) == 16, "Bad sizeof(CookieManager_SetTrackingProtectionEnabledFor3pcd_Params_Data)");
class CookieManager_SetPreCommitCallbackDelayForTesting_Params_Data {
public:
