// services/network/public/mojom/devtools_observer.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_NETWORK_PUBLIC_MOJOM_DEVTOOLS_OBSERVER_MOJOM_PARAMS_DATA_H_
#define SERVICES_NETWORK_PUBLIC_MOJOM_DEVTOOLS_OBSERVER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace network::mojom {
namespace internal {
class DevToolsObserver_OnRawRequest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> devtool_request_id;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::CookieWithAccessResult_Data>>>
        cookies_with_access_result;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::HttpRawHeaderPair_Data>>> headers;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeTicks_Data> timestamp;
    mojo::internal::Pointer<::network::mojom::internal::ClientSecurityState_Data> client_security_state;
    mojo::internal::Pointer<internal::OtherPartitionInfo_Data> other_partition_info;

private:
    friend class mojo::internal::MessageFragment<DevToolsObserver_OnRawRequest_Params_Data>;

    DevToolsObserver_OnRawRequest_Params_Data();
    ~DevToolsObserver_OnRawRequest_Params_Data() = delete;
};
static_assert(sizeof(DevToolsObserver_OnRawRequest_Params_Data) == 56, "Bad sizeof(DevToolsObserver_OnRawRequest_Params_Data)");
class DevToolsObserver_OnRawResponse_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> devtool_request_id;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::CookieAndLineWithAccessResult_Data>>>
        cookies_with_access_result;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::HttpRawHeaderPair_Data>>> headers;
    mojo::internal::Pointer<mojo::internal::String_Data> raw_response_headers;
    int32_t resource_address_space;
    int32_t http_status_code;
    mojo::internal::Pointer<::network::mojom::internal::CookiePartitionKey_Data> cookie_partition_key;

private:
    friend class mojo::internal::MessageFragment<DevToolsObserver_OnRawResponse_Params_Data>;

    DevToolsObserver_OnRawResponse_Params_Data();
    ~DevToolsObserver_OnRawResponse_Params_Data() = delete;
};
static_assert(sizeof(DevToolsObserver_OnRawResponse_Params_Data) == 56, "Bad sizeof(DevToolsObserver_OnRawResponse_Params_Data)");
class DevToolsObserver_OnEarlyHintsResponse_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> devtool_request_id;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::HttpRawHeaderPair_Data>>> headers;

private:
    friend class mojo::internal::MessageFragment<DevToolsObserver_OnEarlyHintsResponse_Params_Data>;

    DevToolsObserver_OnEarlyHintsResponse_Params_Data();
    ~DevToolsObserver_OnEarlyHintsResponse_Params_Data() = delete;
};
static_assert(sizeof(DevToolsObserver_OnEarlyHintsResponse_Params_Data) == 24, "Bad sizeof(DevToolsObserver_OnEarlyHintsResponse_Params_Data)");
class DevToolsObserver_OnPrivateNetworkRequest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> devtool_request_id;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    uint8_t is_warning : 1;
    uint8_t pad2_[3];
    int32_t resource_address_space;
    mojo::internal::Pointer<::network::mojom::internal::ClientSecurityState_Data> client_security_state;

private:
    friend class mojo::internal::MessageFragment<DevToolsObserver_OnPrivateNetworkRequest_Params_Data>;

    DevToolsObserver_OnPrivateNetworkRequest_Params_Data();
    ~DevToolsObserver_OnPrivateNetworkRequest_Params_Data() = delete;
};
static_assert(sizeof(DevToolsObserver_OnPrivateNetworkRequest_Params_Data) == 40, "Bad sizeof(DevToolsObserver_OnPrivateNetworkRequest_Params_Data)");
class DevToolsObserver_OnCorsPreflightRequest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> devtool_request_id;
    mojo::internal::Pointer<::network::mojom::internal::HttpRequestHeaders_Data> request_headers;
    mojo::internal::Pointer<internal::URLRequestDevToolsInfo_Data> request_info;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> initiator_url;
    mojo::internal::Pointer<mojo::internal::String_Data> initiator_devtool_request_id;

private:
    friend class mojo::internal::MessageFragment<DevToolsObserver_OnCorsPreflightRequest_Params_Data>;

    DevToolsObserver_OnCorsPreflightRequest_Params_Data();
    ~DevToolsObserver_OnCorsPreflightRequest_Params_Data() = delete;
};
static_assert(sizeof(DevToolsObserver_OnCorsPreflightRequest_Params_Data) == 48, "Bad sizeof(DevToolsObserver_OnCorsPreflightRequest_Params_Data)");
class DevToolsObserver_OnCorsPreflightResponse_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> devtool_request_id;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<internal::URLResponseHeadDevToolsInfo_Data> head;

private:
    friend class mojo::internal::MessageFragment<DevToolsObserver_OnCorsPreflightResponse_Params_Data>;

    DevToolsObserver_OnCorsPreflightResponse_Params_Data();
    ~DevToolsObserver_OnCorsPreflightResponse_Params_Data() = delete;
};
static_assert(sizeof(DevToolsObserver_OnCorsPreflightResponse_Params_Data) == 32, "Bad sizeof(DevToolsObserver_OnCorsPreflightResponse_Params_Data)");
class DevToolsObserver_OnCorsPreflightRequestCompleted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> devtool_request_id;
    mojo::internal::Pointer<::network::mojom::internal::URLLoaderCompletionStatus_Data> status;

private:
    friend class mojo::internal::MessageFragment<DevToolsObserver_OnCorsPreflightRequestCompleted_Params_Data>;

    DevToolsObserver_OnCorsPreflightRequestCompleted_Params_Data();
    ~DevToolsObserver_OnCorsPreflightRequestCompleted_Params_Data() = delete;
};
static_assert(
    sizeof(DevToolsObserver_OnCorsPreflightRequestCompleted_Params_Data) == 24, "Bad sizeof(DevToolsObserver_OnCorsPreflightRequestCompleted_Params_Data)");
class DevToolsObserver_OnTrustTokenOperationDone_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> devtool_request_id;
    mojo::internal::Pointer<::network::mojom::internal::TrustTokenOperationResult_Data> result;

private:
    friend class mojo::internal::MessageFragment<DevToolsObserver_OnTrustTokenOperationDone_Params_Data>;

    DevToolsObserver_OnTrustTokenOperationDone_Params_Data();
    ~DevToolsObserver_OnTrustTokenOperationDone_Params_Data() = delete;
};
static_assert(sizeof(DevToolsObserver_OnTrustTokenOperationDone_Params_Data) == 24, "Bad sizeof(DevToolsObserver_OnTrustTokenOperationDone_Params_Data)");
class DevToolsObserver_OnCorsError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> devtool_request_id;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> initiator_origin;
    mojo::internal::Pointer<::network::mojom::internal::ClientSecurityState_Data> client_security_state;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::network::mojom::internal::CorsErrorStatus_Data> status;
    uint8_t is_warning : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<DevToolsObserver_OnCorsError_Params_Data>;

    DevToolsObserver_OnCorsError_Params_Data();
    ~DevToolsObserver_OnCorsError_Params_Data() = delete;
};
static_assert(sizeof(DevToolsObserver_OnCorsError_Params_Data) == 56, "Bad sizeof(DevToolsObserver_OnCorsError_Params_Data)");
class DevToolsObserver_OnOrbError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> devtools_request_id;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<DevToolsObserver_OnOrbError_Params_Data>;

    DevToolsObserver_OnOrbError_Params_Data();
    ~DevToolsObserver_OnOrbError_Params_Data() = delete;
};
static_assert(sizeof(DevToolsObserver_OnOrbError_Params_Data) == 24, "Bad sizeof(DevToolsObserver_OnOrbError_Params_Data)");
class DevToolsObserver_OnSubresourceWebBundleMetadata_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> devtool_request_id;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Url_Data>>> urls;

private:
    friend class mojo::internal::MessageFragment<DevToolsObserver_OnSubresourceWebBundleMetadata_Params_Data>;

    DevToolsObserver_OnSubresourceWebBundleMetadata_Params_Data();
    ~DevToolsObserver_OnSubresourceWebBundleMetadata_Params_Data() = delete;
};
static_assert(
    sizeof(DevToolsObserver_OnSubresourceWebBundleMetadata_Params_Data) == 24, "Bad sizeof(DevToolsObserver_OnSubresourceWebBundleMetadata_Params_Data)");
class DevToolsObserver_OnSubresourceWebBundleMetadataError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> devtool_request_id;
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<DevToolsObserver_OnSubresourceWebBundleMetadataError_Params_Data>;

    DevToolsObserver_OnSubresourceWebBundleMetadataError_Params_Data();
    ~DevToolsObserver_OnSubresourceWebBundleMetadataError_Params_Data() = delete;
};
static_assert(sizeof(DevToolsObserver_OnSubresourceWebBundleMetadataError_Params_Data) == 24,
    "Bad sizeof(DevToolsObserver_OnSubresourceWebBundleMetadataError_Params_Data)");
class DevToolsObserver_OnSubresourceWebBundleInnerResponse_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> inner_request_devtools_id;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<mojo::internal::String_Data> bundle_request_devtools_id;

private:
    friend class mojo::internal::MessageFragment<DevToolsObserver_OnSubresourceWebBundleInnerResponse_Params_Data>;

    DevToolsObserver_OnSubresourceWebBundleInnerResponse_Params_Data();
    ~DevToolsObserver_OnSubresourceWebBundleInnerResponse_Params_Data() = delete;
};
static_assert(sizeof(DevToolsObserver_OnSubresourceWebBundleInnerResponse_Params_Data) == 32,
    "Bad sizeof(DevToolsObserver_OnSubresourceWebBundleInnerResponse_Params_Data)");
class DevToolsObserver_OnSubresourceWebBundleInnerResponseError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> inner_request_devtools_id;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;
    mojo::internal::Pointer<mojo::internal::String_Data> bundle_request_devtools_id;

private:
    friend class mojo::internal::MessageFragment<DevToolsObserver_OnSubresourceWebBundleInnerResponseError_Params_Data>;

    DevToolsObserver_OnSubresourceWebBundleInnerResponseError_Params_Data();
    ~DevToolsObserver_OnSubresourceWebBundleInnerResponseError_Params_Data() = delete;
};
static_assert(sizeof(DevToolsObserver_OnSubresourceWebBundleInnerResponseError_Params_Data) == 40,
    "Bad sizeof(DevToolsObserver_OnSubresourceWebBundleInnerResponseError_Params_Data)");
class DevToolsObserver_OnSharedDictionaryError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> devtool_request_id;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    int32_t error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<DevToolsObserver_OnSharedDictionaryError_Params_Data>;

    DevToolsObserver_OnSharedDictionaryError_Params_Data();
    ~DevToolsObserver_OnSharedDictionaryError_Params_Data() = delete;
};
static_assert(sizeof(DevToolsObserver_OnSharedDictionaryError_Params_Data) == 32, "Bad sizeof(DevToolsObserver_OnSharedDictionaryError_Params_Data)");
class DevToolsObserver_Clone_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data listener;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<DevToolsObserver_Clone_Params_Data>;

    DevToolsObserver_Clone_Params_Data();
    ~DevToolsObserver_Clone_Params_Data() = delete;
};
static_assert(sizeof(DevToolsObserver_Clone_Params_Data) == 16, "Bad sizeof(DevToolsObserver_Clone_Params_Data)");

} // namespace internal

class DevToolsObserver_OnRawRequest_ParamsDataView {
public:
    DevToolsObserver_OnRawRequest_ParamsDataView() = default;

    DevToolsObserver_OnRawRequest_ParamsDataView(internal::DevToolsObserver_OnRawRequest_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetDevtoolRequestIdDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadDevtoolRequestId(UserType* output)
    {

        auto* pointer = data_->devtool_request_id.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }
    inline void GetCookiesWithAccessResultDataView(mojo::ArrayDataView<::network::mojom::CookieWithAccessResultDataView>* output);

