// services/network/public/mojom/host_resolver.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_NETWORK_PUBLIC_MOJOM_HOST_RESOLVER_MOJOM_PARAMS_DATA_H_
#define SERVICES_NETWORK_PUBLIC_MOJOM_HOST_RESOLVER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace network::mojom {
namespace internal {
class ResolveHostHandle_Cancel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ResolveHostHandle_Cancel_Params_Data>;

    ResolveHostHandle_Cancel_Params_Data();
    ~ResolveHostHandle_Cancel_Params_Data() = delete;
};
static_assert(sizeof(ResolveHostHandle_Cancel_Params_Data) == 16, "Bad sizeof(ResolveHostHandle_Cancel_Params_Data)");
class ResolveHostClient_OnComplete_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::network::mojom::internal::ResolveErrorInfo_Data> resolve_error_info;
    mojo::internal::Pointer<::network::mojom::internal::AddressList_Data> resolved_addresses;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::HostResolverEndpointResult_Data>>>
        endpoint_results_with_metadata;

private:
    friend class mojo::internal::MessageFragment<ResolveHostClient_OnComplete_Params_Data>;

    ResolveHostClient_OnComplete_Params_Data();
    ~ResolveHostClient_OnComplete_Params_Data() = delete;
};
static_assert(sizeof(ResolveHostClient_OnComplete_Params_Data) == 40, "Bad sizeof(ResolveHostClient_OnComplete_Params_Data)");
class ResolveHostClient_OnTextResults_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> text_results;

private:
    friend class mojo::internal::MessageFragment<ResolveHostClient_OnTextResults_Params_Data>;

    ResolveHostClient_OnTextResults_Params_Data();
    ~ResolveHostClient_OnTextResults_Params_Data() = delete;
};
static_assert(sizeof(ResolveHostClient_OnTextResults_Params_Data) == 16, "Bad sizeof(ResolveHostClient_OnTextResults_Params_Data)");
class ResolveHostClient_OnHostnameResults_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::HostPortPair_Data>>> hosts;

private:
    friend class mojo::internal::MessageFragment<ResolveHostClient_OnHostnameResults_Params_Data>;

    ResolveHostClient_OnHostnameResults_Params_Data();
    ~ResolveHostClient_OnHostnameResults_Params_Data() = delete;
};
static_assert(sizeof(ResolveHostClient_OnHostnameResults_Params_Data) == 16, "Bad sizeof(ResolveHostClient_OnHostnameResults_Params_Data)");
class MdnsListenClient_OnAddressResult_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t update_type;
    int32_t query_type;
    mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> endpoint;

private:
    friend class mojo::internal::MessageFragment<MdnsListenClient_OnAddressResult_Params_Data>;

    MdnsListenClient_OnAddressResult_Params_Data();
    ~MdnsListenClient_OnAddressResult_Params_Data() = delete;
};
static_assert(sizeof(MdnsListenClient_OnAddressResult_Params_Data) == 24, "Bad sizeof(MdnsListenClient_OnAddressResult_Params_Data)");
class MdnsListenClient_OnTextResult_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t update_type;
    int32_t query_type;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> text_records;

private:
    friend class mojo::internal::MessageFragment<MdnsListenClient_OnTextResult_Params_Data>;

    MdnsListenClient_OnTextResult_Params_Data();
    ~MdnsListenClient_OnTextResult_Params_Data() = delete;
};
static_assert(sizeof(MdnsListenClient_OnTextResult_Params_Data) == 24, "Bad sizeof(MdnsListenClient_OnTextResult_Params_Data)");
class MdnsListenClient_OnHostnameResult_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t update_type;
    int32_t query_type;
    mojo::internal::Pointer<::network::mojom::internal::HostPortPair_Data> host;

private:
    friend class mojo::internal::MessageFragment<MdnsListenClient_OnHostnameResult_Params_Data>;

    MdnsListenClient_OnHostnameResult_Params_Data();
    ~MdnsListenClient_OnHostnameResult_Params_Data() = delete;
};
static_assert(sizeof(MdnsListenClient_OnHostnameResult_Params_Data) == 24, "Bad sizeof(MdnsListenClient_OnHostnameResult_Params_Data)");
class MdnsListenClient_OnUnhandledResult_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t update_type;
    int32_t query_type;

private:
    friend class mojo::internal::MessageFragment<MdnsListenClient_OnUnhandledResult_Params_Data>;

    MdnsListenClient_OnUnhandledResult_Params_Data();
    ~MdnsListenClient_OnUnhandledResult_Params_Data() = delete;
};
static_assert(sizeof(MdnsListenClient_OnUnhandledResult_Params_Data) == 16, "Bad sizeof(MdnsListenClient_OnUnhandledResult_Params_Data)");
class HostResolver_ResolveHost_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::HostResolverHost_Data host;
    ::network::mojom::internal::NetworkAnonymizationKey_Data network_anonymization_key;
    mojo::internal::Pointer<internal::ResolveHostParameters_Data> optional_parameters;
    mojo::internal::Interface_Data response_client;

private:
    friend class mojo::internal::MessageFragment<HostResolver_ResolveHost_Params_Data>;

    HostResolver_ResolveHost_Params_Data();
    ~HostResolver_ResolveHost_Params_Data() = delete;
};
static_assert(sizeof(HostResolver_ResolveHost_Params_Data) == 56, "Bad sizeof(HostResolver_ResolveHost_Params_Data)");
class HostResolver_MdnsListen_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::HostPortPair_Data> host;
    int32_t query_type;
    mojo::internal::Interface_Data response_client;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<HostResolver_MdnsListen_Params_Data>;

    HostResolver_MdnsListen_Params_Data();
    ~HostResolver_MdnsListen_Params_Data() = delete;
};
static_assert(sizeof(HostResolver_MdnsListen_Params_Data) == 32, "Bad sizeof(HostResolver_MdnsListen_Params_Data)");
class HostResolver_MdnsListen_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<HostResolver_MdnsListen_ResponseParams_Data>;

    HostResolver_MdnsListen_ResponseParams_Data();
    ~HostResolver_MdnsListen_ResponseParams_Data() = delete;
};
static_assert(sizeof(HostResolver_MdnsListen_ResponseParams_Data) == 16, "Bad sizeof(HostResolver_MdnsListen_ResponseParams_Data)");
class DnsConfigChangeManagerClient_OnDnsConfigChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DnsConfigChangeManagerClient_OnDnsConfigChanged_Params_Data>;

    DnsConfigChangeManagerClient_OnDnsConfigChanged_Params_Data();
    ~DnsConfigChangeManagerClient_OnDnsConfigChanged_Params_Data() = delete;
};
static_assert(
    sizeof(DnsConfigChangeManagerClient_OnDnsConfigChanged_Params_Data) == 8, "Bad sizeof(DnsConfigChangeManagerClient_OnDnsConfigChanged_Params_Data)");
class DnsConfigChangeManager_RequestNotifications_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data client;

private:
    friend class mojo::internal::MessageFragment<DnsConfigChangeManager_RequestNotifications_Params_Data>;

    DnsConfigChangeManager_RequestNotifications_Params_Data();
    ~DnsConfigChangeManager_RequestNotifications_Params_Data() = delete;
};
static_assert(sizeof(DnsConfigChangeManager_RequestNotifications_Params_Data) == 16, "Bad sizeof(DnsConfigChangeManager_RequestNotifications_Params_Data)");

} // namespace internal

class ResolveHostHandle_Cancel_ParamsDataView {
public:
    ResolveHostHandle_Cancel_ParamsDataView() = default;

    ResolveHostHandle_Cancel_ParamsDataView(internal::ResolveHostHandle_Cancel_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    int32_t result() const
    {
        return data_->result;
    }

private:
    internal::ResolveHostHandle_Cancel_Params_Data* data_ = nullptr;
};

class ResolveHostClient_OnComplete_ParamsDataView {
public:
    ResolveHostClient_OnComplete_ParamsDataView() = default;

    ResolveHostClient_OnComplete_ParamsDataView(internal::ResolveHostClient_OnComplete_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
