// services/network/public/mojom/http_cache_backend_file_operations.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_NETWORK_PUBLIC_MOJOM_HTTP_CACHE_BACKEND_FILE_OPERATIONS_MOJOM_PARAMS_DATA_H_
#define SERVICES_NETWORK_PUBLIC_MOJOM_HTTP_CACHE_BACKEND_FILE_OPERATIONS_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace network::mojom {
namespace internal {
class FileEnumerator_GetNext_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t num_entries;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FileEnumerator_GetNext_Params_Data>;

    FileEnumerator_GetNext_Params_Data();
    ~FileEnumerator_GetNext_Params_Data() = delete;
};
static_assert(sizeof(FileEnumerator_GetNext_Params_Data) == 16, "Bad sizeof(FileEnumerator_GetNext_Params_Data)");
class FileEnumerator_GetNext_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::FileEnumerationEntry_Data>>> entries;
    uint8_t end : 1;
    uint8_t error : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FileEnumerator_GetNext_ResponseParams_Data>;

    FileEnumerator_GetNext_ResponseParams_Data();
    ~FileEnumerator_GetNext_ResponseParams_Data() = delete;
};
static_assert(sizeof(FileEnumerator_GetNext_ResponseParams_Data) == 24, "Bad sizeof(FileEnumerator_GetNext_ResponseParams_Data)");
class HttpCacheBackendFileOperations_CreateDirectory_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> path;

private:
    friend class mojo::internal::MessageFragment<HttpCacheBackendFileOperations_CreateDirectory_Params_Data>;

    HttpCacheBackendFileOperations_CreateDirectory_Params_Data();
    ~HttpCacheBackendFileOperations_CreateDirectory_Params_Data() = delete;
};
static_assert(
    sizeof(HttpCacheBackendFileOperations_CreateDirectory_Params_Data) == 16, "Bad sizeof(HttpCacheBackendFileOperations_CreateDirectory_Params_Data)");
class HttpCacheBackendFileOperations_CreateDirectory_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<HttpCacheBackendFileOperations_CreateDirectory_ResponseParams_Data>;

    HttpCacheBackendFileOperations_CreateDirectory_ResponseParams_Data();
    ~HttpCacheBackendFileOperations_CreateDirectory_ResponseParams_Data() = delete;
};
static_assert(sizeof(HttpCacheBackendFileOperations_CreateDirectory_ResponseParams_Data) == 16,
    "Bad sizeof(HttpCacheBackendFileOperations_CreateDirectory_ResponseParams_Data)");
class HttpCacheBackendFileOperations_PathExists_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> path;

private:
    friend class mojo::internal::MessageFragment<HttpCacheBackendFileOperations_PathExists_Params_Data>;

    HttpCacheBackendFileOperations_PathExists_Params_Data();
    ~HttpCacheBackendFileOperations_PathExists_Params_Data() = delete;
};
static_assert(sizeof(HttpCacheBackendFileOperations_PathExists_Params_Data) == 16, "Bad sizeof(HttpCacheBackendFileOperations_PathExists_Params_Data)");
class HttpCacheBackendFileOperations_PathExists_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<HttpCacheBackendFileOperations_PathExists_ResponseParams_Data>;

    HttpCacheBackendFileOperations_PathExists_ResponseParams_Data();
    ~HttpCacheBackendFileOperations_PathExists_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(HttpCacheBackendFileOperations_PathExists_ResponseParams_Data) == 16, "Bad sizeof(HttpCacheBackendFileOperations_PathExists_ResponseParams_Data)");
class HttpCacheBackendFileOperations_DirectoryExists_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> path;

private:
    friend class mojo::internal::MessageFragment<HttpCacheBackendFileOperations_DirectoryExists_Params_Data>;

    HttpCacheBackendFileOperations_DirectoryExists_Params_Data();
    ~HttpCacheBackendFileOperations_DirectoryExists_Params_Data() = delete;
};
static_assert(
    sizeof(HttpCacheBackendFileOperations_DirectoryExists_Params_Data) == 16, "Bad sizeof(HttpCacheBackendFileOperations_DirectoryExists_Params_Data)");
class HttpCacheBackendFileOperations_DirectoryExists_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<HttpCacheBackendFileOperations_DirectoryExists_ResponseParams_Data>;

    HttpCacheBackendFileOperations_DirectoryExists_ResponseParams_Data();
    ~HttpCacheBackendFileOperations_DirectoryExists_ResponseParams_Data() = delete;
};
static_assert(sizeof(HttpCacheBackendFileOperations_DirectoryExists_ResponseParams_Data) == 16,
    "Bad sizeof(HttpCacheBackendFileOperations_DirectoryExists_ResponseParams_Data)");
class HttpCacheBackendFileOperations_OpenFile_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> path;
    int32_t flags;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<HttpCacheBackendFileOperations_OpenFile_Params_Data>;

    HttpCacheBackendFileOperations_OpenFile_Params_Data();
    ~HttpCacheBackendFileOperations_OpenFile_Params_Data() = delete;
};
static_assert(sizeof(HttpCacheBackendFileOperations_OpenFile_Params_Data) == 24, "Bad sizeof(HttpCacheBackendFileOperations_OpenFile_Params_Data)");
class HttpCacheBackendFileOperations_OpenFile_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::File_Data> file;
    int32_t error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<HttpCacheBackendFileOperations_OpenFile_ResponseParams_Data>;

    HttpCacheBackendFileOperations_OpenFile_ResponseParams_Data();
    ~HttpCacheBackendFileOperations_OpenFile_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(HttpCacheBackendFileOperations_OpenFile_ResponseParams_Data) == 24, "Bad sizeof(HttpCacheBackendFileOperations_OpenFile_ResponseParams_Data)");
class HttpCacheBackendFileOperations_DeleteFile_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> path;
    int32_t mode;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<HttpCacheBackendFileOperations_DeleteFile_Params_Data>;

    HttpCacheBackendFileOperations_DeleteFile_Params_Data();
    ~HttpCacheBackendFileOperations_DeleteFile_Params_Data() = delete;
};
static_assert(sizeof(HttpCacheBackendFileOperations_DeleteFile_Params_Data) == 24, "Bad sizeof(HttpCacheBackendFileOperations_DeleteFile_Params_Data)");
class HttpCacheBackendFileOperations_DeleteFile_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<HttpCacheBackendFileOperations_DeleteFile_ResponseParams_Data>;

    HttpCacheBackendFileOperations_DeleteFile_ResponseParams_Data();
    ~HttpCacheBackendFileOperations_DeleteFile_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(HttpCacheBackendFileOperations_DeleteFile_ResponseParams_Data) == 16, "Bad sizeof(HttpCacheBackendFileOperations_DeleteFile_ResponseParams_Data)");
class HttpCacheBackendFileOperations_RenameFile_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> from_path;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> to_path;

private:
    friend class mojo::internal::MessageFragment<HttpCacheBackendFileOperations_RenameFile_Params_Data>;

    HttpCacheBackendFileOperations_RenameFile_Params_Data();
    ~HttpCacheBackendFileOperations_RenameFile_Params_Data() = delete;
};
static_assert(sizeof(HttpCacheBackendFileOperations_RenameFile_Params_Data) == 24, "Bad sizeof(HttpCacheBackendFileOperations_RenameFile_Params_Data)");
class HttpCacheBackendFileOperations_RenameFile_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<HttpCacheBackendFileOperations_RenameFile_ResponseParams_Data>;

    HttpCacheBackendFileOperations_RenameFile_ResponseParams_Data();
    ~HttpCacheBackendFileOperations_RenameFile_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(HttpCacheBackendFileOperations_RenameFile_ResponseParams_Data) == 16, "Bad sizeof(HttpCacheBackendFileOperations_RenameFile_ResponseParams_Data)");
class HttpCacheBackendFileOperations_GetFileInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> path;

private:
    friend class mojo::internal::MessageFragment<HttpCacheBackendFileOperations_GetFileInfo_Params_Data>;

    HttpCacheBackendFileOperations_GetFileInfo_Params_Data();
    ~HttpCacheBackendFileOperations_GetFileInfo_Params_Data() = delete;
};
static_assert(sizeof(HttpCacheBackendFileOperations_GetFileInfo_Params_Data) == 16, "Bad sizeof(HttpCacheBackendFileOperations_GetFileInfo_Params_Data)");
class HttpCacheBackendFileOperations_GetFileInfo_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FileInfo_Data> info;

private:
    friend class mojo::internal::MessageFragment<HttpCacheBackendFileOperations_GetFileInfo_ResponseParams_Data>;

    HttpCacheBackendFileOperations_GetFileInfo_ResponseParams_Data();
    ~HttpCacheBackendFileOperations_GetFileInfo_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(HttpCacheBackendFileOperations_GetFileInfo_ResponseParams_Data) == 16, "Bad sizeof(HttpCacheBackendFileOperations_GetFileInfo_ResponseParams_Data)");
class HttpCacheBackendFileOperations_EnumerateFiles_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> path;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<HttpCacheBackendFileOperations_EnumerateFiles_Params_Data>;

    HttpCacheBackendFileOperations_EnumerateFiles_Params_Data();
    ~HttpCacheBackendFileOperations_EnumerateFiles_Params_Data() = delete;
};
static_assert(sizeof(HttpCacheBackendFileOperations_EnumerateFiles_Params_Data) == 24, "Bad sizeof(HttpCacheBackendFileOperations_EnumerateFiles_Params_Data)");
class HttpCacheBackendFileOperations_CleanupDirectory_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> path;

private:
    friend class mojo::internal::MessageFragment<HttpCacheBackendFileOperations_CleanupDirectory_Params_Data>;

    HttpCacheBackendFileOperations_CleanupDirectory_Params_Data();
    ~HttpCacheBackendFileOperations_CleanupDirectory_Params_Data() = delete;
};
static_assert(
    sizeof(HttpCacheBackendFileOperations_CleanupDirectory_Params_Data) == 16, "Bad sizeof(HttpCacheBackendFileOperations_CleanupDirectory_Params_Data)");
class HttpCacheBackendFileOperations_CleanupDirectory_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<HttpCacheBackendFileOperations_CleanupDirectory_ResponseParams_Data>;

    HttpCacheBackendFileOperations_CleanupDirectory_ResponseParams_Data();
    ~HttpCacheBackendFileOperations_CleanupDirectory_ResponseParams_Data() = delete;
};
static_assert(sizeof(HttpCacheBackendFileOperations_CleanupDirectory_ResponseParams_Data) == 16,
    "Bad sizeof(HttpCacheBackendFileOperations_CleanupDirectory_ResponseParams_Data)");
class HttpCacheBackendFileOperationsFactory_Create_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<HttpCacheBackendFileOperationsFactory_Create_Params_Data>;

    HttpCacheBackendFileOperationsFactory_Create_Params_Data();
    ~HttpCacheBackendFileOperationsFactory_Create_Params_Data() = delete;
};
static_assert(sizeof(HttpCacheBackendFileOperationsFactory_Create_Params_Data) == 16, "Bad sizeof(HttpCacheBackendFileOperationsFactory_Create_Params_Data)");

} // namespace internal

class FileEnumerator_GetNext_ParamsDataView {
public:
    FileEnumerator_GetNext_ParamsDataView() = default;

    FileEnumerator_GetNext_ParamsDataView(internal::FileEnumerator_GetNext_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    uint32_t num_entries() const
    {
        return data_->num_entries;
    }

private:
    internal::FileEnumerator_GetNext_Params_Data* data_ = nullptr;
};

class FileEnumerator_GetNext_ResponseParamsDataView {
public:
    FileEnumerator_GetNext_ResponseParamsDataView() = default;

    FileEnumerator_GetNext_ResponseParamsDataView(internal::FileEnumerator_GetNext_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

