// services/network/public/mojom/network_context.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_NETWORK_PUBLIC_MOJOM_NETWORK_CONTEXT_MOJOM_PARAMS_DATA_H_
#define SERVICES_NETWORK_PUBLIC_MOJOM_NETWORK_CONTEXT_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace network::mojom {
namespace internal {
class CustomProxyConnectionObserver_OnFallback_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::ProxyChain_Data> bad_chain;
    int32_t net_error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CustomProxyConnectionObserver_OnFallback_Params_Data>;

    CustomProxyConnectionObserver_OnFallback_Params_Data();
    ~CustomProxyConnectionObserver_OnFallback_Params_Data() = delete;
};
static_assert(sizeof(CustomProxyConnectionObserver_OnFallback_Params_Data) == 24, "Bad sizeof(CustomProxyConnectionObserver_OnFallback_Params_Data)");
class CustomProxyConnectionObserver_OnTunnelHeadersReceived_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::ProxyChain_Data> proxy_chain;
    uint64_t chain_index;
    mojo::internal::Pointer<::network::mojom::internal::HttpResponseHeaders_Data> response_headers;

private:
    friend class mojo::internal::MessageFragment<CustomProxyConnectionObserver_OnTunnelHeadersReceived_Params_Data>;

    CustomProxyConnectionObserver_OnTunnelHeadersReceived_Params_Data();
    ~CustomProxyConnectionObserver_OnTunnelHeadersReceived_Params_Data() = delete;
};
static_assert(sizeof(CustomProxyConnectionObserver_OnTunnelHeadersReceived_Params_Data) == 32,
    "Bad sizeof(CustomProxyConnectionObserver_OnTunnelHeadersReceived_Params_Data)");
class CustomProxyConfigClient_OnCustomProxyConfigUpdated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CustomProxyConfig_Data> proxy_config;

private:
    friend class mojo::internal::MessageFragment<CustomProxyConfigClient_OnCustomProxyConfigUpdated_Params_Data>;

    CustomProxyConfigClient_OnCustomProxyConfigUpdated_Params_Data();
    ~CustomProxyConfigClient_OnCustomProxyConfigUpdated_Params_Data() = delete;
};
static_assert(
    sizeof(CustomProxyConfigClient_OnCustomProxyConfigUpdated_Params_Data) == 16, "Bad sizeof(CustomProxyConfigClient_OnCustomProxyConfigUpdated_Params_Data)");
class CustomProxyConfigClient_OnCustomProxyConfigUpdated_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CustomProxyConfigClient_OnCustomProxyConfigUpdated_ResponseParams_Data>;

    CustomProxyConfigClient_OnCustomProxyConfigUpdated_ResponseParams_Data();
    ~CustomProxyConfigClient_OnCustomProxyConfigUpdated_ResponseParams_Data() = delete;
};
static_assert(sizeof(CustomProxyConfigClient_OnCustomProxyConfigUpdated_ResponseParams_Data) == 8,
    "Bad sizeof(CustomProxyConfigClient_OnCustomProxyConfigUpdated_ResponseParams_Data)");
class TrustedHeaderClient_OnBeforeSendHeaders_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::HttpRequestHeaders_Data> headers;

private:
    friend class mojo::internal::MessageFragment<TrustedHeaderClient_OnBeforeSendHeaders_Params_Data>;

    TrustedHeaderClient_OnBeforeSendHeaders_Params_Data();
    ~TrustedHeaderClient_OnBeforeSendHeaders_Params_Data() = delete;
};
static_assert(sizeof(TrustedHeaderClient_OnBeforeSendHeaders_Params_Data) == 16, "Bad sizeof(TrustedHeaderClient_OnBeforeSendHeaders_Params_Data)");
class TrustedHeaderClient_OnBeforeSendHeaders_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::network::mojom::internal::HttpRequestHeaders_Data> headers;

private:
    friend class mojo::internal::MessageFragment<TrustedHeaderClient_OnBeforeSendHeaders_ResponseParams_Data>;

    TrustedHeaderClient_OnBeforeSendHeaders_ResponseParams_Data();
    ~TrustedHeaderClient_OnBeforeSendHeaders_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(TrustedHeaderClient_OnBeforeSendHeaders_ResponseParams_Data) == 24, "Bad sizeof(TrustedHeaderClient_OnBeforeSendHeaders_ResponseParams_Data)");
class TrustedHeaderClient_OnHeadersReceived_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> headers;
    mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> remote_endpoint;

private:
    friend class mojo::internal::MessageFragment<TrustedHeaderClient_OnHeadersReceived_Params_Data>;

    TrustedHeaderClient_OnHeadersReceived_Params_Data();
    ~TrustedHeaderClient_OnHeadersReceived_Params_Data() = delete;
};
static_assert(sizeof(TrustedHeaderClient_OnHeadersReceived_Params_Data) == 24, "Bad sizeof(TrustedHeaderClient_OnHeadersReceived_Params_Data)");
class TrustedHeaderClient_OnHeadersReceived_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> headers;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> preserve_fragment_on_redirect_url;

private:
    friend class mojo::internal::MessageFragment<TrustedHeaderClient_OnHeadersReceived_ResponseParams_Data>;

    TrustedHeaderClient_OnHeadersReceived_ResponseParams_Data();
    ~TrustedHeaderClient_OnHeadersReceived_ResponseParams_Data() = delete;
};
static_assert(sizeof(TrustedHeaderClient_OnHeadersReceived_ResponseParams_Data) == 32, "Bad sizeof(TrustedHeaderClient_OnHeadersReceived_ResponseParams_Data)");
class TrustedURLLoaderHeaderClient_OnLoaderCreated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t request_id;
    mojo::internal::Handle_Data header_client;

private:
    friend class mojo::internal::MessageFragment<TrustedURLLoaderHeaderClient_OnLoaderCreated_Params_Data>;

    TrustedURLLoaderHeaderClient_OnLoaderCreated_Params_Data();
    ~TrustedURLLoaderHeaderClient_OnLoaderCreated_Params_Data() = delete;
};
static_assert(sizeof(TrustedURLLoaderHeaderClient_OnLoaderCreated_Params_Data) == 16, "Bad sizeof(TrustedURLLoaderHeaderClient_OnLoaderCreated_Params_Data)");
class TrustedURLLoaderHeaderClient_OnLoaderForCorsPreflightCreated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::URLRequest_Data> request;
    mojo::internal::Handle_Data header_client;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<TrustedURLLoaderHeaderClient_OnLoaderForCorsPreflightCreated_Params_Data>;

    TrustedURLLoaderHeaderClient_OnLoaderForCorsPreflightCreated_Params_Data();
    ~TrustedURLLoaderHeaderClient_OnLoaderForCorsPreflightCreated_Params_Data() = delete;
};
static_assert(sizeof(TrustedURLLoaderHeaderClient_OnLoaderForCorsPreflightCreated_Params_Data) == 24,
    "Bad sizeof(TrustedURLLoaderHeaderClient_OnLoaderForCorsPreflightCreated_Params_Data)");
class NetworkContext_SetClient_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data client;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_SetClient_Params_Data>;

    NetworkContext_SetClient_Params_Data();
    ~NetworkContext_SetClient_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetClient_Params_Data) == 16, "Bad sizeof(NetworkContext_SetClient_Params_Data)");
class NetworkContext_CreateURLLoaderFactory_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data url_loader_factory;
    uint8_t pad0_[4];
    mojo::internal::Pointer<internal::URLLoaderFactoryParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CreateURLLoaderFactory_Params_Data>;

    NetworkContext_CreateURLLoaderFactory_Params_Data();
    ~NetworkContext_CreateURLLoaderFactory_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateURLLoaderFactory_Params_Data) == 24, "Bad sizeof(NetworkContext_CreateURLLoaderFactory_Params_Data)");
class NetworkContext_ResetURLLoaderFactories_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ResetURLLoaderFactories_Params_Data>;

    NetworkContext_ResetURLLoaderFactories_Params_Data();
    ~NetworkContext_ResetURLLoaderFactories_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ResetURLLoaderFactories_Params_Data) == 8, "Bad sizeof(NetworkContext_ResetURLLoaderFactories_Params_Data)");
class NetworkContext_GetViaObliviousHttp_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::ObliviousHttpRequest_Data> request;
    mojo::internal::Interface_Data client;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_GetViaObliviousHttp_Params_Data>;

    NetworkContext_GetViaObliviousHttp_Params_Data();
    ~NetworkContext_GetViaObliviousHttp_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetViaObliviousHttp_Params_Data) == 24, "Bad sizeof(NetworkContext_GetViaObliviousHttp_Params_Data)");
class NetworkContext_GetCookieManager_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data cookie_manager;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_GetCookieManager_Params_Data>;

    NetworkContext_GetCookieManager_Params_Data();
    ~NetworkContext_GetCookieManager_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetCookieManager_Params_Data) == 16, "Bad sizeof(NetworkContext_GetCookieManager_Params_Data)");
class NetworkContext_GetRestrictedCookieManager_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data restricted_cookie_manager;
    int32_t role;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> origin;
    mojo::internal::Pointer<::network::mojom::internal::IsolationInfo_Data> isolation_info;
    mojo::internal::Pointer<::network::mojom::internal::CookieSettingOverrides_Data> cookie_setting_overrides;
    mojo::internal::Interface_Data cookie_observer;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_GetRestrictedCookieManager_Params_Data>;

    NetworkContext_GetRestrictedCookieManager_Params_Data();
    ~NetworkContext_GetRestrictedCookieManager_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetRestrictedCookieManager_Params_Data) == 48, "Bad sizeof(NetworkContext_GetRestrictedCookieManager_Params_Data)");
class NetworkContext_GetTrustTokenQueryAnswerer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data trust_token_query_answerer;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> top_frame_origin;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_GetTrustTokenQueryAnswerer_Params_Data>;

    NetworkContext_GetTrustTokenQueryAnswerer_Params_Data();
    ~NetworkContext_GetTrustTokenQueryAnswerer_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetTrustTokenQueryAnswerer_Params_Data) == 24, "Bad sizeof(NetworkContext_GetTrustTokenQueryAnswerer_Params_Data)");
class NetworkContext_ClearTrustTokenData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::ClearDataFilter_Data> filter;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearTrustTokenData_Params_Data>;

    NetworkContext_ClearTrustTokenData_Params_Data();
    ~NetworkContext_ClearTrustTokenData_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearTrustTokenData_Params_Data) == 16, "Bad sizeof(NetworkContext_ClearTrustTokenData_Params_Data)");
class NetworkContext_ClearTrustTokenData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearTrustTokenData_ResponseParams_Data>;

    NetworkContext_ClearTrustTokenData_ResponseParams_Data();
    ~NetworkContext_ClearTrustTokenData_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearTrustTokenData_ResponseParams_Data) == 8, "Bad sizeof(NetworkContext_ClearTrustTokenData_ResponseParams_Data)");
class NetworkContext_ClearTrustTokenSessionOnlyData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearTrustTokenSessionOnlyData_Params_Data>;

    NetworkContext_ClearTrustTokenSessionOnlyData_Params_Data();
    ~NetworkContext_ClearTrustTokenSessionOnlyData_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearTrustTokenSessionOnlyData_Params_Data) == 8, "Bad sizeof(NetworkContext_ClearTrustTokenSessionOnlyData_Params_Data)");
class NetworkContext_ClearTrustTokenSessionOnlyData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t any_data_deleted : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearTrustTokenSessionOnlyData_ResponseParams_Data>;

    NetworkContext_ClearTrustTokenSessionOnlyData_ResponseParams_Data();
    ~NetworkContext_ClearTrustTokenSessionOnlyData_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearTrustTokenSessionOnlyData_ResponseParams_Data) == 16,
    "Bad sizeof(NetworkContext_ClearTrustTokenSessionOnlyData_ResponseParams_Data)");
class NetworkContext_GetStoredTrustTokenCounts_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_GetStoredTrustTokenCounts_Params_Data>;

    NetworkContext_GetStoredTrustTokenCounts_Params_Data();
    ~NetworkContext_GetStoredTrustTokenCounts_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetStoredTrustTokenCounts_Params_Data) == 8, "Bad sizeof(NetworkContext_GetStoredTrustTokenCounts_Params_Data)");
class NetworkContext_GetStoredTrustTokenCounts_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::StoredTrustTokensForIssuer_Data>>> tokens;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_GetStoredTrustTokenCounts_ResponseParams_Data>;

    NetworkContext_GetStoredTrustTokenCounts_ResponseParams_Data();
    ~NetworkContext_GetStoredTrustTokenCounts_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_GetStoredTrustTokenCounts_ResponseParams_Data) == 16, "Bad sizeof(NetworkContext_GetStoredTrustTokenCounts_ResponseParams_Data)");
class NetworkContext_GetPrivateStateTokenRedemptionRecords_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_GetPrivateStateTokenRedemptionRecords_Params_Data>;

    NetworkContext_GetPrivateStateTokenRedemptionRecords_Params_Data();
    ~NetworkContext_GetPrivateStateTokenRedemptionRecords_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetPrivateStateTokenRedemptionRecords_Params_Data) == 8,
    "Bad sizeof(NetworkContext_GetPrivateStateTokenRedemptionRecords_Params_Data)");
class NetworkContext_GetPrivateStateTokenRedemptionRecords_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Map_Data<mojo::internal::Pointer<::url::mojom::internal::Origin_Data>,
        mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::ToplevelRedemptionRecord_Data>>>>>
        issuer_redemption_record_map;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_GetPrivateStateTokenRedemptionRecords_ResponseParams_Data>;

    NetworkContext_GetPrivateStateTokenRedemptionRecords_ResponseParams_Data();
    ~NetworkContext_GetPrivateStateTokenRedemptionRecords_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetPrivateStateTokenRedemptionRecords_ResponseParams_Data) == 16,
    "Bad sizeof(NetworkContext_GetPrivateStateTokenRedemptionRecords_ResponseParams_Data)");
class NetworkContext_DeleteStoredTrustTokens_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> issuer;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_DeleteStoredTrustTokens_Params_Data>;

    NetworkContext_DeleteStoredTrustTokens_Params_Data();
    ~NetworkContext_DeleteStoredTrustTokens_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_DeleteStoredTrustTokens_Params_Data) == 16, "Bad sizeof(NetworkContext_DeleteStoredTrustTokens_Params_Data)");
class NetworkContext_DeleteStoredTrustTokens_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_DeleteStoredTrustTokens_ResponseParams_Data>;

    NetworkContext_DeleteStoredTrustTokens_ResponseParams_Data();
    ~NetworkContext_DeleteStoredTrustTokens_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_DeleteStoredTrustTokens_ResponseParams_Data) == 16, "Bad sizeof(NetworkContext_DeleteStoredTrustTokens_ResponseParams_Data)");
class NetworkContext_SetBlockTrustTokens_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t block : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_SetBlockTrustTokens_Params_Data>;

    NetworkContext_SetBlockTrustTokens_Params_Data();
    ~NetworkContext_SetBlockTrustTokens_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetBlockTrustTokens_Params_Data) == 16, "Bad sizeof(NetworkContext_SetBlockTrustTokens_Params_Data)");
class NetworkContext_ClearNetworkingHistoryBetween_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> start_time;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> end_time;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearNetworkingHistoryBetween_Params_Data>;

    NetworkContext_ClearNetworkingHistoryBetween_Params_Data();
    ~NetworkContext_ClearNetworkingHistoryBetween_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearNetworkingHistoryBetween_Params_Data) == 24, "Bad sizeof(NetworkContext_ClearNetworkingHistoryBetween_Params_Data)");
class NetworkContext_ClearNetworkingHistoryBetween_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearNetworkingHistoryBetween_ResponseParams_Data>;

    NetworkContext_ClearNetworkingHistoryBetween_ResponseParams_Data();
    ~NetworkContext_ClearNetworkingHistoryBetween_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearNetworkingHistoryBetween_ResponseParams_Data) == 8,
    "Bad sizeof(NetworkContext_ClearNetworkingHistoryBetween_ResponseParams_Data)");
class NetworkContext_ClearHttpCache_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> start_time;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> end_time;
    mojo::internal::Pointer<::network::mojom::internal::ClearDataFilter_Data> filter;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearHttpCache_Params_Data>;

    NetworkContext_ClearHttpCache_Params_Data();
    ~NetworkContext_ClearHttpCache_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearHttpCache_Params_Data) == 32, "Bad sizeof(NetworkContext_ClearHttpCache_Params_Data)");
class NetworkContext_ClearHttpCache_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearHttpCache_ResponseParams_Data>;

    NetworkContext_ClearHttpCache_ResponseParams_Data();
    ~NetworkContext_ClearHttpCache_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearHttpCache_ResponseParams_Data) == 8, "Bad sizeof(NetworkContext_ClearHttpCache_ResponseParams_Data)");
class NetworkContext_ComputeHttpCacheSize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> start_time;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> end_time;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ComputeHttpCacheSize_Params_Data>;

    NetworkContext_ComputeHttpCacheSize_Params_Data();
    ~NetworkContext_ComputeHttpCacheSize_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ComputeHttpCacheSize_Params_Data) == 24, "Bad sizeof(NetworkContext_ComputeHttpCacheSize_Params_Data)");
class NetworkContext_ComputeHttpCacheSize_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_upper_bound : 1;
    uint8_t pad0_[7];
    int64_t size_or_error;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ComputeHttpCacheSize_ResponseParams_Data>;

    NetworkContext_ComputeHttpCacheSize_ResponseParams_Data();
    ~NetworkContext_ComputeHttpCacheSize_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ComputeHttpCacheSize_ResponseParams_Data) == 24, "Bad sizeof(NetworkContext_ComputeHttpCacheSize_ResponseParams_Data)");
class NetworkContext_NotifyExternalCacheHit_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<mojo::internal::String_Data> http_method;
    ::network::mojom::internal::NetworkIsolationKey_Data key;
    uint8_t include_credentials : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_NotifyExternalCacheHit_Params_Data>;

    NetworkContext_NotifyExternalCacheHit_Params_Data();
    ~NetworkContext_NotifyExternalCacheHit_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_NotifyExternalCacheHit_Params_Data) == 48, "Bad sizeof(NetworkContext_NotifyExternalCacheHit_Params_Data)");
class NetworkContext_ClearHostCache_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::ClearDataFilter_Data> filter;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearHostCache_Params_Data>;

    NetworkContext_ClearHostCache_Params_Data();
    ~NetworkContext_ClearHostCache_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearHostCache_Params_Data) == 16, "Bad sizeof(NetworkContext_ClearHostCache_Params_Data)");
class NetworkContext_ClearHostCache_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearHostCache_ResponseParams_Data>;

    NetworkContext_ClearHostCache_ResponseParams_Data();
    ~NetworkContext_ClearHostCache_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearHostCache_ResponseParams_Data) == 8, "Bad sizeof(NetworkContext_ClearHostCache_ResponseParams_Data)");
class NetworkContext_ClearHttpAuthCache_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> start_time;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> end_time;
    mojo::internal::Pointer<::network::mojom::internal::ClearDataFilter_Data> filter;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearHttpAuthCache_Params_Data>;

    NetworkContext_ClearHttpAuthCache_Params_Data();
    ~NetworkContext_ClearHttpAuthCache_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearHttpAuthCache_Params_Data) == 32, "Bad sizeof(NetworkContext_ClearHttpAuthCache_Params_Data)");
class NetworkContext_ClearHttpAuthCache_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearHttpAuthCache_ResponseParams_Data>;

    NetworkContext_ClearHttpAuthCache_ResponseParams_Data();
    ~NetworkContext_ClearHttpAuthCache_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearHttpAuthCache_ResponseParams_Data) == 8, "Bad sizeof(NetworkContext_ClearHttpAuthCache_ResponseParams_Data)");
class NetworkContext_ClearCorsPreflightCache_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::ClearDataFilter_Data> filter;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearCorsPreflightCache_Params_Data>;

    NetworkContext_ClearCorsPreflightCache_Params_Data();
    ~NetworkContext_ClearCorsPreflightCache_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearCorsPreflightCache_Params_Data) == 16, "Bad sizeof(NetworkContext_ClearCorsPreflightCache_Params_Data)");
class NetworkContext_ClearCorsPreflightCache_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearCorsPreflightCache_ResponseParams_Data>;

    NetworkContext_ClearCorsPreflightCache_ResponseParams_Data();
    ~NetworkContext_ClearCorsPreflightCache_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_ClearCorsPreflightCache_ResponseParams_Data) == 8, "Bad sizeof(NetworkContext_ClearCorsPreflightCache_ResponseParams_Data)");
class NetworkContext_ClearReportingCacheReports_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::ClearDataFilter_Data> filter;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearReportingCacheReports_Params_Data>;

    NetworkContext_ClearReportingCacheReports_Params_Data();
    ~NetworkContext_ClearReportingCacheReports_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearReportingCacheReports_Params_Data) == 16, "Bad sizeof(NetworkContext_ClearReportingCacheReports_Params_Data)");
class NetworkContext_ClearReportingCacheReports_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearReportingCacheReports_ResponseParams_Data>;

    NetworkContext_ClearReportingCacheReports_ResponseParams_Data();
    ~NetworkContext_ClearReportingCacheReports_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_ClearReportingCacheReports_ResponseParams_Data) == 8, "Bad sizeof(NetworkContext_ClearReportingCacheReports_ResponseParams_Data)");
class NetworkContext_ClearReportingCacheClients_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::ClearDataFilter_Data> filter;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearReportingCacheClients_Params_Data>;

    NetworkContext_ClearReportingCacheClients_Params_Data();
    ~NetworkContext_ClearReportingCacheClients_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearReportingCacheClients_Params_Data) == 16, "Bad sizeof(NetworkContext_ClearReportingCacheClients_Params_Data)");
class NetworkContext_ClearReportingCacheClients_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearReportingCacheClients_ResponseParams_Data>;

    NetworkContext_ClearReportingCacheClients_ResponseParams_Data();
    ~NetworkContext_ClearReportingCacheClients_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_ClearReportingCacheClients_ResponseParams_Data) == 8, "Bad sizeof(NetworkContext_ClearReportingCacheClients_ResponseParams_Data)");
class NetworkContext_ClearNetworkErrorLogging_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::ClearDataFilter_Data> filter;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearNetworkErrorLogging_Params_Data>;

    NetworkContext_ClearNetworkErrorLogging_Params_Data();
    ~NetworkContext_ClearNetworkErrorLogging_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearNetworkErrorLogging_Params_Data) == 16, "Bad sizeof(NetworkContext_ClearNetworkErrorLogging_Params_Data)");
class NetworkContext_ClearNetworkErrorLogging_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearNetworkErrorLogging_ResponseParams_Data>;

    NetworkContext_ClearNetworkErrorLogging_ResponseParams_Data();
    ~NetworkContext_ClearNetworkErrorLogging_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_ClearNetworkErrorLogging_ResponseParams_Data) == 8, "Bad sizeof(NetworkContext_ClearNetworkErrorLogging_ResponseParams_Data)");
class NetworkContext_ClearDomainReliability_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::ClearDataFilter_Data> filter;
    int32_t mode;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearDomainReliability_Params_Data>;

    NetworkContext_ClearDomainReliability_Params_Data();
    ~NetworkContext_ClearDomainReliability_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearDomainReliability_Params_Data) == 24, "Bad sizeof(NetworkContext_ClearDomainReliability_Params_Data)");
class NetworkContext_ClearDomainReliability_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearDomainReliability_ResponseParams_Data>;

    NetworkContext_ClearDomainReliability_ResponseParams_Data();
    ~NetworkContext_ClearDomainReliability_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearDomainReliability_ResponseParams_Data) == 8, "Bad sizeof(NetworkContext_ClearDomainReliability_ResponseParams_Data)");
class NetworkContext_ClearSharedDictionaryCache_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> start_time;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> end_time;
    mojo::internal::Pointer<::network::mojom::internal::ClearDataFilter_Data> filter;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearSharedDictionaryCache_Params_Data>;

    NetworkContext_ClearSharedDictionaryCache_Params_Data();
    ~NetworkContext_ClearSharedDictionaryCache_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearSharedDictionaryCache_Params_Data) == 32, "Bad sizeof(NetworkContext_ClearSharedDictionaryCache_Params_Data)");
class NetworkContext_ClearSharedDictionaryCache_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearSharedDictionaryCache_ResponseParams_Data>;

    NetworkContext_ClearSharedDictionaryCache_ResponseParams_Data();
    ~NetworkContext_ClearSharedDictionaryCache_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_ClearSharedDictionaryCache_ResponseParams_Data) == 8, "Bad sizeof(NetworkContext_ClearSharedDictionaryCache_ResponseParams_Data)");
class NetworkContext_ClearSharedDictionaryCacheForIsolationKey_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::SharedDictionaryIsolationKey_Data> isolation_key;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearSharedDictionaryCacheForIsolationKey_Params_Data>;

    NetworkContext_ClearSharedDictionaryCacheForIsolationKey_Params_Data();
    ~NetworkContext_ClearSharedDictionaryCacheForIsolationKey_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearSharedDictionaryCacheForIsolationKey_Params_Data) == 16,
    "Bad sizeof(NetworkContext_ClearSharedDictionaryCacheForIsolationKey_Params_Data)");
class NetworkContext_ClearSharedDictionaryCacheForIsolationKey_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearSharedDictionaryCacheForIsolationKey_ResponseParams_Data>;

    NetworkContext_ClearSharedDictionaryCacheForIsolationKey_ResponseParams_Data();
    ~NetworkContext_ClearSharedDictionaryCacheForIsolationKey_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearSharedDictionaryCacheForIsolationKey_ResponseParams_Data) == 8,
    "Bad sizeof(NetworkContext_ClearSharedDictionaryCacheForIsolationKey_ResponseParams_Data)");
class NetworkContext_SetDocumentReportingEndpoints_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> reporting_source;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> origin;
    mojo::internal::Pointer<::network::mojom::internal::IsolationInfo_Data> isolation_info;
    mojo::internal::Pointer<
        mojo::internal::Map_Data<mojo::internal::Pointer<mojo::internal::String_Data>, mojo::internal::Pointer<mojo::internal::String_Data>>>
        endpoints;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_SetDocumentReportingEndpoints_Params_Data>;

    NetworkContext_SetDocumentReportingEndpoints_Params_Data();
    ~NetworkContext_SetDocumentReportingEndpoints_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetDocumentReportingEndpoints_Params_Data) == 40, "Bad sizeof(NetworkContext_SetDocumentReportingEndpoints_Params_Data)");
class NetworkContext_SetEnterpriseReportingEndpoints_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<
        mojo::internal::Map_Data<mojo::internal::Pointer<mojo::internal::String_Data>, mojo::internal::Pointer<::url::mojom::internal::Url_Data>>>
        endpoints;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_SetEnterpriseReportingEndpoints_Params_Data>;

    NetworkContext_SetEnterpriseReportingEndpoints_Params_Data();
    ~NetworkContext_SetEnterpriseReportingEndpoints_Params_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_SetEnterpriseReportingEndpoints_Params_Data) == 16, "Bad sizeof(NetworkContext_SetEnterpriseReportingEndpoints_Params_Data)");
class NetworkContext_SendReportsAndRemoveSource_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> reporting_source;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_SendReportsAndRemoveSource_Params_Data>;

    NetworkContext_SendReportsAndRemoveSource_Params_Data();
    ~NetworkContext_SendReportsAndRemoveSource_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SendReportsAndRemoveSource_Params_Data) == 16, "Bad sizeof(NetworkContext_SendReportsAndRemoveSource_Params_Data)");
class NetworkContext_QueueReport_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> type;
    mojo::internal::Pointer<mojo::internal::String_Data> group;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> reporting_source;
    ::network::mojom::internal::NetworkAnonymizationKey_Data network_anonymization_key;
    mojo::internal::Pointer<::mojo_base::mojom::internal::DictionaryValue_Data> body;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_QueueReport_Params_Data>;

    NetworkContext_QueueReport_Params_Data();
    ~NetworkContext_QueueReport_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_QueueReport_Params_Data) == 64, "Bad sizeof(NetworkContext_QueueReport_Params_Data)");
class NetworkContext_QueueEnterpriseReport_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> type;
    mojo::internal::Pointer<mojo::internal::String_Data> group;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::mojo_base::mojom::internal::DictionaryValue_Data> body;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_QueueEnterpriseReport_Params_Data>;

    NetworkContext_QueueEnterpriseReport_Params_Data();
    ~NetworkContext_QueueEnterpriseReport_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_QueueEnterpriseReport_Params_Data) == 40, "Bad sizeof(NetworkContext_QueueEnterpriseReport_Params_Data)");
class NetworkContext_QueueSignedExchangeReport_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SignedExchangeReport_Data> report;
    ::network::mojom::internal::NetworkAnonymizationKey_Data network_anonymization_key;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_QueueSignedExchangeReport_Params_Data>;

    NetworkContext_QueueSignedExchangeReport_Params_Data();
    ~NetworkContext_QueueSignedExchangeReport_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_QueueSignedExchangeReport_Params_Data) == 32, "Bad sizeof(NetworkContext_QueueSignedExchangeReport_Params_Data)");
class NetworkContext_CloseAllConnections_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CloseAllConnections_Params_Data>;

    NetworkContext_CloseAllConnections_Params_Data();
    ~NetworkContext_CloseAllConnections_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CloseAllConnections_Params_Data) == 8, "Bad sizeof(NetworkContext_CloseAllConnections_Params_Data)");
class NetworkContext_CloseAllConnections_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CloseAllConnections_ResponseParams_Data>;

    NetworkContext_CloseAllConnections_ResponseParams_Data();
    ~NetworkContext_CloseAllConnections_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_CloseAllConnections_ResponseParams_Data) == 8, "Bad sizeof(NetworkContext_CloseAllConnections_ResponseParams_Data)");
class NetworkContext_CloseIdleConnections_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CloseIdleConnections_Params_Data>;

    NetworkContext_CloseIdleConnections_Params_Data();
    ~NetworkContext_CloseIdleConnections_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CloseIdleConnections_Params_Data) == 8, "Bad sizeof(NetworkContext_CloseIdleConnections_Params_Data)");
class NetworkContext_CloseIdleConnections_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CloseIdleConnections_ResponseParams_Data>;

    NetworkContext_CloseIdleConnections_ResponseParams_Data();
    ~NetworkContext_CloseIdleConnections_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_CloseIdleConnections_ResponseParams_Data) == 8, "Bad sizeof(NetworkContext_CloseIdleConnections_ResponseParams_Data)");
class NetworkContext_SetNetworkConditions_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> throttling_profile_id;
    mojo::internal::Pointer<internal::NetworkConditions_Data> conditions;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_SetNetworkConditions_Params_Data>;

    NetworkContext_SetNetworkConditions_Params_Data();
    ~NetworkContext_SetNetworkConditions_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetNetworkConditions_Params_Data) == 24, "Bad sizeof(NetworkContext_SetNetworkConditions_Params_Data)");
class NetworkContext_SetAcceptLanguage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> new_accept_language;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_SetAcceptLanguage_Params_Data>;

    NetworkContext_SetAcceptLanguage_Params_Data();
    ~NetworkContext_SetAcceptLanguage_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetAcceptLanguage_Params_Data) == 16, "Bad sizeof(NetworkContext_SetAcceptLanguage_Params_Data)");
class NetworkContext_SetEnableReferrers_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t enable_referrers : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_SetEnableReferrers_Params_Data>;

    NetworkContext_SetEnableReferrers_Params_Data();
    ~NetworkContext_SetEnableReferrers_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetEnableReferrers_Params_Data) == 16, "Bad sizeof(NetworkContext_SetEnableReferrers_Params_Data)");
class NetworkContext_SetCTPolicy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CTPolicy_Data> ct_policy;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_SetCTPolicy_Params_Data>;

    NetworkContext_SetCTPolicy_Params_Data();
    ~NetworkContext_SetCTPolicy_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetCTPolicy_Params_Data) == 16, "Bad sizeof(NetworkContext_SetCTPolicy_Params_Data)");
class NetworkContext_CreateUDPSocket_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    mojo::internal::Interface_Data listener;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CreateUDPSocket_Params_Data>;

    NetworkContext_CreateUDPSocket_Params_Data();
    ~NetworkContext_CreateUDPSocket_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateUDPSocket_Params_Data) == 24, "Bad sizeof(NetworkContext_CreateUDPSocket_Params_Data)");
class NetworkContext_CreateRestrictedUDPSocket_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> addr;
    int32_t mode;
    mojo::internal::Handle_Data receiver;
    mojo::internal::Pointer<::network::mojom::internal::MutableNetworkTrafficAnnotationTag_Data> traffic_annotation;
    mojo::internal::Pointer<::network::mojom::internal::RestrictedUDPSocketParams_Data> params;
    mojo::internal::Interface_Data listener;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CreateRestrictedUDPSocket_Params_Data>;

    NetworkContext_CreateRestrictedUDPSocket_Params_Data();
    ~NetworkContext_CreateRestrictedUDPSocket_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateRestrictedUDPSocket_Params_Data) == 48, "Bad sizeof(NetworkContext_CreateRestrictedUDPSocket_Params_Data)");
class NetworkContext_CreateRestrictedUDPSocket_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> local_addr_out;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CreateRestrictedUDPSocket_ResponseParams_Data>;

    NetworkContext_CreateRestrictedUDPSocket_ResponseParams_Data();
    ~NetworkContext_CreateRestrictedUDPSocket_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_CreateRestrictedUDPSocket_ResponseParams_Data) == 24, "Bad sizeof(NetworkContext_CreateRestrictedUDPSocket_ResponseParams_Data)");
class NetworkContext_CreateTCPServerSocket_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> local_addr;
    mojo::internal::Pointer<::network::mojom::internal::TCPServerSocketOptions_Data> options;
    mojo::internal::Pointer<::network::mojom::internal::MutableNetworkTrafficAnnotationTag_Data> traffic_annotation;
    mojo::internal::Handle_Data socket;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CreateTCPServerSocket_Params_Data>;

    NetworkContext_CreateTCPServerSocket_Params_Data();
    ~NetworkContext_CreateTCPServerSocket_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateTCPServerSocket_Params_Data) == 40, "Bad sizeof(NetworkContext_CreateTCPServerSocket_Params_Data)");
class NetworkContext_CreateTCPServerSocket_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> local_addr_out;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CreateTCPServerSocket_ResponseParams_Data>;

    NetworkContext_CreateTCPServerSocket_ResponseParams_Data();
    ~NetworkContext_CreateTCPServerSocket_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateTCPServerSocket_ResponseParams_Data) == 24, "Bad sizeof(NetworkContext_CreateTCPServerSocket_ResponseParams_Data)");
class NetworkContext_CreateTCPConnectedSocket_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> local_addr;
    mojo::internal::Pointer<::network::mojom::internal::AddressList_Data> remote_addr_list;
    mojo::internal::Pointer<::network::mojom::internal::TCPConnectedSocketOptions_Data> tcp_connected_socket_options;
    mojo::internal::Pointer<::network::mojom::internal::MutableNetworkTrafficAnnotationTag_Data> traffic_annotation;
    mojo::internal::Handle_Data socket;
    mojo::internal::Interface_Data observer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CreateTCPConnectedSocket_Params_Data>;

    NetworkContext_CreateTCPConnectedSocket_Params_Data();
    ~NetworkContext_CreateTCPConnectedSocket_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateTCPConnectedSocket_Params_Data) == 56, "Bad sizeof(NetworkContext_CreateTCPConnectedSocket_Params_Data)");
class NetworkContext_CreateTCPConnectedSocket_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    mojo::internal::Handle_Data receive_stream;
    mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> local_addr;
    mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> peer_addr;
    mojo::internal::Handle_Data send_stream;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CreateTCPConnectedSocket_ResponseParams_Data>;

    NetworkContext_CreateTCPConnectedSocket_ResponseParams_Data();
    ~NetworkContext_CreateTCPConnectedSocket_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_CreateTCPConnectedSocket_ResponseParams_Data) == 40, "Bad sizeof(NetworkContext_CreateTCPConnectedSocket_ResponseParams_Data)");
class NetworkContext_CreateTCPBoundSocket_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> local_addr;
    mojo::internal::Pointer<::network::mojom::internal::MutableNetworkTrafficAnnotationTag_Data> traffic_annotation;
    mojo::internal::Handle_Data socket;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CreateTCPBoundSocket_Params_Data>;

    NetworkContext_CreateTCPBoundSocket_Params_Data();
    ~NetworkContext_CreateTCPBoundSocket_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateTCPBoundSocket_Params_Data) == 32, "Bad sizeof(NetworkContext_CreateTCPBoundSocket_Params_Data)");
class NetworkContext_CreateTCPBoundSocket_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> local_addr;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CreateTCPBoundSocket_ResponseParams_Data>;

    NetworkContext_CreateTCPBoundSocket_ResponseParams_Data();
    ~NetworkContext_CreateTCPBoundSocket_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateTCPBoundSocket_ResponseParams_Data) == 24, "Bad sizeof(NetworkContext_CreateTCPBoundSocket_ResponseParams_Data)");
class NetworkContext_CreateProxyResolvingSocketFactory_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data factory;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CreateProxyResolvingSocketFactory_Params_Data>;

    NetworkContext_CreateProxyResolvingSocketFactory_Params_Data();
    ~NetworkContext_CreateProxyResolvingSocketFactory_Params_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_CreateProxyResolvingSocketFactory_Params_Data) == 16, "Bad sizeof(NetworkContext_CreateProxyResolvingSocketFactory_Params_Data)");
class NetworkContext_LookUpProxyForURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    ::network::mojom::internal::NetworkAnonymizationKey_Data network_anonymization_key;
    mojo::internal::Interface_Data proxy_lookup_client;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_LookUpProxyForURL_Params_Data>;

    NetworkContext_LookUpProxyForURL_Params_Data();
    ~NetworkContext_LookUpProxyForURL_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_LookUpProxyForURL_Params_Data) == 40, "Bad sizeof(NetworkContext_LookUpProxyForURL_Params_Data)");
class NetworkContext_ForceReloadProxyConfig_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ForceReloadProxyConfig_Params_Data>;

    NetworkContext_ForceReloadProxyConfig_Params_Data();
    ~NetworkContext_ForceReloadProxyConfig_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ForceReloadProxyConfig_Params_Data) == 8, "Bad sizeof(NetworkContext_ForceReloadProxyConfig_Params_Data)");
class NetworkContext_ForceReloadProxyConfig_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ForceReloadProxyConfig_ResponseParams_Data>;

    NetworkContext_ForceReloadProxyConfig_ResponseParams_Data();
    ~NetworkContext_ForceReloadProxyConfig_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ForceReloadProxyConfig_ResponseParams_Data) == 8, "Bad sizeof(NetworkContext_ForceReloadProxyConfig_ResponseParams_Data)");
class NetworkContext_ClearBadProxiesCache_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearBadProxiesCache_Params_Data>;

    NetworkContext_ClearBadProxiesCache_Params_Data();
    ~NetworkContext_ClearBadProxiesCache_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearBadProxiesCache_Params_Data) == 8, "Bad sizeof(NetworkContext_ClearBadProxiesCache_Params_Data)");
class NetworkContext_ClearBadProxiesCache_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearBadProxiesCache_ResponseParams_Data>;

    NetworkContext_ClearBadProxiesCache_ResponseParams_Data();
    ~NetworkContext_ClearBadProxiesCache_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearBadProxiesCache_ResponseParams_Data) == 8, "Bad sizeof(NetworkContext_ClearBadProxiesCache_ResponseParams_Data)");
class NetworkContext_CreateWebSocket_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> requested_protocols;
    mojo::internal::Pointer<::network::mojom::internal::SiteForCookies_Data> site_for_cookies;
    int32_t storage_access_api_status;
    int32_t process_id;
    mojo::internal::Pointer<::network::mojom::internal::IsolationInfo_Data> isolation_info;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::HttpHeader_Data>>> additional_headers;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> origin;
    uint32_t options;
    uint8_t pad8_[4];
    mojo::internal::Pointer<::network::mojom::internal::MutableNetworkTrafficAnnotationTag_Data> traffic_annotation;
    mojo::internal::Interface_Data handshake_client;
    mojo::internal::Interface_Data url_loader_network_observer;
    mojo::internal::Interface_Data auth_handler;
    mojo::internal::Interface_Data header_client;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> throttling_profile_id;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CreateWebSocket_Params_Data>;

    NetworkContext_CreateWebSocket_Params_Data();
    ~NetworkContext_CreateWebSocket_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateWebSocket_Params_Data) == 120, "Bad sizeof(NetworkContext_CreateWebSocket_Params_Data)");
class NetworkContext_CreateWebTransport_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> origin;
    ::network::mojom::internal::NetworkAnonymizationKey_Data network_anonymization_key;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::WebTransportCertificateFingerprint_Data>>>
        fingerprints;
    mojo::internal::Interface_Data handshake_client;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CreateWebTransport_Params_Data>;

    NetworkContext_CreateWebTransport_Params_Data();
    ~NetworkContext_CreateWebTransport_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateWebTransport_Params_Data) == 56, "Bad sizeof(NetworkContext_CreateWebTransport_Params_Data)");
class NetworkContext_CreateNetLogExporter_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CreateNetLogExporter_Params_Data>;

    NetworkContext_CreateNetLogExporter_Params_Data();
    ~NetworkContext_CreateNetLogExporter_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateNetLogExporter_Params_Data) == 16, "Bad sizeof(NetworkContext_CreateNetLogExporter_Params_Data)");
class NetworkContext_PreconnectSockets_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t num_streams;
    int32_t credentials_mode;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    ::network::mojom::internal::NetworkAnonymizationKey_Data network_anonymization_key;
    mojo::internal::Pointer<::network::mojom::internal::MutableNetworkTrafficAnnotationTag_Data> traffic_annotation;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_PreconnectSockets_Params_Data>;

    NetworkContext_PreconnectSockets_Params_Data();
    ~NetworkContext_PreconnectSockets_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_PreconnectSockets_Params_Data) == 48, "Bad sizeof(NetworkContext_PreconnectSockets_Params_Data)");
class NetworkContext_CreateP2PSocketManager_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::network::mojom::internal::NetworkAnonymizationKey_Data network_anonymization_key;
    mojo::internal::Interface_Data client;
    mojo::internal::Handle_Data trusted_socket_manager;
    mojo::internal::Handle_Data socket_manager;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CreateP2PSocketManager_Params_Data>;

    NetworkContext_CreateP2PSocketManager_Params_Data();
    ~NetworkContext_CreateP2PSocketManager_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateP2PSocketManager_Params_Data) == 40, "Bad sizeof(NetworkContext_CreateP2PSocketManager_Params_Data)");
class NetworkContext_CreateMdnsResponder_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data responder_receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CreateMdnsResponder_Params_Data>;

    NetworkContext_CreateMdnsResponder_Params_Data();
    ~NetworkContext_CreateMdnsResponder_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateMdnsResponder_Params_Data) == 16, "Bad sizeof(NetworkContext_CreateMdnsResponder_Params_Data)");
class NetworkContext_ResolveHost_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::network::mojom::internal::HostResolverHost_Data host;
    ::network::mojom::internal::NetworkAnonymizationKey_Data network_anonymization_key;
    mojo::internal::Pointer<::network::mojom::internal::ResolveHostParameters_Data> optional_parameters;
    mojo::internal::Interface_Data response_client;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ResolveHost_Params_Data>;

    NetworkContext_ResolveHost_Params_Data();
    ~NetworkContext_ResolveHost_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ResolveHost_Params_Data) == 56, "Bad sizeof(NetworkContext_ResolveHost_Params_Data)");
class NetworkContext_CreateHostResolver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::DnsConfigOverrides_Data> config_overrides;
    mojo::internal::Handle_Data host_resolver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_CreateHostResolver_Params_Data>;

    NetworkContext_CreateHostResolver_Params_Data();
    ~NetworkContext_CreateHostResolver_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_CreateHostResolver_Params_Data) == 24, "Bad sizeof(NetworkContext_CreateHostResolver_Params_Data)");
class NetworkContext_VerifyCertForSignedExchange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::X509Certificate_Data> certificate;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<mojo::internal::String_Data> ocsp_response;
    mojo::internal::Pointer<mojo::internal::String_Data> sct_list;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_VerifyCertForSignedExchange_Params_Data>;

    NetworkContext_VerifyCertForSignedExchange_Params_Data();
    ~NetworkContext_VerifyCertForSignedExchange_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_VerifyCertForSignedExchange_Params_Data) == 40, "Bad sizeof(NetworkContext_VerifyCertForSignedExchange_Params_Data)");
class NetworkContext_VerifyCertForSignedExchange_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error_code;
    uint8_t pkp_bypassed : 1;
    uint8_t pad1_[3];
    mojo::internal::Pointer<::network::mojom::internal::CertVerifyResult_Data> cv_result;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_VerifyCertForSignedExchange_ResponseParams_Data>;

    NetworkContext_VerifyCertForSignedExchange_ResponseParams_Data();
    ~NetworkContext_VerifyCertForSignedExchange_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_VerifyCertForSignedExchange_ResponseParams_Data) == 24, "Bad sizeof(NetworkContext_VerifyCertForSignedExchange_ResponseParams_Data)");
class NetworkContext_AddHSTS_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> host;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> expiry;
    uint8_t include_subdomains : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_AddHSTS_Params_Data>;

    NetworkContext_AddHSTS_Params_Data();
    ~NetworkContext_AddHSTS_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_AddHSTS_Params_Data) == 32, "Bad sizeof(NetworkContext_AddHSTS_Params_Data)");
class NetworkContext_AddHSTS_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_AddHSTS_ResponseParams_Data>;

    NetworkContext_AddHSTS_ResponseParams_Data();
    ~NetworkContext_AddHSTS_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_AddHSTS_ResponseParams_Data) == 8, "Bad sizeof(NetworkContext_AddHSTS_ResponseParams_Data)");
class NetworkContext_IsHSTSActiveForHost_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> host;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_IsHSTSActiveForHost_Params_Data>;

    NetworkContext_IsHSTSActiveForHost_Params_Data();
    ~NetworkContext_IsHSTSActiveForHost_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_IsHSTSActiveForHost_Params_Data) == 16, "Bad sizeof(NetworkContext_IsHSTSActiveForHost_Params_Data)");
class NetworkContext_IsHSTSActiveForHost_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_IsHSTSActiveForHost_ResponseParams_Data>;

    NetworkContext_IsHSTSActiveForHost_ResponseParams_Data();
    ~NetworkContext_IsHSTSActiveForHost_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_IsHSTSActiveForHost_ResponseParams_Data) == 16, "Bad sizeof(NetworkContext_IsHSTSActiveForHost_ResponseParams_Data)");
class NetworkContext_GetHSTSState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> domain;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_GetHSTSState_Params_Data>;

    NetworkContext_GetHSTSState_Params_Data();
    ~NetworkContext_GetHSTSState_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetHSTSState_Params_Data) == 16, "Bad sizeof(NetworkContext_GetHSTSState_Params_Data)");
class NetworkContext_GetHSTSState_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::DictionaryValue_Data> state;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_GetHSTSState_ResponseParams_Data>;

    NetworkContext_GetHSTSState_ResponseParams_Data();
    ~NetworkContext_GetHSTSState_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetHSTSState_ResponseParams_Data) == 16, "Bad sizeof(NetworkContext_GetHSTSState_ResponseParams_Data)");
class NetworkContext_SetCorsOriginAccessListsForOrigin_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> source_origin;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::CorsOriginPattern_Data>>> allow_patterns;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::CorsOriginPattern_Data>>> block_patterns;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_SetCorsOriginAccessListsForOrigin_Params_Data>;

    NetworkContext_SetCorsOriginAccessListsForOrigin_Params_Data();
    ~NetworkContext_SetCorsOriginAccessListsForOrigin_Params_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_SetCorsOriginAccessListsForOrigin_Params_Data) == 32, "Bad sizeof(NetworkContext_SetCorsOriginAccessListsForOrigin_Params_Data)");
class NetworkContext_SetCorsOriginAccessListsForOrigin_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_SetCorsOriginAccessListsForOrigin_ResponseParams_Data>;

    NetworkContext_SetCorsOriginAccessListsForOrigin_ResponseParams_Data();
    ~NetworkContext_SetCorsOriginAccessListsForOrigin_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetCorsOriginAccessListsForOrigin_ResponseParams_Data) == 8,
    "Bad sizeof(NetworkContext_SetCorsOriginAccessListsForOrigin_ResponseParams_Data)");
class NetworkContext_DeleteDynamicDataForHost_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> host;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_DeleteDynamicDataForHost_Params_Data>;

    NetworkContext_DeleteDynamicDataForHost_Params_Data();
    ~NetworkContext_DeleteDynamicDataForHost_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_DeleteDynamicDataForHost_Params_Data) == 16, "Bad sizeof(NetworkContext_DeleteDynamicDataForHost_Params_Data)");
class NetworkContext_DeleteDynamicDataForHost_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_DeleteDynamicDataForHost_ResponseParams_Data>;

    NetworkContext_DeleteDynamicDataForHost_ResponseParams_Data();
    ~NetworkContext_DeleteDynamicDataForHost_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_DeleteDynamicDataForHost_ResponseParams_Data) == 16, "Bad sizeof(NetworkContext_DeleteDynamicDataForHost_ResponseParams_Data)");
class NetworkContext_SetSplitAuthCacheByNetworkAnonymizationKey_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t split_auth_cache_by_network_anonymization_key : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_SetSplitAuthCacheByNetworkAnonymizationKey_Params_Data>;

    NetworkContext_SetSplitAuthCacheByNetworkAnonymizationKey_Params_Data();
    ~NetworkContext_SetSplitAuthCacheByNetworkAnonymizationKey_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetSplitAuthCacheByNetworkAnonymizationKey_Params_Data) == 16,
    "Bad sizeof(NetworkContext_SetSplitAuthCacheByNetworkAnonymizationKey_Params_Data)");
class NetworkContext_SaveHttpAuthCacheProxyEntries_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_SaveHttpAuthCacheProxyEntries_Params_Data>;

    NetworkContext_SaveHttpAuthCacheProxyEntries_Params_Data();
    ~NetworkContext_SaveHttpAuthCacheProxyEntries_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SaveHttpAuthCacheProxyEntries_Params_Data) == 8, "Bad sizeof(NetworkContext_SaveHttpAuthCacheProxyEntries_Params_Data)");
class NetworkContext_SaveHttpAuthCacheProxyEntries_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> cache_key;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_SaveHttpAuthCacheProxyEntries_ResponseParams_Data>;

    NetworkContext_SaveHttpAuthCacheProxyEntries_ResponseParams_Data();
    ~NetworkContext_SaveHttpAuthCacheProxyEntries_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_SaveHttpAuthCacheProxyEntries_ResponseParams_Data) == 16,
    "Bad sizeof(NetworkContext_SaveHttpAuthCacheProxyEntries_ResponseParams_Data)");
class NetworkContext_LoadHttpAuthCacheProxyEntries_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> cache_key;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_LoadHttpAuthCacheProxyEntries_Params_Data>;

    NetworkContext_LoadHttpAuthCacheProxyEntries_Params_Data();
    ~NetworkContext_LoadHttpAuthCacheProxyEntries_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_LoadHttpAuthCacheProxyEntries_Params_Data) == 16, "Bad sizeof(NetworkContext_LoadHttpAuthCacheProxyEntries_Params_Data)");
class NetworkContext_LoadHttpAuthCacheProxyEntries_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_LoadHttpAuthCacheProxyEntries_ResponseParams_Data>;

    NetworkContext_LoadHttpAuthCacheProxyEntries_ResponseParams_Data();
    ~NetworkContext_LoadHttpAuthCacheProxyEntries_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_LoadHttpAuthCacheProxyEntries_ResponseParams_Data) == 8,
    "Bad sizeof(NetworkContext_LoadHttpAuthCacheProxyEntries_ResponseParams_Data)");
class NetworkContext_AddAuthCacheEntry_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::AuthChallengeInfo_Data> challenge;
    ::network::mojom::internal::NetworkAnonymizationKey_Data network_anonymization_key;
    mojo::internal::Pointer<::network::mojom::internal::AuthCredentials_Data> credentials;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_AddAuthCacheEntry_Params_Data>;

    NetworkContext_AddAuthCacheEntry_Params_Data();
    ~NetworkContext_AddAuthCacheEntry_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_AddAuthCacheEntry_Params_Data) == 40, "Bad sizeof(NetworkContext_AddAuthCacheEntry_Params_Data)");
class NetworkContext_AddAuthCacheEntry_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_AddAuthCacheEntry_ResponseParams_Data>;

    NetworkContext_AddAuthCacheEntry_ResponseParams_Data();
    ~NetworkContext_AddAuthCacheEntry_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_AddAuthCacheEntry_ResponseParams_Data) == 8, "Bad sizeof(NetworkContext_AddAuthCacheEntry_ResponseParams_Data)");
class NetworkContext_SetCorsNonWildcardRequestHeadersSupport_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t value : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_SetCorsNonWildcardRequestHeadersSupport_Params_Data>;

    NetworkContext_SetCorsNonWildcardRequestHeadersSupport_Params_Data();
    ~NetworkContext_SetCorsNonWildcardRequestHeadersSupport_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetCorsNonWildcardRequestHeadersSupport_Params_Data) == 16,
    "Bad sizeof(NetworkContext_SetCorsNonWildcardRequestHeadersSupport_Params_Data)");
class NetworkContext_LookupServerBasicAuthCredentials_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    ::network::mojom::internal::NetworkAnonymizationKey_Data network_anonymization_key;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_LookupServerBasicAuthCredentials_Params_Data>;

    NetworkContext_LookupServerBasicAuthCredentials_Params_Data();
    ~NetworkContext_LookupServerBasicAuthCredentials_Params_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_LookupServerBasicAuthCredentials_Params_Data) == 32, "Bad sizeof(NetworkContext_LookupServerBasicAuthCredentials_Params_Data)");
class NetworkContext_LookupServerBasicAuthCredentials_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::AuthCredentials_Data> credentials;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_LookupServerBasicAuthCredentials_ResponseParams_Data>;

    NetworkContext_LookupServerBasicAuthCredentials_ResponseParams_Data();
    ~NetworkContext_LookupServerBasicAuthCredentials_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_LookupServerBasicAuthCredentials_ResponseParams_Data) == 16,
    "Bad sizeof(NetworkContext_LookupServerBasicAuthCredentials_ResponseParams_Data)");
class NetworkContext_EnableStaticKeyPinningForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_EnableStaticKeyPinningForTesting_Params_Data>;

    NetworkContext_EnableStaticKeyPinningForTesting_Params_Data();
    ~NetworkContext_EnableStaticKeyPinningForTesting_Params_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_EnableStaticKeyPinningForTesting_Params_Data) == 8, "Bad sizeof(NetworkContext_EnableStaticKeyPinningForTesting_Params_Data)");
class NetworkContext_EnableStaticKeyPinningForTesting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_EnableStaticKeyPinningForTesting_ResponseParams_Data>;

    NetworkContext_EnableStaticKeyPinningForTesting_ResponseParams_Data();
    ~NetworkContext_EnableStaticKeyPinningForTesting_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_EnableStaticKeyPinningForTesting_ResponseParams_Data) == 8,
    "Bad sizeof(NetworkContext_EnableStaticKeyPinningForTesting_ResponseParams_Data)");
class NetworkContext_VerifyCertificateForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::X509Certificate_Data> certificate;
    mojo::internal::Pointer<mojo::internal::String_Data> hostname;
    mojo::internal::Pointer<mojo::internal::String_Data> ocsp_response;
    mojo::internal::Pointer<mojo::internal::String_Data> sct_list;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_VerifyCertificateForTesting_Params_Data>;

    NetworkContext_VerifyCertificateForTesting_Params_Data();
    ~NetworkContext_VerifyCertificateForTesting_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_VerifyCertificateForTesting_Params_Data) == 40, "Bad sizeof(NetworkContext_VerifyCertificateForTesting_Params_Data)");
class NetworkContext_VerifyCertificateForTesting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_VerifyCertificateForTesting_ResponseParams_Data>;

    NetworkContext_VerifyCertificateForTesting_ResponseParams_Data();
    ~NetworkContext_VerifyCertificateForTesting_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_VerifyCertificateForTesting_ResponseParams_Data) == 16, "Bad sizeof(NetworkContext_VerifyCertificateForTesting_ResponseParams_Data)");
class NetworkContext_AddDomainReliabilityContextForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> origin;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> upload_url;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_AddDomainReliabilityContextForTesting_Params_Data>;

    NetworkContext_AddDomainReliabilityContextForTesting_Params_Data();
    ~NetworkContext_AddDomainReliabilityContextForTesting_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_AddDomainReliabilityContextForTesting_Params_Data) == 24,
    "Bad sizeof(NetworkContext_AddDomainReliabilityContextForTesting_Params_Data)");
class NetworkContext_AddDomainReliabilityContextForTesting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_AddDomainReliabilityContextForTesting_ResponseParams_Data>;

    NetworkContext_AddDomainReliabilityContextForTesting_ResponseParams_Data();
    ~NetworkContext_AddDomainReliabilityContextForTesting_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_AddDomainReliabilityContextForTesting_ResponseParams_Data) == 8,
    "Bad sizeof(NetworkContext_AddDomainReliabilityContextForTesting_ResponseParams_Data)");
class NetworkContext_ForceDomainReliabilityUploadsForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ForceDomainReliabilityUploadsForTesting_Params_Data>;

    NetworkContext_ForceDomainReliabilityUploadsForTesting_Params_Data();
    ~NetworkContext_ForceDomainReliabilityUploadsForTesting_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ForceDomainReliabilityUploadsForTesting_Params_Data) == 8,
    "Bad sizeof(NetworkContext_ForceDomainReliabilityUploadsForTesting_Params_Data)");
class NetworkContext_ForceDomainReliabilityUploadsForTesting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ForceDomainReliabilityUploadsForTesting_ResponseParams_Data>;

    NetworkContext_ForceDomainReliabilityUploadsForTesting_ResponseParams_Data();
    ~NetworkContext_ForceDomainReliabilityUploadsForTesting_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ForceDomainReliabilityUploadsForTesting_ResponseParams_Data) == 8,
    "Bad sizeof(NetworkContext_ForceDomainReliabilityUploadsForTesting_ResponseParams_Data)");
class NetworkContext_SetSCTAuditingMode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t mode;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_SetSCTAuditingMode_Params_Data>;

    NetworkContext_SetSCTAuditingMode_Params_Data();
    ~NetworkContext_SetSCTAuditingMode_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetSCTAuditingMode_Params_Data) == 16, "Bad sizeof(NetworkContext_SetSCTAuditingMode_Params_Data)");
class NetworkContext_AddReportingApiObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data observer;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_AddReportingApiObserver_Params_Data>;

    NetworkContext_AddReportingApiObserver_Params_Data();
    ~NetworkContext_AddReportingApiObserver_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_AddReportingApiObserver_Params_Data) == 16, "Bad sizeof(NetworkContext_AddReportingApiObserver_Params_Data)");
class NetworkContext_GetSharedDictionaryUsageInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_GetSharedDictionaryUsageInfo_Params_Data>;

    NetworkContext_GetSharedDictionaryUsageInfo_Params_Data();
    ~NetworkContext_GetSharedDictionaryUsageInfo_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetSharedDictionaryUsageInfo_Params_Data) == 8, "Bad sizeof(NetworkContext_GetSharedDictionaryUsageInfo_Params_Data)");
class NetworkContext_GetSharedDictionaryUsageInfo_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::SharedDictionaryUsageInfo_Data>>> usage_info;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_GetSharedDictionaryUsageInfo_ResponseParams_Data>;

    NetworkContext_GetSharedDictionaryUsageInfo_ResponseParams_Data();
    ~NetworkContext_GetSharedDictionaryUsageInfo_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetSharedDictionaryUsageInfo_ResponseParams_Data) == 16,
    "Bad sizeof(NetworkContext_GetSharedDictionaryUsageInfo_ResponseParams_Data)");
class NetworkContext_GetSharedDictionaryInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::SharedDictionaryIsolationKey_Data> isolation_key;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_GetSharedDictionaryInfo_Params_Data>;

    NetworkContext_GetSharedDictionaryInfo_Params_Data();
    ~NetworkContext_GetSharedDictionaryInfo_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetSharedDictionaryInfo_Params_Data) == 16, "Bad sizeof(NetworkContext_GetSharedDictionaryInfo_Params_Data)");
class NetworkContext_GetSharedDictionaryInfo_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::SharedDictionaryInfo_Data>>> dictionaries;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_GetSharedDictionaryInfo_ResponseParams_Data>;

    NetworkContext_GetSharedDictionaryInfo_ResponseParams_Data();
    ~NetworkContext_GetSharedDictionaryInfo_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_GetSharedDictionaryInfo_ResponseParams_Data) == 16, "Bad sizeof(NetworkContext_GetSharedDictionaryInfo_ResponseParams_Data)");
class NetworkContext_GetSharedDictionaryOriginsBetween_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> start_time;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> end_time;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_GetSharedDictionaryOriginsBetween_Params_Data>;

    NetworkContext_GetSharedDictionaryOriginsBetween_Params_Data();
    ~NetworkContext_GetSharedDictionaryOriginsBetween_Params_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_GetSharedDictionaryOriginsBetween_Params_Data) == 24, "Bad sizeof(NetworkContext_GetSharedDictionaryOriginsBetween_Params_Data)");
class NetworkContext_GetSharedDictionaryOriginsBetween_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Origin_Data>>> origins;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_GetSharedDictionaryOriginsBetween_ResponseParams_Data>;

    NetworkContext_GetSharedDictionaryOriginsBetween_ResponseParams_Data();
    ~NetworkContext_GetSharedDictionaryOriginsBetween_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetSharedDictionaryOriginsBetween_ResponseParams_Data) == 16,
    "Bad sizeof(NetworkContext_GetSharedDictionaryOriginsBetween_ResponseParams_Data)");
class NetworkContext_SetSharedDictionaryCacheMaxSize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t cache_max_size;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_SetSharedDictionaryCacheMaxSize_Params_Data>;

    NetworkContext_SetSharedDictionaryCacheMaxSize_Params_Data();
    ~NetworkContext_SetSharedDictionaryCacheMaxSize_Params_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_SetSharedDictionaryCacheMaxSize_Params_Data) == 16, "Bad sizeof(NetworkContext_SetSharedDictionaryCacheMaxSize_Params_Data)");
class NetworkContext_PreloadSharedDictionaryInfoForDocument_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Url_Data>>> urls;
    mojo::internal::Handle_Data preload_handle;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_PreloadSharedDictionaryInfoForDocument_Params_Data>;

    NetworkContext_PreloadSharedDictionaryInfoForDocument_Params_Data();
    ~NetworkContext_PreloadSharedDictionaryInfoForDocument_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_PreloadSharedDictionaryInfoForDocument_Params_Data) == 24,
    "Bad sizeof(NetworkContext_PreloadSharedDictionaryInfoForDocument_Params_Data)");
class NetworkContext_HasPreloadedSharedDictionaryInfoForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_HasPreloadedSharedDictionaryInfoForTesting_Params_Data>;

    NetworkContext_HasPreloadedSharedDictionaryInfoForTesting_Params_Data();
    ~NetworkContext_HasPreloadedSharedDictionaryInfoForTesting_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_HasPreloadedSharedDictionaryInfoForTesting_Params_Data) == 8,
    "Bad sizeof(NetworkContext_HasPreloadedSharedDictionaryInfoForTesting_Params_Data)");
class NetworkContext_HasPreloadedSharedDictionaryInfoForTesting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t value : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_HasPreloadedSharedDictionaryInfoForTesting_ResponseParams_Data>;

    NetworkContext_HasPreloadedSharedDictionaryInfoForTesting_ResponseParams_Data();
    ~NetworkContext_HasPreloadedSharedDictionaryInfoForTesting_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_HasPreloadedSharedDictionaryInfoForTesting_ResponseParams_Data) == 16,
    "Bad sizeof(NetworkContext_HasPreloadedSharedDictionaryInfoForTesting_ResponseParams_Data)");
class NetworkContext_ResourceSchedulerClientVisibilityChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> client_token;
    uint8_t visible : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ResourceSchedulerClientVisibilityChanged_Params_Data>;

    NetworkContext_ResourceSchedulerClientVisibilityChanged_Params_Data();
    ~NetworkContext_ResourceSchedulerClientVisibilityChanged_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ResourceSchedulerClientVisibilityChanged_Params_Data) == 24,
    "Bad sizeof(NetworkContext_ResourceSchedulerClientVisibilityChanged_Params_Data)");
class NetworkContext_FlushCachedClientCertIfNeeded_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::HostPortPair_Data> host;
    mojo::internal::Pointer<::network::mojom::internal::X509Certificate_Data> certificate;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_FlushCachedClientCertIfNeeded_Params_Data>;

    NetworkContext_FlushCachedClientCertIfNeeded_Params_Data();
    ~NetworkContext_FlushCachedClientCertIfNeeded_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_FlushCachedClientCertIfNeeded_Params_Data) == 24, "Bad sizeof(NetworkContext_FlushCachedClientCertIfNeeded_Params_Data)");
class NetworkContext_FlushMatchingCachedClientCert_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::X509Certificate_Data> certificate;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_FlushMatchingCachedClientCert_Params_Data>;

    NetworkContext_FlushMatchingCachedClientCert_Params_Data();
    ~NetworkContext_FlushMatchingCachedClientCert_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_FlushMatchingCachedClientCert_Params_Data) == 16, "Bad sizeof(NetworkContext_FlushMatchingCachedClientCert_Params_Data)");
class NetworkContext_SetCookieDeprecationLabel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> label;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_SetCookieDeprecationLabel_Params_Data>;

    NetworkContext_SetCookieDeprecationLabel_Params_Data();
    ~NetworkContext_SetCookieDeprecationLabel_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_SetCookieDeprecationLabel_Params_Data) == 16, "Bad sizeof(NetworkContext_SetCookieDeprecationLabel_Params_Data)");
class NetworkContext_RevokeNetworkForNonces_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data>>> nonces;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_RevokeNetworkForNonces_Params_Data>;

    NetworkContext_RevokeNetworkForNonces_Params_Data();
    ~NetworkContext_RevokeNetworkForNonces_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_RevokeNetworkForNonces_Params_Data) == 16, "Bad sizeof(NetworkContext_RevokeNetworkForNonces_Params_Data)");
class NetworkContext_RevokeNetworkForNonces_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_RevokeNetworkForNonces_ResponseParams_Data>;

    NetworkContext_RevokeNetworkForNonces_ResponseParams_Data();
    ~NetworkContext_RevokeNetworkForNonces_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_RevokeNetworkForNonces_ResponseParams_Data) == 8, "Bad sizeof(NetworkContext_RevokeNetworkForNonces_ResponseParams_Data)");
class NetworkContext_ClearNonces_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data>>> nonces;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ClearNonces_Params_Data>;

    NetworkContext_ClearNonces_Params_Data();
    ~NetworkContext_ClearNonces_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ClearNonces_Params_Data) == 16, "Bad sizeof(NetworkContext_ClearNonces_Params_Data)");
class NetworkContext_ExemptUrlFromNetworkRevocationForNonce_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> exempted_url;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> nonce;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ExemptUrlFromNetworkRevocationForNonce_Params_Data>;

    NetworkContext_ExemptUrlFromNetworkRevocationForNonce_Params_Data();
    ~NetworkContext_ExemptUrlFromNetworkRevocationForNonce_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_ExemptUrlFromNetworkRevocationForNonce_Params_Data) == 24,
    "Bad sizeof(NetworkContext_ExemptUrlFromNetworkRevocationForNonce_Params_Data)");
class NetworkContext_ExemptUrlFromNetworkRevocationForNonce_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_ExemptUrlFromNetworkRevocationForNonce_ResponseParams_Data>;

    NetworkContext_ExemptUrlFromNetworkRevocationForNonce_ResponseParams_Data();
    ~NetworkContext_ExemptUrlFromNetworkRevocationForNonce_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkContext_ExemptUrlFromNetworkRevocationForNonce_ResponseParams_Data) == 8,
    "Bad sizeof(NetworkContext_ExemptUrlFromNetworkRevocationForNonce_ResponseParams_Data)");
class NetworkContext_Prefetch_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t request_id;
    uint32_t options;
    mojo::internal::Pointer<::network::mojom::internal::URLRequest_Data> request;
    mojo::internal::Pointer<::network::mojom::internal::MutableNetworkTrafficAnnotationTag_Data> traffic_annotation;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_Prefetch_Params_Data>;

    NetworkContext_Prefetch_Params_Data();
    ~NetworkContext_Prefetch_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_Prefetch_Params_Data) == 32, "Bad sizeof(NetworkContext_Prefetch_Params_Data)");
class NetworkContext_GetBoundNetworkForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_GetBoundNetworkForTesting_Params_Data>;

    NetworkContext_GetBoundNetworkForTesting_Params_Data();
    ~NetworkContext_GetBoundNetworkForTesting_Params_Data() = delete;
};
static_assert(sizeof(NetworkContext_GetBoundNetworkForTesting_Params_Data) == 8, "Bad sizeof(NetworkContext_GetBoundNetworkForTesting_Params_Data)");
class NetworkContext_GetBoundNetworkForTesting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t bound_network;

private:
    friend class mojo::internal::MessageFragment<NetworkContext_GetBoundNetworkForTesting_ResponseParams_Data>;

    NetworkContext_GetBoundNetworkForTesting_ResponseParams_Data();
    ~NetworkContext_GetBoundNetworkForTesting_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkContext_GetBoundNetworkForTesting_ResponseParams_Data) == 16, "Bad sizeof(NetworkContext_GetBoundNetworkForTesting_ResponseParams_Data)");

} // namespace internal

class CustomProxyConnectionObserver_OnFallback_ParamsDataView {
public:
