// services/network/public/mojom/network_service.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_NETWORK_PUBLIC_MOJOM_NETWORK_SERVICE_MOJOM_PARAMS_DATA_H_
#define SERVICES_NETWORK_PUBLIC_MOJOM_NETWORK_SERVICE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace network::mojom {
namespace internal {
class NetworkService_SetParams_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::NetworkServiceParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<NetworkService_SetParams_Params_Data>;

    NetworkService_SetParams_Params_Data();
    ~NetworkService_SetParams_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetParams_Params_Data) == 16, "Bad sizeof(NetworkService_SetParams_Params_Data)");
class NetworkService_StartNetLog_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::File_Data> file;
    uint64_t max_total_size;
    int32_t capture_mode;
    uint8_t pad2_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::DictionaryValue_Data> constants;

private:
    friend class mojo::internal::MessageFragment<NetworkService_StartNetLog_Params_Data>;

    NetworkService_StartNetLog_Params_Data();
    ~NetworkService_StartNetLog_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_StartNetLog_Params_Data) == 40, "Bad sizeof(NetworkService_StartNetLog_Params_Data)");
class NetworkService_AttachNetLogProxy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data proxy_source;
    mojo::internal::Handle_Data proxy_sink;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkService_AttachNetLogProxy_Params_Data>;

    NetworkService_AttachNetLogProxy_Params_Data();
    ~NetworkService_AttachNetLogProxy_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_AttachNetLogProxy_Params_Data) == 24, "Bad sizeof(NetworkService_AttachNetLogProxy_Params_Data)");
class NetworkService_SetSSLKeyLogFile_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::File_Data> file;

private:
    friend class mojo::internal::MessageFragment<NetworkService_SetSSLKeyLogFile_Params_Data>;

    NetworkService_SetSSLKeyLogFile_Params_Data();
    ~NetworkService_SetSSLKeyLogFile_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetSSLKeyLogFile_Params_Data) == 16, "Bad sizeof(NetworkService_SetSSLKeyLogFile_Params_Data)");
class NetworkService_CreateNetworkContext_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data context;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::network::mojom::internal::NetworkContextParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<NetworkService_CreateNetworkContext_Params_Data>;

    NetworkService_CreateNetworkContext_Params_Data();
    ~NetworkService_CreateNetworkContext_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_CreateNetworkContext_Params_Data) == 24, "Bad sizeof(NetworkService_CreateNetworkContext_Params_Data)");
class NetworkService_ConfigureStubHostResolver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t insecure_dns_client_enabled : 1;
    uint8_t additional_dns_types_enabled : 1;
    uint8_t pad1_[3];
    int32_t secure_dns_mode;
    mojo::internal::Pointer<::network::mojom::internal::DnsOverHttpsConfig_Data> dns_over_https_config;

private:
    friend class mojo::internal::MessageFragment<NetworkService_ConfigureStubHostResolver_Params_Data>;

    NetworkService_ConfigureStubHostResolver_Params_Data();
    ~NetworkService_ConfigureStubHostResolver_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_ConfigureStubHostResolver_Params_Data) == 24, "Bad sizeof(NetworkService_ConfigureStubHostResolver_Params_Data)");
class NetworkService_DisableQuic_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkService_DisableQuic_Params_Data>;

    NetworkService_DisableQuic_Params_Data();
    ~NetworkService_DisableQuic_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_DisableQuic_Params_Data) == 8, "Bad sizeof(NetworkService_DisableQuic_Params_Data)");
class NetworkService_SetUpHttpAuth_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::HttpAuthStaticParams_Data> http_auth_static_params;

private:
    friend class mojo::internal::MessageFragment<NetworkService_SetUpHttpAuth_Params_Data>;

    NetworkService_SetUpHttpAuth_Params_Data();
    ~NetworkService_SetUpHttpAuth_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetUpHttpAuth_Params_Data) == 16, "Bad sizeof(NetworkService_SetUpHttpAuth_Params_Data)");
class NetworkService_ConfigureHttpAuthPrefs_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::HttpAuthDynamicParams_Data> http_auth_dynamic_params;

private:
    friend class mojo::internal::MessageFragment<NetworkService_ConfigureHttpAuthPrefs_Params_Data>;

    NetworkService_ConfigureHttpAuthPrefs_Params_Data();
    ~NetworkService_ConfigureHttpAuthPrefs_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_ConfigureHttpAuthPrefs_Params_Data) == 16, "Bad sizeof(NetworkService_ConfigureHttpAuthPrefs_Params_Data)");
class NetworkService_SetRawHeadersAccess_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t process_id;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Origin_Data>>> origins;

private:
    friend class mojo::internal::MessageFragment<NetworkService_SetRawHeadersAccess_Params_Data>;

    NetworkService_SetRawHeadersAccess_Params_Data();
    ~NetworkService_SetRawHeadersAccess_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetRawHeadersAccess_Params_Data) == 24, "Bad sizeof(NetworkService_SetRawHeadersAccess_Params_Data)");
class NetworkService_SetMaxConnectionsPerProxyChain_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t max_connections;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkService_SetMaxConnectionsPerProxyChain_Params_Data>;

    NetworkService_SetMaxConnectionsPerProxyChain_Params_Data();
    ~NetworkService_SetMaxConnectionsPerProxyChain_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetMaxConnectionsPerProxyChain_Params_Data) == 16, "Bad sizeof(NetworkService_SetMaxConnectionsPerProxyChain_Params_Data)");
class NetworkService_GetNetworkChangeManager_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data network_change_manager;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkService_GetNetworkChangeManager_Params_Data>;

    NetworkService_GetNetworkChangeManager_Params_Data();
    ~NetworkService_GetNetworkChangeManager_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_GetNetworkChangeManager_Params_Data) == 16, "Bad sizeof(NetworkService_GetNetworkChangeManager_Params_Data)");
class NetworkService_GetNetworkQualityEstimatorManager_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkService_GetNetworkQualityEstimatorManager_Params_Data>;

    NetworkService_GetNetworkQualityEstimatorManager_Params_Data();
    ~NetworkService_GetNetworkQualityEstimatorManager_Params_Data() = delete;
};
static_assert(
    sizeof(NetworkService_GetNetworkQualityEstimatorManager_Params_Data) == 16, "Bad sizeof(NetworkService_GetNetworkQualityEstimatorManager_Params_Data)");
class NetworkService_GetDnsConfigChangeManager_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkService_GetDnsConfigChangeManager_Params_Data>;

    NetworkService_GetDnsConfigChangeManager_Params_Data();
    ~NetworkService_GetDnsConfigChangeManager_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_GetDnsConfigChangeManager_Params_Data) == 16, "Bad sizeof(NetworkService_GetDnsConfigChangeManager_Params_Data)");
class NetworkService_GetNetworkList_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t policy;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkService_GetNetworkList_Params_Data>;

    NetworkService_GetNetworkList_Params_Data();
    ~NetworkService_GetNetworkList_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_GetNetworkList_Params_Data) == 16, "Bad sizeof(NetworkService_GetNetworkList_Params_Data)");
class NetworkService_GetNetworkList_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::NetworkInterface_Data>>> networks;

private:
    friend class mojo::internal::MessageFragment<NetworkService_GetNetworkList_ResponseParams_Data>;

    NetworkService_GetNetworkList_ResponseParams_Data();
    ~NetworkService_GetNetworkList_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkService_GetNetworkList_ResponseParams_Data) == 16, "Bad sizeof(NetworkService_GetNetworkList_ResponseParams_Data)");
class NetworkService_OnTrustStoreChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkService_OnTrustStoreChanged_Params_Data>;

    NetworkService_OnTrustStoreChanged_Params_Data();
    ~NetworkService_OnTrustStoreChanged_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_OnTrustStoreChanged_Params_Data) == 8, "Bad sizeof(NetworkService_OnTrustStoreChanged_Params_Data)");
class NetworkService_OnClientCertStoreChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkService_OnClientCertStoreChanged_Params_Data>;

    NetworkService_OnClientCertStoreChanged_Params_Data();
    ~NetworkService_OnClientCertStoreChanged_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_OnClientCertStoreChanged_Params_Data) == 8, "Bad sizeof(NetworkService_OnClientCertStoreChanged_Params_Data)");
class NetworkService_SetEncryptionKey_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ByteString_Data> encryption_key;

private:
    friend class mojo::internal::MessageFragment<NetworkService_SetEncryptionKey_Params_Data>;

    NetworkService_SetEncryptionKey_Params_Data();
    ~NetworkService_SetEncryptionKey_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetEncryptionKey_Params_Data) == 16, "Bad sizeof(NetworkService_SetEncryptionKey_Params_Data)");
class NetworkService_OnMemoryPressure_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t memory_pressure_level;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkService_OnMemoryPressure_Params_Data>;

    NetworkService_OnMemoryPressure_Params_Data();
    ~NetworkService_OnMemoryPressure_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_OnMemoryPressure_Params_Data) == 16, "Bad sizeof(NetworkService_OnMemoryPressure_Params_Data)");
class NetworkService_OnPeerToPeerConnectionsCountChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t count;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkService_OnPeerToPeerConnectionsCountChange_Params_Data>;

    NetworkService_OnPeerToPeerConnectionsCountChange_Params_Data();
    ~NetworkService_OnPeerToPeerConnectionsCountChange_Params_Data() = delete;
};
static_assert(
    sizeof(NetworkService_OnPeerToPeerConnectionsCountChange_Params_Data) == 16, "Bad sizeof(NetworkService_OnPeerToPeerConnectionsCountChange_Params_Data)");
class NetworkService_SetTrustTokenKeyCommitments_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> raw_commitments;

private:
    friend class mojo::internal::MessageFragment<NetworkService_SetTrustTokenKeyCommitments_Params_Data>;

    NetworkService_SetTrustTokenKeyCommitments_Params_Data();
    ~NetworkService_SetTrustTokenKeyCommitments_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetTrustTokenKeyCommitments_Params_Data) == 16, "Bad sizeof(NetworkService_SetTrustTokenKeyCommitments_Params_Data)");
class NetworkService_SetTrustTokenKeyCommitments_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkService_SetTrustTokenKeyCommitments_ResponseParams_Data>;

    NetworkService_SetTrustTokenKeyCommitments_ResponseParams_Data();
    ~NetworkService_SetTrustTokenKeyCommitments_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkService_SetTrustTokenKeyCommitments_ResponseParams_Data) == 8, "Bad sizeof(NetworkService_SetTrustTokenKeyCommitments_ResponseParams_Data)");
class NetworkService_ClearSCTAuditingCache_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkService_ClearSCTAuditingCache_Params_Data>;

    NetworkService_ClearSCTAuditingCache_Params_Data();
    ~NetworkService_ClearSCTAuditingCache_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_ClearSCTAuditingCache_Params_Data) == 8, "Bad sizeof(NetworkService_ClearSCTAuditingCache_Params_Data)");
class NetworkService_ConfigureSCTAuditing_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SCTAuditingConfiguration_Data> configuration;

private:
    friend class mojo::internal::MessageFragment<NetworkService_ConfigureSCTAuditing_Params_Data>;

    NetworkService_ConfigureSCTAuditing_Params_Data();
    ~NetworkService_ConfigureSCTAuditing_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_ConfigureSCTAuditing_Params_Data) == 16, "Bad sizeof(NetworkService_ConfigureSCTAuditing_Params_Data)");
class NetworkService_UpdateCtLogList_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::CTLogInfo_Data>>> log_list;

private:
    friend class mojo::internal::MessageFragment<NetworkService_UpdateCtLogList_Params_Data>;

    NetworkService_UpdateCtLogList_Params_Data();
    ~NetworkService_UpdateCtLogList_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_UpdateCtLogList_Params_Data) == 16, "Bad sizeof(NetworkService_UpdateCtLogList_Params_Data)");
class NetworkService_UpdateCtLogList_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkService_UpdateCtLogList_ResponseParams_Data>;

    NetworkService_UpdateCtLogList_ResponseParams_Data();
    ~NetworkService_UpdateCtLogList_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkService_UpdateCtLogList_ResponseParams_Data) == 8, "Bad sizeof(NetworkService_UpdateCtLogList_ResponseParams_Data)");
class NetworkService_UpdateCtKnownPopularSCTs_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>>>> sct_hashes;

private:
    friend class mojo::internal::MessageFragment<NetworkService_UpdateCtKnownPopularSCTs_Params_Data>;

    NetworkService_UpdateCtKnownPopularSCTs_Params_Data();
    ~NetworkService_UpdateCtKnownPopularSCTs_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_UpdateCtKnownPopularSCTs_Params_Data) == 16, "Bad sizeof(NetworkService_UpdateCtKnownPopularSCTs_Params_Data)");
class NetworkService_UpdateCtKnownPopularSCTs_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkService_UpdateCtKnownPopularSCTs_ResponseParams_Data>;

    NetworkService_UpdateCtKnownPopularSCTs_ResponseParams_Data();
    ~NetworkService_UpdateCtKnownPopularSCTs_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkService_UpdateCtKnownPopularSCTs_ResponseParams_Data) == 8, "Bad sizeof(NetworkService_UpdateCtKnownPopularSCTs_ResponseParams_Data)");
class NetworkService_SetCtEnforcementEnabled_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t enabled : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkService_SetCtEnforcementEnabled_Params_Data>;

    NetworkService_SetCtEnforcementEnabled_Params_Data();
    ~NetworkService_SetCtEnforcementEnabled_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetCtEnforcementEnabled_Params_Data) == 16, "Bad sizeof(NetworkService_SetCtEnforcementEnabled_Params_Data)");
class NetworkService_SetCtEnforcementEnabled_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkService_SetCtEnforcementEnabled_ResponseParams_Data>;

    NetworkService_SetCtEnforcementEnabled_ResponseParams_Data();
    ~NetworkService_SetCtEnforcementEnabled_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkService_SetCtEnforcementEnabled_ResponseParams_Data) == 8, "Bad sizeof(NetworkService_SetCtEnforcementEnabled_ResponseParams_Data)");
class NetworkService_UpdateKeyPinsList_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::PinList_Data> pin_list;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> update_time;

private:
    friend class mojo::internal::MessageFragment<NetworkService_UpdateKeyPinsList_Params_Data>;

    NetworkService_UpdateKeyPinsList_Params_Data();
    ~NetworkService_UpdateKeyPinsList_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_UpdateKeyPinsList_Params_Data) == 24, "Bad sizeof(NetworkService_UpdateKeyPinsList_Params_Data)");
class NetworkService_BindTestInterfaceForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkService_BindTestInterfaceForTesting_Params_Data>;

    NetworkService_BindTestInterfaceForTesting_Params_Data();
    ~NetworkService_BindTestInterfaceForTesting_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_BindTestInterfaceForTesting_Params_Data) == 16, "Bad sizeof(NetworkService_BindTestInterfaceForTesting_Params_Data)");
class NetworkService_SetFirstPartySets_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::GlobalFirstPartySets_Data> sets;

private:
    friend class mojo::internal::MessageFragment<NetworkService_SetFirstPartySets_Params_Data>;

    NetworkService_SetFirstPartySets_Params_Data();
    ~NetworkService_SetFirstPartySets_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetFirstPartySets_Params_Data) == 16, "Bad sizeof(NetworkService_SetFirstPartySets_Params_Data)");
class NetworkService_SetExplicitlyAllowedPorts_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint16_t>> ports;

private:
    friend class mojo::internal::MessageFragment<NetworkService_SetExplicitlyAllowedPorts_Params_Data>;

    NetworkService_SetExplicitlyAllowedPorts_Params_Data();
    ~NetworkService_SetExplicitlyAllowedPorts_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetExplicitlyAllowedPorts_Params_Data) == 16, "Bad sizeof(NetworkService_SetExplicitlyAllowedPorts_Params_Data)");
class NetworkService_UpdateMaskedDomainList_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ProtoWrapper_Data> masked_domain_list;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> exclusion_list;

private:
    friend class mojo::internal::MessageFragment<NetworkService_UpdateMaskedDomainList_Params_Data>;

    NetworkService_UpdateMaskedDomainList_Params_Data();
    ~NetworkService_UpdateMaskedDomainList_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_UpdateMaskedDomainList_Params_Data) == 24, "Bad sizeof(NetworkService_UpdateMaskedDomainList_Params_Data)");
class NetworkService_ParseHeaders_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::network::mojom::internal::HttpResponseHeaders_Data> headers;

private:
    friend class mojo::internal::MessageFragment<NetworkService_ParseHeaders_Params_Data>;

    NetworkService_ParseHeaders_Params_Data();
    ~NetworkService_ParseHeaders_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_ParseHeaders_Params_Data) == 24, "Bad sizeof(NetworkService_ParseHeaders_Params_Data)");
class NetworkService_ParseHeaders_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::ParsedHeaders_Data> parsed_headers;

private:
    friend class mojo::internal::MessageFragment<NetworkService_ParseHeaders_ResponseParams_Data>;

    NetworkService_ParseHeaders_ResponseParams_Data();
    ~NetworkService_ParseHeaders_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkService_ParseHeaders_ResponseParams_Data) == 16, "Bad sizeof(NetworkService_ParseHeaders_ResponseParams_Data)");
class NetworkService_EnableDataUseUpdates_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t enable : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkService_EnableDataUseUpdates_Params_Data>;

    NetworkService_EnableDataUseUpdates_Params_Data();
    ~NetworkService_EnableDataUseUpdates_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_EnableDataUseUpdates_Params_Data) == 16, "Bad sizeof(NetworkService_EnableDataUseUpdates_Params_Data)");
class NetworkService_SetIPv6ReachabilityOverride_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t reachability_override : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkService_SetIPv6ReachabilityOverride_Params_Data>;

    NetworkService_SetIPv6ReachabilityOverride_Params_Data();
    ~NetworkService_SetIPv6ReachabilityOverride_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetIPv6ReachabilityOverride_Params_Data) == 16, "Bad sizeof(NetworkService_SetIPv6ReachabilityOverride_Params_Data)");
class NetworkService_SetNetworkAnnotationMonitor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data remote;

private:
    friend class mojo::internal::MessageFragment<NetworkService_SetNetworkAnnotationMonitor_Params_Data>;

    NetworkService_SetNetworkAnnotationMonitor_Params_Data();
    ~NetworkService_SetNetworkAnnotationMonitor_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetNetworkAnnotationMonitor_Params_Data) == 16, "Bad sizeof(NetworkService_SetNetworkAnnotationMonitor_Params_Data)");
class NetworkService_SetTpcdMetadataGrants_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::content_settings::mojom::internal::ContentSettingPatternSource_Data>>>
        settings;

private:
    friend class mojo::internal::MessageFragment<NetworkService_SetTpcdMetadataGrants_Params_Data>;

    NetworkService_SetTpcdMetadataGrants_Params_Data();
    ~NetworkService_SetTpcdMetadataGrants_Params_Data() = delete;
};
static_assert(sizeof(NetworkService_SetTpcdMetadataGrants_Params_Data) == 16, "Bad sizeof(NetworkService_SetTpcdMetadataGrants_Params_Data)");

} // namespace internal

class NetworkService_SetParams_ParamsDataView {
public:
    NetworkService_SetParams_ParamsDataView() = default;

    NetworkService_SetParams_ParamsDataView(internal::NetworkService_SetParams_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetParamsDataView(NetworkServiceParamsDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadParams(UserType* output)
    {

        auto* pointer = data_->params.Get();
        return mojo::internal::Deserialize<::network::mojom::NetworkServiceParamsDataView>(pointer, output, message_);
    }

private:
    internal::NetworkService_SetParams_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

