// services/network/public/mojom/network_service_test.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_NETWORK_PUBLIC_MOJOM_NETWORK_SERVICE_TEST_MOJOM_PARAMS_DATA_H_
#define SERVICES_NETWORK_PUBLIC_MOJOM_NETWORK_SERVICE_TEST_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace network::mojom {
namespace internal {
class SimpleCacheEntry_WriteData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t index;
    int32_t offset;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> data;
    uint8_t truncate : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<SimpleCacheEntry_WriteData_Params_Data>;

    SimpleCacheEntry_WriteData_Params_Data();
    ~SimpleCacheEntry_WriteData_Params_Data() = delete;
};
static_assert(sizeof(SimpleCacheEntry_WriteData_Params_Data) == 32, "Bad sizeof(SimpleCacheEntry_WriteData_Params_Data)");
class SimpleCacheEntry_WriteData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SimpleCacheEntry_WriteData_ResponseParams_Data>;

    SimpleCacheEntry_WriteData_ResponseParams_Data();
    ~SimpleCacheEntry_WriteData_ResponseParams_Data() = delete;
};
static_assert(sizeof(SimpleCacheEntry_WriteData_ResponseParams_Data) == 16, "Bad sizeof(SimpleCacheEntry_WriteData_ResponseParams_Data)");
class SimpleCacheEntry_ReadData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t index;
    int32_t offset;
    uint32_t length;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SimpleCacheEntry_ReadData_Params_Data>;

    SimpleCacheEntry_ReadData_Params_Data();
    ~SimpleCacheEntry_ReadData_Params_Data() = delete;
};
static_assert(sizeof(SimpleCacheEntry_ReadData_Params_Data) == 24, "Bad sizeof(SimpleCacheEntry_ReadData_Params_Data)");
class SimpleCacheEntry_ReadData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> data;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SimpleCacheEntry_ReadData_ResponseParams_Data>;

    SimpleCacheEntry_ReadData_ResponseParams_Data();
    ~SimpleCacheEntry_ReadData_ResponseParams_Data() = delete;
};
static_assert(sizeof(SimpleCacheEntry_ReadData_ResponseParams_Data) == 24, "Bad sizeof(SimpleCacheEntry_ReadData_ResponseParams_Data)");
class SimpleCacheEntry_WriteSparseData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t offset;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> data;

private:
    friend class mojo::internal::MessageFragment<SimpleCacheEntry_WriteSparseData_Params_Data>;

    SimpleCacheEntry_WriteSparseData_Params_Data();
    ~SimpleCacheEntry_WriteSparseData_Params_Data() = delete;
};
static_assert(sizeof(SimpleCacheEntry_WriteSparseData_Params_Data) == 24, "Bad sizeof(SimpleCacheEntry_WriteSparseData_Params_Data)");
class SimpleCacheEntry_WriteSparseData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SimpleCacheEntry_WriteSparseData_ResponseParams_Data>;

    SimpleCacheEntry_WriteSparseData_ResponseParams_Data();
    ~SimpleCacheEntry_WriteSparseData_ResponseParams_Data() = delete;
};
static_assert(sizeof(SimpleCacheEntry_WriteSparseData_ResponseParams_Data) == 16, "Bad sizeof(SimpleCacheEntry_WriteSparseData_ResponseParams_Data)");
class SimpleCacheEntry_ReadSparseData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t offset;
    uint32_t length;

private:
    friend class mojo::internal::MessageFragment<SimpleCacheEntry_ReadSparseData_Params_Data>;

    SimpleCacheEntry_ReadSparseData_Params_Data();
    ~SimpleCacheEntry_ReadSparseData_Params_Data() = delete;
};
static_assert(sizeof(SimpleCacheEntry_ReadSparseData_Params_Data) == 16, "Bad sizeof(SimpleCacheEntry_ReadSparseData_Params_Data)");
class SimpleCacheEntry_ReadSparseData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> data;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SimpleCacheEntry_ReadSparseData_ResponseParams_Data>;

    SimpleCacheEntry_ReadSparseData_ResponseParams_Data();
    ~SimpleCacheEntry_ReadSparseData_ResponseParams_Data() = delete;
};
static_assert(sizeof(SimpleCacheEntry_ReadSparseData_ResponseParams_Data) == 24, "Bad sizeof(SimpleCacheEntry_ReadSparseData_ResponseParams_Data)");
class SimpleCacheEntry_Close_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SimpleCacheEntry_Close_Params_Data>;

    SimpleCacheEntry_Close_Params_Data();
    ~SimpleCacheEntry_Close_Params_Data() = delete;
};
static_assert(sizeof(SimpleCacheEntry_Close_Params_Data) == 8, "Bad sizeof(SimpleCacheEntry_Close_Params_Data)");
class SimpleCacheEntry_Close_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SimpleCacheEntry_Close_ResponseParams_Data>;

    SimpleCacheEntry_Close_ResponseParams_Data();
    ~SimpleCacheEntry_Close_ResponseParams_Data() = delete;
};
static_assert(sizeof(SimpleCacheEntry_Close_ResponseParams_Data) == 8, "Bad sizeof(SimpleCacheEntry_Close_ResponseParams_Data)");
class SimpleCacheEntryEnumerator_GetNext_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SimpleCacheEntryEnumerator_GetNext_Params_Data>;

    SimpleCacheEntryEnumerator_GetNext_Params_Data();
    ~SimpleCacheEntryEnumerator_GetNext_Params_Data() = delete;
};
static_assert(sizeof(SimpleCacheEntryEnumerator_GetNext_Params_Data) == 8, "Bad sizeof(SimpleCacheEntryEnumerator_GetNext_Params_Data)");
class SimpleCacheEntryEnumerator_GetNext_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SimpleCacheOpenEntryResult_Data> result;

private:
    friend class mojo::internal::MessageFragment<SimpleCacheEntryEnumerator_GetNext_ResponseParams_Data>;

    SimpleCacheEntryEnumerator_GetNext_ResponseParams_Data();
    ~SimpleCacheEntryEnumerator_GetNext_ResponseParams_Data() = delete;
};
static_assert(sizeof(SimpleCacheEntryEnumerator_GetNext_ResponseParams_Data) == 16, "Bad sizeof(SimpleCacheEntryEnumerator_GetNext_ResponseParams_Data)");
class SimpleCache_CreateEntry_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> key;

private:
    friend class mojo::internal::MessageFragment<SimpleCache_CreateEntry_Params_Data>;

    SimpleCache_CreateEntry_Params_Data();
    ~SimpleCache_CreateEntry_Params_Data() = delete;
};
static_assert(sizeof(SimpleCache_CreateEntry_Params_Data) == 16, "Bad sizeof(SimpleCache_CreateEntry_Params_Data)");
class SimpleCache_CreateEntry_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data entry;
    int32_t error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SimpleCache_CreateEntry_ResponseParams_Data>;

    SimpleCache_CreateEntry_ResponseParams_Data();
    ~SimpleCache_CreateEntry_ResponseParams_Data() = delete;
};
static_assert(sizeof(SimpleCache_CreateEntry_ResponseParams_Data) == 24, "Bad sizeof(SimpleCache_CreateEntry_ResponseParams_Data)");
class SimpleCache_OpenEntry_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> key;

private:
    friend class mojo::internal::MessageFragment<SimpleCache_OpenEntry_Params_Data>;

    SimpleCache_OpenEntry_Params_Data();
    ~SimpleCache_OpenEntry_Params_Data() = delete;
};
static_assert(sizeof(SimpleCache_OpenEntry_Params_Data) == 16, "Bad sizeof(SimpleCache_OpenEntry_Params_Data)");
class SimpleCache_OpenEntry_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data entry;
    int32_t error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SimpleCache_OpenEntry_ResponseParams_Data>;

    SimpleCache_OpenEntry_ResponseParams_Data();
    ~SimpleCache_OpenEntry_ResponseParams_Data() = delete;
};
static_assert(sizeof(SimpleCache_OpenEntry_ResponseParams_Data) == 24, "Bad sizeof(SimpleCache_OpenEntry_ResponseParams_Data)");
class SimpleCache_DoomEntry_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> key;

private:
    friend class mojo::internal::MessageFragment<SimpleCache_DoomEntry_Params_Data>;

    SimpleCache_DoomEntry_Params_Data();
    ~SimpleCache_DoomEntry_Params_Data() = delete;
};
static_assert(sizeof(SimpleCache_DoomEntry_Params_Data) == 16, "Bad sizeof(SimpleCache_DoomEntry_Params_Data)");
class SimpleCache_DoomEntry_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SimpleCache_DoomEntry_ResponseParams_Data>;

    SimpleCache_DoomEntry_ResponseParams_Data();
    ~SimpleCache_DoomEntry_ResponseParams_Data() = delete;
};
static_assert(sizeof(SimpleCache_DoomEntry_ResponseParams_Data) == 16, "Bad sizeof(SimpleCache_DoomEntry_ResponseParams_Data)");
class SimpleCache_DoomAllEntries_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SimpleCache_DoomAllEntries_Params_Data>;

    SimpleCache_DoomAllEntries_Params_Data();
    ~SimpleCache_DoomAllEntries_Params_Data() = delete;
};
static_assert(sizeof(SimpleCache_DoomAllEntries_Params_Data) == 8, "Bad sizeof(SimpleCache_DoomAllEntries_Params_Data)");
class SimpleCache_DoomAllEntries_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SimpleCache_DoomAllEntries_ResponseParams_Data>;

    SimpleCache_DoomAllEntries_ResponseParams_Data();
    ~SimpleCache_DoomAllEntries_ResponseParams_Data() = delete;
};
static_assert(sizeof(SimpleCache_DoomAllEntries_ResponseParams_Data) == 16, "Bad sizeof(SimpleCache_DoomAllEntries_ResponseParams_Data)");
class SimpleCache_EnumerateEntries_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SimpleCache_EnumerateEntries_Params_Data>;

    SimpleCache_EnumerateEntries_Params_Data();
    ~SimpleCache_EnumerateEntries_Params_Data() = delete;
};
static_assert(sizeof(SimpleCache_EnumerateEntries_Params_Data) == 16, "Bad sizeof(SimpleCache_EnumerateEntries_Params_Data)");
class SimpleCache_Detach_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SimpleCache_Detach_Params_Data>;

    SimpleCache_Detach_Params_Data();
    ~SimpleCache_Detach_Params_Data() = delete;
};
static_assert(sizeof(SimpleCache_Detach_Params_Data) == 8, "Bad sizeof(SimpleCache_Detach_Params_Data)");
class SimpleCache_Detach_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SimpleCache_Detach_ResponseParams_Data>;

    SimpleCache_Detach_ResponseParams_Data();
    ~SimpleCache_Detach_ResponseParams_Data() = delete;
};
static_assert(sizeof(SimpleCache_Detach_ResponseParams_Data) == 8, "Bad sizeof(SimpleCache_Detach_ResponseParams_Data)");
class NetworkServiceTest_AddRules_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::Rule_Data>>> rules;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_AddRules_Params_Data>;

    NetworkServiceTest_AddRules_Params_Data();
    ~NetworkServiceTest_AddRules_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_AddRules_Params_Data) == 16, "Bad sizeof(NetworkServiceTest_AddRules_Params_Data)");
class NetworkServiceTest_AddRules_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_AddRules_ResponseParams_Data>;

    NetworkServiceTest_AddRules_ResponseParams_Data();
    ~NetworkServiceTest_AddRules_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_AddRules_ResponseParams_Data) == 8, "Bad sizeof(NetworkServiceTest_AddRules_ResponseParams_Data)");
class NetworkServiceTest_SimulateNetworkChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_SimulateNetworkChange_Params_Data>;

    NetworkServiceTest_SimulateNetworkChange_Params_Data();
    ~NetworkServiceTest_SimulateNetworkChange_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_SimulateNetworkChange_Params_Data) == 16, "Bad sizeof(NetworkServiceTest_SimulateNetworkChange_Params_Data)");
class NetworkServiceTest_SimulateNetworkChange_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_SimulateNetworkChange_ResponseParams_Data>;

    NetworkServiceTest_SimulateNetworkChange_ResponseParams_Data();
    ~NetworkServiceTest_SimulateNetworkChange_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkServiceTest_SimulateNetworkChange_ResponseParams_Data) == 8, "Bad sizeof(NetworkServiceTest_SimulateNetworkChange_ResponseParams_Data)");
class NetworkServiceTest_SimulateNetworkQualityChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_SimulateNetworkQualityChange_Params_Data>;

    NetworkServiceTest_SimulateNetworkQualityChange_Params_Data();
    ~NetworkServiceTest_SimulateNetworkQualityChange_Params_Data() = delete;
};
static_assert(
    sizeof(NetworkServiceTest_SimulateNetworkQualityChange_Params_Data) == 16, "Bad sizeof(NetworkServiceTest_SimulateNetworkQualityChange_Params_Data)");
class NetworkServiceTest_SimulateNetworkQualityChange_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_SimulateNetworkQualityChange_ResponseParams_Data>;

    NetworkServiceTest_SimulateNetworkQualityChange_ResponseParams_Data();
    ~NetworkServiceTest_SimulateNetworkQualityChange_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_SimulateNetworkQualityChange_ResponseParams_Data) == 8,
    "Bad sizeof(NetworkServiceTest_SimulateNetworkQualityChange_ResponseParams_Data)");
class NetworkServiceTest_ForceNetworkQualityEstimatorReportWifiAsSlow2G_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_ForceNetworkQualityEstimatorReportWifiAsSlow2G_Params_Data>;

    NetworkServiceTest_ForceNetworkQualityEstimatorReportWifiAsSlow2G_Params_Data();
    ~NetworkServiceTest_ForceNetworkQualityEstimatorReportWifiAsSlow2G_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_ForceNetworkQualityEstimatorReportWifiAsSlow2G_Params_Data) == 8,
    "Bad sizeof(NetworkServiceTest_ForceNetworkQualityEstimatorReportWifiAsSlow2G_Params_Data)");
class NetworkServiceTest_ForceNetworkQualityEstimatorReportWifiAsSlow2G_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_ForceNetworkQualityEstimatorReportWifiAsSlow2G_ResponseParams_Data>;

    NetworkServiceTest_ForceNetworkQualityEstimatorReportWifiAsSlow2G_ResponseParams_Data();
    ~NetworkServiceTest_ForceNetworkQualityEstimatorReportWifiAsSlow2G_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_ForceNetworkQualityEstimatorReportWifiAsSlow2G_ResponseParams_Data) == 8,
    "Bad sizeof(NetworkServiceTest_ForceNetworkQualityEstimatorReportWifiAsSlow2G_ResponseParams_Data)");
class NetworkServiceTest_SimulateCrash_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_SimulateCrash_Params_Data>;

    NetworkServiceTest_SimulateCrash_Params_Data();
    ~NetworkServiceTest_SimulateCrash_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_SimulateCrash_Params_Data) == 8, "Bad sizeof(NetworkServiceTest_SimulateCrash_Params_Data)");
class NetworkServiceTest_MockCertVerifierSetDefaultResult_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t default_result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_MockCertVerifierSetDefaultResult_Params_Data>;

    NetworkServiceTest_MockCertVerifierSetDefaultResult_Params_Data();
    ~NetworkServiceTest_MockCertVerifierSetDefaultResult_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_MockCertVerifierSetDefaultResult_Params_Data) == 16,
    "Bad sizeof(NetworkServiceTest_MockCertVerifierSetDefaultResult_Params_Data)");
class NetworkServiceTest_MockCertVerifierSetDefaultResult_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_MockCertVerifierSetDefaultResult_ResponseParams_Data>;

    NetworkServiceTest_MockCertVerifierSetDefaultResult_ResponseParams_Data();
    ~NetworkServiceTest_MockCertVerifierSetDefaultResult_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_MockCertVerifierSetDefaultResult_ResponseParams_Data) == 8,
    "Bad sizeof(NetworkServiceTest_MockCertVerifierSetDefaultResult_ResponseParams_Data)");
class NetworkServiceTest_MockCertVerifierAddResultForCertAndHost_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::X509Certificate_Data> cert;
    mojo::internal::Pointer<mojo::internal::String_Data> host_pattern;
    mojo::internal::Pointer<::network::mojom::internal::CertVerifyResult_Data> verify_result;
    int32_t rv;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_MockCertVerifierAddResultForCertAndHost_Params_Data>;

    NetworkServiceTest_MockCertVerifierAddResultForCertAndHost_Params_Data();
    ~NetworkServiceTest_MockCertVerifierAddResultForCertAndHost_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_MockCertVerifierAddResultForCertAndHost_Params_Data) == 40,
    "Bad sizeof(NetworkServiceTest_MockCertVerifierAddResultForCertAndHost_Params_Data)");
class NetworkServiceTest_MockCertVerifierAddResultForCertAndHost_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_MockCertVerifierAddResultForCertAndHost_ResponseParams_Data>;

    NetworkServiceTest_MockCertVerifierAddResultForCertAndHost_ResponseParams_Data();
    ~NetworkServiceTest_MockCertVerifierAddResultForCertAndHost_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_MockCertVerifierAddResultForCertAndHost_ResponseParams_Data) == 8,
    "Bad sizeof(NetworkServiceTest_MockCertVerifierAddResultForCertAndHost_ResponseParams_Data)");
class NetworkServiceTest_SetTransportSecurityStateSource_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint16_t reporting_port;
    uint8_t padfinal_[6];

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_SetTransportSecurityStateSource_Params_Data>;

    NetworkServiceTest_SetTransportSecurityStateSource_Params_Data();
    ~NetworkServiceTest_SetTransportSecurityStateSource_Params_Data() = delete;
};
static_assert(
    sizeof(NetworkServiceTest_SetTransportSecurityStateSource_Params_Data) == 16, "Bad sizeof(NetworkServiceTest_SetTransportSecurityStateSource_Params_Data)");
class NetworkServiceTest_SetTransportSecurityStateSource_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_SetTransportSecurityStateSource_ResponseParams_Data>;

    NetworkServiceTest_SetTransportSecurityStateSource_ResponseParams_Data();
    ~NetworkServiceTest_SetTransportSecurityStateSource_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_SetTransportSecurityStateSource_ResponseParams_Data) == 8,
    "Bad sizeof(NetworkServiceTest_SetTransportSecurityStateSource_ResponseParams_Data)");
class NetworkServiceTest_SetAllowNetworkAccessToHostResolutions_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_SetAllowNetworkAccessToHostResolutions_Params_Data>;

    NetworkServiceTest_SetAllowNetworkAccessToHostResolutions_Params_Data();
    ~NetworkServiceTest_SetAllowNetworkAccessToHostResolutions_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_SetAllowNetworkAccessToHostResolutions_Params_Data) == 8,
    "Bad sizeof(NetworkServiceTest_SetAllowNetworkAccessToHostResolutions_Params_Data)");
class NetworkServiceTest_SetAllowNetworkAccessToHostResolutions_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_SetAllowNetworkAccessToHostResolutions_ResponseParams_Data>;

    NetworkServiceTest_SetAllowNetworkAccessToHostResolutions_ResponseParams_Data();
    ~NetworkServiceTest_SetAllowNetworkAccessToHostResolutions_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_SetAllowNetworkAccessToHostResolutions_ResponseParams_Data) == 8,
    "Bad sizeof(NetworkServiceTest_SetAllowNetworkAccessToHostResolutions_ResponseParams_Data)");
class NetworkServiceTest_ReplaceSystemDnsConfig_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_ReplaceSystemDnsConfig_Params_Data>;

    NetworkServiceTest_ReplaceSystemDnsConfig_Params_Data();
    ~NetworkServiceTest_ReplaceSystemDnsConfig_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_ReplaceSystemDnsConfig_Params_Data) == 8, "Bad sizeof(NetworkServiceTest_ReplaceSystemDnsConfig_Params_Data)");
class NetworkServiceTest_ReplaceSystemDnsConfig_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_ReplaceSystemDnsConfig_ResponseParams_Data>;

    NetworkServiceTest_ReplaceSystemDnsConfig_ResponseParams_Data();
    ~NetworkServiceTest_ReplaceSystemDnsConfig_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkServiceTest_ReplaceSystemDnsConfig_ResponseParams_Data) == 8, "Bad sizeof(NetworkServiceTest_ReplaceSystemDnsConfig_ResponseParams_Data)");
class NetworkServiceTest_SetTestDohConfig_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t secure_dns_mode;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::network::mojom::internal::DnsOverHttpsConfig_Data> doh_config;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_SetTestDohConfig_Params_Data>;

    NetworkServiceTest_SetTestDohConfig_Params_Data();
    ~NetworkServiceTest_SetTestDohConfig_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_SetTestDohConfig_Params_Data) == 24, "Bad sizeof(NetworkServiceTest_SetTestDohConfig_Params_Data)");
class NetworkServiceTest_SetTestDohConfig_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_SetTestDohConfig_ResponseParams_Data>;

    NetworkServiceTest_SetTestDohConfig_ResponseParams_Data();
    ~NetworkServiceTest_SetTestDohConfig_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_SetTestDohConfig_ResponseParams_Data) == 8, "Bad sizeof(NetworkServiceTest_SetTestDohConfig_ResponseParams_Data)");
class NetworkServiceTest_CrashOnResolveHost_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> host;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_CrashOnResolveHost_Params_Data>;

    NetworkServiceTest_CrashOnResolveHost_Params_Data();
    ~NetworkServiceTest_CrashOnResolveHost_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_CrashOnResolveHost_Params_Data) == 16, "Bad sizeof(NetworkServiceTest_CrashOnResolveHost_Params_Data)");
class NetworkServiceTest_CrashOnGetCookieList_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_CrashOnGetCookieList_Params_Data>;

    NetworkServiceTest_CrashOnGetCookieList_Params_Data();
    ~NetworkServiceTest_CrashOnGetCookieList_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_CrashOnGetCookieList_Params_Data) == 8, "Bad sizeof(NetworkServiceTest_CrashOnGetCookieList_Params_Data)");
class NetworkServiceTest_GetLatestMemoryPressureLevel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_GetLatestMemoryPressureLevel_Params_Data>;

    NetworkServiceTest_GetLatestMemoryPressureLevel_Params_Data();
    ~NetworkServiceTest_GetLatestMemoryPressureLevel_Params_Data() = delete;
};
static_assert(
    sizeof(NetworkServiceTest_GetLatestMemoryPressureLevel_Params_Data) == 8, "Bad sizeof(NetworkServiceTest_GetLatestMemoryPressureLevel_Params_Data)");
class NetworkServiceTest_GetLatestMemoryPressureLevel_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t memory_pressure_level;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_GetLatestMemoryPressureLevel_ResponseParams_Data>;

    NetworkServiceTest_GetLatestMemoryPressureLevel_ResponseParams_Data();
    ~NetworkServiceTest_GetLatestMemoryPressureLevel_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_GetLatestMemoryPressureLevel_ResponseParams_Data) == 16,
    "Bad sizeof(NetworkServiceTest_GetLatestMemoryPressureLevel_ResponseParams_Data)");
class NetworkServiceTest_GetPeerToPeerConnectionsCountChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_GetPeerToPeerConnectionsCountChange_Params_Data>;

    NetworkServiceTest_GetPeerToPeerConnectionsCountChange_Params_Data();
    ~NetworkServiceTest_GetPeerToPeerConnectionsCountChange_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_GetPeerToPeerConnectionsCountChange_Params_Data) == 8,
    "Bad sizeof(NetworkServiceTest_GetPeerToPeerConnectionsCountChange_Params_Data)");
class NetworkServiceTest_GetPeerToPeerConnectionsCountChange_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t connection_count;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_GetPeerToPeerConnectionsCountChange_ResponseParams_Data>;

    NetworkServiceTest_GetPeerToPeerConnectionsCountChange_ResponseParams_Data();
    ~NetworkServiceTest_GetPeerToPeerConnectionsCountChange_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_GetPeerToPeerConnectionsCountChange_ResponseParams_Data) == 16,
    "Bad sizeof(NetworkServiceTest_GetPeerToPeerConnectionsCountChange_ResponseParams_Data)");
class NetworkServiceTest_GetEnvironmentVariableValue_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> name;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_GetEnvironmentVariableValue_Params_Data>;

    NetworkServiceTest_GetEnvironmentVariableValue_Params_Data();
    ~NetworkServiceTest_GetEnvironmentVariableValue_Params_Data() = delete;
};
static_assert(
    sizeof(NetworkServiceTest_GetEnvironmentVariableValue_Params_Data) == 16, "Bad sizeof(NetworkServiceTest_GetEnvironmentVariableValue_Params_Data)");
class NetworkServiceTest_GetEnvironmentVariableValue_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> value;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_GetEnvironmentVariableValue_ResponseParams_Data>;

    NetworkServiceTest_GetEnvironmentVariableValue_ResponseParams_Data();
    ~NetworkServiceTest_GetEnvironmentVariableValue_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_GetEnvironmentVariableValue_ResponseParams_Data) == 16,
    "Bad sizeof(NetworkServiceTest_GetEnvironmentVariableValue_ResponseParams_Data)");
class NetworkServiceTest_Log_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> message;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_Log_Params_Data>;

    NetworkServiceTest_Log_Params_Data();
    ~NetworkServiceTest_Log_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_Log_Params_Data) == 16, "Bad sizeof(NetworkServiceTest_Log_Params_Data)");
class NetworkServiceTest_Log_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_Log_ResponseParams_Data>;

    NetworkServiceTest_Log_ResponseParams_Data();
    ~NetworkServiceTest_Log_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_Log_ResponseParams_Data) == 8, "Bad sizeof(NetworkServiceTest_Log_ResponseParams_Data)");
class NetworkServiceTest_ActivateFieldTrial_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> field_trial_name;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_ActivateFieldTrial_Params_Data>;

    NetworkServiceTest_ActivateFieldTrial_Params_Data();
    ~NetworkServiceTest_ActivateFieldTrial_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_ActivateFieldTrial_Params_Data) == 16, "Bad sizeof(NetworkServiceTest_ActivateFieldTrial_Params_Data)");
class NetworkServiceTest_SetSCTAuditingRetryDelay_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> delay;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_SetSCTAuditingRetryDelay_Params_Data>;

    NetworkServiceTest_SetSCTAuditingRetryDelay_Params_Data();
    ~NetworkServiceTest_SetSCTAuditingRetryDelay_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_SetSCTAuditingRetryDelay_Params_Data) == 16, "Bad sizeof(NetworkServiceTest_SetSCTAuditingRetryDelay_Params_Data)");
class NetworkServiceTest_SetSCTAuditingRetryDelay_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_SetSCTAuditingRetryDelay_ResponseParams_Data>;

    NetworkServiceTest_SetSCTAuditingRetryDelay_ResponseParams_Data();
    ~NetworkServiceTest_SetSCTAuditingRetryDelay_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_SetSCTAuditingRetryDelay_ResponseParams_Data) == 8,
    "Bad sizeof(NetworkServiceTest_SetSCTAuditingRetryDelay_ResponseParams_Data)");
class NetworkServiceTest_OpenFile_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> path;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_OpenFile_Params_Data>;

    NetworkServiceTest_OpenFile_Params_Data();
    ~NetworkServiceTest_OpenFile_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_OpenFile_Params_Data) == 16, "Bad sizeof(NetworkServiceTest_OpenFile_Params_Data)");
class NetworkServiceTest_OpenFile_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_OpenFile_ResponseParams_Data>;

    NetworkServiceTest_OpenFile_ResponseParams_Data();
    ~NetworkServiceTest_OpenFile_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_OpenFile_ResponseParams_Data) == 16, "Bad sizeof(NetworkServiceTest_OpenFile_ResponseParams_Data)");
class NetworkServiceTest_EnumerateFiles_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> path;
    mojo::internal::Interface_Data factory;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_EnumerateFiles_Params_Data>;

    NetworkServiceTest_EnumerateFiles_Params_Data();
    ~NetworkServiceTest_EnumerateFiles_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_EnumerateFiles_Params_Data) == 24, "Bad sizeof(NetworkServiceTest_EnumerateFiles_Params_Data)");
class NetworkServiceTest_EnumerateFiles_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::FileEnumerationEntry_Data>>> entries;
    uint8_t error : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_EnumerateFiles_ResponseParams_Data>;

    NetworkServiceTest_EnumerateFiles_ResponseParams_Data();
    ~NetworkServiceTest_EnumerateFiles_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_EnumerateFiles_ResponseParams_Data) == 24, "Bad sizeof(NetworkServiceTest_EnumerateFiles_ResponseParams_Data)");
class NetworkServiceTest_CreateSimpleCache_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data factory;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> path;
    uint8_t reset : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_CreateSimpleCache_Params_Data>;

    NetworkServiceTest_CreateSimpleCache_Params_Data();
    ~NetworkServiceTest_CreateSimpleCache_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_CreateSimpleCache_Params_Data) == 32, "Bad sizeof(NetworkServiceTest_CreateSimpleCache_Params_Data)");
class NetworkServiceTest_CreateSimpleCache_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data backend;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_CreateSimpleCache_ResponseParams_Data>;

    NetworkServiceTest_CreateSimpleCache_ResponseParams_Data();
    ~NetworkServiceTest_CreateSimpleCache_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_CreateSimpleCache_ResponseParams_Data) == 16, "Bad sizeof(NetworkServiceTest_CreateSimpleCache_ResponseParams_Data)");
class NetworkServiceTest_MakeRequestToServer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::TransferableSocket_Data> s;
    mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> endpoint;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_MakeRequestToServer_Params_Data>;

    NetworkServiceTest_MakeRequestToServer_Params_Data();
    ~NetworkServiceTest_MakeRequestToServer_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_MakeRequestToServer_Params_Data) == 24, "Bad sizeof(NetworkServiceTest_MakeRequestToServer_Params_Data)");
class NetworkServiceTest_MakeRequestToServer_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_MakeRequestToServer_ResponseParams_Data>;

    NetworkServiceTest_MakeRequestToServer_ResponseParams_Data();
    ~NetworkServiceTest_MakeRequestToServer_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkServiceTest_MakeRequestToServer_ResponseParams_Data) == 16, "Bad sizeof(NetworkServiceTest_MakeRequestToServer_ResponseParams_Data)");
class NetworkServiceTest_ResolveOwnHostnameWithSystemDns_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_ResolveOwnHostnameWithSystemDns_Params_Data>;

    NetworkServiceTest_ResolveOwnHostnameWithSystemDns_Params_Data();
    ~NetworkServiceTest_ResolveOwnHostnameWithSystemDns_Params_Data() = delete;
};
static_assert(
    sizeof(NetworkServiceTest_ResolveOwnHostnameWithSystemDns_Params_Data) == 8, "Bad sizeof(NetworkServiceTest_ResolveOwnHostnameWithSystemDns_Params_Data)");
class NetworkServiceTest_ResolveOwnHostnameWithSystemDns_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::AddressList_Data> addr_list;
    int32_t os_error;
    int32_t net_error;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_ResolveOwnHostnameWithSystemDns_ResponseParams_Data>;

    NetworkServiceTest_ResolveOwnHostnameWithSystemDns_ResponseParams_Data();
    ~NetworkServiceTest_ResolveOwnHostnameWithSystemDns_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_ResolveOwnHostnameWithSystemDns_ResponseParams_Data) == 24,
    "Bad sizeof(NetworkServiceTest_ResolveOwnHostnameWithSystemDns_ResponseParams_Data)");
class NetworkServiceTest_SetIPv6ProbeResult_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_SetIPv6ProbeResult_Params_Data>;

    NetworkServiceTest_SetIPv6ProbeResult_Params_Data();
    ~NetworkServiceTest_SetIPv6ProbeResult_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_SetIPv6ProbeResult_Params_Data) == 16, "Bad sizeof(NetworkServiceTest_SetIPv6ProbeResult_Params_Data)");
class NetworkServiceTest_SetIPv6ProbeResult_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_SetIPv6ProbeResult_ResponseParams_Data>;

    NetworkServiceTest_SetIPv6ProbeResult_ResponseParams_Data();
    ~NetworkServiceTest_SetIPv6ProbeResult_ResponseParams_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_SetIPv6ProbeResult_ResponseParams_Data) == 8, "Bad sizeof(NetworkServiceTest_SetIPv6ProbeResult_ResponseParams_Data)");
class NetworkServiceTest_AllowsGSSAPILibraryLoad_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_AllowsGSSAPILibraryLoad_Params_Data>;

    NetworkServiceTest_AllowsGSSAPILibraryLoad_Params_Data();
    ~NetworkServiceTest_AllowsGSSAPILibraryLoad_Params_Data() = delete;
};
static_assert(sizeof(NetworkServiceTest_AllowsGSSAPILibraryLoad_Params_Data) == 8, "Bad sizeof(NetworkServiceTest_AllowsGSSAPILibraryLoad_Params_Data)");
class NetworkServiceTest_AllowsGSSAPILibraryLoad_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t allow_gssapi_library_load : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<NetworkServiceTest_AllowsGSSAPILibraryLoad_ResponseParams_Data>;

    NetworkServiceTest_AllowsGSSAPILibraryLoad_ResponseParams_Data();
    ~NetworkServiceTest_AllowsGSSAPILibraryLoad_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(NetworkServiceTest_AllowsGSSAPILibraryLoad_ResponseParams_Data) == 16, "Bad sizeof(NetworkServiceTest_AllowsGSSAPILibraryLoad_ResponseParams_Data)");

} // namespace internal

class SimpleCacheEntry_WriteData_ParamsDataView {
public:
