// services/network/public/mojom/proxy_config_with_annotation.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_NETWORK_PUBLIC_MOJOM_PROXY_CONFIG_WITH_ANNOTATION_MOJOM_PARAMS_DATA_H_
#define SERVICES_NETWORK_PUBLIC_MOJOM_PROXY_CONFIG_WITH_ANNOTATION_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace network::mojom {
namespace internal {
class ProxyConfigClient_OnProxyConfigUpdated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::ProxyConfigWithAnnotation_Data> proxy_config;

private:
    friend class mojo::internal::MessageFragment<ProxyConfigClient_OnProxyConfigUpdated_Params_Data>;

    ProxyConfigClient_OnProxyConfigUpdated_Params_Data();
    ~ProxyConfigClient_OnProxyConfigUpdated_Params_Data() = delete;
};
static_assert(sizeof(ProxyConfigClient_OnProxyConfigUpdated_Params_Data) == 16, "Bad sizeof(ProxyConfigClient_OnProxyConfigUpdated_Params_Data)");
class ProxyConfigClient_FlushProxyConfig_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ProxyConfigClient_FlushProxyConfig_Params_Data>;

    ProxyConfigClient_FlushProxyConfig_Params_Data();
    ~ProxyConfigClient_FlushProxyConfig_Params_Data() = delete;
};
static_assert(sizeof(ProxyConfigClient_FlushProxyConfig_Params_Data) == 8, "Bad sizeof(ProxyConfigClient_FlushProxyConfig_Params_Data)");
class ProxyConfigClient_FlushProxyConfig_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ProxyConfigClient_FlushProxyConfig_ResponseParams_Data>;

    ProxyConfigClient_FlushProxyConfig_ResponseParams_Data();
    ~ProxyConfigClient_FlushProxyConfig_ResponseParams_Data() = delete;
};
static_assert(sizeof(ProxyConfigClient_FlushProxyConfig_ResponseParams_Data) == 8, "Bad sizeof(ProxyConfigClient_FlushProxyConfig_ResponseParams_Data)");
class ProxyConfigPollerClient_OnLazyProxyConfigPoll_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ProxyConfigPollerClient_OnLazyProxyConfigPoll_Params_Data>;

    ProxyConfigPollerClient_OnLazyProxyConfigPoll_Params_Data();
    ~ProxyConfigPollerClient_OnLazyProxyConfigPoll_Params_Data() = delete;
};
static_assert(sizeof(ProxyConfigPollerClient_OnLazyProxyConfigPoll_Params_Data) == 8, "Bad sizeof(ProxyConfigPollerClient_OnLazyProxyConfigPoll_Params_Data)");
class ProxyErrorClient_OnPACScriptError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t line_number;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> details;

private:
    friend class mojo::internal::MessageFragment<ProxyErrorClient_OnPACScriptError_Params_Data>;

    ProxyErrorClient_OnPACScriptError_Params_Data();
    ~ProxyErrorClient_OnPACScriptError_Params_Data() = delete;
};
static_assert(sizeof(ProxyErrorClient_OnPACScriptError_Params_Data) == 24, "Bad sizeof(ProxyErrorClient_OnPACScriptError_Params_Data)");
class ProxyErrorClient_OnRequestMaybeFailedDueToProxySettings_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t net_error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ProxyErrorClient_OnRequestMaybeFailedDueToProxySettings_Params_Data>;

    ProxyErrorClient_OnRequestMaybeFailedDueToProxySettings_Params_Data();
    ~ProxyErrorClient_OnRequestMaybeFailedDueToProxySettings_Params_Data() = delete;
};
static_assert(sizeof(ProxyErrorClient_OnRequestMaybeFailedDueToProxySettings_Params_Data) == 16,
    "Bad sizeof(ProxyErrorClient_OnRequestMaybeFailedDueToProxySettings_Params_Data)");

} // namespace internal

class ProxyConfigClient_OnProxyConfigUpdated_ParamsDataView {
public:
    ProxyConfigClient_OnProxyConfigUpdated_ParamsDataView() = default;

    ProxyConfigClient_OnProxyConfigUpdated_ParamsDataView(internal::ProxyConfigClient_OnProxyConfigUpdated_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetProxyConfigDataView(ProxyConfigWithAnnotationDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadProxyConfig(UserType* output)
    {

        auto* pointer = data_->proxy_config.Get();
        return mojo::internal::Deserialize<::network::mojom::ProxyConfigWithAnnotationDataView>(pointer, output, message_);
    }

private:
    internal::ProxyConfigClient_OnProxyConfigUpdated_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class ProxyConfigClient_FlushProxyConfig_ParamsDataView {
public:
    ProxyConfigClient_FlushProxyConfig_ParamsDataView() = default;

    ProxyConfigClient_FlushProxyConfig_ParamsDataView(internal::ProxyConfigClient_FlushProxyConfig_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::ProxyConfigClient_FlushProxyConfig_Params_Data* data_ = nullptr;
};

class ProxyConfigClient_FlushProxyConfig_ResponseParamsDataView {
public:
    ProxyConfigClient_FlushProxyConfig_ResponseParamsDataView() = default;

    ProxyConfigClient_FlushProxyConfig_ResponseParamsDataView(internal::ProxyConfigClient_FlushProxyConfig_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::ProxyConfigClient_FlushProxyConfig_ResponseParams_Data* data_ = nullptr;
};

class ProxyConfigPollerClient_OnLazyProxyConfigPoll_ParamsDataView {
public:
    ProxyConfigPollerClient_OnLazyProxyConfigPoll_ParamsDataView() = default;

    ProxyConfigPollerClient_OnLazyProxyConfigPoll_ParamsDataView(
        internal::ProxyConfigPollerClient_OnLazyProxyConfigPoll_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::ProxyConfigPollerClient_OnLazyProxyConfigPoll_Params_Data* data_ = nullptr;
};

class ProxyErrorClient_OnPACScriptError_ParamsDataView {
public:
    ProxyErrorClient_OnPACScriptError_ParamsDataView() = default;

    ProxyErrorClient_OnPACScriptError_ParamsDataView(internal::ProxyErrorClient_OnPACScriptError_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    int32_t line_number() const
    {
        return data_->line_number;
    }
    inline void GetDetailsDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadDetails(UserType* output)
    {

        auto* pointer = data_->details.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }

private:
    internal::ProxyErrorClient_OnPACScriptError_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class ProxyErrorClient_OnRequestMaybeFailedDueToProxySettings_ParamsDataView {
public:
    ProxyErrorClient_OnRequestMaybeFailedDueToProxySettings_ParamsDataView() = default;

    ProxyErrorClient_OnRequestMaybeFailedDueToProxySettings_ParamsDataView(
        internal::ProxyErrorClient_OnRequestMaybeFailedDueToProxySettings_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    int32_t net_error() const
    {
        return data_->net_error;
    }

private:
    internal::ProxyErrorClient_OnRequestMaybeFailedDueToProxySettings_Params_Data* data_ = nullptr;
};

inline void ProxyConfigClient_OnProxyConfigUpdated_ParamsDataView::GetProxyConfigDataView(ProxyConfigWithAnnotationDataView* output)
{
    auto pointer = data_->proxy_config.Get();
    *output = ProxyConfigWithAnnotationDataView(pointer, message_);
}

inline void ProxyErrorClient_OnPACScriptError_ParamsDataView::GetDetailsDataView(mojo::StringDataView* output)
{
    auto pointer = data_->details.Get();
    *output = mojo::StringDataView(pointer, message_);
}

} // network::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // SERVICES_NETWORK_PUBLIC_MOJOM_PROXY_CONFIG_WITH_ANNOTATION_MOJOM_PARAMS_DATA_H_
