// services/network/public/mojom/restricted_udp_socket.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_NETWORK_PUBLIC_MOJOM_RESTRICTED_UDP_SOCKET_MOJOM_PARAMS_DATA_H_
#define SERVICES_NETWORK_PUBLIC_MOJOM_RESTRICTED_UDP_SOCKET_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace network::mojom {
namespace internal {
class RestrictedUDPSocket_ReceiveMore_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t num_additional_datagrams;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<RestrictedUDPSocket_ReceiveMore_Params_Data>;

    RestrictedUDPSocket_ReceiveMore_Params_Data();
    ~RestrictedUDPSocket_ReceiveMore_Params_Data() = delete;
};
static_assert(sizeof(RestrictedUDPSocket_ReceiveMore_Params_Data) == 16, "Bad sizeof(RestrictedUDPSocket_ReceiveMore_Params_Data)");
class RestrictedUDPSocket_Send_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> data;

private:
    friend class mojo::internal::MessageFragment<RestrictedUDPSocket_Send_Params_Data>;

    RestrictedUDPSocket_Send_Params_Data();
    ~RestrictedUDPSocket_Send_Params_Data() = delete;
};
static_assert(sizeof(RestrictedUDPSocket_Send_Params_Data) == 16, "Bad sizeof(RestrictedUDPSocket_Send_Params_Data)");
class RestrictedUDPSocket_Send_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<RestrictedUDPSocket_Send_ResponseParams_Data>;

    RestrictedUDPSocket_Send_ResponseParams_Data();
    ~RestrictedUDPSocket_Send_ResponseParams_Data() = delete;
};
static_assert(sizeof(RestrictedUDPSocket_Send_ResponseParams_Data) == 16, "Bad sizeof(RestrictedUDPSocket_Send_ResponseParams_Data)");
class RestrictedUDPSocket_SendTo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> data;
    mojo::internal::Pointer<::network::mojom::internal::HostPortPair_Data> dest_addr;
    int32_t dns_query_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<RestrictedUDPSocket_SendTo_Params_Data>;

    RestrictedUDPSocket_SendTo_Params_Data();
    ~RestrictedUDPSocket_SendTo_Params_Data() = delete;
};
static_assert(sizeof(RestrictedUDPSocket_SendTo_Params_Data) == 32, "Bad sizeof(RestrictedUDPSocket_SendTo_Params_Data)");
class RestrictedUDPSocket_SendTo_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<RestrictedUDPSocket_SendTo_ResponseParams_Data>;

    RestrictedUDPSocket_SendTo_ResponseParams_Data();
    ~RestrictedUDPSocket_SendTo_ResponseParams_Data() = delete;
};
static_assert(sizeof(RestrictedUDPSocket_SendTo_ResponseParams_Data) == 16, "Bad sizeof(RestrictedUDPSocket_SendTo_ResponseParams_Data)");

} // namespace internal

class RestrictedUDPSocket_ReceiveMore_ParamsDataView {
public:
    RestrictedUDPSocket_ReceiveMore_ParamsDataView() = default;

    RestrictedUDPSocket_ReceiveMore_ParamsDataView(internal::RestrictedUDPSocket_ReceiveMore_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    uint32_t num_additional_datagrams() const
    {
        return data_->num_additional_datagrams;
    }

private:
    internal::RestrictedUDPSocket_ReceiveMore_Params_Data* data_ = nullptr;
};

class RestrictedUDPSocket_Send_ParamsDataView {
public:
    RestrictedUDPSocket_Send_ParamsDataView() = default;

    RestrictedUDPSocket_Send_ParamsDataView(internal::RestrictedUDPSocket_Send_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetDataDataView(::mojo_base::mojom::ReadOnlyBufferDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadData(UserType* output)
    {

        auto* pointer = data_->data.Get();
        return mojo::internal::Deserialize<::mojo_base::mojom::ReadOnlyBufferDataView>(pointer, output, message_);
    }

private:
    internal::RestrictedUDPSocket_Send_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class RestrictedUDPSocket_Send_ResponseParamsDataView {
public:
    RestrictedUDPSocket_Send_ResponseParamsDataView() = default;

    RestrictedUDPSocket_Send_ResponseParamsDataView(internal::RestrictedUDPSocket_Send_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    int32_t result() const
    {
        return data_->result;
    }

private:
    internal::RestrictedUDPSocket_Send_ResponseParams_Data* data_ = nullptr;
};

class RestrictedUDPSocket_SendTo_ParamsDataView {
public:
    RestrictedUDPSocket_SendTo_ParamsDataView() = default;

    RestrictedUDPSocket_SendTo_ParamsDataView(internal::RestrictedUDPSocket_SendTo_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetDataDataView(::mojo_base::mojom::ReadOnlyBufferDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadData(UserType* output)
    {

        auto* pointer = data_->data.Get();
        return mojo::internal::Deserialize<::mojo_base::mojom::ReadOnlyBufferDataView>(pointer, output, message_);
    }
    inline void GetDestAddrDataView(::network::mojom::HostPortPairDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadDestAddr(UserType* output)
    {

        auto* pointer = data_->dest_addr.Get();
        return mojo::internal::Deserialize<::network::mojom::HostPortPairDataView>(pointer, output, message_);
    }
    template <typename UserType> [[nodiscard]] bool ReadDnsQueryType(UserType* output) const
    {
        auto data_value = data_->dns_query_type;
        return mojo::internal::Deserialize<::network::mojom::DnsQueryType>(data_value, output);
    }
    ::network::mojom::DnsQueryType dns_query_type() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::network::mojom::DnsQueryType>(data_->dns_query_type));
    }

private:
    internal::RestrictedUDPSocket_SendTo_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class RestrictedUDPSocket_SendTo_ResponseParamsDataView {
public:
    RestrictedUDPSocket_SendTo_ResponseParamsDataView() = default;

    RestrictedUDPSocket_SendTo_ResponseParamsDataView(internal::RestrictedUDPSocket_SendTo_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    int32_t result() const
    {
        return data_->result;
    }

private:
    internal::RestrictedUDPSocket_SendTo_ResponseParams_Data* data_ = nullptr;
};

inline void RestrictedUDPSocket_Send_ParamsDataView::GetDataDataView(::mojo_base::mojom::ReadOnlyBufferDataView* output)
{
    auto pointer = data_->data.Get();
    *output = ::mojo_base::mojom::ReadOnlyBufferDataView(pointer, message_);
}

inline void RestrictedUDPSocket_SendTo_ParamsDataView::GetDataDataView(::mojo_base::mojom::ReadOnlyBufferDataView* output)
{
    auto pointer = data_->data.Get();
    *output = ::mojo_base::mojom::ReadOnlyBufferDataView(pointer, message_);
}
inline void RestrictedUDPSocket_SendTo_ParamsDataView::GetDestAddrDataView(::network::mojom::HostPortPairDataView* output)
{
    auto pointer = data_->dest_addr.Get();
    *output = ::network::mojom::HostPortPairDataView(pointer, message_);
}

} // network::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // SERVICES_NETWORK_PUBLIC_MOJOM_RESTRICTED_UDP_SOCKET_MOJOM_PARAMS_DATA_H_
