// services/network/public/mojom/restricted_cookie_manager.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_NETWORK_PUBLIC_MOJOM_RESTRICTED_COOKIE_MANAGER_MOJOM_PARAMS_DATA_H_
#define SERVICES_NETWORK_PUBLIC_MOJOM_RESTRICTED_COOKIE_MANAGER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace network::mojom {
namespace internal {
class RestrictedCookieManager_GetAllForUrl_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::network::mojom::internal::SiteForCookies_Data> site_for_cookies;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> top_frame_origin;
    int32_t storage_access_api_status;
    uint8_t is_ad_tagged : 1;
    uint8_t force_disable_third_party_cookies : 1;
    uint8_t pad5_[3];
    mojo::internal::Pointer<internal::CookieManagerGetOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<RestrictedCookieManager_GetAllForUrl_Params_Data>;

    RestrictedCookieManager_GetAllForUrl_Params_Data();
    ~RestrictedCookieManager_GetAllForUrl_Params_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_GetAllForUrl_Params_Data) == 48, "Bad sizeof(RestrictedCookieManager_GetAllForUrl_Params_Data)");
class RestrictedCookieManager_GetAllForUrl_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::network::mojom::internal::CookieWithAccessResult_Data>>> cookies;

private:
    friend class mojo::internal::MessageFragment<RestrictedCookieManager_GetAllForUrl_ResponseParams_Data>;

    RestrictedCookieManager_GetAllForUrl_ResponseParams_Data();
    ~RestrictedCookieManager_GetAllForUrl_ResponseParams_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_GetAllForUrl_ResponseParams_Data) == 16, "Bad sizeof(RestrictedCookieManager_GetAllForUrl_ResponseParams_Data)");
class RestrictedCookieManager_SetCanonicalCookie_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::CanonicalCookie_Data> cookie;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::network::mojom::internal::SiteForCookies_Data> site_for_cookies;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> top_frame_origin;
    int32_t storage_access_api_status;
    uint8_t pad4_[4];
    mojo::internal::Pointer<::network::mojom::internal::CookieInclusionStatus_Data> status;

private:
    friend class mojo::internal::MessageFragment<RestrictedCookieManager_SetCanonicalCookie_Params_Data>;

    RestrictedCookieManager_SetCanonicalCookie_Params_Data();
    ~RestrictedCookieManager_SetCanonicalCookie_Params_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_SetCanonicalCookie_Params_Data) == 56, "Bad sizeof(RestrictedCookieManager_SetCanonicalCookie_Params_Data)");
class RestrictedCookieManager_SetCanonicalCookie_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<RestrictedCookieManager_SetCanonicalCookie_ResponseParams_Data>;

    RestrictedCookieManager_SetCanonicalCookie_ResponseParams_Data();
    ~RestrictedCookieManager_SetCanonicalCookie_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(RestrictedCookieManager_SetCanonicalCookie_ResponseParams_Data) == 16, "Bad sizeof(RestrictedCookieManager_SetCanonicalCookie_ResponseParams_Data)");
class RestrictedCookieManager_AddChangeListener_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::network::mojom::internal::SiteForCookies_Data> site_for_cookies;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> top_frame_origin;
    int32_t storage_access_api_status;
    mojo::internal::Interface_Data listener;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<RestrictedCookieManager_AddChangeListener_Params_Data>;

    RestrictedCookieManager_AddChangeListener_Params_Data();
    ~RestrictedCookieManager_AddChangeListener_Params_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_AddChangeListener_Params_Data) == 48, "Bad sizeof(RestrictedCookieManager_AddChangeListener_Params_Data)");
class RestrictedCookieManager_AddChangeListener_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RestrictedCookieManager_AddChangeListener_ResponseParams_Data>;

    RestrictedCookieManager_AddChangeListener_ResponseParams_Data();
    ~RestrictedCookieManager_AddChangeListener_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(RestrictedCookieManager_AddChangeListener_ResponseParams_Data) == 8, "Bad sizeof(RestrictedCookieManager_AddChangeListener_ResponseParams_Data)");
class RestrictedCookieManager_SetCookieFromString_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::network::mojom::internal::SiteForCookies_Data> site_for_cookies;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> top_frame_origin;
    int32_t storage_access_api_status;
    uint8_t pad3_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> cookie;

private:
    friend class mojo::internal::MessageFragment<RestrictedCookieManager_SetCookieFromString_Params_Data>;

    RestrictedCookieManager_SetCookieFromString_Params_Data();
    ~RestrictedCookieManager_SetCookieFromString_Params_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_SetCookieFromString_Params_Data) == 48, "Bad sizeof(RestrictedCookieManager_SetCookieFromString_Params_Data)");
class RestrictedCookieManager_SetCookieFromString_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RestrictedCookieManager_SetCookieFromString_ResponseParams_Data>;

    RestrictedCookieManager_SetCookieFromString_ResponseParams_Data();
    ~RestrictedCookieManager_SetCookieFromString_ResponseParams_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_SetCookieFromString_ResponseParams_Data) == 8,
    "Bad sizeof(RestrictedCookieManager_SetCookieFromString_ResponseParams_Data)");
class RestrictedCookieManager_GetCookiesString_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::network::mojom::internal::SiteForCookies_Data> site_for_cookies;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> top_frame_origin;
    int32_t storage_access_api_status;
    uint8_t get_version_shared_memory : 1;
    uint8_t is_ad_tagged : 1;
    uint8_t force_disable_third_party_cookies : 1;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<RestrictedCookieManager_GetCookiesString_Params_Data>;

    RestrictedCookieManager_GetCookiesString_Params_Data();
    ~RestrictedCookieManager_GetCookiesString_Params_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_GetCookiesString_Params_Data) == 40, "Bad sizeof(RestrictedCookieManager_GetCookiesString_Params_Data)");
class RestrictedCookieManager_GetCookiesString_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t version;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> version_buffer;
    mojo::internal::Pointer<mojo::internal::String_Data> cookies;

private:
    friend class mojo::internal::MessageFragment<RestrictedCookieManager_GetCookiesString_ResponseParams_Data>;

    RestrictedCookieManager_GetCookiesString_ResponseParams_Data();
    ~RestrictedCookieManager_GetCookiesString_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(RestrictedCookieManager_GetCookiesString_ResponseParams_Data) == 32, "Bad sizeof(RestrictedCookieManager_GetCookiesString_ResponseParams_Data)");
class RestrictedCookieManager_CookiesEnabledFor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::network::mojom::internal::SiteForCookies_Data> site_for_cookies;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> top_frame_origin;
    int32_t storage_access_api_status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<RestrictedCookieManager_CookiesEnabledFor_Params_Data>;

    RestrictedCookieManager_CookiesEnabledFor_Params_Data();
    ~RestrictedCookieManager_CookiesEnabledFor_Params_Data() = delete;
};
static_assert(sizeof(RestrictedCookieManager_CookiesEnabledFor_Params_Data) == 40, "Bad sizeof(RestrictedCookieManager_CookiesEnabledFor_Params_Data)");
class RestrictedCookieManager_CookiesEnabledFor_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t cookies_enabled : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<RestrictedCookieManager_CookiesEnabledFor_ResponseParams_Data>;

    RestrictedCookieManager_CookiesEnabledFor_ResponseParams_Data();
    ~RestrictedCookieManager_CookiesEnabledFor_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(RestrictedCookieManager_CookiesEnabledFor_ResponseParams_Data) == 16, "Bad sizeof(RestrictedCookieManager_CookiesEnabledFor_ResponseParams_Data)");

} // namespace internal

class RestrictedCookieManager_GetAllForUrl_ParamsDataView {
public:
