// services/network/public/mojom/tcp_socket.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_NETWORK_PUBLIC_MOJOM_TCP_SOCKET_MOJOM_PARAMS_DATA_H_
#define SERVICES_NETWORK_PUBLIC_MOJOM_TCP_SOCKET_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace network::mojom {
namespace internal {
class TCPBoundSocket_Listen_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t backlog;
    mojo::internal::Handle_Data socket;

private:
    friend class mojo::internal::MessageFragment<TCPBoundSocket_Listen_Params_Data>;

    TCPBoundSocket_Listen_Params_Data();
    ~TCPBoundSocket_Listen_Params_Data() = delete;
};
static_assert(sizeof(TCPBoundSocket_Listen_Params_Data) == 16, "Bad sizeof(TCPBoundSocket_Listen_Params_Data)");
class TCPBoundSocket_Listen_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t net_error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<TCPBoundSocket_Listen_ResponseParams_Data>;

    TCPBoundSocket_Listen_ResponseParams_Data();
    ~TCPBoundSocket_Listen_ResponseParams_Data() = delete;
};
static_assert(sizeof(TCPBoundSocket_Listen_ResponseParams_Data) == 16, "Bad sizeof(TCPBoundSocket_Listen_ResponseParams_Data)");
class TCPBoundSocket_Connect_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::AddressList_Data> remote_addr_list;
    mojo::internal::Pointer<internal::TCPConnectedSocketOptions_Data> tcp_connected_socket_options;
    mojo::internal::Handle_Data socket;
    mojo::internal::Interface_Data observer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<TCPBoundSocket_Connect_Params_Data>;

    TCPBoundSocket_Connect_Params_Data();
    ~TCPBoundSocket_Connect_Params_Data() = delete;
};
static_assert(sizeof(TCPBoundSocket_Connect_Params_Data) == 40, "Bad sizeof(TCPBoundSocket_Connect_Params_Data)");
class TCPBoundSocket_Connect_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t net_error;
    mojo::internal::Handle_Data receive_stream;
    mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> local_addr;
    mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> peer_addr;
    mojo::internal::Handle_Data send_stream;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<TCPBoundSocket_Connect_ResponseParams_Data>;

    TCPBoundSocket_Connect_ResponseParams_Data();
    ~TCPBoundSocket_Connect_ResponseParams_Data() = delete;
};
static_assert(sizeof(TCPBoundSocket_Connect_ResponseParams_Data) == 40, "Bad sizeof(TCPBoundSocket_Connect_ResponseParams_Data)");
class TCPConnectedSocket_UpgradeToTLS_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::HostPortPair_Data> host_port_pair;
    mojo::internal::Pointer<::network::mojom::internal::TLSClientSocketOptions_Data> options;
    mojo::internal::Pointer<::network::mojom::internal::MutableNetworkTrafficAnnotationTag_Data> traffic_annotation;
    mojo::internal::Handle_Data receiver;
    mojo::internal::Interface_Data observer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<TCPConnectedSocket_UpgradeToTLS_Params_Data>;

    TCPConnectedSocket_UpgradeToTLS_Params_Data();
    ~TCPConnectedSocket_UpgradeToTLS_Params_Data() = delete;
};
static_assert(sizeof(TCPConnectedSocket_UpgradeToTLS_Params_Data) == 48, "Bad sizeof(TCPConnectedSocket_UpgradeToTLS_Params_Data)");
class TCPConnectedSocket_UpgradeToTLS_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t net_error;
    mojo::internal::Handle_Data receive_stream;
    mojo::internal::Handle_Data send_stream;
    uint8_t pad2_[4];
    mojo::internal::Pointer<::network::mojom::internal::SSLInfo_Data> ssl_info;

private:
    friend class mojo::internal::MessageFragment<TCPConnectedSocket_UpgradeToTLS_ResponseParams_Data>;

    TCPConnectedSocket_UpgradeToTLS_ResponseParams_Data();
    ~TCPConnectedSocket_UpgradeToTLS_ResponseParams_Data() = delete;
};
static_assert(sizeof(TCPConnectedSocket_UpgradeToTLS_ResponseParams_Data) == 32, "Bad sizeof(TCPConnectedSocket_UpgradeToTLS_ResponseParams_Data)");
class TCPConnectedSocket_SetSendBufferSize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t send_buffer_size;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<TCPConnectedSocket_SetSendBufferSize_Params_Data>;

    TCPConnectedSocket_SetSendBufferSize_Params_Data();
    ~TCPConnectedSocket_SetSendBufferSize_Params_Data() = delete;
};
static_assert(sizeof(TCPConnectedSocket_SetSendBufferSize_Params_Data) == 16, "Bad sizeof(TCPConnectedSocket_SetSendBufferSize_Params_Data)");
class TCPConnectedSocket_SetSendBufferSize_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t net_error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<TCPConnectedSocket_SetSendBufferSize_ResponseParams_Data>;

    TCPConnectedSocket_SetSendBufferSize_ResponseParams_Data();
    ~TCPConnectedSocket_SetSendBufferSize_ResponseParams_Data() = delete;
};
static_assert(sizeof(TCPConnectedSocket_SetSendBufferSize_ResponseParams_Data) == 16, "Bad sizeof(TCPConnectedSocket_SetSendBufferSize_ResponseParams_Data)");
class TCPConnectedSocket_SetReceiveBufferSize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t receive_buffer_size;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<TCPConnectedSocket_SetReceiveBufferSize_Params_Data>;

    TCPConnectedSocket_SetReceiveBufferSize_Params_Data();
    ~TCPConnectedSocket_SetReceiveBufferSize_Params_Data() = delete;
};
static_assert(sizeof(TCPConnectedSocket_SetReceiveBufferSize_Params_Data) == 16, "Bad sizeof(TCPConnectedSocket_SetReceiveBufferSize_Params_Data)");
class TCPConnectedSocket_SetReceiveBufferSize_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t net_error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<TCPConnectedSocket_SetReceiveBufferSize_ResponseParams_Data>;

    TCPConnectedSocket_SetReceiveBufferSize_ResponseParams_Data();
    ~TCPConnectedSocket_SetReceiveBufferSize_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(TCPConnectedSocket_SetReceiveBufferSize_ResponseParams_Data) == 16, "Bad sizeof(TCPConnectedSocket_SetReceiveBufferSize_ResponseParams_Data)");
class TCPConnectedSocket_SetNoDelay_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t no_delay : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<TCPConnectedSocket_SetNoDelay_Params_Data>;

    TCPConnectedSocket_SetNoDelay_Params_Data();
    ~TCPConnectedSocket_SetNoDelay_Params_Data() = delete;
};
static_assert(sizeof(TCPConnectedSocket_SetNoDelay_Params_Data) == 16, "Bad sizeof(TCPConnectedSocket_SetNoDelay_Params_Data)");
class TCPConnectedSocket_SetNoDelay_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<TCPConnectedSocket_SetNoDelay_ResponseParams_Data>;

    TCPConnectedSocket_SetNoDelay_ResponseParams_Data();
    ~TCPConnectedSocket_SetNoDelay_ResponseParams_Data() = delete;
};
static_assert(sizeof(TCPConnectedSocket_SetNoDelay_ResponseParams_Data) == 16, "Bad sizeof(TCPConnectedSocket_SetNoDelay_ResponseParams_Data)");
class TCPConnectedSocket_SetKeepAlive_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t enable : 1;
    uint8_t pad0_[3];
    int32_t delay_secs;

private:
    friend class mojo::internal::MessageFragment<TCPConnectedSocket_SetKeepAlive_Params_Data>;

    TCPConnectedSocket_SetKeepAlive_Params_Data();
    ~TCPConnectedSocket_SetKeepAlive_Params_Data() = delete;
};
static_assert(sizeof(TCPConnectedSocket_SetKeepAlive_Params_Data) == 16, "Bad sizeof(TCPConnectedSocket_SetKeepAlive_Params_Data)");
class TCPConnectedSocket_SetKeepAlive_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<TCPConnectedSocket_SetKeepAlive_ResponseParams_Data>;

    TCPConnectedSocket_SetKeepAlive_ResponseParams_Data();
    ~TCPConnectedSocket_SetKeepAlive_ResponseParams_Data() = delete;
};
static_assert(sizeof(TCPConnectedSocket_SetKeepAlive_ResponseParams_Data) == 16, "Bad sizeof(TCPConnectedSocket_SetKeepAlive_ResponseParams_Data)");
class SocketObserver_OnReadError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t net_error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SocketObserver_OnReadError_Params_Data>;

    SocketObserver_OnReadError_Params_Data();
    ~SocketObserver_OnReadError_Params_Data() = delete;
};
static_assert(sizeof(SocketObserver_OnReadError_Params_Data) == 16, "Bad sizeof(SocketObserver_OnReadError_Params_Data)");
class SocketObserver_OnWriteError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t net_error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SocketObserver_OnWriteError_Params_Data>;

    SocketObserver_OnWriteError_Params_Data();
    ~SocketObserver_OnWriteError_Params_Data() = delete;
};
static_assert(sizeof(SocketObserver_OnWriteError_Params_Data) == 16, "Bad sizeof(SocketObserver_OnWriteError_Params_Data)");
class TCPServerSocket_Accept_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data observer;

private:
    friend class mojo::internal::MessageFragment<TCPServerSocket_Accept_Params_Data>;

    TCPServerSocket_Accept_Params_Data();
    ~TCPServerSocket_Accept_Params_Data() = delete;
};
static_assert(sizeof(TCPServerSocket_Accept_Params_Data) == 16, "Bad sizeof(TCPServerSocket_Accept_Params_Data)");
class TCPServerSocket_Accept_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t net_error;
    mojo::internal::Handle_Data send_stream;
    mojo::internal::Pointer<::network::mojom::internal::IPEndPoint_Data> remote_addr;
    mojo::internal::Interface_Data connected_socket;
    mojo::internal::Handle_Data receive_stream;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<TCPServerSocket_Accept_ResponseParams_Data>;

    TCPServerSocket_Accept_ResponseParams_Data();
    ~TCPServerSocket_Accept_ResponseParams_Data() = delete;
};
static_assert(sizeof(TCPServerSocket_Accept_ResponseParams_Data) == 40, "Bad sizeof(TCPServerSocket_Accept_ResponseParams_Data)");

} // namespace internal

class TCPBoundSocket_Listen_ParamsDataView {
public:
    TCPBoundSocket_Listen_ParamsDataView() = default;

    TCPBoundSocket_Listen_ParamsDataView(internal::TCPBoundSocket_Listen_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    uint32_t backlog() const
    {
        return data_->backlog;
    }
    template <typename UserType> UserType TakeSocket()
    {
        UserType result;
        bool ret
            = mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::network::mojom::TCPServerSocketInterfaceBase>>(&data_->socket, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::TCPBoundSocket_Listen_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

