// services/network/public/mojom/url_loader_network_service_observer.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_NETWORK_PUBLIC_MOJOM_URL_LOADER_NETWORK_SERVICE_OBSERVER_MOJOM_PARAMS_DATA_H_
#define SERVICES_NETWORK_PUBLIC_MOJOM_URL_LOADER_NETWORK_SERVICE_OBSERVER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace network::mojom {
namespace internal {
class ClientCertificateResponder_ContinueWithCertificate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::X509Certificate_Data> x509_certificate;
    mojo::internal::Pointer<mojo::internal::String_Data> provider_name;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint16_t>> algorithm_preferences;
    mojo::internal::Interface_Data ssl_private_key;

private:
    friend class mojo::internal::MessageFragment<ClientCertificateResponder_ContinueWithCertificate_Params_Data>;

    ClientCertificateResponder_ContinueWithCertificate_Params_Data();
    ~ClientCertificateResponder_ContinueWithCertificate_Params_Data() = delete;
};
static_assert(
    sizeof(ClientCertificateResponder_ContinueWithCertificate_Params_Data) == 40, "Bad sizeof(ClientCertificateResponder_ContinueWithCertificate_Params_Data)");
class ClientCertificateResponder_ContinueWithoutCertificate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ClientCertificateResponder_ContinueWithoutCertificate_Params_Data>;

    ClientCertificateResponder_ContinueWithoutCertificate_Params_Data();
    ~ClientCertificateResponder_ContinueWithoutCertificate_Params_Data() = delete;
};
static_assert(sizeof(ClientCertificateResponder_ContinueWithoutCertificate_Params_Data) == 8,
    "Bad sizeof(ClientCertificateResponder_ContinueWithoutCertificate_Params_Data)");
class ClientCertificateResponder_CancelRequest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ClientCertificateResponder_CancelRequest_Params_Data>;

    ClientCertificateResponder_CancelRequest_Params_Data();
    ~ClientCertificateResponder_CancelRequest_Params_Data() = delete;
};
static_assert(sizeof(ClientCertificateResponder_CancelRequest_Params_Data) == 8, "Bad sizeof(ClientCertificateResponder_CancelRequest_Params_Data)");
class SSLPrivateKey_Sign_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint16_t algorithm;
    uint8_t pad0_[6];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> input;

private:
    friend class mojo::internal::MessageFragment<SSLPrivateKey_Sign_Params_Data>;

    SSLPrivateKey_Sign_Params_Data();
    ~SSLPrivateKey_Sign_Params_Data() = delete;
};
static_assert(sizeof(SSLPrivateKey_Sign_Params_Data) == 24, "Bad sizeof(SSLPrivateKey_Sign_Params_Data)");
class SSLPrivateKey_Sign_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t net_error;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> signature;

private:
    friend class mojo::internal::MessageFragment<SSLPrivateKey_Sign_ResponseParams_Data>;

    SSLPrivateKey_Sign_ResponseParams_Data();
    ~SSLPrivateKey_Sign_ResponseParams_Data() = delete;
};
static_assert(sizeof(SSLPrivateKey_Sign_ResponseParams_Data) == 24, "Bad sizeof(SSLPrivateKey_Sign_ResponseParams_Data)");
class AuthChallengeResponder_OnAuthCredentials_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::AuthCredentials_Data> credentials;

private:
    friend class mojo::internal::MessageFragment<AuthChallengeResponder_OnAuthCredentials_Params_Data>;

    AuthChallengeResponder_OnAuthCredentials_Params_Data();
    ~AuthChallengeResponder_OnAuthCredentials_Params_Data() = delete;
};
static_assert(sizeof(AuthChallengeResponder_OnAuthCredentials_Params_Data) == 16, "Bad sizeof(AuthChallengeResponder_OnAuthCredentials_Params_Data)");
class URLLoaderNetworkServiceObserver_OnSSLCertificateError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    int32_t net_error;
    uint8_t fatal : 1;
    uint8_t pad2_[3];
    mojo::internal::Pointer<::network::mojom::internal::SSLInfo_Data> ssl_info;

private:
    friend class mojo::internal::MessageFragment<URLLoaderNetworkServiceObserver_OnSSLCertificateError_Params_Data>;

    URLLoaderNetworkServiceObserver_OnSSLCertificateError_Params_Data();
    ~URLLoaderNetworkServiceObserver_OnSSLCertificateError_Params_Data() = delete;
};
static_assert(sizeof(URLLoaderNetworkServiceObserver_OnSSLCertificateError_Params_Data) == 32,
    "Bad sizeof(URLLoaderNetworkServiceObserver_OnSSLCertificateError_Params_Data)");
class URLLoaderNetworkServiceObserver_OnSSLCertificateError_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t net_error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<URLLoaderNetworkServiceObserver_OnSSLCertificateError_ResponseParams_Data>;

    URLLoaderNetworkServiceObserver_OnSSLCertificateError_ResponseParams_Data();
    ~URLLoaderNetworkServiceObserver_OnSSLCertificateError_ResponseParams_Data() = delete;
};
static_assert(sizeof(URLLoaderNetworkServiceObserver_OnSSLCertificateError_ResponseParams_Data) == 16,
    "Bad sizeof(URLLoaderNetworkServiceObserver_OnSSLCertificateError_ResponseParams_Data)");
class URLLoaderNetworkServiceObserver_OnCertificateRequested_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> window_id;
    mojo::internal::Pointer<::network::mojom::internal::SSLCertRequestInfo_Data> cert_info;
    mojo::internal::Interface_Data cert_responder;

private:
    friend class mojo::internal::MessageFragment<URLLoaderNetworkServiceObserver_OnCertificateRequested_Params_Data>;

    URLLoaderNetworkServiceObserver_OnCertificateRequested_Params_Data();
    ~URLLoaderNetworkServiceObserver_OnCertificateRequested_Params_Data() = delete;
};
static_assert(sizeof(URLLoaderNetworkServiceObserver_OnCertificateRequested_Params_Data) == 32,
    "Bad sizeof(URLLoaderNetworkServiceObserver_OnCertificateRequested_Params_Data)");
class URLLoaderNetworkServiceObserver_OnAuthRequired_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> window_id;
    int32_t request_id;
    uint8_t first_auth_attempt : 1;
    uint8_t pad2_[3];
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::network::mojom::internal::AuthChallengeInfo_Data> auth_info;
    mojo::internal::Pointer<::network::mojom::internal::HttpResponseHeaders_Data> head_headers;
    mojo::internal::Interface_Data auth_challenge_responder;

private:
    friend class mojo::internal::MessageFragment<URLLoaderNetworkServiceObserver_OnAuthRequired_Params_Data>;

    URLLoaderNetworkServiceObserver_OnAuthRequired_Params_Data();
    ~URLLoaderNetworkServiceObserver_OnAuthRequired_Params_Data() = delete;
};
static_assert(
    sizeof(URLLoaderNetworkServiceObserver_OnAuthRequired_Params_Data) == 56, "Bad sizeof(URLLoaderNetworkServiceObserver_OnAuthRequired_Params_Data)");
class URLLoaderNetworkServiceObserver_OnPrivateNetworkAccessPermissionRequired_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::network::mojom::internal::IPAddress_Data> ip_address;
    mojo::internal::Pointer<mojo::internal::String_Data> private_network_device_id;
    mojo::internal::Pointer<mojo::internal::String_Data> private_network_device_name;

private:
    friend class mojo::internal::MessageFragment<URLLoaderNetworkServiceObserver_OnPrivateNetworkAccessPermissionRequired_Params_Data>;

    URLLoaderNetworkServiceObserver_OnPrivateNetworkAccessPermissionRequired_Params_Data();
    ~URLLoaderNetworkServiceObserver_OnPrivateNetworkAccessPermissionRequired_Params_Data() = delete;
};
static_assert(sizeof(URLLoaderNetworkServiceObserver_OnPrivateNetworkAccessPermissionRequired_Params_Data) == 40,
    "Bad sizeof(URLLoaderNetworkServiceObserver_OnPrivateNetworkAccessPermissionRequired_Params_Data)");
class URLLoaderNetworkServiceObserver_OnPrivateNetworkAccessPermissionRequired_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t permission_granted : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<URLLoaderNetworkServiceObserver_OnPrivateNetworkAccessPermissionRequired_ResponseParams_Data>;

    URLLoaderNetworkServiceObserver_OnPrivateNetworkAccessPermissionRequired_ResponseParams_Data();
    ~URLLoaderNetworkServiceObserver_OnPrivateNetworkAccessPermissionRequired_ResponseParams_Data() = delete;
};
static_assert(sizeof(URLLoaderNetworkServiceObserver_OnPrivateNetworkAccessPermissionRequired_ResponseParams_Data) == 16,
    "Bad sizeof(URLLoaderNetworkServiceObserver_OnPrivateNetworkAccessPermissionRequired_ResponseParams_Data)");
class URLLoaderNetworkServiceObserver_OnClearSiteData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<mojo::internal::String_Data> header_value;
    int32_t load_flags;
    uint8_t partitioned_state_allowed_only : 1;
    uint8_t pad3_[3];
    mojo::internal::Pointer<::network::mojom::internal::CookiePartitionKey_Data> cookie_partition_key;

private:
    friend class mojo::internal::MessageFragment<URLLoaderNetworkServiceObserver_OnClearSiteData_Params_Data>;

    URLLoaderNetworkServiceObserver_OnClearSiteData_Params_Data();
    ~URLLoaderNetworkServiceObserver_OnClearSiteData_Params_Data() = delete;
};
static_assert(
    sizeof(URLLoaderNetworkServiceObserver_OnClearSiteData_Params_Data) == 40, "Bad sizeof(URLLoaderNetworkServiceObserver_OnClearSiteData_Params_Data)");
class URLLoaderNetworkServiceObserver_OnClearSiteData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<URLLoaderNetworkServiceObserver_OnClearSiteData_ResponseParams_Data>;

    URLLoaderNetworkServiceObserver_OnClearSiteData_ResponseParams_Data();
    ~URLLoaderNetworkServiceObserver_OnClearSiteData_ResponseParams_Data() = delete;
};
static_assert(sizeof(URLLoaderNetworkServiceObserver_OnClearSiteData_ResponseParams_Data) == 8,
    "Bad sizeof(URLLoaderNetworkServiceObserver_OnClearSiteData_ResponseParams_Data)");
class URLLoaderNetworkServiceObserver_OnLoadingStateUpdate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::LoadInfo_Data> info;

private:
    friend class mojo::internal::MessageFragment<URLLoaderNetworkServiceObserver_OnLoadingStateUpdate_Params_Data>;

    URLLoaderNetworkServiceObserver_OnLoadingStateUpdate_Params_Data();
    ~URLLoaderNetworkServiceObserver_OnLoadingStateUpdate_Params_Data() = delete;
};
static_assert(sizeof(URLLoaderNetworkServiceObserver_OnLoadingStateUpdate_Params_Data) == 16,
    "Bad sizeof(URLLoaderNetworkServiceObserver_OnLoadingStateUpdate_Params_Data)");
class URLLoaderNetworkServiceObserver_OnLoadingStateUpdate_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<URLLoaderNetworkServiceObserver_OnLoadingStateUpdate_ResponseParams_Data>;

    URLLoaderNetworkServiceObserver_OnLoadingStateUpdate_ResponseParams_Data();
    ~URLLoaderNetworkServiceObserver_OnLoadingStateUpdate_ResponseParams_Data() = delete;
};
static_assert(sizeof(URLLoaderNetworkServiceObserver_OnLoadingStateUpdate_ResponseParams_Data) == 8,
    "Bad sizeof(URLLoaderNetworkServiceObserver_OnLoadingStateUpdate_ResponseParams_Data)");
class URLLoaderNetworkServiceObserver_OnDataUseUpdate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t network_traffic_annotation_id_hash;
    uint8_t pad0_[4];
    int64_t recv_bytes;
    int64_t sent_bytes;

private:
    friend class mojo::internal::MessageFragment<URLLoaderNetworkServiceObserver_OnDataUseUpdate_Params_Data>;

    URLLoaderNetworkServiceObserver_OnDataUseUpdate_Params_Data();
    ~URLLoaderNetworkServiceObserver_OnDataUseUpdate_Params_Data() = delete;
};
static_assert(
    sizeof(URLLoaderNetworkServiceObserver_OnDataUseUpdate_Params_Data) == 32, "Bad sizeof(URLLoaderNetworkServiceObserver_OnDataUseUpdate_Params_Data)");
class URLLoaderNetworkServiceObserver_OnSharedStorageHeaderReceived_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> request_origin;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::SharedStorageOperation_Data>>> operations;

private:
    friend class mojo::internal::MessageFragment<URLLoaderNetworkServiceObserver_OnSharedStorageHeaderReceived_Params_Data>;

    URLLoaderNetworkServiceObserver_OnSharedStorageHeaderReceived_Params_Data();
    ~URLLoaderNetworkServiceObserver_OnSharedStorageHeaderReceived_Params_Data() = delete;
};
static_assert(sizeof(URLLoaderNetworkServiceObserver_OnSharedStorageHeaderReceived_Params_Data) == 24,
    "Bad sizeof(URLLoaderNetworkServiceObserver_OnSharedStorageHeaderReceived_Params_Data)");
class URLLoaderNetworkServiceObserver_OnSharedStorageHeaderReceived_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<URLLoaderNetworkServiceObserver_OnSharedStorageHeaderReceived_ResponseParams_Data>;

    URLLoaderNetworkServiceObserver_OnSharedStorageHeaderReceived_ResponseParams_Data();
    ~URLLoaderNetworkServiceObserver_OnSharedStorageHeaderReceived_ResponseParams_Data() = delete;
};
static_assert(sizeof(URLLoaderNetworkServiceObserver_OnSharedStorageHeaderReceived_ResponseParams_Data) == 8,
    "Bad sizeof(URLLoaderNetworkServiceObserver_OnSharedStorageHeaderReceived_ResponseParams_Data)");
class URLLoaderNetworkServiceObserver_Clone_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data listener;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<URLLoaderNetworkServiceObserver_Clone_Params_Data>;

    URLLoaderNetworkServiceObserver_Clone_Params_Data();
    ~URLLoaderNetworkServiceObserver_Clone_Params_Data() = delete;
};
static_assert(sizeof(URLLoaderNetworkServiceObserver_Clone_Params_Data) == 16, "Bad sizeof(URLLoaderNetworkServiceObserver_Clone_Params_Data)");
class URLLoaderNetworkServiceObserver_OnWebSocketConnectedToPrivateNetwork_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t ip_address_space;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<URLLoaderNetworkServiceObserver_OnWebSocketConnectedToPrivateNetwork_Params_Data>;

    URLLoaderNetworkServiceObserver_OnWebSocketConnectedToPrivateNetwork_Params_Data();
    ~URLLoaderNetworkServiceObserver_OnWebSocketConnectedToPrivateNetwork_Params_Data() = delete;
};
static_assert(sizeof(URLLoaderNetworkServiceObserver_OnWebSocketConnectedToPrivateNetwork_Params_Data) == 16,
    "Bad sizeof(URLLoaderNetworkServiceObserver_OnWebSocketConnectedToPrivateNetwork_Params_Data)");

} // namespace internal

class ClientCertificateResponder_ContinueWithCertificate_ParamsDataView {
public:
    ClientCertificateResponder_ContinueWithCertificate_ParamsDataView() = default;

    ClientCertificateResponder_ContinueWithCertificate_ParamsDataView(
        internal::ClientCertificateResponder_ContinueWithCertificate_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetX509CertificateDataView(::network::mojom::X509CertificateDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadX509Certificate(UserType* output)
    {

        auto* pointer = data_->x509_certificate.Get();
