// services/network/public/mojom/web_transport.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_NETWORK_PUBLIC_MOJOM_WEB_TRANSPORT_MOJOM_PARAMS_DATA_H_
#define SERVICES_NETWORK_PUBLIC_MOJOM_WEB_TRANSPORT_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace network::mojom {
namespace internal {
class WebTransport_SendDatagram_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> data;

private:
    friend class mojo::internal::MessageFragment<WebTransport_SendDatagram_Params_Data>;

    WebTransport_SendDatagram_Params_Data();
    ~WebTransport_SendDatagram_Params_Data() = delete;
};
static_assert(sizeof(WebTransport_SendDatagram_Params_Data) == 16, "Bad sizeof(WebTransport_SendDatagram_Params_Data)");
class WebTransport_SendDatagram_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<WebTransport_SendDatagram_ResponseParams_Data>;

    WebTransport_SendDatagram_ResponseParams_Data();
    ~WebTransport_SendDatagram_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebTransport_SendDatagram_ResponseParams_Data) == 16, "Bad sizeof(WebTransport_SendDatagram_ResponseParams_Data)");
class WebTransport_CreateStream_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data readable;
    mojo::internal::Handle_Data writable;

private:
    friend class mojo::internal::MessageFragment<WebTransport_CreateStream_Params_Data>;

    WebTransport_CreateStream_Params_Data();
    ~WebTransport_CreateStream_Params_Data() = delete;
};
static_assert(sizeof(WebTransport_CreateStream_Params_Data) == 16, "Bad sizeof(WebTransport_CreateStream_Params_Data)");
class WebTransport_CreateStream_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t succeeded : 1;
    uint8_t pad0_[3];
    uint32_t stream_id;

private:
    friend class mojo::internal::MessageFragment<WebTransport_CreateStream_ResponseParams_Data>;

    WebTransport_CreateStream_ResponseParams_Data();
    ~WebTransport_CreateStream_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebTransport_CreateStream_ResponseParams_Data) == 16, "Bad sizeof(WebTransport_CreateStream_ResponseParams_Data)");
class WebTransport_AcceptBidirectionalStream_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WebTransport_AcceptBidirectionalStream_Params_Data>;

    WebTransport_AcceptBidirectionalStream_Params_Data();
    ~WebTransport_AcceptBidirectionalStream_Params_Data() = delete;
};
static_assert(sizeof(WebTransport_AcceptBidirectionalStream_Params_Data) == 8, "Bad sizeof(WebTransport_AcceptBidirectionalStream_Params_Data)");
class WebTransport_AcceptBidirectionalStream_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t stream_id;
    mojo::internal::Handle_Data readable;
    mojo::internal::Handle_Data writable;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WebTransport_AcceptBidirectionalStream_ResponseParams_Data>;

    WebTransport_AcceptBidirectionalStream_ResponseParams_Data();
    ~WebTransport_AcceptBidirectionalStream_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(WebTransport_AcceptBidirectionalStream_ResponseParams_Data) == 24, "Bad sizeof(WebTransport_AcceptBidirectionalStream_ResponseParams_Data)");
class WebTransport_AcceptUnidirectionalStream_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WebTransport_AcceptUnidirectionalStream_Params_Data>;

    WebTransport_AcceptUnidirectionalStream_Params_Data();
    ~WebTransport_AcceptUnidirectionalStream_Params_Data() = delete;
};
static_assert(sizeof(WebTransport_AcceptUnidirectionalStream_Params_Data) == 8, "Bad sizeof(WebTransport_AcceptUnidirectionalStream_Params_Data)");
class WebTransport_AcceptUnidirectionalStream_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t stream_id;
    mojo::internal::Handle_Data readable;

private:
    friend class mojo::internal::MessageFragment<WebTransport_AcceptUnidirectionalStream_ResponseParams_Data>;

    WebTransport_AcceptUnidirectionalStream_ResponseParams_Data();
    ~WebTransport_AcceptUnidirectionalStream_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(WebTransport_AcceptUnidirectionalStream_ResponseParams_Data) == 16, "Bad sizeof(WebTransport_AcceptUnidirectionalStream_ResponseParams_Data)");
class WebTransport_SendFin_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t stream_id;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WebTransport_SendFin_Params_Data>;

    WebTransport_SendFin_Params_Data();
    ~WebTransport_SendFin_Params_Data() = delete;
};
static_assert(sizeof(WebTransport_SendFin_Params_Data) == 16, "Bad sizeof(WebTransport_SendFin_Params_Data)");
class WebTransport_AbortStream_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t stream_id;
    uint8_t code;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<WebTransport_AbortStream_Params_Data>;

    WebTransport_AbortStream_Params_Data();
    ~WebTransport_AbortStream_Params_Data() = delete;
};
static_assert(sizeof(WebTransport_AbortStream_Params_Data) == 16, "Bad sizeof(WebTransport_AbortStream_Params_Data)");
class WebTransport_StopSending_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t stream_id;
    uint8_t code;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<WebTransport_StopSending_Params_Data>;

    WebTransport_StopSending_Params_Data();
    ~WebTransport_StopSending_Params_Data() = delete;
};
static_assert(sizeof(WebTransport_StopSending_Params_Data) == 16, "Bad sizeof(WebTransport_StopSending_Params_Data)");
class WebTransport_SetOutgoingDatagramExpirationDuration_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> duration;

private:
    friend class mojo::internal::MessageFragment<WebTransport_SetOutgoingDatagramExpirationDuration_Params_Data>;

    WebTransport_SetOutgoingDatagramExpirationDuration_Params_Data();
    ~WebTransport_SetOutgoingDatagramExpirationDuration_Params_Data() = delete;
};
static_assert(
    sizeof(WebTransport_SetOutgoingDatagramExpirationDuration_Params_Data) == 16, "Bad sizeof(WebTransport_SetOutgoingDatagramExpirationDuration_Params_Data)");
class WebTransport_GetStats_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WebTransport_GetStats_Params_Data>;

    WebTransport_GetStats_Params_Data();
    ~WebTransport_GetStats_Params_Data() = delete;
};
static_assert(sizeof(WebTransport_GetStats_Params_Data) == 8, "Bad sizeof(WebTransport_GetStats_Params_Data)");
class WebTransport_GetStats_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::WebTransportStats_Data> stats;

private:
    friend class mojo::internal::MessageFragment<WebTransport_GetStats_ResponseParams_Data>;

    WebTransport_GetStats_ResponseParams_Data();
    ~WebTransport_GetStats_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebTransport_GetStats_ResponseParams_Data) == 16, "Bad sizeof(WebTransport_GetStats_ResponseParams_Data)");
class WebTransport_Close_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::WebTransportCloseInfo_Data> close_info;

private:
    friend class mojo::internal::MessageFragment<WebTransport_Close_Params_Data>;

    WebTransport_Close_Params_Data();
    ~WebTransport_Close_Params_Data() = delete;
};
static_assert(sizeof(WebTransport_Close_Params_Data) == 16, "Bad sizeof(WebTransport_Close_Params_Data)");
class WebTransportClient_OnDatagramReceived_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> data;

private:
    friend class mojo::internal::MessageFragment<WebTransportClient_OnDatagramReceived_Params_Data>;

    WebTransportClient_OnDatagramReceived_Params_Data();
    ~WebTransportClient_OnDatagramReceived_Params_Data() = delete;
};
static_assert(sizeof(WebTransportClient_OnDatagramReceived_Params_Data) == 16, "Bad sizeof(WebTransportClient_OnDatagramReceived_Params_Data)");
class WebTransportClient_OnIncomingStreamClosed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t stream_id;
    uint8_t fin_received : 1;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<WebTransportClient_OnIncomingStreamClosed_Params_Data>;

    WebTransportClient_OnIncomingStreamClosed_Params_Data();
    ~WebTransportClient_OnIncomingStreamClosed_Params_Data() = delete;
};
static_assert(sizeof(WebTransportClient_OnIncomingStreamClosed_Params_Data) == 16, "Bad sizeof(WebTransportClient_OnIncomingStreamClosed_Params_Data)");
class WebTransportClient_OnOutgoingStreamClosed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t stream_id;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WebTransportClient_OnOutgoingStreamClosed_Params_Data>;

    WebTransportClient_OnOutgoingStreamClosed_Params_Data();
    ~WebTransportClient_OnOutgoingStreamClosed_Params_Data() = delete;
};
static_assert(sizeof(WebTransportClient_OnOutgoingStreamClosed_Params_Data) == 16, "Bad sizeof(WebTransportClient_OnOutgoingStreamClosed_Params_Data)");
class WebTransportClient_OnReceivedStopSending_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t stream_id;
    uint32_t stream_error_code;

private:
    friend class mojo::internal::MessageFragment<WebTransportClient_OnReceivedStopSending_Params_Data>;

    WebTransportClient_OnReceivedStopSending_Params_Data();
    ~WebTransportClient_OnReceivedStopSending_Params_Data() = delete;
};
static_assert(sizeof(WebTransportClient_OnReceivedStopSending_Params_Data) == 16, "Bad sizeof(WebTransportClient_OnReceivedStopSending_Params_Data)");
class WebTransportClient_OnReceivedResetStream_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t stream_id;
    uint32_t stream_error_code;

private:
    friend class mojo::internal::MessageFragment<WebTransportClient_OnReceivedResetStream_Params_Data>;

    WebTransportClient_OnReceivedResetStream_Params_Data();
    ~WebTransportClient_OnReceivedResetStream_Params_Data() = delete;
};
static_assert(sizeof(WebTransportClient_OnReceivedResetStream_Params_Data) == 16, "Bad sizeof(WebTransportClient_OnReceivedResetStream_Params_Data)");
class WebTransportClient_OnClosed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::WebTransportCloseInfo_Data> close_info;
    mojo::internal::Pointer<internal::WebTransportStats_Data> final_stats;

private:
    friend class mojo::internal::MessageFragment<WebTransportClient_OnClosed_Params_Data>;

    WebTransportClient_OnClosed_Params_Data();
    ~WebTransportClient_OnClosed_Params_Data() = delete;
};
static_assert(sizeof(WebTransportClient_OnClosed_Params_Data) == 24, "Bad sizeof(WebTransportClient_OnClosed_Params_Data)");
class WebTransportHandshakeClient_OnConnectionEstablished_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data transport;
    mojo::internal::Handle_Data client;
    uint8_t pad1_[4];
    mojo::internal::Pointer<::network::mojom::internal::HttpResponseHeaders_Data> response_headers;
    mojo::internal::Pointer<internal::WebTransportStats_Data> initial_stats;

private:
    friend class mojo::internal::MessageFragment<WebTransportHandshakeClient_OnConnectionEstablished_Params_Data>;

    WebTransportHandshakeClient_OnConnectionEstablished_Params_Data();
    ~WebTransportHandshakeClient_OnConnectionEstablished_Params_Data() = delete;
};
static_assert(sizeof(WebTransportHandshakeClient_OnConnectionEstablished_Params_Data) == 40,
    "Bad sizeof(WebTransportHandshakeClient_OnConnectionEstablished_Params_Data)");
class WebTransportHandshakeClient_OnHandshakeFailed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::WebTransportError_Data> error;

private:
    friend class mojo::internal::MessageFragment<WebTransportHandshakeClient_OnHandshakeFailed_Params_Data>;

    WebTransportHandshakeClient_OnHandshakeFailed_Params_Data();
    ~WebTransportHandshakeClient_OnHandshakeFailed_Params_Data() = delete;
};
static_assert(sizeof(WebTransportHandshakeClient_OnHandshakeFailed_Params_Data) == 16, "Bad sizeof(WebTransportHandshakeClient_OnHandshakeFailed_Params_Data)");

} // namespace internal

class WebTransport_SendDatagram_ParamsDataView {
public:
    WebTransport_SendDatagram_ParamsDataView() = default;

    WebTransport_SendDatagram_ParamsDataView(internal::WebTransport_SendDatagram_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetDataDataView(::mojo_base::mojom::ReadOnlyBufferDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadData(UserType* output)
    {

        auto* pointer = data_->data.Get();
        return mojo::internal::Deserialize<::mojo_base::mojom::ReadOnlyBufferDataView>(pointer, output, message_);
    }

private:
    internal::WebTransport_SendDatagram_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
