// third_party/blink/public/mojom/cache_storage/cache_storage.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_CACHE_STORAGE_CACHE_STORAGE_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_CACHE_STORAGE_CACHE_STORAGE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorageCache_Match_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FetchAPIRequest_Data> request;
    mojo::internal::Pointer<internal::CacheQueryOptions_Data> query_options;
    uint8_t in_related_fetch_event : 1;
    uint8_t in_range_fetch_event : 1;
    uint8_t pad3_[7];
    int64_t trace_id;

private:
    friend class mojo::internal::MessageFragment<CacheStorageCache_Match_Params_Data>;

    CacheStorageCache_Match_Params_Data();
    ~CacheStorageCache_Match_Params_Data() = delete;
};
static_assert(sizeof(CacheStorageCache_Match_Params_Data) == 40, "Bad sizeof(CacheStorageCache_Match_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorageCache_Match_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::MatchResult_Data result;

private:
    friend class mojo::internal::MessageFragment<CacheStorageCache_Match_ResponseParams_Data>;

    CacheStorageCache_Match_ResponseParams_Data();
    ~CacheStorageCache_Match_ResponseParams_Data() = delete;
};
static_assert(sizeof(CacheStorageCache_Match_ResponseParams_Data) == 24, "Bad sizeof(CacheStorageCache_Match_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorageCache_MatchAll_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FetchAPIRequest_Data> request;
    mojo::internal::Pointer<internal::CacheQueryOptions_Data> query_options;
    int64_t trace_id;

private:
    friend class mojo::internal::MessageFragment<CacheStorageCache_MatchAll_Params_Data>;

    CacheStorageCache_MatchAll_Params_Data();
    ~CacheStorageCache_MatchAll_Params_Data() = delete;
};
static_assert(sizeof(CacheStorageCache_MatchAll_Params_Data) == 32, "Bad sizeof(CacheStorageCache_MatchAll_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorageCache_MatchAll_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::MatchAllResult_Data result;

private:
    friend class mojo::internal::MessageFragment<CacheStorageCache_MatchAll_ResponseParams_Data>;

    CacheStorageCache_MatchAll_ResponseParams_Data();
    ~CacheStorageCache_MatchAll_ResponseParams_Data() = delete;
};
static_assert(sizeof(CacheStorageCache_MatchAll_ResponseParams_Data) == 24, "Bad sizeof(CacheStorageCache_MatchAll_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorageCache_GetAllMatchedEntries_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FetchAPIRequest_Data> request;
    mojo::internal::Pointer<internal::CacheQueryOptions_Data> query_options;
    int64_t trace_id;

private:
    friend class mojo::internal::MessageFragment<CacheStorageCache_GetAllMatchedEntries_Params_Data>;

    CacheStorageCache_GetAllMatchedEntries_Params_Data();
    ~CacheStorageCache_GetAllMatchedEntries_Params_Data() = delete;
};
static_assert(sizeof(CacheStorageCache_GetAllMatchedEntries_Params_Data) == 32, "Bad sizeof(CacheStorageCache_GetAllMatchedEntries_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorageCache_GetAllMatchedEntries_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::GetAllMatchedEntriesResult_Data result;

private:
    friend class mojo::internal::MessageFragment<CacheStorageCache_GetAllMatchedEntries_ResponseParams_Data>;

    CacheStorageCache_GetAllMatchedEntries_ResponseParams_Data();
    ~CacheStorageCache_GetAllMatchedEntries_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(CacheStorageCache_GetAllMatchedEntries_ResponseParams_Data) == 24, "Bad sizeof(CacheStorageCache_GetAllMatchedEntries_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorageCache_Keys_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FetchAPIRequest_Data> request;
    mojo::internal::Pointer<internal::CacheQueryOptions_Data> query_options;
    int64_t trace_id;

private:
    friend class mojo::internal::MessageFragment<CacheStorageCache_Keys_Params_Data>;

    CacheStorageCache_Keys_Params_Data();
    ~CacheStorageCache_Keys_Params_Data() = delete;
};
static_assert(sizeof(CacheStorageCache_Keys_Params_Data) == 32, "Bad sizeof(CacheStorageCache_Keys_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorageCache_Keys_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::CacheKeysResult_Data result;

private:
    friend class mojo::internal::MessageFragment<CacheStorageCache_Keys_ResponseParams_Data>;

    CacheStorageCache_Keys_ResponseParams_Data();
    ~CacheStorageCache_Keys_ResponseParams_Data() = delete;
};
static_assert(sizeof(CacheStorageCache_Keys_ResponseParams_Data) == 24, "Bad sizeof(CacheStorageCache_Keys_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorageCache_Batch_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::BatchOperation_Data>>> batch_operations;
    int64_t trace_id;

private:
    friend class mojo::internal::MessageFragment<CacheStorageCache_Batch_Params_Data>;

    CacheStorageCache_Batch_Params_Data();
    ~CacheStorageCache_Batch_Params_Data() = delete;
};
static_assert(sizeof(CacheStorageCache_Batch_Params_Data) == 24, "Bad sizeof(CacheStorageCache_Batch_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorageCache_Batch_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CacheStorageVerboseError_Data> result;

private:
    friend class mojo::internal::MessageFragment<CacheStorageCache_Batch_ResponseParams_Data>;

    CacheStorageCache_Batch_ResponseParams_Data();
    ~CacheStorageCache_Batch_ResponseParams_Data() = delete;
};
static_assert(sizeof(CacheStorageCache_Batch_ResponseParams_Data) == 16, "Bad sizeof(CacheStorageCache_Batch_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorageCache_WriteSideData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> expected_response_time;
    ::mojo_base::mojom::internal::BigBuffer_Data data;
    int64_t trace_id;

private:
    friend class mojo::internal::MessageFragment<CacheStorageCache_WriteSideData_Params_Data>;

    CacheStorageCache_WriteSideData_Params_Data();
    ~CacheStorageCache_WriteSideData_Params_Data() = delete;
};
static_assert(sizeof(CacheStorageCache_WriteSideData_Params_Data) == 48, "Bad sizeof(CacheStorageCache_WriteSideData_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorageCache_WriteSideData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CacheStorageCache_WriteSideData_ResponseParams_Data>;

    CacheStorageCache_WriteSideData_ResponseParams_Data();
    ~CacheStorageCache_WriteSideData_ResponseParams_Data() = delete;
};
static_assert(sizeof(CacheStorageCache_WriteSideData_ResponseParams_Data) == 16, "Bad sizeof(CacheStorageCache_WriteSideData_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorage_Has_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> cache_name;
    int64_t trace_id;

private:
    friend class mojo::internal::MessageFragment<CacheStorage_Has_Params_Data>;

    CacheStorage_Has_Params_Data();
    ~CacheStorage_Has_Params_Data() = delete;
};
static_assert(sizeof(CacheStorage_Has_Params_Data) == 24, "Bad sizeof(CacheStorage_Has_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorage_Has_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CacheStorage_Has_ResponseParams_Data>;

    CacheStorage_Has_ResponseParams_Data();
    ~CacheStorage_Has_ResponseParams_Data() = delete;
};
static_assert(sizeof(CacheStorage_Has_ResponseParams_Data) == 16, "Bad sizeof(CacheStorage_Has_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorage_Delete_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> cache_name;
    int64_t trace_id;

private:
    friend class mojo::internal::MessageFragment<CacheStorage_Delete_Params_Data>;

    CacheStorage_Delete_Params_Data();
    ~CacheStorage_Delete_Params_Data() = delete;
};
static_assert(sizeof(CacheStorage_Delete_Params_Data) == 24, "Bad sizeof(CacheStorage_Delete_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorage_Delete_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CacheStorage_Delete_ResponseParams_Data>;

    CacheStorage_Delete_ResponseParams_Data();
    ~CacheStorage_Delete_ResponseParams_Data() = delete;
};
static_assert(sizeof(CacheStorage_Delete_ResponseParams_Data) == 16, "Bad sizeof(CacheStorage_Delete_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorage_Keys_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t trace_id;

private:
    friend class mojo::internal::MessageFragment<CacheStorage_Keys_Params_Data>;

    CacheStorage_Keys_Params_Data();
    ~CacheStorage_Keys_Params_Data() = delete;
};
static_assert(sizeof(CacheStorage_Keys_Params_Data) == 16, "Bad sizeof(CacheStorage_Keys_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorage_Keys_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data>>> keys;

private:
    friend class mojo::internal::MessageFragment<CacheStorage_Keys_ResponseParams_Data>;

    CacheStorage_Keys_ResponseParams_Data();
    ~CacheStorage_Keys_ResponseParams_Data() = delete;
};
static_assert(sizeof(CacheStorage_Keys_ResponseParams_Data) == 16, "Bad sizeof(CacheStorage_Keys_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorage_Match_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FetchAPIRequest_Data> request;
    mojo::internal::Pointer<internal::MultiCacheQueryOptions_Data> match_options;
    uint8_t in_related_fetch_event : 1;
    uint8_t in_range_fetch_event : 1;
    uint8_t pad3_[7];
    int64_t trace_id;

private:
    friend class mojo::internal::MessageFragment<CacheStorage_Match_Params_Data>;

    CacheStorage_Match_Params_Data();
    ~CacheStorage_Match_Params_Data() = delete;
};
static_assert(sizeof(CacheStorage_Match_Params_Data) == 40, "Bad sizeof(CacheStorage_Match_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorage_Match_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::MatchResult_Data result;

private:
    friend class mojo::internal::MessageFragment<CacheStorage_Match_ResponseParams_Data>;

    CacheStorage_Match_ResponseParams_Data();
    ~CacheStorage_Match_ResponseParams_Data() = delete;
};
static_assert(sizeof(CacheStorage_Match_ResponseParams_Data) == 24, "Bad sizeof(CacheStorage_Match_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorage_Open_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> cache_name;
    int64_t trace_id;

private:
    friend class mojo::internal::MessageFragment<CacheStorage_Open_Params_Data>;

    CacheStorage_Open_Params_Data();
    ~CacheStorage_Open_Params_Data() = delete;
};
static_assert(sizeof(CacheStorage_Open_Params_Data) == 24, "Bad sizeof(CacheStorage_Open_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CacheStorage_Open_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::OpenResult_Data result;

private:
    friend class mojo::internal::MessageFragment<CacheStorage_Open_ResponseParams_Data>;

    CacheStorage_Open_ResponseParams_Data();
    ~CacheStorage_Open_ResponseParams_Data() = delete;
};
static_assert(sizeof(CacheStorage_Open_ResponseParams_Data) == 24, "Bad sizeof(CacheStorage_Open_ResponseParams_Data)");

} // namespace internal

class CacheStorageCache_Match_ParamsDataView {
public:
    CacheStorageCache_Match_ParamsDataView() = default;

    CacheStorageCache_Match_ParamsDataView(internal::CacheStorageCache_Match_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetRequestDataView(::blink::mojom::FetchAPIRequestDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadRequest(UserType* output)
    {

        auto* pointer = data_->request.Get();
        return mojo::internal::Deserialize<::blink::mojom::FetchAPIRequestDataView>(pointer, output, message_);
    }
    inline void GetQueryOptionsDataView(CacheQueryOptionsDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadQueryOptions(UserType* output)
