// services/device/public/mojom/fingerprint.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_DEVICE_PUBLIC_MOJOM_FINGERPRINT_MOJOM_PARAMS_DATA_H_
#define SERVICES_DEVICE_PUBLIC_MOJOM_FINGERPRINT_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace device::mojom {
namespace internal {
class FingerprintObserver_OnRestarted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FingerprintObserver_OnRestarted_Params_Data>;

    FingerprintObserver_OnRestarted_Params_Data();
    ~FingerprintObserver_OnRestarted_Params_Data() = delete;
};
static_assert(sizeof(FingerprintObserver_OnRestarted_Params_Data) == 8, "Bad sizeof(FingerprintObserver_OnRestarted_Params_Data)");
class FingerprintObserver_OnStatusChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FingerprintObserver_OnStatusChanged_Params_Data>;

    FingerprintObserver_OnStatusChanged_Params_Data();
    ~FingerprintObserver_OnStatusChanged_Params_Data() = delete;
};
static_assert(sizeof(FingerprintObserver_OnStatusChanged_Params_Data) == 16, "Bad sizeof(FingerprintObserver_OnStatusChanged_Params_Data)");
class FingerprintObserver_OnEnrollScanDone_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t scan_result;
    uint8_t is_complete : 1;
    uint8_t pad1_[3];
    int32_t percent_complete;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FingerprintObserver_OnEnrollScanDone_Params_Data>;

    FingerprintObserver_OnEnrollScanDone_Params_Data();
    ~FingerprintObserver_OnEnrollScanDone_Params_Data() = delete;
};
static_assert(sizeof(FingerprintObserver_OnEnrollScanDone_Params_Data) == 24, "Bad sizeof(FingerprintObserver_OnEnrollScanDone_Params_Data)");
class FingerprintObserver_OnAuthScanDone_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::FingerprintMessage_Data msg;
    mojo::internal::Pointer<mojo::internal::Map_Data<mojo::internal::Pointer<mojo::internal::String_Data>,
        mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>>>>
        matches;

private:
    friend class mojo::internal::MessageFragment<FingerprintObserver_OnAuthScanDone_Params_Data>;

    FingerprintObserver_OnAuthScanDone_Params_Data();
    ~FingerprintObserver_OnAuthScanDone_Params_Data() = delete;
};
static_assert(sizeof(FingerprintObserver_OnAuthScanDone_Params_Data) == 32, "Bad sizeof(FingerprintObserver_OnAuthScanDone_Params_Data)");
class FingerprintObserver_OnSessionFailed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FingerprintObserver_OnSessionFailed_Params_Data>;

    FingerprintObserver_OnSessionFailed_Params_Data();
    ~FingerprintObserver_OnSessionFailed_Params_Data() = delete;
};
static_assert(sizeof(FingerprintObserver_OnSessionFailed_Params_Data) == 8, "Bad sizeof(FingerprintObserver_OnSessionFailed_Params_Data)");
class Fingerprint_GetRecordsForUser_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> user_id;

private:
    friend class mojo::internal::MessageFragment<Fingerprint_GetRecordsForUser_Params_Data>;

    Fingerprint_GetRecordsForUser_Params_Data();
    ~Fingerprint_GetRecordsForUser_Params_Data() = delete;
};
static_assert(sizeof(Fingerprint_GetRecordsForUser_Params_Data) == 16, "Bad sizeof(Fingerprint_GetRecordsForUser_Params_Data)");
class Fingerprint_GetRecordsForUser_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<
        mojo::internal::Map_Data<mojo::internal::Pointer<mojo::internal::String_Data>, mojo::internal::Pointer<mojo::internal::String_Data>>>
        records;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<Fingerprint_GetRecordsForUser_ResponseParams_Data>;

    Fingerprint_GetRecordsForUser_ResponseParams_Data();
    ~Fingerprint_GetRecordsForUser_ResponseParams_Data() = delete;
};
static_assert(sizeof(Fingerprint_GetRecordsForUser_ResponseParams_Data) == 24, "Bad sizeof(Fingerprint_GetRecordsForUser_ResponseParams_Data)");
class Fingerprint_StartEnrollSession_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> user_id;
    mojo::internal::Pointer<mojo::internal::String_Data> label;

private:
    friend class mojo::internal::MessageFragment<Fingerprint_StartEnrollSession_Params_Data>;

    Fingerprint_StartEnrollSession_Params_Data();
    ~Fingerprint_StartEnrollSession_Params_Data() = delete;
};
static_assert(sizeof(Fingerprint_StartEnrollSession_Params_Data) == 24, "Bad sizeof(Fingerprint_StartEnrollSession_Params_Data)");
class Fingerprint_CancelCurrentEnrollSession_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<Fingerprint_CancelCurrentEnrollSession_Params_Data>;

    Fingerprint_CancelCurrentEnrollSession_Params_Data();
    ~Fingerprint_CancelCurrentEnrollSession_Params_Data() = delete;
};
static_assert(sizeof(Fingerprint_CancelCurrentEnrollSession_Params_Data) == 8, "Bad sizeof(Fingerprint_CancelCurrentEnrollSession_Params_Data)");
class Fingerprint_CancelCurrentEnrollSession_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<Fingerprint_CancelCurrentEnrollSession_ResponseParams_Data>;

    Fingerprint_CancelCurrentEnrollSession_ResponseParams_Data();
    ~Fingerprint_CancelCurrentEnrollSession_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(Fingerprint_CancelCurrentEnrollSession_ResponseParams_Data) == 16, "Bad sizeof(Fingerprint_CancelCurrentEnrollSession_ResponseParams_Data)");
class Fingerprint_RequestRecordLabel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> record_path;

private:
    friend class mojo::internal::MessageFragment<Fingerprint_RequestRecordLabel_Params_Data>;

    Fingerprint_RequestRecordLabel_Params_Data();
    ~Fingerprint_RequestRecordLabel_Params_Data() = delete;
};
static_assert(sizeof(Fingerprint_RequestRecordLabel_Params_Data) == 16, "Bad sizeof(Fingerprint_RequestRecordLabel_Params_Data)");
class Fingerprint_RequestRecordLabel_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> label;

private:
    friend class mojo::internal::MessageFragment<Fingerprint_RequestRecordLabel_ResponseParams_Data>;

    Fingerprint_RequestRecordLabel_ResponseParams_Data();
    ~Fingerprint_RequestRecordLabel_ResponseParams_Data() = delete;
};
static_assert(sizeof(Fingerprint_RequestRecordLabel_ResponseParams_Data) == 16, "Bad sizeof(Fingerprint_RequestRecordLabel_ResponseParams_Data)");
class Fingerprint_SetRecordLabel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> record_path;
    mojo::internal::Pointer<mojo::internal::String_Data> new_label;

private:
    friend class mojo::internal::MessageFragment<Fingerprint_SetRecordLabel_Params_Data>;

    Fingerprint_SetRecordLabel_Params_Data();
    ~Fingerprint_SetRecordLabel_Params_Data() = delete;
};
static_assert(sizeof(Fingerprint_SetRecordLabel_Params_Data) == 24, "Bad sizeof(Fingerprint_SetRecordLabel_Params_Data)");
class Fingerprint_SetRecordLabel_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<Fingerprint_SetRecordLabel_ResponseParams_Data>;

    Fingerprint_SetRecordLabel_ResponseParams_Data();
    ~Fingerprint_SetRecordLabel_ResponseParams_Data() = delete;
};
static_assert(sizeof(Fingerprint_SetRecordLabel_ResponseParams_Data) == 16, "Bad sizeof(Fingerprint_SetRecordLabel_ResponseParams_Data)");
class Fingerprint_RemoveRecord_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> record_path;

private:
    friend class mojo::internal::MessageFragment<Fingerprint_RemoveRecord_Params_Data>;

    Fingerprint_RemoveRecord_Params_Data();
    ~Fingerprint_RemoveRecord_Params_Data() = delete;
};
static_assert(sizeof(Fingerprint_RemoveRecord_Params_Data) == 16, "Bad sizeof(Fingerprint_RemoveRecord_Params_Data)");
class Fingerprint_RemoveRecord_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<Fingerprint_RemoveRecord_ResponseParams_Data>;

    Fingerprint_RemoveRecord_ResponseParams_Data();
    ~Fingerprint_RemoveRecord_ResponseParams_Data() = delete;
};
static_assert(sizeof(Fingerprint_RemoveRecord_ResponseParams_Data) == 16, "Bad sizeof(Fingerprint_RemoveRecord_ResponseParams_Data)");
class Fingerprint_StartAuthSession_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<Fingerprint_StartAuthSession_Params_Data>;

    Fingerprint_StartAuthSession_Params_Data();
    ~Fingerprint_StartAuthSession_Params_Data() = delete;
};
static_assert(sizeof(Fingerprint_StartAuthSession_Params_Data) == 8, "Bad sizeof(Fingerprint_StartAuthSession_Params_Data)");
class Fingerprint_EndCurrentAuthSession_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<Fingerprint_EndCurrentAuthSession_Params_Data>;

    Fingerprint_EndCurrentAuthSession_Params_Data();
    ~Fingerprint_EndCurrentAuthSession_Params_Data() = delete;
};
static_assert(sizeof(Fingerprint_EndCurrentAuthSession_Params_Data) == 8, "Bad sizeof(Fingerprint_EndCurrentAuthSession_Params_Data)");
class Fingerprint_EndCurrentAuthSession_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<Fingerprint_EndCurrentAuthSession_ResponseParams_Data>;

    Fingerprint_EndCurrentAuthSession_ResponseParams_Data();
    ~Fingerprint_EndCurrentAuthSession_ResponseParams_Data() = delete;
};
static_assert(sizeof(Fingerprint_EndCurrentAuthSession_ResponseParams_Data) == 16, "Bad sizeof(Fingerprint_EndCurrentAuthSession_ResponseParams_Data)");
class Fingerprint_DestroyAllRecords_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<Fingerprint_DestroyAllRecords_Params_Data>;

    Fingerprint_DestroyAllRecords_Params_Data();
    ~Fingerprint_DestroyAllRecords_Params_Data() = delete;
};
static_assert(sizeof(Fingerprint_DestroyAllRecords_Params_Data) == 8, "Bad sizeof(Fingerprint_DestroyAllRecords_Params_Data)");
class Fingerprint_DestroyAllRecords_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<Fingerprint_DestroyAllRecords_ResponseParams_Data>;

    Fingerprint_DestroyAllRecords_ResponseParams_Data();
    ~Fingerprint_DestroyAllRecords_ResponseParams_Data() = delete;
};
static_assert(sizeof(Fingerprint_DestroyAllRecords_ResponseParams_Data) == 16, "Bad sizeof(Fingerprint_DestroyAllRecords_ResponseParams_Data)");
class Fingerprint_AddFingerprintObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data observer;

private:
    friend class mojo::internal::MessageFragment<Fingerprint_AddFingerprintObserver_Params_Data>;

    Fingerprint_AddFingerprintObserver_Params_Data();
    ~Fingerprint_AddFingerprintObserver_Params_Data() = delete;
};
static_assert(sizeof(Fingerprint_AddFingerprintObserver_Params_Data) == 16, "Bad sizeof(Fingerprint_AddFingerprintObserver_Params_Data)");
class Fingerprint_RequestType_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<Fingerprint_RequestType_Params_Data>;

    Fingerprint_RequestType_Params_Data();
    ~Fingerprint_RequestType_Params_Data() = delete;
};
static_assert(sizeof(Fingerprint_RequestType_Params_Data) == 8, "Bad sizeof(Fingerprint_RequestType_Params_Data)");
class Fingerprint_RequestType_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Fingerprint_RequestType_ResponseParams_Data>;

    Fingerprint_RequestType_ResponseParams_Data();
    ~Fingerprint_RequestType_ResponseParams_Data() = delete;
};
static_assert(sizeof(Fingerprint_RequestType_ResponseParams_Data) == 16, "Bad sizeof(Fingerprint_RequestType_ResponseParams_Data)");

} // namespace internal

class FingerprintObserver_OnRestarted_ParamsDataView {
public:
    FingerprintObserver_OnRestarted_ParamsDataView() = default;

    FingerprintObserver_OnRestarted_ParamsDataView(internal::FingerprintObserver_OnRestarted_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::FingerprintObserver_OnRestarted_Params_Data* data_ = nullptr;
};

class FingerprintObserver_OnStatusChanged_ParamsDataView {
public:
    FingerprintObserver_OnStatusChanged_ParamsDataView() = default;

    FingerprintObserver_OnStatusChanged_ParamsDataView(internal::FingerprintObserver_OnStatusChanged_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
