// services/device/public/mojom/hid.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_DEVICE_PUBLIC_MOJOM_HID_MOJOM_PARAMS_DATA_H_
#define SERVICES_DEVICE_PUBLIC_MOJOM_HID_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace device::mojom {
namespace internal {
class HidManagerClient_DeviceAdded_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::HidDeviceInfo_Data> device_info;

private:
    friend class mojo::internal::MessageFragment<HidManagerClient_DeviceAdded_Params_Data>;

    HidManagerClient_DeviceAdded_Params_Data();
    ~HidManagerClient_DeviceAdded_Params_Data() = delete;
};
static_assert(sizeof(HidManagerClient_DeviceAdded_Params_Data) == 16, "Bad sizeof(HidManagerClient_DeviceAdded_Params_Data)");
class HidManagerClient_DeviceRemoved_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::HidDeviceInfo_Data> device_info;

private:
    friend class mojo::internal::MessageFragment<HidManagerClient_DeviceRemoved_Params_Data>;

    HidManagerClient_DeviceRemoved_Params_Data();
    ~HidManagerClient_DeviceRemoved_Params_Data() = delete;
};
static_assert(sizeof(HidManagerClient_DeviceRemoved_Params_Data) == 16, "Bad sizeof(HidManagerClient_DeviceRemoved_Params_Data)");
class HidManagerClient_DeviceChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::HidDeviceInfo_Data> device_info;

private:
    friend class mojo::internal::MessageFragment<HidManagerClient_DeviceChanged_Params_Data>;

    HidManagerClient_DeviceChanged_Params_Data();
    ~HidManagerClient_DeviceChanged_Params_Data() = delete;
};
static_assert(sizeof(HidManagerClient_DeviceChanged_Params_Data) == 16, "Bad sizeof(HidManagerClient_DeviceChanged_Params_Data)");
class HidManager_GetDevicesAndSetClient_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data client;

private:
    friend class mojo::internal::MessageFragment<HidManager_GetDevicesAndSetClient_Params_Data>;

    HidManager_GetDevicesAndSetClient_Params_Data();
    ~HidManager_GetDevicesAndSetClient_Params_Data() = delete;
};
static_assert(sizeof(HidManager_GetDevicesAndSetClient_Params_Data) == 16, "Bad sizeof(HidManager_GetDevicesAndSetClient_Params_Data)");
class HidManager_GetDevicesAndSetClient_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::HidDeviceInfo_Data>>> devices;

private:
    friend class mojo::internal::MessageFragment<HidManager_GetDevicesAndSetClient_ResponseParams_Data>;

    HidManager_GetDevicesAndSetClient_ResponseParams_Data();
    ~HidManager_GetDevicesAndSetClient_ResponseParams_Data() = delete;
};
static_assert(sizeof(HidManager_GetDevicesAndSetClient_ResponseParams_Data) == 16, "Bad sizeof(HidManager_GetDevicesAndSetClient_ResponseParams_Data)");
class HidManager_GetDevices_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<HidManager_GetDevices_Params_Data>;

    HidManager_GetDevices_Params_Data();
    ~HidManager_GetDevices_Params_Data() = delete;
};
static_assert(sizeof(HidManager_GetDevices_Params_Data) == 8, "Bad sizeof(HidManager_GetDevices_Params_Data)");
class HidManager_GetDevices_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::HidDeviceInfo_Data>>> devices;

private:
    friend class mojo::internal::MessageFragment<HidManager_GetDevices_ResponseParams_Data>;

    HidManager_GetDevices_ResponseParams_Data();
    ~HidManager_GetDevices_ResponseParams_Data() = delete;
};
static_assert(sizeof(HidManager_GetDevices_ResponseParams_Data) == 16, "Bad sizeof(HidManager_GetDevices_ResponseParams_Data)");
class HidManager_Connect_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> device_guid;
    mojo::internal::Interface_Data connection_client;
    mojo::internal::Interface_Data watcher;
    uint8_t allow_protected_reports : 1;
    uint8_t allow_fido_reports : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<HidManager_Connect_Params_Data>;

    HidManager_Connect_Params_Data();
    ~HidManager_Connect_Params_Data() = delete;
};
static_assert(sizeof(HidManager_Connect_Params_Data) == 40, "Bad sizeof(HidManager_Connect_Params_Data)");
class HidManager_Connect_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data connection;

private:
    friend class mojo::internal::MessageFragment<HidManager_Connect_ResponseParams_Data>;

    HidManager_Connect_ResponseParams_Data();
    ~HidManager_Connect_ResponseParams_Data() = delete;
};
static_assert(sizeof(HidManager_Connect_ResponseParams_Data) == 16, "Bad sizeof(HidManager_Connect_ResponseParams_Data)");
class HidManager_AddReceiver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<HidManager_AddReceiver_Params_Data>;

    HidManager_AddReceiver_Params_Data();
    ~HidManager_AddReceiver_Params_Data() = delete;
};
static_assert(sizeof(HidManager_AddReceiver_Params_Data) == 16, "Bad sizeof(HidManager_AddReceiver_Params_Data)");
class HidConnection_Read_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<HidConnection_Read_Params_Data>;

    HidConnection_Read_Params_Data();
    ~HidConnection_Read_Params_Data() = delete;
};
static_assert(sizeof(HidConnection_Read_Params_Data) == 8, "Bad sizeof(HidConnection_Read_Params_Data)");
class HidConnection_Read_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t report_id;
    uint8_t pad1_[6];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> buffer;

private:
    friend class mojo::internal::MessageFragment<HidConnection_Read_ResponseParams_Data>;

    HidConnection_Read_ResponseParams_Data();
    ~HidConnection_Read_ResponseParams_Data() = delete;
};
static_assert(sizeof(HidConnection_Read_ResponseParams_Data) == 24, "Bad sizeof(HidConnection_Read_ResponseParams_Data)");
class HidConnection_Write_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t report_id;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> buffer;

private:
    friend class mojo::internal::MessageFragment<HidConnection_Write_Params_Data>;

    HidConnection_Write_Params_Data();
    ~HidConnection_Write_Params_Data() = delete;
};
static_assert(sizeof(HidConnection_Write_Params_Data) == 24, "Bad sizeof(HidConnection_Write_Params_Data)");
class HidConnection_Write_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<HidConnection_Write_ResponseParams_Data>;

    HidConnection_Write_ResponseParams_Data();
    ~HidConnection_Write_ResponseParams_Data() = delete;
};
static_assert(sizeof(HidConnection_Write_ResponseParams_Data) == 16, "Bad sizeof(HidConnection_Write_ResponseParams_Data)");
class HidConnection_GetFeatureReport_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t report_id;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<HidConnection_GetFeatureReport_Params_Data>;

    HidConnection_GetFeatureReport_Params_Data();
    ~HidConnection_GetFeatureReport_Params_Data() = delete;
};
static_assert(sizeof(HidConnection_GetFeatureReport_Params_Data) == 16, "Bad sizeof(HidConnection_GetFeatureReport_Params_Data)");
class HidConnection_GetFeatureReport_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> buffer;

private:
    friend class mojo::internal::MessageFragment<HidConnection_GetFeatureReport_ResponseParams_Data>;

    HidConnection_GetFeatureReport_ResponseParams_Data();
    ~HidConnection_GetFeatureReport_ResponseParams_Data() = delete;
};
static_assert(sizeof(HidConnection_GetFeatureReport_ResponseParams_Data) == 24, "Bad sizeof(HidConnection_GetFeatureReport_ResponseParams_Data)");
class HidConnection_SendFeatureReport_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t report_id;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> buffer;

private:
    friend class mojo::internal::MessageFragment<HidConnection_SendFeatureReport_Params_Data>;

    HidConnection_SendFeatureReport_Params_Data();
    ~HidConnection_SendFeatureReport_Params_Data() = delete;
};
static_assert(sizeof(HidConnection_SendFeatureReport_Params_Data) == 24, "Bad sizeof(HidConnection_SendFeatureReport_Params_Data)");
class HidConnection_SendFeatureReport_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<HidConnection_SendFeatureReport_ResponseParams_Data>;

    HidConnection_SendFeatureReport_ResponseParams_Data();
    ~HidConnection_SendFeatureReport_ResponseParams_Data() = delete;
};
static_assert(sizeof(HidConnection_SendFeatureReport_ResponseParams_Data) == 16, "Bad sizeof(HidConnection_SendFeatureReport_ResponseParams_Data)");
class HidConnectionClient_OnInputReport_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t report_id;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> buffer;

private:
    friend class mojo::internal::MessageFragment<HidConnectionClient_OnInputReport_Params_Data>;

    HidConnectionClient_OnInputReport_Params_Data();
    ~HidConnectionClient_OnInputReport_Params_Data() = delete;
};
static_assert(sizeof(HidConnectionClient_OnInputReport_Params_Data) == 24, "Bad sizeof(HidConnectionClient_OnInputReport_Params_Data)");

} // namespace internal

class HidManagerClient_DeviceAdded_ParamsDataView {
public:
    HidManagerClient_DeviceAdded_ParamsDataView() = default;

    HidManagerClient_DeviceAdded_ParamsDataView(internal::HidManagerClient_DeviceAdded_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetDeviceInfoDataView(HidDeviceInfoDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadDeviceInfo(UserType* output)
    {

        auto* pointer = data_->device_info.Get();
        return mojo::internal::Deserialize<::device::mojom::HidDeviceInfoDataView>(pointer, output, message_);
    }

private:
    internal::HidManagerClient_DeviceAdded_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

