// services/device/public/mojom/serial.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_DEVICE_PUBLIC_MOJOM_SERIAL_MOJOM_PARAMS_DATA_H_
#define SERVICES_DEVICE_PUBLIC_MOJOM_SERIAL_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace device::mojom {
namespace internal {
class SerialPortManager_SetClient_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data client;

private:
    friend class mojo::internal::MessageFragment<SerialPortManager_SetClient_Params_Data>;

    SerialPortManager_SetClient_Params_Data();
    ~SerialPortManager_SetClient_Params_Data() = delete;
};
static_assert(sizeof(SerialPortManager_SetClient_Params_Data) == 16, "Bad sizeof(SerialPortManager_SetClient_Params_Data)");
class SerialPortManager_GetDevices_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SerialPortManager_GetDevices_Params_Data>;

    SerialPortManager_GetDevices_Params_Data();
    ~SerialPortManager_GetDevices_Params_Data() = delete;
};
static_assert(sizeof(SerialPortManager_GetDevices_Params_Data) == 8, "Bad sizeof(SerialPortManager_GetDevices_Params_Data)");
class SerialPortManager_GetDevices_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::SerialPortInfo_Data>>> devices;

private:
    friend class mojo::internal::MessageFragment<SerialPortManager_GetDevices_ResponseParams_Data>;

    SerialPortManager_GetDevices_ResponseParams_Data();
    ~SerialPortManager_GetDevices_ResponseParams_Data() = delete;
};
static_assert(sizeof(SerialPortManager_GetDevices_ResponseParams_Data) == 16, "Bad sizeof(SerialPortManager_GetDevices_ResponseParams_Data)");
class SerialPortManager_OpenPort_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> token;
    uint8_t use_alternate_path : 1;
    uint8_t pad1_[7];
    mojo::internal::Pointer<internal::SerialConnectionOptions_Data> options;
    mojo::internal::Interface_Data client;
    mojo::internal::Interface_Data watcher;

private:
    friend class mojo::internal::MessageFragment<SerialPortManager_OpenPort_Params_Data>;

    SerialPortManager_OpenPort_Params_Data();
    ~SerialPortManager_OpenPort_Params_Data() = delete;
};
static_assert(sizeof(SerialPortManager_OpenPort_Params_Data) == 48, "Bad sizeof(SerialPortManager_OpenPort_Params_Data)");
class SerialPortManager_OpenPort_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data port;

private:
    friend class mojo::internal::MessageFragment<SerialPortManager_OpenPort_ResponseParams_Data>;

    SerialPortManager_OpenPort_ResponseParams_Data();
    ~SerialPortManager_OpenPort_ResponseParams_Data() = delete;
};
static_assert(sizeof(SerialPortManager_OpenPort_ResponseParams_Data) == 16, "Bad sizeof(SerialPortManager_OpenPort_ResponseParams_Data)");
class SerialPortManagerClient_OnPortAdded_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SerialPortInfo_Data> port_info;

private:
    friend class mojo::internal::MessageFragment<SerialPortManagerClient_OnPortAdded_Params_Data>;

    SerialPortManagerClient_OnPortAdded_Params_Data();
    ~SerialPortManagerClient_OnPortAdded_Params_Data() = delete;
};
static_assert(sizeof(SerialPortManagerClient_OnPortAdded_Params_Data) == 16, "Bad sizeof(SerialPortManagerClient_OnPortAdded_Params_Data)");
class SerialPortManagerClient_OnPortRemoved_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SerialPortInfo_Data> port_info;

private:
    friend class mojo::internal::MessageFragment<SerialPortManagerClient_OnPortRemoved_Params_Data>;

    SerialPortManagerClient_OnPortRemoved_Params_Data();
    ~SerialPortManagerClient_OnPortRemoved_Params_Data() = delete;
};
static_assert(sizeof(SerialPortManagerClient_OnPortRemoved_Params_Data) == 16, "Bad sizeof(SerialPortManagerClient_OnPortRemoved_Params_Data)");
class SerialPortManagerClient_OnPortConnectedStateChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SerialPortInfo_Data> port_info;

private:
    friend class mojo::internal::MessageFragment<SerialPortManagerClient_OnPortConnectedStateChanged_Params_Data>;

    SerialPortManagerClient_OnPortConnectedStateChanged_Params_Data();
    ~SerialPortManagerClient_OnPortConnectedStateChanged_Params_Data() = delete;
};
static_assert(sizeof(SerialPortManagerClient_OnPortConnectedStateChanged_Params_Data) == 16,
    "Bad sizeof(SerialPortManagerClient_OnPortConnectedStateChanged_Params_Data)");
class SerialPort_StartWriting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data consumer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SerialPort_StartWriting_Params_Data>;

    SerialPort_StartWriting_Params_Data();
    ~SerialPort_StartWriting_Params_Data() = delete;
};
static_assert(sizeof(SerialPort_StartWriting_Params_Data) == 16, "Bad sizeof(SerialPort_StartWriting_Params_Data)");
class SerialPort_StartReading_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data producer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SerialPort_StartReading_Params_Data>;

    SerialPort_StartReading_Params_Data();
    ~SerialPort_StartReading_Params_Data() = delete;
};
static_assert(sizeof(SerialPort_StartReading_Params_Data) == 16, "Bad sizeof(SerialPort_StartReading_Params_Data)");
class SerialPort_Flush_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t mode;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SerialPort_Flush_Params_Data>;

    SerialPort_Flush_Params_Data();
    ~SerialPort_Flush_Params_Data() = delete;
};
static_assert(sizeof(SerialPort_Flush_Params_Data) == 16, "Bad sizeof(SerialPort_Flush_Params_Data)");
class SerialPort_Flush_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SerialPort_Flush_ResponseParams_Data>;

    SerialPort_Flush_ResponseParams_Data();
    ~SerialPort_Flush_ResponseParams_Data() = delete;
};
static_assert(sizeof(SerialPort_Flush_ResponseParams_Data) == 8, "Bad sizeof(SerialPort_Flush_ResponseParams_Data)");
class SerialPort_Drain_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SerialPort_Drain_Params_Data>;

    SerialPort_Drain_Params_Data();
    ~SerialPort_Drain_Params_Data() = delete;
};
static_assert(sizeof(SerialPort_Drain_Params_Data) == 8, "Bad sizeof(SerialPort_Drain_Params_Data)");
class SerialPort_Drain_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SerialPort_Drain_ResponseParams_Data>;

    SerialPort_Drain_ResponseParams_Data();
    ~SerialPort_Drain_ResponseParams_Data() = delete;
};
static_assert(sizeof(SerialPort_Drain_ResponseParams_Data) == 8, "Bad sizeof(SerialPort_Drain_ResponseParams_Data)");
class SerialPort_GetControlSignals_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SerialPort_GetControlSignals_Params_Data>;

    SerialPort_GetControlSignals_Params_Data();
    ~SerialPort_GetControlSignals_Params_Data() = delete;
};
static_assert(sizeof(SerialPort_GetControlSignals_Params_Data) == 8, "Bad sizeof(SerialPort_GetControlSignals_Params_Data)");
class SerialPort_GetControlSignals_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SerialPortControlSignals_Data> signals;

private:
    friend class mojo::internal::MessageFragment<SerialPort_GetControlSignals_ResponseParams_Data>;

    SerialPort_GetControlSignals_ResponseParams_Data();
    ~SerialPort_GetControlSignals_ResponseParams_Data() = delete;
};
static_assert(sizeof(SerialPort_GetControlSignals_ResponseParams_Data) == 16, "Bad sizeof(SerialPort_GetControlSignals_ResponseParams_Data)");
class SerialPort_SetControlSignals_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SerialHostControlSignals_Data> signals;

private:
    friend class mojo::internal::MessageFragment<SerialPort_SetControlSignals_Params_Data>;

    SerialPort_SetControlSignals_Params_Data();
    ~SerialPort_SetControlSignals_Params_Data() = delete;
};
static_assert(sizeof(SerialPort_SetControlSignals_Params_Data) == 16, "Bad sizeof(SerialPort_SetControlSignals_Params_Data)");
class SerialPort_SetControlSignals_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<SerialPort_SetControlSignals_ResponseParams_Data>;

    SerialPort_SetControlSignals_ResponseParams_Data();
    ~SerialPort_SetControlSignals_ResponseParams_Data() = delete;
};
static_assert(sizeof(SerialPort_SetControlSignals_ResponseParams_Data) == 16, "Bad sizeof(SerialPort_SetControlSignals_ResponseParams_Data)");
class SerialPort_ConfigurePort_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SerialConnectionOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<SerialPort_ConfigurePort_Params_Data>;

    SerialPort_ConfigurePort_Params_Data();
    ~SerialPort_ConfigurePort_Params_Data() = delete;
};
static_assert(sizeof(SerialPort_ConfigurePort_Params_Data) == 16, "Bad sizeof(SerialPort_ConfigurePort_Params_Data)");
class SerialPort_ConfigurePort_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<SerialPort_ConfigurePort_ResponseParams_Data>;

    SerialPort_ConfigurePort_ResponseParams_Data();
    ~SerialPort_ConfigurePort_ResponseParams_Data() = delete;
};
static_assert(sizeof(SerialPort_ConfigurePort_ResponseParams_Data) == 16, "Bad sizeof(SerialPort_ConfigurePort_ResponseParams_Data)");
class SerialPort_GetPortInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SerialPort_GetPortInfo_Params_Data>;

    SerialPort_GetPortInfo_Params_Data();
    ~SerialPort_GetPortInfo_Params_Data() = delete;
};
static_assert(sizeof(SerialPort_GetPortInfo_Params_Data) == 8, "Bad sizeof(SerialPort_GetPortInfo_Params_Data)");
class SerialPort_GetPortInfo_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SerialConnectionInfo_Data> info;

private:
    friend class mojo::internal::MessageFragment<SerialPort_GetPortInfo_ResponseParams_Data>;

    SerialPort_GetPortInfo_ResponseParams_Data();
    ~SerialPort_GetPortInfo_ResponseParams_Data() = delete;
};
static_assert(sizeof(SerialPort_GetPortInfo_ResponseParams_Data) == 16, "Bad sizeof(SerialPort_GetPortInfo_ResponseParams_Data)");
class SerialPort_Close_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t flush : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<SerialPort_Close_Params_Data>;

    SerialPort_Close_Params_Data();
    ~SerialPort_Close_Params_Data() = delete;
};
static_assert(sizeof(SerialPort_Close_Params_Data) == 16, "Bad sizeof(SerialPort_Close_Params_Data)");
class SerialPort_Close_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SerialPort_Close_ResponseParams_Data>;

    SerialPort_Close_ResponseParams_Data();
    ~SerialPort_Close_ResponseParams_Data() = delete;
};
static_assert(sizeof(SerialPort_Close_ResponseParams_Data) == 8, "Bad sizeof(SerialPort_Close_ResponseParams_Data)");
class SerialPortClient_OnReadError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SerialPortClient_OnReadError_Params_Data>;

    SerialPortClient_OnReadError_Params_Data();
    ~SerialPortClient_OnReadError_Params_Data() = delete;
};
static_assert(sizeof(SerialPortClient_OnReadError_Params_Data) == 16, "Bad sizeof(SerialPortClient_OnReadError_Params_Data)");
class SerialPortClient_OnSendError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SerialPortClient_OnSendError_Params_Data>;

    SerialPortClient_OnSendError_Params_Data();
    ~SerialPortClient_OnSendError_Params_Data() = delete;
};
static_assert(sizeof(SerialPortClient_OnSendError_Params_Data) == 16, "Bad sizeof(SerialPortClient_OnSendError_Params_Data)");

} // namespace internal

class SerialPortManager_SetClient_ParamsDataView {
public:
    SerialPortManager_SetClient_ParamsDataView() = default;

    SerialPortManager_SetClient_ParamsDataView(internal::SerialPortManager_SetClient_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeClient()
    {
        UserType result;
        bool ret
            = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::device::mojom::SerialPortManagerClientInterfaceBase>>(&data_->client, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::SerialPortManager_SetClient_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

