// services/device/public/mojom/smart_card.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_DEVICE_PUBLIC_MOJOM_SMART_CARD_MOJOM_PARAMS_DATA_H_
#define SERVICES_DEVICE_PUBLIC_MOJOM_SMART_CARD_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace device::mojom {
namespace internal {
class SmartCardTransaction_EndTransaction_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t disposition;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SmartCardTransaction_EndTransaction_Params_Data>;

    SmartCardTransaction_EndTransaction_Params_Data();
    ~SmartCardTransaction_EndTransaction_Params_Data() = delete;
};
static_assert(sizeof(SmartCardTransaction_EndTransaction_Params_Data) == 16, "Bad sizeof(SmartCardTransaction_EndTransaction_Params_Data)");
class SmartCardTransaction_EndTransaction_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::SmartCardResult_Data result;

private:
    friend class mojo::internal::MessageFragment<SmartCardTransaction_EndTransaction_ResponseParams_Data>;

    SmartCardTransaction_EndTransaction_ResponseParams_Data();
    ~SmartCardTransaction_EndTransaction_ResponseParams_Data() = delete;
};
static_assert(sizeof(SmartCardTransaction_EndTransaction_ResponseParams_Data) == 24, "Bad sizeof(SmartCardTransaction_EndTransaction_ResponseParams_Data)");
class SmartCardConnection_Disconnect_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t disposition;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SmartCardConnection_Disconnect_Params_Data>;

    SmartCardConnection_Disconnect_Params_Data();
    ~SmartCardConnection_Disconnect_Params_Data() = delete;
};
static_assert(sizeof(SmartCardConnection_Disconnect_Params_Data) == 16, "Bad sizeof(SmartCardConnection_Disconnect_Params_Data)");
class SmartCardConnection_Disconnect_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::SmartCardResult_Data result;

private:
    friend class mojo::internal::MessageFragment<SmartCardConnection_Disconnect_ResponseParams_Data>;

    SmartCardConnection_Disconnect_ResponseParams_Data();
    ~SmartCardConnection_Disconnect_ResponseParams_Data() = delete;
};
static_assert(sizeof(SmartCardConnection_Disconnect_ResponseParams_Data) == 24, "Bad sizeof(SmartCardConnection_Disconnect_ResponseParams_Data)");
class SmartCardConnection_Transmit_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t protocol;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> data;

private:
    friend class mojo::internal::MessageFragment<SmartCardConnection_Transmit_Params_Data>;

    SmartCardConnection_Transmit_Params_Data();
    ~SmartCardConnection_Transmit_Params_Data() = delete;
};
static_assert(sizeof(SmartCardConnection_Transmit_Params_Data) == 24, "Bad sizeof(SmartCardConnection_Transmit_Params_Data)");
class SmartCardConnection_Transmit_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::SmartCardDataResult_Data result;

private:
    friend class mojo::internal::MessageFragment<SmartCardConnection_Transmit_ResponseParams_Data>;

    SmartCardConnection_Transmit_ResponseParams_Data();
    ~SmartCardConnection_Transmit_ResponseParams_Data() = delete;
};
static_assert(sizeof(SmartCardConnection_Transmit_ResponseParams_Data) == 24, "Bad sizeof(SmartCardConnection_Transmit_ResponseParams_Data)");
class SmartCardConnection_Control_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t control_code;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> data;

private:
    friend class mojo::internal::MessageFragment<SmartCardConnection_Control_Params_Data>;

    SmartCardConnection_Control_Params_Data();
    ~SmartCardConnection_Control_Params_Data() = delete;
};
static_assert(sizeof(SmartCardConnection_Control_Params_Data) == 24, "Bad sizeof(SmartCardConnection_Control_Params_Data)");
class SmartCardConnection_Control_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::SmartCardDataResult_Data result;

private:
    friend class mojo::internal::MessageFragment<SmartCardConnection_Control_ResponseParams_Data>;

    SmartCardConnection_Control_ResponseParams_Data();
    ~SmartCardConnection_Control_ResponseParams_Data() = delete;
};
static_assert(sizeof(SmartCardConnection_Control_ResponseParams_Data) == 24, "Bad sizeof(SmartCardConnection_Control_ResponseParams_Data)");
class SmartCardConnection_GetAttrib_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t id;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<SmartCardConnection_GetAttrib_Params_Data>;

    SmartCardConnection_GetAttrib_Params_Data();
    ~SmartCardConnection_GetAttrib_Params_Data() = delete;
};
static_assert(sizeof(SmartCardConnection_GetAttrib_Params_Data) == 16, "Bad sizeof(SmartCardConnection_GetAttrib_Params_Data)");
class SmartCardConnection_GetAttrib_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::SmartCardDataResult_Data result;

private:
    friend class mojo::internal::MessageFragment<SmartCardConnection_GetAttrib_ResponseParams_Data>;

    SmartCardConnection_GetAttrib_ResponseParams_Data();
    ~SmartCardConnection_GetAttrib_ResponseParams_Data() = delete;
};
static_assert(sizeof(SmartCardConnection_GetAttrib_ResponseParams_Data) == 24, "Bad sizeof(SmartCardConnection_GetAttrib_ResponseParams_Data)");
class SmartCardConnection_SetAttrib_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t id;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> data;

private:
    friend class mojo::internal::MessageFragment<SmartCardConnection_SetAttrib_Params_Data>;

    SmartCardConnection_SetAttrib_Params_Data();
    ~SmartCardConnection_SetAttrib_Params_Data() = delete;
};
static_assert(sizeof(SmartCardConnection_SetAttrib_Params_Data) == 24, "Bad sizeof(SmartCardConnection_SetAttrib_Params_Data)");
class SmartCardConnection_SetAttrib_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::SmartCardResult_Data result;

private:
    friend class mojo::internal::MessageFragment<SmartCardConnection_SetAttrib_ResponseParams_Data>;

    SmartCardConnection_SetAttrib_ResponseParams_Data();
    ~SmartCardConnection_SetAttrib_ResponseParams_Data() = delete;
};
static_assert(sizeof(SmartCardConnection_SetAttrib_ResponseParams_Data) == 24, "Bad sizeof(SmartCardConnection_SetAttrib_ResponseParams_Data)");
class SmartCardConnection_Status_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SmartCardConnection_Status_Params_Data>;

    SmartCardConnection_Status_Params_Data();
    ~SmartCardConnection_Status_Params_Data() = delete;
};
static_assert(sizeof(SmartCardConnection_Status_Params_Data) == 8, "Bad sizeof(SmartCardConnection_Status_Params_Data)");
class SmartCardConnection_Status_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::SmartCardStatusResult_Data result;

private:
    friend class mojo::internal::MessageFragment<SmartCardConnection_Status_ResponseParams_Data>;

    SmartCardConnection_Status_ResponseParams_Data();
    ~SmartCardConnection_Status_ResponseParams_Data() = delete;
};
static_assert(sizeof(SmartCardConnection_Status_ResponseParams_Data) == 24, "Bad sizeof(SmartCardConnection_Status_ResponseParams_Data)");
class SmartCardConnection_BeginTransaction_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SmartCardConnection_BeginTransaction_Params_Data>;

    SmartCardConnection_BeginTransaction_Params_Data();
    ~SmartCardConnection_BeginTransaction_Params_Data() = delete;
};
static_assert(sizeof(SmartCardConnection_BeginTransaction_Params_Data) == 8, "Bad sizeof(SmartCardConnection_BeginTransaction_Params_Data)");
class SmartCardConnection_BeginTransaction_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::SmartCardTransactionResult_Data result;

private:
    friend class mojo::internal::MessageFragment<SmartCardConnection_BeginTransaction_ResponseParams_Data>;

    SmartCardConnection_BeginTransaction_ResponseParams_Data();
    ~SmartCardConnection_BeginTransaction_ResponseParams_Data() = delete;
};
static_assert(sizeof(SmartCardConnection_BeginTransaction_ResponseParams_Data) == 24, "Bad sizeof(SmartCardConnection_BeginTransaction_ResponseParams_Data)");
class SmartCardContext_ListReaders_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SmartCardContext_ListReaders_Params_Data>;

    SmartCardContext_ListReaders_Params_Data();
    ~SmartCardContext_ListReaders_Params_Data() = delete;
};
static_assert(sizeof(SmartCardContext_ListReaders_Params_Data) == 8, "Bad sizeof(SmartCardContext_ListReaders_Params_Data)");
class SmartCardContext_ListReaders_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::SmartCardListReadersResult_Data result;

private:
    friend class mojo::internal::MessageFragment<SmartCardContext_ListReaders_ResponseParams_Data>;

    SmartCardContext_ListReaders_ResponseParams_Data();
    ~SmartCardContext_ListReaders_ResponseParams_Data() = delete;
};
static_assert(sizeof(SmartCardContext_ListReaders_ResponseParams_Data) == 24, "Bad sizeof(SmartCardContext_ListReaders_ResponseParams_Data)");
class SmartCardContext_GetStatusChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> timeout;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::SmartCardReaderStateIn_Data>>> reader_states;

private:
    friend class mojo::internal::MessageFragment<SmartCardContext_GetStatusChange_Params_Data>;

    SmartCardContext_GetStatusChange_Params_Data();
    ~SmartCardContext_GetStatusChange_Params_Data() = delete;
};
static_assert(sizeof(SmartCardContext_GetStatusChange_Params_Data) == 24, "Bad sizeof(SmartCardContext_GetStatusChange_Params_Data)");
class SmartCardContext_GetStatusChange_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::SmartCardStatusChangeResult_Data result;

private:
    friend class mojo::internal::MessageFragment<SmartCardContext_GetStatusChange_ResponseParams_Data>;

    SmartCardContext_GetStatusChange_ResponseParams_Data();
    ~SmartCardContext_GetStatusChange_ResponseParams_Data() = delete;
};
static_assert(sizeof(SmartCardContext_GetStatusChange_ResponseParams_Data) == 24, "Bad sizeof(SmartCardContext_GetStatusChange_ResponseParams_Data)");
class SmartCardContext_Cancel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SmartCardContext_Cancel_Params_Data>;

    SmartCardContext_Cancel_Params_Data();
    ~SmartCardContext_Cancel_Params_Data() = delete;
};
static_assert(sizeof(SmartCardContext_Cancel_Params_Data) == 8, "Bad sizeof(SmartCardContext_Cancel_Params_Data)");
class SmartCardContext_Cancel_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::SmartCardResult_Data result;

private:
    friend class mojo::internal::MessageFragment<SmartCardContext_Cancel_ResponseParams_Data>;

    SmartCardContext_Cancel_ResponseParams_Data();
    ~SmartCardContext_Cancel_ResponseParams_Data() = delete;
};
static_assert(sizeof(SmartCardContext_Cancel_ResponseParams_Data) == 24, "Bad sizeof(SmartCardContext_Cancel_ResponseParams_Data)");
class SmartCardContext_Connect_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> reader;
    int32_t share_mode;
    uint8_t pad1_[4];
    mojo::internal::Pointer<internal::SmartCardProtocols_Data> preferred_protocols;

private:
    friend class mojo::internal::MessageFragment<SmartCardContext_Connect_Params_Data>;

    SmartCardContext_Connect_Params_Data();
    ~SmartCardContext_Connect_Params_Data() = delete;
};
static_assert(sizeof(SmartCardContext_Connect_Params_Data) == 32, "Bad sizeof(SmartCardContext_Connect_Params_Data)");
class SmartCardContext_Connect_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::SmartCardConnectResult_Data result;

private:
    friend class mojo::internal::MessageFragment<SmartCardContext_Connect_ResponseParams_Data>;

    SmartCardContext_Connect_ResponseParams_Data();
    ~SmartCardContext_Connect_ResponseParams_Data() = delete;
};
static_assert(sizeof(SmartCardContext_Connect_ResponseParams_Data) == 24, "Bad sizeof(SmartCardContext_Connect_ResponseParams_Data)");
class SmartCardContextFactory_CreateContext_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SmartCardContextFactory_CreateContext_Params_Data>;

    SmartCardContextFactory_CreateContext_Params_Data();
    ~SmartCardContextFactory_CreateContext_Params_Data() = delete;
};
static_assert(sizeof(SmartCardContextFactory_CreateContext_Params_Data) == 8, "Bad sizeof(SmartCardContextFactory_CreateContext_Params_Data)");
class SmartCardContextFactory_CreateContext_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::SmartCardCreateContextResult_Data result;

private:
    friend class mojo::internal::MessageFragment<SmartCardContextFactory_CreateContext_ResponseParams_Data>;

    SmartCardContextFactory_CreateContext_ResponseParams_Data();
    ~SmartCardContextFactory_CreateContext_ResponseParams_Data() = delete;
};
static_assert(sizeof(SmartCardContextFactory_CreateContext_ResponseParams_Data) == 24, "Bad sizeof(SmartCardContextFactory_CreateContext_ResponseParams_Data)");

} // namespace internal

class SmartCardTransaction_EndTransaction_ParamsDataView {
public:
    SmartCardTransaction_EndTransaction_ParamsDataView() = default;

    SmartCardTransaction_EndTransaction_ParamsDataView(internal::SmartCardTransaction_EndTransaction_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadDisposition(UserType* output) const
    {
        auto data_value = data_->disposition;
        return mojo::internal::Deserialize<::device::mojom::SmartCardDisposition>(data_value, output);
    }
    SmartCardDisposition disposition() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::device::mojom::SmartCardDisposition>(data_->disposition));
    }

