// services/device/public/mojom/usb_device.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_DEVICE_PUBLIC_MOJOM_USB_DEVICE_MOJOM_PARAMS_DATA_H_
#define SERVICES_DEVICE_PUBLIC_MOJOM_USB_DEVICE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace device::mojom {
namespace internal {
class UsbDevice_Open_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<UsbDevice_Open_Params_Data>;

    UsbDevice_Open_Params_Data();
    ~UsbDevice_Open_Params_Data() = delete;
};
static_assert(sizeof(UsbDevice_Open_Params_Data) == 8, "Bad sizeof(UsbDevice_Open_Params_Data)");
class UsbDevice_Open_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::UsbOpenDeviceResult_Data result;

private:
    friend class mojo::internal::MessageFragment<UsbDevice_Open_ResponseParams_Data>;

    UsbDevice_Open_ResponseParams_Data();
    ~UsbDevice_Open_ResponseParams_Data() = delete;
};
static_assert(sizeof(UsbDevice_Open_ResponseParams_Data) == 24, "Bad sizeof(UsbDevice_Open_ResponseParams_Data)");
class UsbDevice_Close_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<UsbDevice_Close_Params_Data>;

    UsbDevice_Close_Params_Data();
    ~UsbDevice_Close_Params_Data() = delete;
};
static_assert(sizeof(UsbDevice_Close_Params_Data) == 8, "Bad sizeof(UsbDevice_Close_Params_Data)");
class UsbDevice_Close_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<UsbDevice_Close_ResponseParams_Data>;

    UsbDevice_Close_ResponseParams_Data();
    ~UsbDevice_Close_ResponseParams_Data() = delete;
};
static_assert(sizeof(UsbDevice_Close_ResponseParams_Data) == 8, "Bad sizeof(UsbDevice_Close_ResponseParams_Data)");
class UsbDevice_SetConfiguration_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t value;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<UsbDevice_SetConfiguration_Params_Data>;

    UsbDevice_SetConfiguration_Params_Data();
    ~UsbDevice_SetConfiguration_Params_Data() = delete;
};
static_assert(sizeof(UsbDevice_SetConfiguration_Params_Data) == 16, "Bad sizeof(UsbDevice_SetConfiguration_Params_Data)");
class UsbDevice_SetConfiguration_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<UsbDevice_SetConfiguration_ResponseParams_Data>;

    UsbDevice_SetConfiguration_ResponseParams_Data();
    ~UsbDevice_SetConfiguration_ResponseParams_Data() = delete;
};
static_assert(sizeof(UsbDevice_SetConfiguration_ResponseParams_Data) == 16, "Bad sizeof(UsbDevice_SetConfiguration_ResponseParams_Data)");
class UsbDevice_ClaimInterface_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t interface_number;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<UsbDevice_ClaimInterface_Params_Data>;

    UsbDevice_ClaimInterface_Params_Data();
    ~UsbDevice_ClaimInterface_Params_Data() = delete;
};
static_assert(sizeof(UsbDevice_ClaimInterface_Params_Data) == 16, "Bad sizeof(UsbDevice_ClaimInterface_Params_Data)");
class UsbDevice_ClaimInterface_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<UsbDevice_ClaimInterface_ResponseParams_Data>;

    UsbDevice_ClaimInterface_ResponseParams_Data();
    ~UsbDevice_ClaimInterface_ResponseParams_Data() = delete;
};
static_assert(sizeof(UsbDevice_ClaimInterface_ResponseParams_Data) == 16, "Bad sizeof(UsbDevice_ClaimInterface_ResponseParams_Data)");
class UsbDevice_ReleaseInterface_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t interface_number;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<UsbDevice_ReleaseInterface_Params_Data>;

    UsbDevice_ReleaseInterface_Params_Data();
    ~UsbDevice_ReleaseInterface_Params_Data() = delete;
};
static_assert(sizeof(UsbDevice_ReleaseInterface_Params_Data) == 16, "Bad sizeof(UsbDevice_ReleaseInterface_Params_Data)");
class UsbDevice_ReleaseInterface_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<UsbDevice_ReleaseInterface_ResponseParams_Data>;

    UsbDevice_ReleaseInterface_ResponseParams_Data();
    ~UsbDevice_ReleaseInterface_ResponseParams_Data() = delete;
};
static_assert(sizeof(UsbDevice_ReleaseInterface_ResponseParams_Data) == 16, "Bad sizeof(UsbDevice_ReleaseInterface_ResponseParams_Data)");
class UsbDevice_SetInterfaceAlternateSetting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t interface_number;
    uint8_t alternate_setting;
    uint8_t padfinal_[6];

private:
    friend class mojo::internal::MessageFragment<UsbDevice_SetInterfaceAlternateSetting_Params_Data>;

    UsbDevice_SetInterfaceAlternateSetting_Params_Data();
    ~UsbDevice_SetInterfaceAlternateSetting_Params_Data() = delete;
};
static_assert(sizeof(UsbDevice_SetInterfaceAlternateSetting_Params_Data) == 16, "Bad sizeof(UsbDevice_SetInterfaceAlternateSetting_Params_Data)");
class UsbDevice_SetInterfaceAlternateSetting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<UsbDevice_SetInterfaceAlternateSetting_ResponseParams_Data>;

    UsbDevice_SetInterfaceAlternateSetting_ResponseParams_Data();
    ~UsbDevice_SetInterfaceAlternateSetting_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(UsbDevice_SetInterfaceAlternateSetting_ResponseParams_Data) == 16, "Bad sizeof(UsbDevice_SetInterfaceAlternateSetting_ResponseParams_Data)");
class UsbDevice_Reset_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<UsbDevice_Reset_Params_Data>;

    UsbDevice_Reset_Params_Data();
    ~UsbDevice_Reset_Params_Data() = delete;
};
static_assert(sizeof(UsbDevice_Reset_Params_Data) == 8, "Bad sizeof(UsbDevice_Reset_Params_Data)");
class UsbDevice_Reset_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<UsbDevice_Reset_ResponseParams_Data>;

    UsbDevice_Reset_ResponseParams_Data();
    ~UsbDevice_Reset_ResponseParams_Data() = delete;
};
static_assert(sizeof(UsbDevice_Reset_ResponseParams_Data) == 16, "Bad sizeof(UsbDevice_Reset_ResponseParams_Data)");
class UsbDevice_ClearHalt_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t direction;
    uint8_t endpoint_number;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<UsbDevice_ClearHalt_Params_Data>;

    UsbDevice_ClearHalt_Params_Data();
    ~UsbDevice_ClearHalt_Params_Data() = delete;
};
static_assert(sizeof(UsbDevice_ClearHalt_Params_Data) == 16, "Bad sizeof(UsbDevice_ClearHalt_Params_Data)");
class UsbDevice_ClearHalt_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<UsbDevice_ClearHalt_ResponseParams_Data>;

    UsbDevice_ClearHalt_ResponseParams_Data();
    ~UsbDevice_ClearHalt_ResponseParams_Data() = delete;
};
static_assert(sizeof(UsbDevice_ClearHalt_ResponseParams_Data) == 16, "Bad sizeof(UsbDevice_ClearHalt_ResponseParams_Data)");
class UsbDevice_ControlTransferIn_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::UsbControlTransferParams_Data> params;
    uint32_t length;
    uint32_t timeout;

private:
    friend class mojo::internal::MessageFragment<UsbDevice_ControlTransferIn_Params_Data>;

    UsbDevice_ControlTransferIn_Params_Data();
    ~UsbDevice_ControlTransferIn_Params_Data() = delete;
};
static_assert(sizeof(UsbDevice_ControlTransferIn_Params_Data) == 24, "Bad sizeof(UsbDevice_ControlTransferIn_Params_Data)");
class UsbDevice_ControlTransferIn_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> data;

private:
    friend class mojo::internal::MessageFragment<UsbDevice_ControlTransferIn_ResponseParams_Data>;

    UsbDevice_ControlTransferIn_ResponseParams_Data();
    ~UsbDevice_ControlTransferIn_ResponseParams_Data() = delete;
};
static_assert(sizeof(UsbDevice_ControlTransferIn_ResponseParams_Data) == 24, "Bad sizeof(UsbDevice_ControlTransferIn_ResponseParams_Data)");
class UsbDevice_ControlTransferOut_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::UsbControlTransferParams_Data> params;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> data;
    uint32_t timeout;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<UsbDevice_ControlTransferOut_Params_Data>;

    UsbDevice_ControlTransferOut_Params_Data();
    ~UsbDevice_ControlTransferOut_Params_Data() = delete;
};
static_assert(sizeof(UsbDevice_ControlTransferOut_Params_Data) == 32, "Bad sizeof(UsbDevice_ControlTransferOut_Params_Data)");
class UsbDevice_ControlTransferOut_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<UsbDevice_ControlTransferOut_ResponseParams_Data>;

    UsbDevice_ControlTransferOut_ResponseParams_Data();
    ~UsbDevice_ControlTransferOut_ResponseParams_Data() = delete;
};
static_assert(sizeof(UsbDevice_ControlTransferOut_ResponseParams_Data) == 16, "Bad sizeof(UsbDevice_ControlTransferOut_ResponseParams_Data)");
class UsbDevice_GenericTransferIn_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t endpoint_number;
    uint8_t pad0_[3];
    uint32_t length;
    uint32_t timeout;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<UsbDevice_GenericTransferIn_Params_Data>;

    UsbDevice_GenericTransferIn_Params_Data();
    ~UsbDevice_GenericTransferIn_Params_Data() = delete;
};
static_assert(sizeof(UsbDevice_GenericTransferIn_Params_Data) == 24, "Bad sizeof(UsbDevice_GenericTransferIn_Params_Data)");
class UsbDevice_GenericTransferIn_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> data;

private:
    friend class mojo::internal::MessageFragment<UsbDevice_GenericTransferIn_ResponseParams_Data>;

    UsbDevice_GenericTransferIn_ResponseParams_Data();
    ~UsbDevice_GenericTransferIn_ResponseParams_Data() = delete;
};
static_assert(sizeof(UsbDevice_GenericTransferIn_ResponseParams_Data) == 24, "Bad sizeof(UsbDevice_GenericTransferIn_ResponseParams_Data)");
class UsbDevice_GenericTransferOut_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t endpoint_number;
    uint8_t pad0_[3];
    uint32_t timeout;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> data;

private:
    friend class mojo::internal::MessageFragment<UsbDevice_GenericTransferOut_Params_Data>;

    UsbDevice_GenericTransferOut_Params_Data();
    ~UsbDevice_GenericTransferOut_Params_Data() = delete;
};
static_assert(sizeof(UsbDevice_GenericTransferOut_Params_Data) == 24, "Bad sizeof(UsbDevice_GenericTransferOut_Params_Data)");
class UsbDevice_GenericTransferOut_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<UsbDevice_GenericTransferOut_ResponseParams_Data>;

    UsbDevice_GenericTransferOut_ResponseParams_Data();
    ~UsbDevice_GenericTransferOut_ResponseParams_Data() = delete;
};
static_assert(sizeof(UsbDevice_GenericTransferOut_ResponseParams_Data) == 16, "Bad sizeof(UsbDevice_GenericTransferOut_ResponseParams_Data)");
class UsbDevice_IsochronousTransferIn_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t endpoint_number;
    uint8_t pad0_[3];
    uint32_t timeout;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint32_t>> packet_lengths;

private:
    friend class mojo::internal::MessageFragment<UsbDevice_IsochronousTransferIn_Params_Data>;

    UsbDevice_IsochronousTransferIn_Params_Data();
    ~UsbDevice_IsochronousTransferIn_Params_Data() = delete;
};
static_assert(sizeof(UsbDevice_IsochronousTransferIn_Params_Data) == 24, "Bad sizeof(UsbDevice_IsochronousTransferIn_Params_Data)");
class UsbDevice_IsochronousTransferIn_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> data;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::UsbIsochronousPacket_Data>>> packets;

private:
    friend class mojo::internal::MessageFragment<UsbDevice_IsochronousTransferIn_ResponseParams_Data>;

    UsbDevice_IsochronousTransferIn_ResponseParams_Data();
    ~UsbDevice_IsochronousTransferIn_ResponseParams_Data() = delete;
};
static_assert(sizeof(UsbDevice_IsochronousTransferIn_ResponseParams_Data) == 24, "Bad sizeof(UsbDevice_IsochronousTransferIn_ResponseParams_Data)");
class UsbDevice_IsochronousTransferOut_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t endpoint_number;
    uint8_t pad0_[3];
    uint32_t timeout;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> data;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint32_t>> packet_lengths;

private:
    friend class mojo::internal::MessageFragment<UsbDevice_IsochronousTransferOut_Params_Data>;

    UsbDevice_IsochronousTransferOut_Params_Data();
    ~UsbDevice_IsochronousTransferOut_Params_Data() = delete;
};
static_assert(sizeof(UsbDevice_IsochronousTransferOut_Params_Data) == 32, "Bad sizeof(UsbDevice_IsochronousTransferOut_Params_Data)");
class UsbDevice_IsochronousTransferOut_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::UsbIsochronousPacket_Data>>> packets;

private:
    friend class mojo::internal::MessageFragment<UsbDevice_IsochronousTransferOut_ResponseParams_Data>;

    UsbDevice_IsochronousTransferOut_ResponseParams_Data();
    ~UsbDevice_IsochronousTransferOut_ResponseParams_Data() = delete;
};
static_assert(sizeof(UsbDevice_IsochronousTransferOut_ResponseParams_Data) == 16, "Bad sizeof(UsbDevice_IsochronousTransferOut_ResponseParams_Data)");
class UsbDeviceClient_OnDeviceOpened_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<UsbDeviceClient_OnDeviceOpened_Params_Data>;

    UsbDeviceClient_OnDeviceOpened_Params_Data();
    ~UsbDeviceClient_OnDeviceOpened_Params_Data() = delete;
};
static_assert(sizeof(UsbDeviceClient_OnDeviceOpened_Params_Data) == 8, "Bad sizeof(UsbDeviceClient_OnDeviceOpened_Params_Data)");
class UsbDeviceClient_OnDeviceClosed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<UsbDeviceClient_OnDeviceClosed_Params_Data>;

    UsbDeviceClient_OnDeviceClosed_Params_Data();
    ~UsbDeviceClient_OnDeviceClosed_Params_Data() = delete;
};
static_assert(sizeof(UsbDeviceClient_OnDeviceClosed_Params_Data) == 8, "Bad sizeof(UsbDeviceClient_OnDeviceClosed_Params_Data)");

} // namespace internal

class UsbDevice_Open_ParamsDataView {
public:
    UsbDevice_Open_ParamsDataView() = default;

    UsbDevice_Open_ParamsDataView(internal::UsbDevice_Open_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::UsbDevice_Open_Params_Data* data_ = nullptr;
};

class UsbDevice_Open_ResponseParamsDataView {
public:
    UsbDevice_Open_ResponseParamsDataView() = default;

    UsbDevice_Open_ResponseParamsDataView(internal::UsbDevice_Open_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetResultDataView(UsbOpenDeviceResultDataView* output);

