// services/device/public/mojom/wake_lock.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_DEVICE_PUBLIC_MOJOM_WAKE_LOCK_MOJOM_PARAMS_DATA_H_
#define SERVICES_DEVICE_PUBLIC_MOJOM_WAKE_LOCK_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace device::mojom {
namespace internal {
class WakeLock_RequestWakeLock_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WakeLock_RequestWakeLock_Params_Data>;

    WakeLock_RequestWakeLock_Params_Data();
    ~WakeLock_RequestWakeLock_Params_Data() = delete;
};
static_assert(sizeof(WakeLock_RequestWakeLock_Params_Data) == 8, "Bad sizeof(WakeLock_RequestWakeLock_Params_Data)");
class WakeLock_CancelWakeLock_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WakeLock_CancelWakeLock_Params_Data>;

    WakeLock_CancelWakeLock_Params_Data();
    ~WakeLock_CancelWakeLock_Params_Data() = delete;
};
static_assert(sizeof(WakeLock_CancelWakeLock_Params_Data) == 8, "Bad sizeof(WakeLock_CancelWakeLock_Params_Data)");
class WakeLock_AddClient_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data wake_lock;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WakeLock_AddClient_Params_Data>;

    WakeLock_AddClient_Params_Data();
    ~WakeLock_AddClient_Params_Data() = delete;
};
static_assert(sizeof(WakeLock_AddClient_Params_Data) == 16, "Bad sizeof(WakeLock_AddClient_Params_Data)");
class WakeLock_ChangeType_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WakeLock_ChangeType_Params_Data>;

    WakeLock_ChangeType_Params_Data();
    ~WakeLock_ChangeType_Params_Data() = delete;
};
static_assert(sizeof(WakeLock_ChangeType_Params_Data) == 16, "Bad sizeof(WakeLock_ChangeType_Params_Data)");
class WakeLock_ChangeType_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<WakeLock_ChangeType_ResponseParams_Data>;

    WakeLock_ChangeType_ResponseParams_Data();
    ~WakeLock_ChangeType_ResponseParams_Data() = delete;
};
static_assert(sizeof(WakeLock_ChangeType_ResponseParams_Data) == 16, "Bad sizeof(WakeLock_ChangeType_ResponseParams_Data)");
class WakeLock_HasWakeLockForTests_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WakeLock_HasWakeLockForTests_Params_Data>;

    WakeLock_HasWakeLockForTests_Params_Data();
    ~WakeLock_HasWakeLockForTests_Params_Data() = delete;
};
static_assert(sizeof(WakeLock_HasWakeLockForTests_Params_Data) == 8, "Bad sizeof(WakeLock_HasWakeLockForTests_Params_Data)");
class WakeLock_HasWakeLockForTests_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<WakeLock_HasWakeLockForTests_ResponseParams_Data>;

    WakeLock_HasWakeLockForTests_ResponseParams_Data();
    ~WakeLock_HasWakeLockForTests_ResponseParams_Data() = delete;
};
static_assert(sizeof(WakeLock_HasWakeLockForTests_ResponseParams_Data) == 16, "Bad sizeof(WakeLock_HasWakeLockForTests_ResponseParams_Data)");

} // namespace internal

class WakeLock_RequestWakeLock_ParamsDataView {
public:
    WakeLock_RequestWakeLock_ParamsDataView() = default;

    WakeLock_RequestWakeLock_ParamsDataView(internal::WakeLock_RequestWakeLock_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::WakeLock_RequestWakeLock_Params_Data* data_ = nullptr;
};

class WakeLock_CancelWakeLock_ParamsDataView {
public:
    WakeLock_CancelWakeLock_ParamsDataView() = default;

    WakeLock_CancelWakeLock_ParamsDataView(internal::WakeLock_CancelWakeLock_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::WakeLock_CancelWakeLock_Params_Data* data_ = nullptr;
};

class WakeLock_AddClient_ParamsDataView {
public:
    WakeLock_AddClient_ParamsDataView() = default;

    WakeLock_AddClient_ParamsDataView(internal::WakeLock_AddClient_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeWakeLock()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::device::mojom::WakeLockInterfaceBase>>(&data_->wake_lock, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::WakeLock_AddClient_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class WakeLock_ChangeType_ParamsDataView {
public:
    WakeLock_ChangeType_ParamsDataView() = default;

    WakeLock_ChangeType_ParamsDataView(internal::WakeLock_ChangeType_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadType(UserType* output) const
    {
        auto data_value = data_->type;
        return mojo::internal::Deserialize<::device::mojom::WakeLockType>(data_value, output);
    }
    WakeLockType type() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::device::mojom::WakeLockType>(data_->type));
    }

private:
    internal::WakeLock_ChangeType_Params_Data* data_ = nullptr;
};

class WakeLock_ChangeType_ResponseParamsDataView {
public:
    WakeLock_ChangeType_ResponseParamsDataView() = default;

    WakeLock_ChangeType_ResponseParamsDataView(internal::WakeLock_ChangeType_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    bool result() const
    {
        return data_->result;
    }

private:
    internal::WakeLock_ChangeType_ResponseParams_Data* data_ = nullptr;
};

class WakeLock_HasWakeLockForTests_ParamsDataView {
public:
    WakeLock_HasWakeLockForTests_ParamsDataView() = default;

    WakeLock_HasWakeLockForTests_ParamsDataView(internal::WakeLock_HasWakeLockForTests_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::WakeLock_HasWakeLockForTests_Params_Data* data_ = nullptr;
};

class WakeLock_HasWakeLockForTests_ResponseParamsDataView {
public:
    WakeLock_HasWakeLockForTests_ResponseParamsDataView() = default;

    WakeLock_HasWakeLockForTests_ResponseParamsDataView(internal::WakeLock_HasWakeLockForTests_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    bool result() const
    {
        return data_->result;
    }

private:
    internal::WakeLock_HasWakeLockForTests_ResponseParams_Data* data_ = nullptr;
};

} // device::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // SERVICES_DEVICE_PUBLIC_MOJOM_WAKE_LOCK_MOJOM_PARAMS_DATA_H_
