// third_party/blink/public/mojom/printing/web_printing.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_PRINTING_WEB_PRINTING_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_PRINTING_WEB_PRINTING_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebPrintJobStateObserver_OnWebPrintJobUpdate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::WebPrintJobUpdate_Data> update;

private:
    friend class mojo::internal::MessageFragment<WebPrintJobStateObserver_OnWebPrintJobUpdate_Params_Data>;

    WebPrintJobStateObserver_OnWebPrintJobUpdate_Params_Data();
    ~WebPrintJobStateObserver_OnWebPrintJobUpdate_Params_Data() = delete;
};
static_assert(sizeof(WebPrintJobStateObserver_OnWebPrintJobUpdate_Params_Data) == 16, "Bad sizeof(WebPrintJobStateObserver_OnWebPrintJobUpdate_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebPrintJobController_Cancel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WebPrintJobController_Cancel_Params_Data>;

    WebPrintJobController_Cancel_Params_Data();
    ~WebPrintJobController_Cancel_Params_Data() = delete;
};
static_assert(sizeof(WebPrintJobController_Cancel_Params_Data) == 8, "Bad sizeof(WebPrintJobController_Cancel_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebPrinter_FetchAttributes_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WebPrinter_FetchAttributes_Params_Data>;

    WebPrinter_FetchAttributes_Params_Data();
    ~WebPrinter_FetchAttributes_Params_Data() = delete;
};
static_assert(sizeof(WebPrinter_FetchAttributes_Params_Data) == 8, "Bad sizeof(WebPrinter_FetchAttributes_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebPrinter_FetchAttributes_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::WebPrinterFetchResult_Data result;

private:
    friend class mojo::internal::MessageFragment<WebPrinter_FetchAttributes_ResponseParams_Data>;

    WebPrinter_FetchAttributes_ResponseParams_Data();
    ~WebPrinter_FetchAttributes_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebPrinter_FetchAttributes_ResponseParams_Data) == 24, "Bad sizeof(WebPrinter_FetchAttributes_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebPrinter_Print_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data document;
    mojo::internal::Pointer<internal::WebPrintJobTemplateAttributes_Data> attributes;

private:
    friend class mojo::internal::MessageFragment<WebPrinter_Print_Params_Data>;

    WebPrinter_Print_Params_Data();
    ~WebPrinter_Print_Params_Data() = delete;
};
static_assert(sizeof(WebPrinter_Print_Params_Data) == 24, "Bad sizeof(WebPrinter_Print_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebPrinter_Print_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::WebPrintResult_Data result;

private:
    friend class mojo::internal::MessageFragment<WebPrinter_Print_ResponseParams_Data>;

    WebPrinter_Print_ResponseParams_Data();
    ~WebPrinter_Print_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebPrinter_Print_ResponseParams_Data) == 24, "Bad sizeof(WebPrinter_Print_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebPrintingService_GetPrinters_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WebPrintingService_GetPrinters_Params_Data>;

    WebPrintingService_GetPrinters_Params_Data();
    ~WebPrintingService_GetPrinters_Params_Data() = delete;
};
static_assert(sizeof(WebPrintingService_GetPrinters_Params_Data) == 8, "Bad sizeof(WebPrintingService_GetPrinters_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebPrintingService_GetPrinters_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::GetPrintersResult_Data result;

private:
    friend class mojo::internal::MessageFragment<WebPrintingService_GetPrinters_ResponseParams_Data>;

    WebPrintingService_GetPrinters_ResponseParams_Data();
    ~WebPrintingService_GetPrinters_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebPrintingService_GetPrinters_ResponseParams_Data) == 24, "Bad sizeof(WebPrintingService_GetPrinters_ResponseParams_Data)");

} // namespace internal

class WebPrintJobStateObserver_OnWebPrintJobUpdate_ParamsDataView {
public:
    WebPrintJobStateObserver_OnWebPrintJobUpdate_ParamsDataView() = default;

    WebPrintJobStateObserver_OnWebPrintJobUpdate_ParamsDataView(
        internal::WebPrintJobStateObserver_OnWebPrintJobUpdate_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetUpdateDataView(WebPrintJobUpdateDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadUpdate(UserType* output)
    {

        auto* pointer = data_->update.Get();
        return mojo::internal::Deserialize<::blink::mojom::WebPrintJobUpdateDataView>(pointer, output, message_);
    }

private:
    internal::WebPrintJobStateObserver_OnWebPrintJobUpdate_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class WebPrintJobController_Cancel_ParamsDataView {
public:
    WebPrintJobController_Cancel_ParamsDataView() = default;

    WebPrintJobController_Cancel_ParamsDataView(internal::WebPrintJobController_Cancel_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::WebPrintJobController_Cancel_Params_Data* data_ = nullptr;
};

class WebPrinter_FetchAttributes_ParamsDataView {
public:
    WebPrinter_FetchAttributes_ParamsDataView() = default;

    WebPrinter_FetchAttributes_ParamsDataView(internal::WebPrinter_FetchAttributes_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::WebPrinter_FetchAttributes_Params_Data* data_ = nullptr;
};

class WebPrinter_FetchAttributes_ResponseParamsDataView {
public:
    WebPrinter_FetchAttributes_ResponseParamsDataView() = default;

    WebPrinter_FetchAttributes_ResponseParamsDataView(internal::WebPrinter_FetchAttributes_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetResultDataView(WebPrinterFetchResultDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadResult(UserType* output)
    {

        auto* pointer = !data_->result.is_null() ? &data_->result : nullptr;
        return mojo::internal::Deserialize<::blink::mojom::WebPrinterFetchResultDataView>(pointer, output, message_);
    }

private:
    internal::WebPrinter_FetchAttributes_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class WebPrinter_Print_ParamsDataView {
public:
    WebPrinter_Print_ParamsDataView() = default;

    WebPrinter_Print_ParamsDataView(internal::WebPrinter_Print_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeDocument()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::blink::mojom::BlobInterfaceBase>>(&data_->document, &result, message_);
        DCHECK(ret);
        return result;
    }
    inline void GetAttributesDataView(WebPrintJobTemplateAttributesDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadAttributes(UserType* output)
    {

        auto* pointer = data_->attributes.Get();
        return mojo::internal::Deserialize<::blink::mojom::WebPrintJobTemplateAttributesDataView>(pointer, output, message_);
    }

private:
    internal::WebPrinter_Print_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class WebPrinter_Print_ResponseParamsDataView {
public:
    WebPrinter_Print_ResponseParamsDataView() = default;

    WebPrinter_Print_ResponseParamsDataView(internal::WebPrinter_Print_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetResultDataView(WebPrintResultDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadResult(UserType* output)
    {

        auto* pointer = !data_->result.is_null() ? &data_->result : nullptr;
        return mojo::internal::Deserialize<::blink::mojom::WebPrintResultDataView>(pointer, output, message_);
    }

private:
    internal::WebPrinter_Print_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class WebPrintingService_GetPrinters_ParamsDataView {
public:
    WebPrintingService_GetPrinters_ParamsDataView() = default;

    WebPrintingService_GetPrinters_ParamsDataView(internal::WebPrintingService_GetPrinters_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::WebPrintingService_GetPrinters_Params_Data* data_ = nullptr;
};

class WebPrintingService_GetPrinters_ResponseParamsDataView {
public:
    WebPrintingService_GetPrinters_ResponseParamsDataView() = default;

    WebPrintingService_GetPrinters_ResponseParamsDataView(internal::WebPrintingService_GetPrinters_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetResultDataView(GetPrintersResultDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadResult(UserType* output)
    {

        auto* pointer = !data_->result.is_null() ? &data_->result : nullptr;
        return mojo::internal::Deserialize<::blink::mojom::GetPrintersResultDataView>(pointer, output, message_);
    }

private:
    internal::WebPrintingService_GetPrinters_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

inline void WebPrintJobStateObserver_OnWebPrintJobUpdate_ParamsDataView::GetUpdateDataView(WebPrintJobUpdateDataView* output)
{
    auto pointer = data_->update.Get();
    *output = WebPrintJobUpdateDataView(pointer, message_);
}

inline void WebPrinter_FetchAttributes_ResponseParamsDataView::GetResultDataView(WebPrinterFetchResultDataView* output)
{
    auto pointer = &data_->result;
    *output = WebPrinterFetchResultDataView(pointer, message_);
}

inline void WebPrinter_Print_ParamsDataView::GetAttributesDataView(WebPrintJobTemplateAttributesDataView* output)
{
    auto pointer = data_->attributes.Get();
    *output = WebPrintJobTemplateAttributesDataView(pointer, message_);
}

inline void WebPrinter_Print_ResponseParamsDataView::GetResultDataView(WebPrintResultDataView* output)
{
    auto pointer = &data_->result;
    *output = WebPrintResultDataView(pointer, message_);
}

inline void WebPrintingService_GetPrinters_ResponseParamsDataView::GetResultDataView(GetPrintersResultDataView* output)
{
    auto pointer = &data_->result;
    *output = GetPrintersResultDataView(pointer, message_);
}

} // blink::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // THIRD_PARTY_BLINK_PUBLIC_MOJOM_PRINTING_WEB_PRINTING_MOJOM_PARAMS_DATA_H_
