// third_party/blink/public/mojom/ai/ai_assistant.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_AI_AI_ASSISTANT_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_AI_AI_ASSISTANT_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIManagerCreateAssistantClient_OnResult_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data assistant_remote;
    mojo::internal::Pointer<internal::AIAssistantInfo_Data> info;

private:
    friend class mojo::internal::MessageFragment<AIManagerCreateAssistantClient_OnResult_Params_Data>;

    AIManagerCreateAssistantClient_OnResult_Params_Data();
    ~AIManagerCreateAssistantClient_OnResult_Params_Data() = delete;
};
static_assert(sizeof(AIManagerCreateAssistantClient_OnResult_Params_Data) == 24, "Bad sizeof(AIManagerCreateAssistantClient_OnResult_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIAssistantCountPromptTokensClient_OnResult_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t number_of_tokens;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<AIAssistantCountPromptTokensClient_OnResult_Params_Data>;

    AIAssistantCountPromptTokensClient_OnResult_Params_Data();
    ~AIAssistantCountPromptTokensClient_OnResult_Params_Data() = delete;
};
static_assert(sizeof(AIAssistantCountPromptTokensClient_OnResult_Params_Data) == 16, "Bad sizeof(AIAssistantCountPromptTokensClient_OnResult_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIAssistant_Prompt_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> input;
    mojo::internal::Interface_Data pending_responder;

private:
    friend class mojo::internal::MessageFragment<AIAssistant_Prompt_Params_Data>;

    AIAssistant_Prompt_Params_Data();
    ~AIAssistant_Prompt_Params_Data() = delete;
};
static_assert(sizeof(AIAssistant_Prompt_Params_Data) == 24, "Bad sizeof(AIAssistant_Prompt_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIAssistant_Fork_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data client;

private:
    friend class mojo::internal::MessageFragment<AIAssistant_Fork_Params_Data>;

    AIAssistant_Fork_Params_Data();
    ~AIAssistant_Fork_Params_Data() = delete;
};
static_assert(sizeof(AIAssistant_Fork_Params_Data) == 16, "Bad sizeof(AIAssistant_Fork_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIAssistant_Destroy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AIAssistant_Destroy_Params_Data>;

    AIAssistant_Destroy_Params_Data();
    ~AIAssistant_Destroy_Params_Data() = delete;
};
static_assert(sizeof(AIAssistant_Destroy_Params_Data) == 8, "Bad sizeof(AIAssistant_Destroy_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIAssistant_CountPromptTokens_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> input;
    mojo::internal::Interface_Data client;

private:
    friend class mojo::internal::MessageFragment<AIAssistant_CountPromptTokens_Params_Data>;

    AIAssistant_CountPromptTokens_Params_Data();
    ~AIAssistant_CountPromptTokens_Params_Data() = delete;
};
static_assert(sizeof(AIAssistant_CountPromptTokens_Params_Data) == 24, "Bad sizeof(AIAssistant_CountPromptTokens_Params_Data)");

} // namespace internal

class AIManagerCreateAssistantClient_OnResult_ParamsDataView {
public:
    AIManagerCreateAssistantClient_OnResult_ParamsDataView() = default;

    AIManagerCreateAssistantClient_OnResult_ParamsDataView(internal::AIManagerCreateAssistantClient_OnResult_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeAssistantRemote()
    {
        UserType result;
        bool ret
            = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::blink::mojom::AIAssistantInterfaceBase>>(&data_->assistant_remote, &result, message_);
        DCHECK(ret);
        return result;
    }
    inline void GetInfoDataView(AIAssistantInfoDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadInfo(UserType* output)
    {

        static_assert(mojo::internal::IsValidUserTypeForOptionalValue<::blink::mojom::AIAssistantInfoDataView, UserType>(),
            "Attempting to read the optional `info` field into a type which "
            "cannot represent a null value. Either wrap the destination object "
            "with std::optional, ensure that any corresponding "
            "{Struct/Union/Array/String}Traits define the necessary IsNull and "
            "SetToNull methods, or use `MaybeReadInfo` instead "
            "of `ReadInfo if you're fine with null values being "
            "silently ignored in this case.");
        auto* pointer = data_->info.Get();
        return mojo::internal::Deserialize<::blink::mojom::AIAssistantInfoDataView>(pointer, output, message_);
    }

private:
    internal::AIManagerCreateAssistantClient_OnResult_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class AIAssistantCountPromptTokensClient_OnResult_ParamsDataView {
public:
    AIAssistantCountPromptTokensClient_OnResult_ParamsDataView() = default;

    AIAssistantCountPromptTokensClient_OnResult_ParamsDataView(internal::AIAssistantCountPromptTokensClient_OnResult_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    uint32_t number_of_tokens() const
    {
        return data_->number_of_tokens;
    }

private:
    internal::AIAssistantCountPromptTokensClient_OnResult_Params_Data* data_ = nullptr;
};

class AIAssistant_Prompt_ParamsDataView {
public:
    AIAssistant_Prompt_ParamsDataView() = default;

    AIAssistant_Prompt_ParamsDataView(internal::AIAssistant_Prompt_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetInputDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadInput(UserType* output)
    {

        auto* pointer = data_->input.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }
    template <typename UserType> UserType TakePendingResponder()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::blink::mojom::ModelStreamingResponderInterfaceBase>>(
            &data_->pending_responder, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::AIAssistant_Prompt_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class AIAssistant_Fork_ParamsDataView {
public:
    AIAssistant_Fork_ParamsDataView() = default;

    AIAssistant_Fork_ParamsDataView(internal::AIAssistant_Fork_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeClient()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::blink::mojom::AIManagerCreateAssistantClientInterfaceBase>>(
            &data_->client, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::AIAssistant_Fork_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class AIAssistant_Destroy_ParamsDataView {
public:
    AIAssistant_Destroy_ParamsDataView() = default;

    AIAssistant_Destroy_ParamsDataView(internal::AIAssistant_Destroy_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::AIAssistant_Destroy_Params_Data* data_ = nullptr;
};

class AIAssistant_CountPromptTokens_ParamsDataView {
public:
    AIAssistant_CountPromptTokens_ParamsDataView() = default;

    AIAssistant_CountPromptTokens_ParamsDataView(internal::AIAssistant_CountPromptTokens_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetInputDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadInput(UserType* output)
    {

        auto* pointer = data_->input.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }
    template <typename UserType> UserType TakeClient()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::blink::mojom::AIAssistantCountPromptTokensClientInterfaceBase>>(
            &data_->client, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::AIAssistant_CountPromptTokens_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

inline void AIManagerCreateAssistantClient_OnResult_ParamsDataView::GetInfoDataView(AIAssistantInfoDataView* output)
{
    auto pointer = data_->info.Get();
    *output = AIAssistantInfoDataView(pointer, message_);
}

inline void AIAssistant_Prompt_ParamsDataView::GetInputDataView(mojo::StringDataView* output)
{
    auto pointer = data_->input.Get();
    *output = mojo::StringDataView(pointer, message_);
}

inline void AIAssistant_CountPromptTokens_ParamsDataView::GetInputDataView(mojo::StringDataView* output)
{
    auto pointer = data_->input.Get();
    *output = mojo::StringDataView(pointer, message_);
}

} // blink::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // THIRD_PARTY_BLINK_PUBLIC_MOJOM_AI_AI_ASSISTANT_MOJOM_PARAMS_DATA_H_
