// third_party/blink/public/mojom/ai/ai_manager.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_AI_AI_MANAGER_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_AI_AI_MANAGER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIManagerCreateWriterClient_OnResult_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data writer;

private:
    friend class mojo::internal::MessageFragment<AIManagerCreateWriterClient_OnResult_Params_Data>;

    AIManagerCreateWriterClient_OnResult_Params_Data();
    ~AIManagerCreateWriterClient_OnResult_Params_Data() = delete;
};
static_assert(sizeof(AIManagerCreateWriterClient_OnResult_Params_Data) == 16, "Bad sizeof(AIManagerCreateWriterClient_OnResult_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIManagerCreateRewriterClient_OnResult_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data rewriter;

private:
    friend class mojo::internal::MessageFragment<AIManagerCreateRewriterClient_OnResult_Params_Data>;

    AIManagerCreateRewriterClient_OnResult_Params_Data();
    ~AIManagerCreateRewriterClient_OnResult_Params_Data() = delete;
};
static_assert(sizeof(AIManagerCreateRewriterClient_OnResult_Params_Data) == 16, "Bad sizeof(AIManagerCreateRewriterClient_OnResult_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIManagerCreateSummarizerClient_OnResult_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data summarizer;

private:
    friend class mojo::internal::MessageFragment<AIManagerCreateSummarizerClient_OnResult_Params_Data>;

    AIManagerCreateSummarizerClient_OnResult_Params_Data();
    ~AIManagerCreateSummarizerClient_OnResult_Params_Data() = delete;
};
static_assert(sizeof(AIManagerCreateSummarizerClient_OnResult_Params_Data) == 16, "Bad sizeof(AIManagerCreateSummarizerClient_OnResult_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIManager_CanCreateAssistant_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AIManager_CanCreateAssistant_Params_Data>;

    AIManager_CanCreateAssistant_Params_Data();
    ~AIManager_CanCreateAssistant_Params_Data() = delete;
};
static_assert(sizeof(AIManager_CanCreateAssistant_Params_Data) == 8, "Bad sizeof(AIManager_CanCreateAssistant_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIManager_CanCreateAssistant_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<AIManager_CanCreateAssistant_ResponseParams_Data>;

    AIManager_CanCreateAssistant_ResponseParams_Data();
    ~AIManager_CanCreateAssistant_ResponseParams_Data() = delete;
};
static_assert(sizeof(AIManager_CanCreateAssistant_ResponseParams_Data) == 16, "Bad sizeof(AIManager_CanCreateAssistant_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIManager_CreateAssistant_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data client;
    mojo::internal::Pointer<::blink::mojom::internal::AIAssistantCreateOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<AIManager_CreateAssistant_Params_Data>;

    AIManager_CreateAssistant_Params_Data();
    ~AIManager_CreateAssistant_Params_Data() = delete;
};
static_assert(sizeof(AIManager_CreateAssistant_Params_Data) == 24, "Bad sizeof(AIManager_CreateAssistant_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIManager_CanCreateSummarizer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AIManager_CanCreateSummarizer_Params_Data>;

    AIManager_CanCreateSummarizer_Params_Data();
    ~AIManager_CanCreateSummarizer_Params_Data() = delete;
};
static_assert(sizeof(AIManager_CanCreateSummarizer_Params_Data) == 8, "Bad sizeof(AIManager_CanCreateSummarizer_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIManager_CanCreateSummarizer_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<AIManager_CanCreateSummarizer_ResponseParams_Data>;

    AIManager_CanCreateSummarizer_ResponseParams_Data();
    ~AIManager_CanCreateSummarizer_ResponseParams_Data() = delete;
};
static_assert(sizeof(AIManager_CanCreateSummarizer_ResponseParams_Data) == 16, "Bad sizeof(AIManager_CanCreateSummarizer_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIManager_CreateSummarizer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data client;
    mojo::internal::Pointer<::blink::mojom::internal::AISummarizerCreateOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<AIManager_CreateSummarizer_Params_Data>;

    AIManager_CreateSummarizer_Params_Data();
    ~AIManager_CreateSummarizer_Params_Data() = delete;
};
static_assert(sizeof(AIManager_CreateSummarizer_Params_Data) == 24, "Bad sizeof(AIManager_CreateSummarizer_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIManager_GetModelInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AIManager_GetModelInfo_Params_Data>;

    AIManager_GetModelInfo_Params_Data();
    ~AIManager_GetModelInfo_Params_Data() = delete;
};
static_assert(sizeof(AIManager_GetModelInfo_Params_Data) == 8, "Bad sizeof(AIManager_GetModelInfo_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIManager_GetModelInfo_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::AIModelInfo_Data> model_info;

private:
    friend class mojo::internal::MessageFragment<AIManager_GetModelInfo_ResponseParams_Data>;

    AIManager_GetModelInfo_ResponseParams_Data();
    ~AIManager_GetModelInfo_ResponseParams_Data() = delete;
};
static_assert(sizeof(AIManager_GetModelInfo_ResponseParams_Data) == 16, "Bad sizeof(AIManager_GetModelInfo_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIManager_CreateWriter_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data client;
    mojo::internal::Pointer<::blink::mojom::internal::AIWriterCreateOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<AIManager_CreateWriter_Params_Data>;

    AIManager_CreateWriter_Params_Data();
    ~AIManager_CreateWriter_Params_Data() = delete;
};
static_assert(sizeof(AIManager_CreateWriter_Params_Data) == 24, "Bad sizeof(AIManager_CreateWriter_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIManager_CreateRewriter_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data client;
    mojo::internal::Pointer<::blink::mojom::internal::AIRewriterCreateOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<AIManager_CreateRewriter_Params_Data>;

    AIManager_CreateRewriter_Params_Data();
    ~AIManager_CreateRewriter_Params_Data() = delete;
};
static_assert(sizeof(AIManager_CreateRewriter_Params_Data) == 24, "Bad sizeof(AIManager_CreateRewriter_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) AIManager_AddModelDownloadProgressObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data observer_remote;

private:
    friend class mojo::internal::MessageFragment<AIManager_AddModelDownloadProgressObserver_Params_Data>;

    AIManager_AddModelDownloadProgressObserver_Params_Data();
    ~AIManager_AddModelDownloadProgressObserver_Params_Data() = delete;
};
static_assert(sizeof(AIManager_AddModelDownloadProgressObserver_Params_Data) == 16, "Bad sizeof(AIManager_AddModelDownloadProgressObserver_Params_Data)");

} // namespace internal

class AIManagerCreateWriterClient_OnResult_ParamsDataView {
public:
    AIManagerCreateWriterClient_OnResult_ParamsDataView() = default;

    AIManagerCreateWriterClient_OnResult_ParamsDataView(internal::AIManagerCreateWriterClient_OnResult_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeWriter()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::blink::mojom::AIWriterInterfaceBase>>(&data_->writer, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::AIManagerCreateWriterClient_OnResult_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class AIManagerCreateRewriterClient_OnResult_ParamsDataView {
public:
    AIManagerCreateRewriterClient_OnResult_ParamsDataView() = default;

    AIManagerCreateRewriterClient_OnResult_ParamsDataView(internal::AIManagerCreateRewriterClient_OnResult_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeRewriter()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::blink::mojom::AIRewriterInterfaceBase>>(&data_->rewriter, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::AIManagerCreateRewriterClient_OnResult_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class AIManagerCreateSummarizerClient_OnResult_ParamsDataView {
public:
    AIManagerCreateSummarizerClient_OnResult_ParamsDataView() = default;

    AIManagerCreateSummarizerClient_OnResult_ParamsDataView(internal::AIManagerCreateSummarizerClient_OnResult_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeSummarizer()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::blink::mojom::AISummarizerInterfaceBase>>(&data_->summarizer, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::AIManagerCreateSummarizerClient_OnResult_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class AIManager_CanCreateAssistant_ParamsDataView {
public:
    AIManager_CanCreateAssistant_ParamsDataView() = default;

    AIManager_CanCreateAssistant_ParamsDataView(internal::AIManager_CanCreateAssistant_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::AIManager_CanCreateAssistant_Params_Data* data_ = nullptr;
};

class AIManager_CanCreateAssistant_ResponseParamsDataView {
public:
    AIManager_CanCreateAssistant_ResponseParamsDataView() = default;

    AIManager_CanCreateAssistant_ResponseParamsDataView(internal::AIManager_CanCreateAssistant_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadResult(UserType* output) const
    {
        auto data_value = data_->result;
        return mojo::internal::Deserialize<::blink::mojom::ModelAvailabilityCheckResult>(data_value, output);
    }
    ModelAvailabilityCheckResult result() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::blink::mojom::ModelAvailabilityCheckResult>(data_->result));
    }

private:
    internal::AIManager_CanCreateAssistant_ResponseParams_Data* data_ = nullptr;
};

class AIManager_CreateAssistant_ParamsDataView {
public:
    AIManager_CreateAssistant_ParamsDataView() = default;

    AIManager_CreateAssistant_ParamsDataView(internal::AIManager_CreateAssistant_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeClient()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::blink::mojom::AIManagerCreateAssistantClientInterfaceBase>>(
            &data_->client, &result, message_);
        DCHECK(ret);
        return result;
    }
    inline void GetOptionsDataView(::blink::mojom::AIAssistantCreateOptionsDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadOptions(UserType* output)
    {

        auto* pointer = data_->options.Get();
        return mojo::internal::Deserialize<::blink::mojom::AIAssistantCreateOptionsDataView>(pointer, output, message_);
    }

private:
    internal::AIManager_CreateAssistant_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class AIManager_CanCreateSummarizer_ParamsDataView {
public:
    AIManager_CanCreateSummarizer_ParamsDataView() = default;

    AIManager_CanCreateSummarizer_ParamsDataView(internal::AIManager_CanCreateSummarizer_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::AIManager_CanCreateSummarizer_Params_Data* data_ = nullptr;
};

class AIManager_CanCreateSummarizer_ResponseParamsDataView {
public:
    AIManager_CanCreateSummarizer_ResponseParamsDataView() = default;

    AIManager_CanCreateSummarizer_ResponseParamsDataView(internal::AIManager_CanCreateSummarizer_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadResult(UserType* output) const
    {
        auto data_value = data_->result;
        return mojo::internal::Deserialize<::blink::mojom::ModelAvailabilityCheckResult>(data_value, output);
    }
    ModelAvailabilityCheckResult result() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::blink::mojom::ModelAvailabilityCheckResult>(data_->result));
    }

private:
    internal::AIManager_CanCreateSummarizer_ResponseParams_Data* data_ = nullptr;
};

class AIManager_CreateSummarizer_ParamsDataView {
public:
    AIManager_CreateSummarizer_ParamsDataView() = default;

    AIManager_CreateSummarizer_ParamsDataView(internal::AIManager_CreateSummarizer_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeClient()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::blink::mojom::AIManagerCreateSummarizerClientInterfaceBase>>(
            &data_->client, &result, message_);
        DCHECK(ret);
        return result;
    }
    inline void GetOptionsDataView(::blink::mojom::AISummarizerCreateOptionsDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadOptions(UserType* output)
    {

        auto* pointer = data_->options.Get();
        return mojo::internal::Deserialize<::blink::mojom::AISummarizerCreateOptionsDataView>(pointer, output, message_);
    }

private:
    internal::AIManager_CreateSummarizer_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class AIManager_GetModelInfo_ParamsDataView {
public:
    AIManager_GetModelInfo_ParamsDataView() = default;

    AIManager_GetModelInfo_ParamsDataView(internal::AIManager_GetModelInfo_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::AIManager_GetModelInfo_Params_Data* data_ = nullptr;
};

class AIManager_GetModelInfo_ResponseParamsDataView {
public:
    AIManager_GetModelInfo_ResponseParamsDataView() = default;

    AIManager_GetModelInfo_ResponseParamsDataView(internal::AIManager_GetModelInfo_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetModelInfoDataView(::blink::mojom::AIModelInfoDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadModelInfo(UserType* output)
    {

        auto* pointer = data_->model_info.Get();
        return mojo::internal::Deserialize<::blink::mojom::AIModelInfoDataView>(pointer, output, message_);
    }

private:
    internal::AIManager_GetModelInfo_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class AIManager_CreateWriter_ParamsDataView {
public:
    AIManager_CreateWriter_ParamsDataView() = default;

    AIManager_CreateWriter_ParamsDataView(internal::AIManager_CreateWriter_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeClient()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::blink::mojom::AIManagerCreateWriterClientInterfaceBase>>(
            &data_->client, &result, message_);
        DCHECK(ret);
        return result;
    }
    inline void GetOptionsDataView(::blink::mojom::AIWriterCreateOptionsDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadOptions(UserType* output)
    {

        auto* pointer = data_->options.Get();
        return mojo::internal::Deserialize<::blink::mojom::AIWriterCreateOptionsDataView>(pointer, output, message_);
    }

private:
    internal::AIManager_CreateWriter_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class AIManager_CreateRewriter_ParamsDataView {
public:
    AIManager_CreateRewriter_ParamsDataView() = default;

    AIManager_CreateRewriter_ParamsDataView(internal::AIManager_CreateRewriter_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeClient()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::blink::mojom::AIManagerCreateRewriterClientInterfaceBase>>(
            &data_->client, &result, message_);
        DCHECK(ret);
        return result;
    }
    inline void GetOptionsDataView(::blink::mojom::AIRewriterCreateOptionsDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadOptions(UserType* output)
    {

        auto* pointer = data_->options.Get();
        return mojo::internal::Deserialize<::blink::mojom::AIRewriterCreateOptionsDataView>(pointer, output, message_);
    }

private:
    internal::AIManager_CreateRewriter_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class AIManager_AddModelDownloadProgressObserver_ParamsDataView {
public:
    AIManager_AddModelDownloadProgressObserver_ParamsDataView() = default;

    AIManager_AddModelDownloadProgressObserver_ParamsDataView(internal::AIManager_AddModelDownloadProgressObserver_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeObserverRemote()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::blink::mojom::ModelDownloadProgressObserverInterfaceBase>>(
            &data_->observer_remote, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::AIManager_AddModelDownloadProgressObserver_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

inline void AIManager_CreateAssistant_ParamsDataView::GetOptionsDataView(::blink::mojom::AIAssistantCreateOptionsDataView* output)
{
    auto pointer = data_->options.Get();
    *output = ::blink::mojom::AIAssistantCreateOptionsDataView(pointer, message_);
}

inline void AIManager_CreateSummarizer_ParamsDataView::GetOptionsDataView(::blink::mojom::AISummarizerCreateOptionsDataView* output)
{
    auto pointer = data_->options.Get();
    *output = ::blink::mojom::AISummarizerCreateOptionsDataView(pointer, message_);
}

inline void AIManager_GetModelInfo_ResponseParamsDataView::GetModelInfoDataView(::blink::mojom::AIModelInfoDataView* output)
{
    auto pointer = data_->model_info.Get();
    *output = ::blink::mojom::AIModelInfoDataView(pointer, message_);
}

inline void AIManager_CreateWriter_ParamsDataView::GetOptionsDataView(::blink::mojom::AIWriterCreateOptionsDataView* output)
{
    auto pointer = data_->options.Get();
    *output = ::blink::mojom::AIWriterCreateOptionsDataView(pointer, message_);
}

inline void AIManager_CreateRewriter_ParamsDataView::GetOptionsDataView(::blink::mojom::AIRewriterCreateOptionsDataView* output)
{
    auto pointer = data_->options.Get();
    *output = ::blink::mojom::AIRewriterCreateOptionsDataView(pointer, message_);
}

} // blink::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // THIRD_PARTY_BLINK_PUBLIC_MOJOM_AI_AI_MANAGER_MOJOM_PARAMS_DATA_H_
