// services/viz/privileged/mojom/gl/gpu_service.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_VIZ_PRIVILEGED_MOJOM_GL_GPU_SERVICE_MOJOM_PARAMS_DATA_H_
#define SERVICES_VIZ_PRIVILEGED_MOJOM_GL_GPU_SERVICE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace viz::mojom {
namespace internal {
class GpuService_EstablishGpuChannel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t client_id;
    uint8_t is_gpu_host : 1;
    uint8_t pad1_[3];
    uint64_t client_tracing_id;

private:
    friend class mojo::internal::MessageFragment<GpuService_EstablishGpuChannel_Params_Data>;

    GpuService_EstablishGpuChannel_Params_Data();
    ~GpuService_EstablishGpuChannel_Params_Data() = delete;
};
static_assert(sizeof(GpuService_EstablishGpuChannel_Params_Data) == 24, "Bad sizeof(GpuService_EstablishGpuChannel_Params_Data)");
class GpuService_EstablishGpuChannel_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data channel_handle;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::gpu::mojom::internal::GpuInfo_Data> gpu_info;
    mojo::internal::Pointer<::gpu::mojom::internal::GpuFeatureInfo_Data> gpu_feature_info;
    mojo::internal::Pointer<::gpu::mojom::internal::SharedImageCapabilities_Data> shared_image_capabilities;

private:
    friend class mojo::internal::MessageFragment<GpuService_EstablishGpuChannel_ResponseParams_Data>;

    GpuService_EstablishGpuChannel_ResponseParams_Data();
    ~GpuService_EstablishGpuChannel_ResponseParams_Data() = delete;
};
static_assert(sizeof(GpuService_EstablishGpuChannel_ResponseParams_Data) == 40, "Bad sizeof(GpuService_EstablishGpuChannel_ResponseParams_Data)");
class GpuService_SetChannelClientPid_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t client_id;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ProcessId_Data> client_pid;

private:
    friend class mojo::internal::MessageFragment<GpuService_SetChannelClientPid_Params_Data>;

    GpuService_SetChannelClientPid_Params_Data();
    ~GpuService_SetChannelClientPid_Params_Data() = delete;
};
static_assert(sizeof(GpuService_SetChannelClientPid_Params_Data) == 24, "Bad sizeof(GpuService_SetChannelClientPid_Params_Data)");
class GpuService_SetChannelDiskCacheHandle_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t client_id;
    uint8_t pad0_[4];
    ::gpu::mojom::internal::GpuDiskCacheHandle_Data cache_handle;

private:
    friend class mojo::internal::MessageFragment<GpuService_SetChannelDiskCacheHandle_Params_Data>;

    GpuService_SetChannelDiskCacheHandle_Params_Data();
    ~GpuService_SetChannelDiskCacheHandle_Params_Data() = delete;
};
static_assert(sizeof(GpuService_SetChannelDiskCacheHandle_Params_Data) == 32, "Bad sizeof(GpuService_SetChannelDiskCacheHandle_Params_Data)");
class GpuService_OnDiskCacheHandleDestoyed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::gpu::mojom::internal::GpuDiskCacheHandle_Data cache_handle;

private:
    friend class mojo::internal::MessageFragment<GpuService_OnDiskCacheHandleDestoyed_Params_Data>;

    GpuService_OnDiskCacheHandleDestoyed_Params_Data();
    ~GpuService_OnDiskCacheHandleDestoyed_Params_Data() = delete;
};
static_assert(sizeof(GpuService_OnDiskCacheHandleDestoyed_Params_Data) == 24, "Bad sizeof(GpuService_OnDiskCacheHandleDestoyed_Params_Data)");
class GpuService_CloseChannel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t client_id;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<GpuService_CloseChannel_Params_Data>;

    GpuService_CloseChannel_Params_Data();
    ~GpuService_CloseChannel_Params_Data() = delete;
};
static_assert(sizeof(GpuService_CloseChannel_Params_Data) == 16, "Bad sizeof(GpuService_CloseChannel_Params_Data)");
class GpuService_RegisterDCOMPSurfaceHandle_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data surface_handle;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<GpuService_RegisterDCOMPSurfaceHandle_Params_Data>;

    GpuService_RegisterDCOMPSurfaceHandle_Params_Data();
    ~GpuService_RegisterDCOMPSurfaceHandle_Params_Data() = delete;
};
static_assert(sizeof(GpuService_RegisterDCOMPSurfaceHandle_Params_Data) == 16, "Bad sizeof(GpuService_RegisterDCOMPSurfaceHandle_Params_Data)");
class GpuService_RegisterDCOMPSurfaceHandle_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> token;

private:
    friend class mojo::internal::MessageFragment<GpuService_RegisterDCOMPSurfaceHandle_ResponseParams_Data>;

    GpuService_RegisterDCOMPSurfaceHandle_ResponseParams_Data();
    ~GpuService_RegisterDCOMPSurfaceHandle_ResponseParams_Data() = delete;
};
static_assert(sizeof(GpuService_RegisterDCOMPSurfaceHandle_ResponseParams_Data) == 16, "Bad sizeof(GpuService_RegisterDCOMPSurfaceHandle_ResponseParams_Data)");
class GpuService_UnregisterDCOMPSurfaceHandle_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> token;

private:
    friend class mojo::internal::MessageFragment<GpuService_UnregisterDCOMPSurfaceHandle_Params_Data>;

    GpuService_UnregisterDCOMPSurfaceHandle_Params_Data();
    ~GpuService_UnregisterDCOMPSurfaceHandle_Params_Data() = delete;
};
static_assert(sizeof(GpuService_UnregisterDCOMPSurfaceHandle_Params_Data) == 16, "Bad sizeof(GpuService_UnregisterDCOMPSurfaceHandle_Params_Data)");
class GpuService_BindClientGmbInterface_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    int32_t client_id;

private:
    friend class mojo::internal::MessageFragment<GpuService_BindClientGmbInterface_Params_Data>;

    GpuService_BindClientGmbInterface_Params_Data();
    ~GpuService_BindClientGmbInterface_Params_Data() = delete;
};
static_assert(sizeof(GpuService_BindClientGmbInterface_Params_Data) == 16, "Bad sizeof(GpuService_BindClientGmbInterface_Params_Data)");
class GpuService_CreateVideoEncodeAcceleratorProvider_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data vea_provider;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<GpuService_CreateVideoEncodeAcceleratorProvider_Params_Data>;

    GpuService_CreateVideoEncodeAcceleratorProvider_Params_Data();
    ~GpuService_CreateVideoEncodeAcceleratorProvider_Params_Data() = delete;
};
static_assert(
    sizeof(GpuService_CreateVideoEncodeAcceleratorProvider_Params_Data) == 16, "Bad sizeof(GpuService_CreateVideoEncodeAcceleratorProvider_Params_Data)");
class GpuService_BindWebNNContextProvider_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    int32_t client_id;

private:
    friend class mojo::internal::MessageFragment<GpuService_BindWebNNContextProvider_Params_Data>;

    GpuService_BindWebNNContextProvider_Params_Data();
    ~GpuService_BindWebNNContextProvider_Params_Data() = delete;
};
static_assert(sizeof(GpuService_BindWebNNContextProvider_Params_Data) == 16, "Bad sizeof(GpuService_BindWebNNContextProvider_Params_Data)");
class GpuService_CreateGpuMemoryBuffer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::GpuMemoryBufferId_Data> id;
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> size;
    int32_t format;
    int32_t usage;
    int32_t client_id;
    uint8_t pad4_[4];
    mojo::internal::Pointer<::gpu::mojom::internal::SurfaceHandle_Data> surface_handle;

private:
    friend class mojo::internal::MessageFragment<GpuService_CreateGpuMemoryBuffer_Params_Data>;

    GpuService_CreateGpuMemoryBuffer_Params_Data();
    ~GpuService_CreateGpuMemoryBuffer_Params_Data() = delete;
};
static_assert(sizeof(GpuService_CreateGpuMemoryBuffer_Params_Data) == 48, "Bad sizeof(GpuService_CreateGpuMemoryBuffer_Params_Data)");
class GpuService_CreateGpuMemoryBuffer_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::GpuMemoryBufferHandle_Data> buffer_handle;

private:
    friend class mojo::internal::MessageFragment<GpuService_CreateGpuMemoryBuffer_ResponseParams_Data>;

    GpuService_CreateGpuMemoryBuffer_ResponseParams_Data();
    ~GpuService_CreateGpuMemoryBuffer_ResponseParams_Data() = delete;
};
static_assert(sizeof(GpuService_CreateGpuMemoryBuffer_ResponseParams_Data) == 16, "Bad sizeof(GpuService_CreateGpuMemoryBuffer_ResponseParams_Data)");
class GpuService_DestroyGpuMemoryBuffer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::GpuMemoryBufferId_Data> id;
    int32_t client_id;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<GpuService_DestroyGpuMemoryBuffer_Params_Data>;

    GpuService_DestroyGpuMemoryBuffer_Params_Data();
    ~GpuService_DestroyGpuMemoryBuffer_Params_Data() = delete;
};
static_assert(sizeof(GpuService_DestroyGpuMemoryBuffer_Params_Data) == 24, "Bad sizeof(GpuService_DestroyGpuMemoryBuffer_Params_Data)");
class GpuService_CopyGpuMemoryBuffer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::GpuMemoryBufferHandle_Data> buffer_handle;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnsafeSharedMemoryRegion_Data> shared_memory;

private:
    friend class mojo::internal::MessageFragment<GpuService_CopyGpuMemoryBuffer_Params_Data>;

    GpuService_CopyGpuMemoryBuffer_Params_Data();
    ~GpuService_CopyGpuMemoryBuffer_Params_Data() = delete;
};
static_assert(sizeof(GpuService_CopyGpuMemoryBuffer_Params_Data) == 24, "Bad sizeof(GpuService_CopyGpuMemoryBuffer_Params_Data)");
class GpuService_CopyGpuMemoryBuffer_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<GpuService_CopyGpuMemoryBuffer_ResponseParams_Data>;

    GpuService_CopyGpuMemoryBuffer_ResponseParams_Data();
    ~GpuService_CopyGpuMemoryBuffer_ResponseParams_Data() = delete;
};
static_assert(sizeof(GpuService_CopyGpuMemoryBuffer_ResponseParams_Data) == 16, "Bad sizeof(GpuService_CopyGpuMemoryBuffer_ResponseParams_Data)");
class GpuService_GetVideoMemoryUsageStats_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<GpuService_GetVideoMemoryUsageStats_Params_Data>;

    GpuService_GetVideoMemoryUsageStats_Params_Data();
    ~GpuService_GetVideoMemoryUsageStats_Params_Data() = delete;
};
static_assert(sizeof(GpuService_GetVideoMemoryUsageStats_Params_Data) == 8, "Bad sizeof(GpuService_GetVideoMemoryUsageStats_Params_Data)");
class GpuService_GetVideoMemoryUsageStats_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gpu::mojom::internal::VideoMemoryUsageStats_Data> stats;

private:
    friend class mojo::internal::MessageFragment<GpuService_GetVideoMemoryUsageStats_ResponseParams_Data>;

    GpuService_GetVideoMemoryUsageStats_ResponseParams_Data();
    ~GpuService_GetVideoMemoryUsageStats_ResponseParams_Data() = delete;
};
static_assert(sizeof(GpuService_GetVideoMemoryUsageStats_ResponseParams_Data) == 16, "Bad sizeof(GpuService_GetVideoMemoryUsageStats_ResponseParams_Data)");
class GpuService_StartPeakMemoryMonitor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t sequence_num;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<GpuService_StartPeakMemoryMonitor_Params_Data>;

    GpuService_StartPeakMemoryMonitor_Params_Data();
    ~GpuService_StartPeakMemoryMonitor_Params_Data() = delete;
};
static_assert(sizeof(GpuService_StartPeakMemoryMonitor_Params_Data) == 16, "Bad sizeof(GpuService_StartPeakMemoryMonitor_Params_Data)");
class GpuService_GetPeakMemoryUsage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t sequence_num;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<GpuService_GetPeakMemoryUsage_Params_Data>;

    GpuService_GetPeakMemoryUsage_Params_Data();
    ~GpuService_GetPeakMemoryUsage_Params_Data() = delete;
};
static_assert(sizeof(GpuService_GetPeakMemoryUsage_Params_Data) == 16, "Bad sizeof(GpuService_GetPeakMemoryUsage_Params_Data)");
class GpuService_GetPeakMemoryUsage_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t memory_usage;
    mojo::internal::Pointer<mojo::internal::Map_Data<int32_t, uint64_t>> memory_per_allocation_source;

private:
    friend class mojo::internal::MessageFragment<GpuService_GetPeakMemoryUsage_ResponseParams_Data>;

    GpuService_GetPeakMemoryUsage_ResponseParams_Data();
    ~GpuService_GetPeakMemoryUsage_ResponseParams_Data() = delete;
};
static_assert(sizeof(GpuService_GetPeakMemoryUsage_ResponseParams_Data) == 24, "Bad sizeof(GpuService_GetPeakMemoryUsage_ResponseParams_Data)");
class GpuService_RequestDXGIInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<GpuService_RequestDXGIInfo_Params_Data>;

    GpuService_RequestDXGIInfo_Params_Data();
    ~GpuService_RequestDXGIInfo_Params_Data() = delete;
};
static_assert(sizeof(GpuService_RequestDXGIInfo_Params_Data) == 8, "Bad sizeof(GpuService_RequestDXGIInfo_Params_Data)");
class GpuService_RequestDXGIInfo_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::DXGIInfo_Data> dxgi_info;

private:
    friend class mojo::internal::MessageFragment<GpuService_RequestDXGIInfo_ResponseParams_Data>;

    GpuService_RequestDXGIInfo_ResponseParams_Data();
    ~GpuService_RequestDXGIInfo_ResponseParams_Data() = delete;
};
static_assert(sizeof(GpuService_RequestDXGIInfo_ResponseParams_Data) == 16, "Bad sizeof(GpuService_RequestDXGIInfo_ResponseParams_Data)");
class GpuService_LoadedBlob_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::gpu::mojom::internal::GpuDiskCacheHandle_Data cache_handle;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ByteString_Data> key;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ByteString_Data> data;

private:
    friend class mojo::internal::MessageFragment<GpuService_LoadedBlob_Params_Data>;

    GpuService_LoadedBlob_Params_Data();
    ~GpuService_LoadedBlob_Params_Data() = delete;
};
static_assert(sizeof(GpuService_LoadedBlob_Params_Data) == 40, "Bad sizeof(GpuService_LoadedBlob_Params_Data)");
class GpuService_WakeUpGpu_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<GpuService_WakeUpGpu_Params_Data>;

    GpuService_WakeUpGpu_Params_Data();
    ~GpuService_WakeUpGpu_Params_Data() = delete;
};
static_assert(sizeof(GpuService_WakeUpGpu_Params_Data) == 8, "Bad sizeof(GpuService_WakeUpGpu_Params_Data)");
class GpuService_GpuSwitched_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t active_gpu_heuristic;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<GpuService_GpuSwitched_Params_Data>;

    GpuService_GpuSwitched_Params_Data();
    ~GpuService_GpuSwitched_Params_Data() = delete;
};
static_assert(sizeof(GpuService_GpuSwitched_Params_Data) == 16, "Bad sizeof(GpuService_GpuSwitched_Params_Data)");
class GpuService_DisplayAdded_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<GpuService_DisplayAdded_Params_Data>;

    GpuService_DisplayAdded_Params_Data();
    ~GpuService_DisplayAdded_Params_Data() = delete;
};
static_assert(sizeof(GpuService_DisplayAdded_Params_Data) == 8, "Bad sizeof(GpuService_DisplayAdded_Params_Data)");
class GpuService_DisplayRemoved_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<GpuService_DisplayRemoved_Params_Data>;

    GpuService_DisplayRemoved_Params_Data();
    ~GpuService_DisplayRemoved_Params_Data() = delete;
};
static_assert(sizeof(GpuService_DisplayRemoved_Params_Data) == 8, "Bad sizeof(GpuService_DisplayRemoved_Params_Data)");
class GpuService_DisplayMetricsChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<GpuService_DisplayMetricsChanged_Params_Data>;

    GpuService_DisplayMetricsChanged_Params_Data();
    ~GpuService_DisplayMetricsChanged_Params_Data() = delete;
};
static_assert(sizeof(GpuService_DisplayMetricsChanged_Params_Data) == 8, "Bad sizeof(GpuService_DisplayMetricsChanged_Params_Data)");
class GpuService_DestroyAllChannels_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<GpuService_DestroyAllChannels_Params_Data>;

    GpuService_DestroyAllChannels_Params_Data();
    ~GpuService_DestroyAllChannels_Params_Data() = delete;
};
static_assert(sizeof(GpuService_DestroyAllChannels_Params_Data) == 8, "Bad sizeof(GpuService_DestroyAllChannels_Params_Data)");
class GpuService_OnBackgroundCleanup_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<GpuService_OnBackgroundCleanup_Params_Data>;

    GpuService_OnBackgroundCleanup_Params_Data();
    ~GpuService_OnBackgroundCleanup_Params_Data() = delete;
};
static_assert(sizeof(GpuService_OnBackgroundCleanup_Params_Data) == 8, "Bad sizeof(GpuService_OnBackgroundCleanup_Params_Data)");
class GpuService_OnBackgrounded_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<GpuService_OnBackgrounded_Params_Data>;

    GpuService_OnBackgrounded_Params_Data();
    ~GpuService_OnBackgrounded_Params_Data() = delete;
};
static_assert(sizeof(GpuService_OnBackgrounded_Params_Data) == 8, "Bad sizeof(GpuService_OnBackgrounded_Params_Data)");
class GpuService_OnForegrounded_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<GpuService_OnForegrounded_Params_Data>;

    GpuService_OnForegrounded_Params_Data();
    ~GpuService_OnForegrounded_Params_Data() = delete;
};
static_assert(sizeof(GpuService_OnForegrounded_Params_Data) == 8, "Bad sizeof(GpuService_OnForegrounded_Params_Data)");
class GpuService_OnMemoryPressure_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t level;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<GpuService_OnMemoryPressure_Params_Data>;

    GpuService_OnMemoryPressure_Params_Data();
    ~GpuService_OnMemoryPressure_Params_Data() = delete;
};
static_assert(sizeof(GpuService_OnMemoryPressure_Params_Data) == 16, "Bad sizeof(GpuService_OnMemoryPressure_Params_Data)");
class GpuService_GetDawnInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t collect_metrics : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<GpuService_GetDawnInfo_Params_Data>;

    GpuService_GetDawnInfo_Params_Data();
    ~GpuService_GetDawnInfo_Params_Data() = delete;
};
static_assert(sizeof(GpuService_GetDawnInfo_Params_Data) == 16, "Bad sizeof(GpuService_GetDawnInfo_Params_Data)");
class GpuService_GetDawnInfo_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> dawn_info_list;

private:
    friend class mojo::internal::MessageFragment<GpuService_GetDawnInfo_ResponseParams_Data>;

    GpuService_GetDawnInfo_ResponseParams_Data();
    ~GpuService_GetDawnInfo_ResponseParams_Data() = delete;
};
static_assert(sizeof(GpuService_GetDawnInfo_ResponseParams_Data) == 16, "Bad sizeof(GpuService_GetDawnInfo_ResponseParams_Data)");
class GpuService_Crash_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<GpuService_Crash_Params_Data>;

    GpuService_Crash_Params_Data();
    ~GpuService_Crash_Params_Data() = delete;
};
static_assert(sizeof(GpuService_Crash_Params_Data) == 8, "Bad sizeof(GpuService_Crash_Params_Data)");
class GpuService_Hang_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<GpuService_Hang_Params_Data>;

    GpuService_Hang_Params_Data();
    ~GpuService_Hang_Params_Data() = delete;
};
static_assert(sizeof(GpuService_Hang_Params_Data) == 8, "Bad sizeof(GpuService_Hang_Params_Data)");
class GpuService_ThrowJavaException_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<GpuService_ThrowJavaException_Params_Data>;

    GpuService_ThrowJavaException_Params_Data();
    ~GpuService_ThrowJavaException_Params_Data() = delete;
};
static_assert(sizeof(GpuService_ThrowJavaException_Params_Data) == 8, "Bad sizeof(GpuService_ThrowJavaException_Params_Data)");

} // namespace internal

class GpuService_EstablishGpuChannel_ParamsDataView {
public:
    GpuService_EstablishGpuChannel_ParamsDataView() = default;

    GpuService_EstablishGpuChannel_ParamsDataView(internal::GpuService_EstablishGpuChannel_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    int32_t client_id() const
    {
        return data_->client_id;
    }
    uint64_t client_tracing_id() const
    {
        return data_->client_tracing_id;
    }
    bool is_gpu_host() const
    {
        return data_->is_gpu_host;
    }

private:
    internal::GpuService_EstablishGpuChannel_Params_Data* data_ = nullptr;
};

class GpuService_EstablishGpuChannel_ResponseParamsDataView {
public:
    GpuService_EstablishGpuChannel_ResponseParamsDataView() = default;

