// services/viz/privileged/mojom/gl/gpu_host.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_VIZ_PRIVILEGED_MOJOM_GL_GPU_HOST_MOJOM_PARAMS_DATA_H_
#define SERVICES_VIZ_PRIVILEGED_MOJOM_GL_GPU_HOST_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace viz::mojom {
namespace internal {
class GpuHost_DidInitialize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gpu::mojom::internal::GpuInfo_Data> gpu_info;
    mojo::internal::Pointer<::gpu::mojom::internal::GpuFeatureInfo_Data> gpu_feature_info;
    mojo::internal::Pointer<::gpu::mojom::internal::GpuInfo_Data> gpu_info_for_hardware_gpu;
    mojo::internal::Pointer<::gpu::mojom::internal::GpuFeatureInfo_Data> gpu_feature_info_for_hardware_gpu;
    mojo::internal::Pointer<::gfx::mojom::internal::GpuExtraInfo_Data> gpu_extra_info;

private:
    friend class mojo::internal::MessageFragment<GpuHost_DidInitialize_Params_Data>;

    GpuHost_DidInitialize_Params_Data();
    ~GpuHost_DidInitialize_Params_Data() = delete;
};
static_assert(sizeof(GpuHost_DidInitialize_Params_Data) == 48, "Bad sizeof(GpuHost_DidInitialize_Params_Data)");
class GpuHost_DidFailInitialize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<GpuHost_DidFailInitialize_Params_Data>;

    GpuHost_DidFailInitialize_Params_Data();
    ~GpuHost_DidFailInitialize_Params_Data() = delete;
};
static_assert(sizeof(GpuHost_DidFailInitialize_Params_Data) == 8, "Bad sizeof(GpuHost_DidFailInitialize_Params_Data)");
class GpuHost_DidCreateContextSuccessfully_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<GpuHost_DidCreateContextSuccessfully_Params_Data>;

    GpuHost_DidCreateContextSuccessfully_Params_Data();
    ~GpuHost_DidCreateContextSuccessfully_Params_Data() = delete;
};
static_assert(sizeof(GpuHost_DidCreateContextSuccessfully_Params_Data) == 8, "Bad sizeof(GpuHost_DidCreateContextSuccessfully_Params_Data)");
class GpuHost_DidCreateOffscreenContext_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<GpuHost_DidCreateOffscreenContext_Params_Data>;

    GpuHost_DidCreateOffscreenContext_Params_Data();
    ~GpuHost_DidCreateOffscreenContext_Params_Data() = delete;
};
static_assert(sizeof(GpuHost_DidCreateOffscreenContext_Params_Data) == 16, "Bad sizeof(GpuHost_DidCreateOffscreenContext_Params_Data)");
class GpuHost_DidDestroyOffscreenContext_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<GpuHost_DidDestroyOffscreenContext_Params_Data>;

    GpuHost_DidDestroyOffscreenContext_Params_Data();
    ~GpuHost_DidDestroyOffscreenContext_Params_Data() = delete;
};
static_assert(sizeof(GpuHost_DidDestroyOffscreenContext_Params_Data) == 16, "Bad sizeof(GpuHost_DidDestroyOffscreenContext_Params_Data)");
class GpuHost_DidDestroyChannel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t client_id;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<GpuHost_DidDestroyChannel_Params_Data>;

    GpuHost_DidDestroyChannel_Params_Data();
    ~GpuHost_DidDestroyChannel_Params_Data() = delete;
};
static_assert(sizeof(GpuHost_DidDestroyChannel_Params_Data) == 16, "Bad sizeof(GpuHost_DidDestroyChannel_Params_Data)");
class GpuHost_DidDestroyAllChannels_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<GpuHost_DidDestroyAllChannels_Params_Data>;

    GpuHost_DidDestroyAllChannels_Params_Data();
    ~GpuHost_DidDestroyAllChannels_Params_Data() = delete;
};
static_assert(sizeof(GpuHost_DidDestroyAllChannels_Params_Data) == 8, "Bad sizeof(GpuHost_DidDestroyAllChannels_Params_Data)");
class GpuHost_DidLoseContext_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t reason;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> active_url;

private:
    friend class mojo::internal::MessageFragment<GpuHost_DidLoseContext_Params_Data>;

    GpuHost_DidLoseContext_Params_Data();
    ~GpuHost_DidLoseContext_Params_Data() = delete;
};
static_assert(sizeof(GpuHost_DidLoseContext_Params_Data) == 24, "Bad sizeof(GpuHost_DidLoseContext_Params_Data)");
class GpuHost_DidUpdateGPUInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gpu::mojom::internal::GpuInfo_Data> gpu_info;

private:
    friend class mojo::internal::MessageFragment<GpuHost_DidUpdateGPUInfo_Params_Data>;

    GpuHost_DidUpdateGPUInfo_Params_Data();
    ~GpuHost_DidUpdateGPUInfo_Params_Data() = delete;
};
static_assert(sizeof(GpuHost_DidUpdateGPUInfo_Params_Data) == 16, "Bad sizeof(GpuHost_DidUpdateGPUInfo_Params_Data)");
class GpuHost_DidUpdateOverlayInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gpu::mojom::internal::OverlayInfo_Data> overlay_info;

private:
    friend class mojo::internal::MessageFragment<GpuHost_DidUpdateOverlayInfo_Params_Data>;

    GpuHost_DidUpdateOverlayInfo_Params_Data();
    ~GpuHost_DidUpdateOverlayInfo_Params_Data() = delete;
};
static_assert(sizeof(GpuHost_DidUpdateOverlayInfo_Params_Data) == 16, "Bad sizeof(GpuHost_DidUpdateOverlayInfo_Params_Data)");
class GpuHost_DidUpdateDXGIInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::DXGIInfo_Data> dxgi_info;

private:
    friend class mojo::internal::MessageFragment<GpuHost_DidUpdateDXGIInfo_Params_Data>;

    GpuHost_DidUpdateDXGIInfo_Params_Data();
    ~GpuHost_DidUpdateDXGIInfo_Params_Data() = delete;
};
static_assert(sizeof(GpuHost_DidUpdateDXGIInfo_Params_Data) == 16, "Bad sizeof(GpuHost_DidUpdateDXGIInfo_Params_Data)");
class GpuHost_DisableGpuCompositing_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<GpuHost_DisableGpuCompositing_Params_Data>;

    GpuHost_DisableGpuCompositing_Params_Data();
    ~GpuHost_DisableGpuCompositing_Params_Data() = delete;
};
static_assert(sizeof(GpuHost_DisableGpuCompositing_Params_Data) == 8, "Bad sizeof(GpuHost_DisableGpuCompositing_Params_Data)");
class GpuHost_GetIsolationKey_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t client_id;
    uint8_t pad0_[4];
    ::blink::mojom::internal::WebGPUExecutionContextToken_Data wgpu_context_token;

private:
    friend class mojo::internal::MessageFragment<GpuHost_GetIsolationKey_Params_Data>;

    GpuHost_GetIsolationKey_Params_Data();
    ~GpuHost_GetIsolationKey_Params_Data() = delete;
};
static_assert(sizeof(GpuHost_GetIsolationKey_Params_Data) == 32, "Bad sizeof(GpuHost_GetIsolationKey_Params_Data)");
class GpuHost_GetIsolationKey_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> isolation_key;

private:
    friend class mojo::internal::MessageFragment<GpuHost_GetIsolationKey_ResponseParams_Data>;

    GpuHost_GetIsolationKey_ResponseParams_Data();
    ~GpuHost_GetIsolationKey_ResponseParams_Data() = delete;
};
static_assert(sizeof(GpuHost_GetIsolationKey_ResponseParams_Data) == 16, "Bad sizeof(GpuHost_GetIsolationKey_ResponseParams_Data)");
class GpuHost_StoreBlobToDisk_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::gpu::mojom::internal::GpuDiskCacheHandle_Data cache_handle;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ByteString_Data> key;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ByteString_Data> blob;

private:
    friend class mojo::internal::MessageFragment<GpuHost_StoreBlobToDisk_Params_Data>;

    GpuHost_StoreBlobToDisk_Params_Data();
    ~GpuHost_StoreBlobToDisk_Params_Data() = delete;
};
static_assert(sizeof(GpuHost_StoreBlobToDisk_Params_Data) == 40, "Bad sizeof(GpuHost_StoreBlobToDisk_Params_Data)");
class GpuHost_RecordLogMessage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t severity;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> header;
    mojo::internal::Pointer<mojo::internal::String_Data> message;

private:
    friend class mojo::internal::MessageFragment<GpuHost_RecordLogMessage_Params_Data>;

    GpuHost_RecordLogMessage_Params_Data();
    ~GpuHost_RecordLogMessage_Params_Data() = delete;
};
static_assert(sizeof(GpuHost_RecordLogMessage_Params_Data) == 32, "Bad sizeof(GpuHost_RecordLogMessage_Params_Data)");
class GpuHost_ClearGrShaderDiskCache_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<GpuHost_ClearGrShaderDiskCache_Params_Data>;

    GpuHost_ClearGrShaderDiskCache_Params_Data();
    ~GpuHost_ClearGrShaderDiskCache_Params_Data() = delete;
};
static_assert(sizeof(GpuHost_ClearGrShaderDiskCache_Params_Data) == 8, "Bad sizeof(GpuHost_ClearGrShaderDiskCache_Params_Data)");

} // namespace internal

class GpuHost_DidInitialize_ParamsDataView {
public:
    GpuHost_DidInitialize_ParamsDataView() = default;

    GpuHost_DidInitialize_ParamsDataView(internal::GpuHost_DidInitialize_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetGpuInfoDataView(::gpu::mojom::GpuInfoDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadGpuInfo(UserType* output)
    {

        auto* pointer = data_->gpu_info.Get();
        return mojo::internal::Deserialize<::gpu::mojom::GpuInfoDataView>(pointer, output, message_);
    }
    inline void GetGpuFeatureInfoDataView(::gpu::mojom::GpuFeatureInfoDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadGpuFeatureInfo(UserType* output)
