// third_party/blink/public/mojom/presentation/presentation.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_PRESENTATION_PRESENTATION_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_PRESENTATION_PRESENTATION_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationConnection_OnMessage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::PresentationConnectionMessage_Data message;

private:
    friend class mojo::internal::MessageFragment<PresentationConnection_OnMessage_Params_Data>;

    PresentationConnection_OnMessage_Params_Data();
    ~PresentationConnection_OnMessage_Params_Data() = delete;
};
static_assert(sizeof(PresentationConnection_OnMessage_Params_Data) == 24, "Bad sizeof(PresentationConnection_OnMessage_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationConnection_DidChangeState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t state;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PresentationConnection_DidChangeState_Params_Data>;

    PresentationConnection_DidChangeState_Params_Data();
    ~PresentationConnection_DidChangeState_Params_Data() = delete;
};
static_assert(sizeof(PresentationConnection_DidChangeState_Params_Data) == 16, "Bad sizeof(PresentationConnection_DidChangeState_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationConnection_DidClose_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t reason;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PresentationConnection_DidClose_Params_Data>;

    PresentationConnection_DidClose_Params_Data();
    ~PresentationConnection_DidClose_Params_Data() = delete;
};
static_assert(sizeof(PresentationConnection_DidClose_Params_Data) == 16, "Bad sizeof(PresentationConnection_DidClose_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationService_SetController_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data controller;

private:
    friend class mojo::internal::MessageFragment<PresentationService_SetController_Params_Data>;

    PresentationService_SetController_Params_Data();
    ~PresentationService_SetController_Params_Data() = delete;
};
static_assert(sizeof(PresentationService_SetController_Params_Data) == 16, "Bad sizeof(PresentationService_SetController_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationService_SetReceiver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data receiver;

private:
    friend class mojo::internal::MessageFragment<PresentationService_SetReceiver_Params_Data>;

    PresentationService_SetReceiver_Params_Data();
    ~PresentationService_SetReceiver_Params_Data() = delete;
};
static_assert(sizeof(PresentationService_SetReceiver_Params_Data) == 16, "Bad sizeof(PresentationService_SetReceiver_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationService_SetDefaultPresentationUrls_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Url_Data>>> presentation_urls;

private:
    friend class mojo::internal::MessageFragment<PresentationService_SetDefaultPresentationUrls_Params_Data>;

    PresentationService_SetDefaultPresentationUrls_Params_Data();
    ~PresentationService_SetDefaultPresentationUrls_Params_Data() = delete;
};
static_assert(
    sizeof(PresentationService_SetDefaultPresentationUrls_Params_Data) == 16, "Bad sizeof(PresentationService_SetDefaultPresentationUrls_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationService_ListenForScreenAvailability_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> availability_url;

private:
    friend class mojo::internal::MessageFragment<PresentationService_ListenForScreenAvailability_Params_Data>;

    PresentationService_ListenForScreenAvailability_Params_Data();
    ~PresentationService_ListenForScreenAvailability_Params_Data() = delete;
};
static_assert(
    sizeof(PresentationService_ListenForScreenAvailability_Params_Data) == 16, "Bad sizeof(PresentationService_ListenForScreenAvailability_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationService_StopListeningForScreenAvailability_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> availability_url;

private:
    friend class mojo::internal::MessageFragment<PresentationService_StopListeningForScreenAvailability_Params_Data>;

    PresentationService_StopListeningForScreenAvailability_Params_Data();
    ~PresentationService_StopListeningForScreenAvailability_Params_Data() = delete;
};
static_assert(sizeof(PresentationService_StopListeningForScreenAvailability_Params_Data) == 16,
    "Bad sizeof(PresentationService_StopListeningForScreenAvailability_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationService_StartPresentation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Url_Data>>> presentation_urls;

private:
    friend class mojo::internal::MessageFragment<PresentationService_StartPresentation_Params_Data>;

    PresentationService_StartPresentation_Params_Data();
    ~PresentationService_StartPresentation_Params_Data() = delete;
};
static_assert(sizeof(PresentationService_StartPresentation_Params_Data) == 16, "Bad sizeof(PresentationService_StartPresentation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationService_StartPresentation_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PresentationConnectionResult_Data> result;
    mojo::internal::Pointer<internal::PresentationError_Data> error;

private:
    friend class mojo::internal::MessageFragment<PresentationService_StartPresentation_ResponseParams_Data>;

    PresentationService_StartPresentation_ResponseParams_Data();
    ~PresentationService_StartPresentation_ResponseParams_Data() = delete;
};
static_assert(sizeof(PresentationService_StartPresentation_ResponseParams_Data) == 24, "Bad sizeof(PresentationService_StartPresentation_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationService_ReconnectPresentation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Url_Data>>> presentation_urls;
    mojo::internal::Pointer<mojo::internal::String_Data> presentation_id;

private:
    friend class mojo::internal::MessageFragment<PresentationService_ReconnectPresentation_Params_Data>;

    PresentationService_ReconnectPresentation_Params_Data();
    ~PresentationService_ReconnectPresentation_Params_Data() = delete;
};
static_assert(sizeof(PresentationService_ReconnectPresentation_Params_Data) == 24, "Bad sizeof(PresentationService_ReconnectPresentation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationService_ReconnectPresentation_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PresentationConnectionResult_Data> result;
    mojo::internal::Pointer<internal::PresentationError_Data> error;

private:
    friend class mojo::internal::MessageFragment<PresentationService_ReconnectPresentation_ResponseParams_Data>;

    PresentationService_ReconnectPresentation_ResponseParams_Data();
    ~PresentationService_ReconnectPresentation_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(PresentationService_ReconnectPresentation_ResponseParams_Data) == 24, "Bad sizeof(PresentationService_ReconnectPresentation_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationService_CloseConnection_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> presentation_url;
    mojo::internal::Pointer<mojo::internal::String_Data> presentation_id;

private:
    friend class mojo::internal::MessageFragment<PresentationService_CloseConnection_Params_Data>;

    PresentationService_CloseConnection_Params_Data();
    ~PresentationService_CloseConnection_Params_Data() = delete;
};
static_assert(sizeof(PresentationService_CloseConnection_Params_Data) == 24, "Bad sizeof(PresentationService_CloseConnection_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationService_Terminate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> presentation_url;
    mojo::internal::Pointer<mojo::internal::String_Data> presentation_id;

private:
    friend class mojo::internal::MessageFragment<PresentationService_Terminate_Params_Data>;

    PresentationService_Terminate_Params_Data();
    ~PresentationService_Terminate_Params_Data() = delete;
};
static_assert(sizeof(PresentationService_Terminate_Params_Data) == 24, "Bad sizeof(PresentationService_Terminate_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationController_OnScreenAvailabilityUpdated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    int32_t availability;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PresentationController_OnScreenAvailabilityUpdated_Params_Data>;

    PresentationController_OnScreenAvailabilityUpdated_Params_Data();
    ~PresentationController_OnScreenAvailabilityUpdated_Params_Data() = delete;
};
static_assert(
    sizeof(PresentationController_OnScreenAvailabilityUpdated_Params_Data) == 24, "Bad sizeof(PresentationController_OnScreenAvailabilityUpdated_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationController_OnDefaultPresentationStarted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PresentationConnectionResult_Data> result;

private:
    friend class mojo::internal::MessageFragment<PresentationController_OnDefaultPresentationStarted_Params_Data>;

    PresentationController_OnDefaultPresentationStarted_Params_Data();
    ~PresentationController_OnDefaultPresentationStarted_Params_Data() = delete;
};
static_assert(sizeof(PresentationController_OnDefaultPresentationStarted_Params_Data) == 16,
    "Bad sizeof(PresentationController_OnDefaultPresentationStarted_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationController_OnConnectionStateChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PresentationInfo_Data> presentation_info;
    int32_t newState;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PresentationController_OnConnectionStateChanged_Params_Data>;

    PresentationController_OnConnectionStateChanged_Params_Data();
    ~PresentationController_OnConnectionStateChanged_Params_Data() = delete;
};
static_assert(
    sizeof(PresentationController_OnConnectionStateChanged_Params_Data) == 24, "Bad sizeof(PresentationController_OnConnectionStateChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationController_OnConnectionClosed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PresentationInfo_Data> presentation_info;
    int32_t reason;
    uint8_t pad1_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> message;

private:
    friend class mojo::internal::MessageFragment<PresentationController_OnConnectionClosed_Params_Data>;

    PresentationController_OnConnectionClosed_Params_Data();
    ~PresentationController_OnConnectionClosed_Params_Data() = delete;
};
static_assert(sizeof(PresentationController_OnConnectionClosed_Params_Data) == 32, "Bad sizeof(PresentationController_OnConnectionClosed_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PresentationReceiver_OnReceiverConnectionAvailable_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PresentationConnectionResult_Data> result;

private:
    friend class mojo::internal::MessageFragment<PresentationReceiver_OnReceiverConnectionAvailable_Params_Data>;

    PresentationReceiver_OnReceiverConnectionAvailable_Params_Data();
    ~PresentationReceiver_OnReceiverConnectionAvailable_Params_Data() = delete;
};
static_assert(
    sizeof(PresentationReceiver_OnReceiverConnectionAvailable_Params_Data) == 16, "Bad sizeof(PresentationReceiver_OnReceiverConnectionAvailable_Params_Data)");

} // namespace internal

