// components/performance_manager/public/mojom/coordination_unit.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_PERFORMANCE_MANAGER_PUBLIC_MOJOM_COORDINATION_UNIT_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_PERFORMANCE_MANAGER_PUBLIC_MOJOM_COORDINATION_UNIT_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace performance_manager::mojom {
namespace internal {
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) DocumentCoordinationUnit_SetNetworkAlmostIdle_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DocumentCoordinationUnit_SetNetworkAlmostIdle_Params_Data>;

    DocumentCoordinationUnit_SetNetworkAlmostIdle_Params_Data();
    ~DocumentCoordinationUnit_SetNetworkAlmostIdle_Params_Data() = delete;
};
static_assert(sizeof(DocumentCoordinationUnit_SetNetworkAlmostIdle_Params_Data) == 8, "Bad sizeof(DocumentCoordinationUnit_SetNetworkAlmostIdle_Params_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) DocumentCoordinationUnit_SetLifecycleState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t state;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<DocumentCoordinationUnit_SetLifecycleState_Params_Data>;

    DocumentCoordinationUnit_SetLifecycleState_Params_Data();
    ~DocumentCoordinationUnit_SetLifecycleState_Params_Data() = delete;
};
static_assert(sizeof(DocumentCoordinationUnit_SetLifecycleState_Params_Data) == 16, "Bad sizeof(DocumentCoordinationUnit_SetLifecycleState_Params_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) DocumentCoordinationUnit_SetHasNonEmptyBeforeUnload_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t has_nonempty_beforeunload : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<DocumentCoordinationUnit_SetHasNonEmptyBeforeUnload_Params_Data>;

    DocumentCoordinationUnit_SetHasNonEmptyBeforeUnload_Params_Data();
    ~DocumentCoordinationUnit_SetHasNonEmptyBeforeUnload_Params_Data() = delete;
};
static_assert(sizeof(DocumentCoordinationUnit_SetHasNonEmptyBeforeUnload_Params_Data) == 16,
    "Bad sizeof(DocumentCoordinationUnit_SetHasNonEmptyBeforeUnload_Params_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) DocumentCoordinationUnit_SetHadFormInteraction_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DocumentCoordinationUnit_SetHadFormInteraction_Params_Data>;

    DocumentCoordinationUnit_SetHadFormInteraction_Params_Data();
    ~DocumentCoordinationUnit_SetHadFormInteraction_Params_Data() = delete;
};
static_assert(
    sizeof(DocumentCoordinationUnit_SetHadFormInteraction_Params_Data) == 8, "Bad sizeof(DocumentCoordinationUnit_SetHadFormInteraction_Params_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) DocumentCoordinationUnit_SetHadUserEdits_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DocumentCoordinationUnit_SetHadUserEdits_Params_Data>;

    DocumentCoordinationUnit_SetHadUserEdits_Params_Data();
    ~DocumentCoordinationUnit_SetHadUserEdits_Params_Data() = delete;
};
static_assert(sizeof(DocumentCoordinationUnit_SetHadUserEdits_Params_Data) == 8, "Bad sizeof(DocumentCoordinationUnit_SetHadUserEdits_Params_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) DocumentCoordinationUnit_OnStartedUsingWebRTC_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DocumentCoordinationUnit_OnStartedUsingWebRTC_Params_Data>;

    DocumentCoordinationUnit_OnStartedUsingWebRTC_Params_Data();
    ~DocumentCoordinationUnit_OnStartedUsingWebRTC_Params_Data() = delete;
};
static_assert(sizeof(DocumentCoordinationUnit_OnStartedUsingWebRTC_Params_Data) == 8, "Bad sizeof(DocumentCoordinationUnit_OnStartedUsingWebRTC_Params_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) DocumentCoordinationUnit_OnStoppedUsingWebRTC_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DocumentCoordinationUnit_OnStoppedUsingWebRTC_Params_Data>;

    DocumentCoordinationUnit_OnStoppedUsingWebRTC_Params_Data();
    ~DocumentCoordinationUnit_OnStoppedUsingWebRTC_Params_Data() = delete;
};
static_assert(sizeof(DocumentCoordinationUnit_OnStoppedUsingWebRTC_Params_Data) == 8, "Bad sizeof(DocumentCoordinationUnit_OnStoppedUsingWebRTC_Params_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) DocumentCoordinationUnit_SetIsAdFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_ad_frame : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<DocumentCoordinationUnit_SetIsAdFrame_Params_Data>;

    DocumentCoordinationUnit_SetIsAdFrame_Params_Data();
    ~DocumentCoordinationUnit_SetIsAdFrame_Params_Data() = delete;
};
static_assert(sizeof(DocumentCoordinationUnit_SetIsAdFrame_Params_Data) == 16, "Bad sizeof(DocumentCoordinationUnit_SetIsAdFrame_Params_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) DocumentCoordinationUnit_OnNonPersistentNotificationCreated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DocumentCoordinationUnit_OnNonPersistentNotificationCreated_Params_Data>;

    DocumentCoordinationUnit_OnNonPersistentNotificationCreated_Params_Data();
    ~DocumentCoordinationUnit_OnNonPersistentNotificationCreated_Params_Data() = delete;
};
static_assert(sizeof(DocumentCoordinationUnit_OnNonPersistentNotificationCreated_Params_Data) == 8,
    "Bad sizeof(DocumentCoordinationUnit_OnNonPersistentNotificationCreated_Params_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) DocumentCoordinationUnit_OnFirstContentfulPaint_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> time_since_navigation_start;

private:
    friend class mojo::internal::MessageFragment<DocumentCoordinationUnit_OnFirstContentfulPaint_Params_Data>;

    DocumentCoordinationUnit_OnFirstContentfulPaint_Params_Data();
    ~DocumentCoordinationUnit_OnFirstContentfulPaint_Params_Data() = delete;
};
static_assert(
    sizeof(DocumentCoordinationUnit_OnFirstContentfulPaint_Params_Data) == 16, "Bad sizeof(DocumentCoordinationUnit_OnFirstContentfulPaint_Params_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) DocumentCoordinationUnit_OnWebMemoryMeasurementRequested_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t mode;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<DocumentCoordinationUnit_OnWebMemoryMeasurementRequested_Params_Data>;

    DocumentCoordinationUnit_OnWebMemoryMeasurementRequested_Params_Data();
    ~DocumentCoordinationUnit_OnWebMemoryMeasurementRequested_Params_Data() = delete;
};
static_assert(sizeof(DocumentCoordinationUnit_OnWebMemoryMeasurementRequested_Params_Data) == 16,
    "Bad sizeof(DocumentCoordinationUnit_OnWebMemoryMeasurementRequested_Params_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) DocumentCoordinationUnit_OnWebMemoryMeasurementRequested_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::performance_manager::mojom::internal::WebMemoryMeasurement_Data> measurement;

private:
    friend class mojo::internal::MessageFragment<DocumentCoordinationUnit_OnWebMemoryMeasurementRequested_ResponseParams_Data>;

    DocumentCoordinationUnit_OnWebMemoryMeasurementRequested_ResponseParams_Data();
    ~DocumentCoordinationUnit_OnWebMemoryMeasurementRequested_ResponseParams_Data() = delete;
};
static_assert(sizeof(DocumentCoordinationUnit_OnWebMemoryMeasurementRequested_ResponseParams_Data) == 16,
    "Bad sizeof(DocumentCoordinationUnit_OnWebMemoryMeasurementRequested_ResponseParams_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) ProcessCoordinationUnit_SetMainThreadTaskLoadIsLow_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t main_thread_task_load_is_low : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<ProcessCoordinationUnit_SetMainThreadTaskLoadIsLow_Params_Data>;

    ProcessCoordinationUnit_SetMainThreadTaskLoadIsLow_Params_Data();
    ~ProcessCoordinationUnit_SetMainThreadTaskLoadIsLow_Params_Data() = delete;
};
static_assert(
    sizeof(ProcessCoordinationUnit_SetMainThreadTaskLoadIsLow_Params_Data) == 16, "Bad sizeof(ProcessCoordinationUnit_SetMainThreadTaskLoadIsLow_Params_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) ProcessCoordinationUnit_OnV8ContextCreated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::performance_manager::mojom::internal::V8ContextDescription_Data> description;
    mojo::internal::Pointer<::performance_manager::mojom::internal::IframeAttributionData_Data> iframe_attribution_data;

private:
    friend class mojo::internal::MessageFragment<ProcessCoordinationUnit_OnV8ContextCreated_Params_Data>;

    ProcessCoordinationUnit_OnV8ContextCreated_Params_Data();
    ~ProcessCoordinationUnit_OnV8ContextCreated_Params_Data() = delete;
};
static_assert(sizeof(ProcessCoordinationUnit_OnV8ContextCreated_Params_Data) == 24, "Bad sizeof(ProcessCoordinationUnit_OnV8ContextCreated_Params_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) ProcessCoordinationUnit_OnV8ContextDetached_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::V8ContextToken_Data> v8_context_token;

private:
    friend class mojo::internal::MessageFragment<ProcessCoordinationUnit_OnV8ContextDetached_Params_Data>;

    ProcessCoordinationUnit_OnV8ContextDetached_Params_Data();
    ~ProcessCoordinationUnit_OnV8ContextDetached_Params_Data() = delete;
};
static_assert(sizeof(ProcessCoordinationUnit_OnV8ContextDetached_Params_Data) == 16, "Bad sizeof(ProcessCoordinationUnit_OnV8ContextDetached_Params_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) ProcessCoordinationUnit_OnV8ContextDestroyed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::V8ContextToken_Data> v8_context_token;

private:
    friend class mojo::internal::MessageFragment<ProcessCoordinationUnit_OnV8ContextDestroyed_Params_Data>;

    ProcessCoordinationUnit_OnV8ContextDestroyed_Params_Data();
    ~ProcessCoordinationUnit_OnV8ContextDestroyed_Params_Data() = delete;
};
static_assert(sizeof(ProcessCoordinationUnit_OnV8ContextDestroyed_Params_Data) == 16, "Bad sizeof(ProcessCoordinationUnit_OnV8ContextDestroyed_Params_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) ProcessCoordinationUnit_OnRemoteIframeAttached_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::LocalFrameToken_Data> parent_frame_token;
    mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameToken_Data> remote_frame_token;
    mojo::internal::Pointer<::performance_manager::mojom::internal::IframeAttributionData_Data> iframe_attribution_data;

private:
    friend class mojo::internal::MessageFragment<ProcessCoordinationUnit_OnRemoteIframeAttached_Params_Data>;

    ProcessCoordinationUnit_OnRemoteIframeAttached_Params_Data();
    ~ProcessCoordinationUnit_OnRemoteIframeAttached_Params_Data() = delete;
};
static_assert(
    sizeof(ProcessCoordinationUnit_OnRemoteIframeAttached_Params_Data) == 32, "Bad sizeof(ProcessCoordinationUnit_OnRemoteIframeAttached_Params_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) ProcessCoordinationUnit_OnRemoteIframeDetached_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::LocalFrameToken_Data> parent_frame_token;
    mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameToken_Data> remote_frame_token;

private:
    friend class mojo::internal::MessageFragment<ProcessCoordinationUnit_OnRemoteIframeDetached_Params_Data>;

    ProcessCoordinationUnit_OnRemoteIframeDetached_Params_Data();
    ~ProcessCoordinationUnit_OnRemoteIframeDetached_Params_Data() = delete;
};
static_assert(
    sizeof(ProcessCoordinationUnit_OnRemoteIframeDetached_Params_Data) == 24, "Bad sizeof(ProcessCoordinationUnit_OnRemoteIframeDetached_Params_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) ProcessCoordinationUnit_RequestSharedPerformanceScenarioRegions_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t process_track_id;

private:
    friend class mojo::internal::MessageFragment<ProcessCoordinationUnit_RequestSharedPerformanceScenarioRegions_Params_Data>;

    ProcessCoordinationUnit_RequestSharedPerformanceScenarioRegions_Params_Data();
    ~ProcessCoordinationUnit_RequestSharedPerformanceScenarioRegions_Params_Data() = delete;
};
static_assert(sizeof(ProcessCoordinationUnit_RequestSharedPerformanceScenarioRegions_Params_Data) == 16,
    "Bad sizeof(ProcessCoordinationUnit_RequestSharedPerformanceScenarioRegions_Params_Data)");
class COMPONENT_EXPORT(PERFORMANCE_MANAGER_PUBLIC_MOJOM_SHARED) ProcessCoordinationUnit_RequestSharedPerformanceScenarioRegions_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> global_region;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> process_region;

private:
    friend class mojo::internal::MessageFragment<ProcessCoordinationUnit_RequestSharedPerformanceScenarioRegions_ResponseParams_Data>;

    ProcessCoordinationUnit_RequestSharedPerformanceScenarioRegions_ResponseParams_Data();
    ~ProcessCoordinationUnit_RequestSharedPerformanceScenarioRegions_ResponseParams_Data() = delete;
};
static_assert(sizeof(ProcessCoordinationUnit_RequestSharedPerformanceScenarioRegions_ResponseParams_Data) == 24,
    "Bad sizeof(ProcessCoordinationUnit_RequestSharedPerformanceScenarioRegions_ResponseParams_Data)");

} // namespace internal

class DocumentCoordinationUnit_SetNetworkAlmostIdle_ParamsDataView {
public:
    DocumentCoordinationUnit_SetNetworkAlmostIdle_ParamsDataView() = default;

    DocumentCoordinationUnit_SetNetworkAlmostIdle_ParamsDataView(
        internal::DocumentCoordinationUnit_SetNetworkAlmostIdle_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::DocumentCoordinationUnit_SetNetworkAlmostIdle_Params_Data* data_ = nullptr;
};

class DocumentCoordinationUnit_SetLifecycleState_ParamsDataView {
public:
    DocumentCoordinationUnit_SetLifecycleState_ParamsDataView() = default;

