// components/printing/common/print.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_PRINTING_COMMON_PRINT_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_PRINTING_COMMON_PRINT_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace printing::mojom {
namespace internal {
class PrintPreviewUI_SetOptionsFromDocument_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::OptionsFromDocumentParams_Data> params;
    int32_t request_id;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PrintPreviewUI_SetOptionsFromDocument_Params_Data>;

    PrintPreviewUI_SetOptionsFromDocument_Params_Data();
    ~PrintPreviewUI_SetOptionsFromDocument_Params_Data() = delete;
};
static_assert(sizeof(PrintPreviewUI_SetOptionsFromDocument_Params_Data) == 24, "Bad sizeof(PrintPreviewUI_SetOptionsFromDocument_Params_Data)");
class PrintPreviewUI_DidPrepareDocumentForPreview_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t document_cookie;
    int32_t request_id;

private:
    friend class mojo::internal::MessageFragment<PrintPreviewUI_DidPrepareDocumentForPreview_Params_Data>;

    PrintPreviewUI_DidPrepareDocumentForPreview_Params_Data();
    ~PrintPreviewUI_DidPrepareDocumentForPreview_Params_Data() = delete;
};
static_assert(sizeof(PrintPreviewUI_DidPrepareDocumentForPreview_Params_Data) == 16, "Bad sizeof(PrintPreviewUI_DidPrepareDocumentForPreview_Params_Data)");
class PrintPreviewUI_DidPreviewPage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::DidPreviewPageParams_Data> params;
    int32_t request_id;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PrintPreviewUI_DidPreviewPage_Params_Data>;

    PrintPreviewUI_DidPreviewPage_Params_Data();
    ~PrintPreviewUI_DidPreviewPage_Params_Data() = delete;
};
static_assert(sizeof(PrintPreviewUI_DidPreviewPage_Params_Data) == 24, "Bad sizeof(PrintPreviewUI_DidPreviewPage_Params_Data)");
class PrintPreviewUI_MetafileReadyForPrinting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::DidPreviewDocumentParams_Data> params;
    int32_t request_id;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PrintPreviewUI_MetafileReadyForPrinting_Params_Data>;

    PrintPreviewUI_MetafileReadyForPrinting_Params_Data();
    ~PrintPreviewUI_MetafileReadyForPrinting_Params_Data() = delete;
};
static_assert(sizeof(PrintPreviewUI_MetafileReadyForPrinting_Params_Data) == 24, "Bad sizeof(PrintPreviewUI_MetafileReadyForPrinting_Params_Data)");
class PrintPreviewUI_PrintPreviewFailed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t document_cookie;
    int32_t request_id;

private:
    friend class mojo::internal::MessageFragment<PrintPreviewUI_PrintPreviewFailed_Params_Data>;

    PrintPreviewUI_PrintPreviewFailed_Params_Data();
    ~PrintPreviewUI_PrintPreviewFailed_Params_Data() = delete;
};
static_assert(sizeof(PrintPreviewUI_PrintPreviewFailed_Params_Data) == 16, "Bad sizeof(PrintPreviewUI_PrintPreviewFailed_Params_Data)");
class PrintPreviewUI_PrintPreviewCancelled_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t document_cookie;
    int32_t request_id;

private:
    friend class mojo::internal::MessageFragment<PrintPreviewUI_PrintPreviewCancelled_Params_Data>;

    PrintPreviewUI_PrintPreviewCancelled_Params_Data();
    ~PrintPreviewUI_PrintPreviewCancelled_Params_Data() = delete;
};
static_assert(sizeof(PrintPreviewUI_PrintPreviewCancelled_Params_Data) == 16, "Bad sizeof(PrintPreviewUI_PrintPreviewCancelled_Params_Data)");
class PrintPreviewUI_PrinterSettingsInvalid_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t document_cookie;
    int32_t request_id;

private:
    friend class mojo::internal::MessageFragment<PrintPreviewUI_PrinterSettingsInvalid_Params_Data>;

    PrintPreviewUI_PrinterSettingsInvalid_Params_Data();
    ~PrintPreviewUI_PrinterSettingsInvalid_Params_Data() = delete;
};
static_assert(sizeof(PrintPreviewUI_PrinterSettingsInvalid_Params_Data) == 16, "Bad sizeof(PrintPreviewUI_PrinterSettingsInvalid_Params_Data)");
class PrintPreviewUI_DidGetDefaultPageLayout_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::printing::mojom::internal::PageSizeMargins_Data> page_layout_in_points;
    mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> printable_area_in_points;
    uint8_t all_pages_have_custom_size : 1;
    uint8_t all_pages_have_custom_orientation : 1;
    uint8_t pad3_[3];
    int32_t request_id;

private:
    friend class mojo::internal::MessageFragment<PrintPreviewUI_DidGetDefaultPageLayout_Params_Data>;

    PrintPreviewUI_DidGetDefaultPageLayout_Params_Data();
    ~PrintPreviewUI_DidGetDefaultPageLayout_Params_Data() = delete;
};
static_assert(sizeof(PrintPreviewUI_DidGetDefaultPageLayout_Params_Data) == 32, "Bad sizeof(PrintPreviewUI_DidGetDefaultPageLayout_Params_Data)");
class PrintPreviewUI_DidStartPreview_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::DidStartPreviewParams_Data> params;
    int32_t request_id;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PrintPreviewUI_DidStartPreview_Params_Data>;

    PrintPreviewUI_DidStartPreview_Params_Data();
    ~PrintPreviewUI_DidStartPreview_Params_Data() = delete;
};
static_assert(sizeof(PrintPreviewUI_DidStartPreview_Params_Data) == 24, "Bad sizeof(PrintPreviewUI_DidStartPreview_Params_Data)");
class PrintRenderFrame_PrintRequestedPages_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PrintRenderFrame_PrintRequestedPages_Params_Data>;

    PrintRenderFrame_PrintRequestedPages_Params_Data();
    ~PrintRenderFrame_PrintRequestedPages_Params_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_PrintRequestedPages_Params_Data) == 8, "Bad sizeof(PrintRenderFrame_PrintRequestedPages_Params_Data)");
class PrintRenderFrame_PrintWithParams_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PrintPagesParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<PrintRenderFrame_PrintWithParams_Params_Data>;

    PrintRenderFrame_PrintWithParams_Params_Data();
    ~PrintRenderFrame_PrintWithParams_Params_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_PrintWithParams_Params_Data) == 16, "Bad sizeof(PrintRenderFrame_PrintWithParams_Params_Data)");
class PrintRenderFrame_PrintWithParams_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::PrintWithParamsResult_Data result;

private:
    friend class mojo::internal::MessageFragment<PrintRenderFrame_PrintWithParams_ResponseParams_Data>;

    PrintRenderFrame_PrintWithParams_ResponseParams_Data();
    ~PrintRenderFrame_PrintWithParams_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_PrintWithParams_ResponseParams_Data) == 24, "Bad sizeof(PrintRenderFrame_PrintWithParams_ResponseParams_Data)");
class PrintRenderFrame_PrintForSystemDialog_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PrintRenderFrame_PrintForSystemDialog_Params_Data>;

    PrintRenderFrame_PrintForSystemDialog_Params_Data();
    ~PrintRenderFrame_PrintForSystemDialog_Params_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_PrintForSystemDialog_Params_Data) == 8, "Bad sizeof(PrintRenderFrame_PrintForSystemDialog_Params_Data)");
class PrintRenderFrame_InitiatePrintPreview_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t has_selection : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PrintRenderFrame_InitiatePrintPreview_Params_Data>;

    PrintRenderFrame_InitiatePrintPreview_Params_Data();
    ~PrintRenderFrame_InitiatePrintPreview_Params_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_InitiatePrintPreview_Params_Data) == 16, "Bad sizeof(PrintRenderFrame_InitiatePrintPreview_Params_Data)");
class PrintRenderFrame_SetPrintPreviewUI_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data preview;

private:
    friend class mojo::internal::MessageFragment<PrintRenderFrame_SetPrintPreviewUI_Params_Data>;

    PrintRenderFrame_SetPrintPreviewUI_Params_Data();
    ~PrintRenderFrame_SetPrintPreviewUI_Params_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_SetPrintPreviewUI_Params_Data) == 16, "Bad sizeof(PrintRenderFrame_SetPrintPreviewUI_Params_Data)");
class PrintRenderFrame_PrintPreview_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::DictionaryValue_Data> settings;

private:
    friend class mojo::internal::MessageFragment<PrintRenderFrame_PrintPreview_Params_Data>;

    PrintRenderFrame_PrintPreview_Params_Data();
    ~PrintRenderFrame_PrintPreview_Params_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_PrintPreview_Params_Data) == 16, "Bad sizeof(PrintRenderFrame_PrintPreview_Params_Data)");
class PrintRenderFrame_OnPrintPreviewDialogClosed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PrintRenderFrame_OnPrintPreviewDialogClosed_Params_Data>;

    PrintRenderFrame_OnPrintPreviewDialogClosed_Params_Data();
    ~PrintRenderFrame_OnPrintPreviewDialogClosed_Params_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_OnPrintPreviewDialogClosed_Params_Data) == 8, "Bad sizeof(PrintRenderFrame_OnPrintPreviewDialogClosed_Params_Data)");
class PrintRenderFrame_PrintFrameContent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PrintFrameContentParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<PrintRenderFrame_PrintFrameContent_Params_Data>;

    PrintRenderFrame_PrintFrameContent_Params_Data();
    ~PrintRenderFrame_PrintFrameContent_Params_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_PrintFrameContent_Params_Data) == 16, "Bad sizeof(PrintRenderFrame_PrintFrameContent_Params_Data)");
class PrintRenderFrame_PrintFrameContent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t document_cookie;
    uint8_t pad0_[4];
    mojo::internal::Pointer<internal::DidPrintContentParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<PrintRenderFrame_PrintFrameContent_ResponseParams_Data>;

    PrintRenderFrame_PrintFrameContent_ResponseParams_Data();
    ~PrintRenderFrame_PrintFrameContent_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_PrintFrameContent_ResponseParams_Data) == 24, "Bad sizeof(PrintRenderFrame_PrintFrameContent_ResponseParams_Data)");
class PrintRenderFrame_ConnectToPdfRenderer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PrintRenderFrame_ConnectToPdfRenderer_Params_Data>;

    PrintRenderFrame_ConnectToPdfRenderer_Params_Data();
    ~PrintRenderFrame_ConnectToPdfRenderer_Params_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_ConnectToPdfRenderer_Params_Data) == 8, "Bad sizeof(PrintRenderFrame_ConnectToPdfRenderer_Params_Data)");
class PrintRenderFrame_PrintingDone_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PrintRenderFrame_PrintingDone_Params_Data>;

    PrintRenderFrame_PrintingDone_Params_Data();
    ~PrintRenderFrame_PrintingDone_Params_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_PrintingDone_Params_Data) == 16, "Bad sizeof(PrintRenderFrame_PrintingDone_Params_Data)");
class PrintRenderFrame_PrintNodeUnderContextMenu_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PrintRenderFrame_PrintNodeUnderContextMenu_Params_Data>;

    PrintRenderFrame_PrintNodeUnderContextMenu_Params_Data();
    ~PrintRenderFrame_PrintNodeUnderContextMenu_Params_Data() = delete;
};
static_assert(sizeof(PrintRenderFrame_PrintNodeUnderContextMenu_Params_Data) == 8, "Bad sizeof(PrintRenderFrame_PrintNodeUnderContextMenu_Params_Data)");
class PrintManagerHost_DidGetPrintedPagesCount_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t cookie;
    uint32_t number_pages;

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_DidGetPrintedPagesCount_Params_Data>;

    PrintManagerHost_DidGetPrintedPagesCount_Params_Data();
    ~PrintManagerHost_DidGetPrintedPagesCount_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_DidGetPrintedPagesCount_Params_Data) == 16, "Bad sizeof(PrintManagerHost_DidGetPrintedPagesCount_Params_Data)");
class PrintManagerHost_GetDefaultPrintSettings_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_GetDefaultPrintSettings_Params_Data>;

    PrintManagerHost_GetDefaultPrintSettings_Params_Data();
    ~PrintManagerHost_GetDefaultPrintSettings_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_GetDefaultPrintSettings_Params_Data) == 8, "Bad sizeof(PrintManagerHost_GetDefaultPrintSettings_Params_Data)");
class PrintManagerHost_GetDefaultPrintSettings_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PrintParams_Data> default_settings;

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_GetDefaultPrintSettings_ResponseParams_Data>;

    PrintManagerHost_GetDefaultPrintSettings_ResponseParams_Data();
    ~PrintManagerHost_GetDefaultPrintSettings_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(PrintManagerHost_GetDefaultPrintSettings_ResponseParams_Data) == 16, "Bad sizeof(PrintManagerHost_GetDefaultPrintSettings_ResponseParams_Data)");
class PrintManagerHost_DidShowPrintDialog_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_DidShowPrintDialog_Params_Data>;

    PrintManagerHost_DidShowPrintDialog_Params_Data();
    ~PrintManagerHost_DidShowPrintDialog_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_DidShowPrintDialog_Params_Data) == 8, "Bad sizeof(PrintManagerHost_DidShowPrintDialog_Params_Data)");
class PrintManagerHost_DidPrintDocument_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::DidPrintDocumentParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_DidPrintDocument_Params_Data>;

    PrintManagerHost_DidPrintDocument_Params_Data();
    ~PrintManagerHost_DidPrintDocument_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_DidPrintDocument_Params_Data) == 16, "Bad sizeof(PrintManagerHost_DidPrintDocument_Params_Data)");
class PrintManagerHost_DidPrintDocument_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t completed : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_DidPrintDocument_ResponseParams_Data>;

    PrintManagerHost_DidPrintDocument_ResponseParams_Data();
    ~PrintManagerHost_DidPrintDocument_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_DidPrintDocument_ResponseParams_Data) == 16, "Bad sizeof(PrintManagerHost_DidPrintDocument_ResponseParams_Data)");
class PrintManagerHost_IsPrintingEnabled_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_IsPrintingEnabled_Params_Data>;

    PrintManagerHost_IsPrintingEnabled_Params_Data();
    ~PrintManagerHost_IsPrintingEnabled_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_IsPrintingEnabled_Params_Data) == 8, "Bad sizeof(PrintManagerHost_IsPrintingEnabled_Params_Data)");
class PrintManagerHost_IsPrintingEnabled_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t printing_enabled : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_IsPrintingEnabled_ResponseParams_Data>;

    PrintManagerHost_IsPrintingEnabled_ResponseParams_Data();
    ~PrintManagerHost_IsPrintingEnabled_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_IsPrintingEnabled_ResponseParams_Data) == 16, "Bad sizeof(PrintManagerHost_IsPrintingEnabled_ResponseParams_Data)");
class PrintManagerHost_ScriptedPrint_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::ScriptedPrintParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_ScriptedPrint_Params_Data>;

    PrintManagerHost_ScriptedPrint_Params_Data();
    ~PrintManagerHost_ScriptedPrint_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_ScriptedPrint_Params_Data) == 16, "Bad sizeof(PrintManagerHost_ScriptedPrint_Params_Data)");
class PrintManagerHost_ScriptedPrint_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PrintPagesParams_Data> settings;

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_ScriptedPrint_ResponseParams_Data>;

    PrintManagerHost_ScriptedPrint_ResponseParams_Data();
    ~PrintManagerHost_ScriptedPrint_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_ScriptedPrint_ResponseParams_Data) == 16, "Bad sizeof(PrintManagerHost_ScriptedPrint_ResponseParams_Data)");
class PrintManagerHost_PrintingFailed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t cookie;
    int32_t reason;

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_PrintingFailed_Params_Data>;

    PrintManagerHost_PrintingFailed_Params_Data();
    ~PrintManagerHost_PrintingFailed_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_PrintingFailed_Params_Data) == 16, "Bad sizeof(PrintManagerHost_PrintingFailed_Params_Data)");
class PrintManagerHost_UpdatePrintSettings_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::DictionaryValue_Data> job_settings;

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_UpdatePrintSettings_Params_Data>;

    PrintManagerHost_UpdatePrintSettings_Params_Data();
    ~PrintManagerHost_UpdatePrintSettings_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_UpdatePrintSettings_Params_Data) == 16, "Bad sizeof(PrintManagerHost_UpdatePrintSettings_Params_Data)");
class PrintManagerHost_UpdatePrintSettings_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PrintPagesParams_Data> current_settings;

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_UpdatePrintSettings_ResponseParams_Data>;

    PrintManagerHost_UpdatePrintSettings_ResponseParams_Data();
    ~PrintManagerHost_UpdatePrintSettings_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_UpdatePrintSettings_ResponseParams_Data) == 16, "Bad sizeof(PrintManagerHost_UpdatePrintSettings_ResponseParams_Data)");
class PrintManagerHost_SetupScriptedPrintPreview_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_SetupScriptedPrintPreview_Params_Data>;

    PrintManagerHost_SetupScriptedPrintPreview_Params_Data();
    ~PrintManagerHost_SetupScriptedPrintPreview_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_SetupScriptedPrintPreview_Params_Data) == 8, "Bad sizeof(PrintManagerHost_SetupScriptedPrintPreview_Params_Data)");
class PrintManagerHost_SetupScriptedPrintPreview_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_SetupScriptedPrintPreview_ResponseParams_Data>;

    PrintManagerHost_SetupScriptedPrintPreview_ResponseParams_Data();
    ~PrintManagerHost_SetupScriptedPrintPreview_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(PrintManagerHost_SetupScriptedPrintPreview_ResponseParams_Data) == 8, "Bad sizeof(PrintManagerHost_SetupScriptedPrintPreview_ResponseParams_Data)");
class PrintManagerHost_ShowScriptedPrintPreview_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_modifiable : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_ShowScriptedPrintPreview_Params_Data>;

    PrintManagerHost_ShowScriptedPrintPreview_Params_Data();
    ~PrintManagerHost_ShowScriptedPrintPreview_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_ShowScriptedPrintPreview_Params_Data) == 16, "Bad sizeof(PrintManagerHost_ShowScriptedPrintPreview_Params_Data)");
class PrintManagerHost_RequestPrintPreview_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::RequestPrintPreviewParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_RequestPrintPreview_Params_Data>;

    PrintManagerHost_RequestPrintPreview_Params_Data();
    ~PrintManagerHost_RequestPrintPreview_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_RequestPrintPreview_Params_Data) == 16, "Bad sizeof(PrintManagerHost_RequestPrintPreview_Params_Data)");
class PrintManagerHost_CheckForCancel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t preview_ui_id;
    int32_t request_id;

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_CheckForCancel_Params_Data>;

    PrintManagerHost_CheckForCancel_Params_Data();
    ~PrintManagerHost_CheckForCancel_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_CheckForCancel_Params_Data) == 16, "Bad sizeof(PrintManagerHost_CheckForCancel_Params_Data)");
class PrintManagerHost_CheckForCancel_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t cancel : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_CheckForCancel_ResponseParams_Data>;

    PrintManagerHost_CheckForCancel_ResponseParams_Data();
    ~PrintManagerHost_CheckForCancel_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_CheckForCancel_ResponseParams_Data) == 16, "Bad sizeof(PrintManagerHost_CheckForCancel_ResponseParams_Data)");
class PrintManagerHost_SetAccessibilityTree_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t cookie;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::ax::mojom::internal::AXTreeUpdate_Data> accessibility_tree;

private:
    friend class mojo::internal::MessageFragment<PrintManagerHost_SetAccessibilityTree_Params_Data>;

    PrintManagerHost_SetAccessibilityTree_Params_Data();
    ~PrintManagerHost_SetAccessibilityTree_Params_Data() = delete;
};
static_assert(sizeof(PrintManagerHost_SetAccessibilityTree_Params_Data) == 24, "Bad sizeof(PrintManagerHost_SetAccessibilityTree_Params_Data)");

} // namespace internal

class PrintPreviewUI_SetOptionsFromDocument_ParamsDataView {
public:
    PrintPreviewUI_SetOptionsFromDocument_ParamsDataView() = default;

    PrintPreviewUI_SetOptionsFromDocument_ParamsDataView(internal::PrintPreviewUI_SetOptionsFromDocument_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetParamsDataView(OptionsFromDocumentParamsDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadParams(UserType* output)
    {

        auto* pointer = data_->params.Get();
        return mojo::internal::Deserialize<::printing::mojom::OptionsFromDocumentParamsDataView>(pointer, output, message_);
    }
    int32_t request_id() const
    {
        return data_->request_id;
    }

