// third_party/blink/public/mojom/service_worker/service_worker_registration.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_SERVICE_WORKER_SERVICE_WORKER_REGISTRATION_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_SERVICE_WORKER_SERVICE_WORKER_REGISTRATION_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerRegistrationObjectHost_Update_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FetchClientSettingsObject_Data> outside_fetch_client_settings_object;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerRegistrationObjectHost_Update_Params_Data>;

    ServiceWorkerRegistrationObjectHost_Update_Params_Data();
    ~ServiceWorkerRegistrationObjectHost_Update_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerRegistrationObjectHost_Update_Params_Data) == 16, "Bad sizeof(ServiceWorkerRegistrationObjectHost_Update_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerRegistrationObjectHost_Update_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> error_msg;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerRegistrationObjectHost_Update_ResponseParams_Data>;

    ServiceWorkerRegistrationObjectHost_Update_ResponseParams_Data();
    ~ServiceWorkerRegistrationObjectHost_Update_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerRegistrationObjectHost_Update_ResponseParams_Data) == 24, "Bad sizeof(ServiceWorkerRegistrationObjectHost_Update_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerRegistrationObjectHost_Unregister_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerRegistrationObjectHost_Unregister_Params_Data>;

    ServiceWorkerRegistrationObjectHost_Unregister_Params_Data();
    ~ServiceWorkerRegistrationObjectHost_Unregister_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerRegistrationObjectHost_Unregister_Params_Data) == 8, "Bad sizeof(ServiceWorkerRegistrationObjectHost_Unregister_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerRegistrationObjectHost_Unregister_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> error_msg;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerRegistrationObjectHost_Unregister_ResponseParams_Data>;

    ServiceWorkerRegistrationObjectHost_Unregister_ResponseParams_Data();
    ~ServiceWorkerRegistrationObjectHost_Unregister_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerRegistrationObjectHost_Unregister_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerRegistrationObjectHost_Unregister_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerRegistrationObjectHost_EnableNavigationPreload_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t enable : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerRegistrationObjectHost_EnableNavigationPreload_Params_Data>;

    ServiceWorkerRegistrationObjectHost_EnableNavigationPreload_Params_Data();
    ~ServiceWorkerRegistrationObjectHost_EnableNavigationPreload_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerRegistrationObjectHost_EnableNavigationPreload_Params_Data) == 16,
    "Bad sizeof(ServiceWorkerRegistrationObjectHost_EnableNavigationPreload_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerRegistrationObjectHost_EnableNavigationPreload_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> error_msg;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerRegistrationObjectHost_EnableNavigationPreload_ResponseParams_Data>;

    ServiceWorkerRegistrationObjectHost_EnableNavigationPreload_ResponseParams_Data();
    ~ServiceWorkerRegistrationObjectHost_EnableNavigationPreload_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerRegistrationObjectHost_EnableNavigationPreload_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerRegistrationObjectHost_EnableNavigationPreload_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerRegistrationObjectHost_GetNavigationPreloadState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerRegistrationObjectHost_GetNavigationPreloadState_Params_Data>;

    ServiceWorkerRegistrationObjectHost_GetNavigationPreloadState_Params_Data();
    ~ServiceWorkerRegistrationObjectHost_GetNavigationPreloadState_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerRegistrationObjectHost_GetNavigationPreloadState_Params_Data) == 8,
    "Bad sizeof(ServiceWorkerRegistrationObjectHost_GetNavigationPreloadState_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerRegistrationObjectHost_GetNavigationPreloadState_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> error_msg;
    mojo::internal::Pointer<::blink::mojom::internal::NavigationPreloadState_Data> state;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerRegistrationObjectHost_GetNavigationPreloadState_ResponseParams_Data>;

    ServiceWorkerRegistrationObjectHost_GetNavigationPreloadState_ResponseParams_Data();
    ~ServiceWorkerRegistrationObjectHost_GetNavigationPreloadState_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerRegistrationObjectHost_GetNavigationPreloadState_ResponseParams_Data) == 32,
    "Bad sizeof(ServiceWorkerRegistrationObjectHost_GetNavigationPreloadState_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerRegistrationObjectHost_SetNavigationPreloadHeader_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> value;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerRegistrationObjectHost_SetNavigationPreloadHeader_Params_Data>;

    ServiceWorkerRegistrationObjectHost_SetNavigationPreloadHeader_Params_Data();
    ~ServiceWorkerRegistrationObjectHost_SetNavigationPreloadHeader_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerRegistrationObjectHost_SetNavigationPreloadHeader_Params_Data) == 16,
    "Bad sizeof(ServiceWorkerRegistrationObjectHost_SetNavigationPreloadHeader_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerRegistrationObjectHost_SetNavigationPreloadHeader_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> error_msg;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerRegistrationObjectHost_SetNavigationPreloadHeader_ResponseParams_Data>;

    ServiceWorkerRegistrationObjectHost_SetNavigationPreloadHeader_ResponseParams_Data();
    ~ServiceWorkerRegistrationObjectHost_SetNavigationPreloadHeader_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerRegistrationObjectHost_SetNavigationPreloadHeader_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerRegistrationObjectHost_SetNavigationPreloadHeader_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerRegistrationObject_SetServiceWorkerObjects_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::ChangedServiceWorkerObjectsMask_Data> changed_mask;
    mojo::internal::Pointer<::blink::mojom::internal::ServiceWorkerObjectInfo_Data> installing;
    mojo::internal::Pointer<::blink::mojom::internal::ServiceWorkerObjectInfo_Data> waiting;
    mojo::internal::Pointer<::blink::mojom::internal::ServiceWorkerObjectInfo_Data> active;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerRegistrationObject_SetServiceWorkerObjects_Params_Data>;

    ServiceWorkerRegistrationObject_SetServiceWorkerObjects_Params_Data();
    ~ServiceWorkerRegistrationObject_SetServiceWorkerObjects_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerRegistrationObject_SetServiceWorkerObjects_Params_Data) == 40,
    "Bad sizeof(ServiceWorkerRegistrationObject_SetServiceWorkerObjects_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerRegistrationObject_SetUpdateViaCache_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t update_via_cache;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerRegistrationObject_SetUpdateViaCache_Params_Data>;

    ServiceWorkerRegistrationObject_SetUpdateViaCache_Params_Data();
    ~ServiceWorkerRegistrationObject_SetUpdateViaCache_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerRegistrationObject_SetUpdateViaCache_Params_Data) == 16, "Bad sizeof(ServiceWorkerRegistrationObject_SetUpdateViaCache_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerRegistrationObject_UpdateFound_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerRegistrationObject_UpdateFound_Params_Data>;

    ServiceWorkerRegistrationObject_UpdateFound_Params_Data();
    ~ServiceWorkerRegistrationObject_UpdateFound_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerRegistrationObject_UpdateFound_Params_Data) == 8, "Bad sizeof(ServiceWorkerRegistrationObject_UpdateFound_Params_Data)");

} // namespace internal

class ServiceWorkerRegistrationObjectHost_Update_ParamsDataView {
public:
    ServiceWorkerRegistrationObjectHost_Update_ParamsDataView() = default;

    ServiceWorkerRegistrationObjectHost_Update_ParamsDataView(internal::ServiceWorkerRegistrationObjectHost_Update_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetOutsideFetchClientSettingsObjectDataView(::blink::mojom::FetchClientSettingsObjectDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadOutsideFetchClientSettingsObject(UserType* output)
    {

        auto* pointer = data_->outside_fetch_client_settings_object.Get();
