// third_party/blink/public/mojom/service_worker/service_worker.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_SERVICE_WORKER_SERVICE_WORKER_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_SERVICE_WORKER_SERVICE_WORKER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_SetCachedMetadata_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> data;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_SetCachedMetadata_Params_Data>;

    ServiceWorkerHost_SetCachedMetadata_Params_Data();
    ~ServiceWorkerHost_SetCachedMetadata_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_SetCachedMetadata_Params_Data) == 24, "Bad sizeof(ServiceWorkerHost_SetCachedMetadata_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_ClearCachedMetadata_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_ClearCachedMetadata_Params_Data>;

    ServiceWorkerHost_ClearCachedMetadata_Params_Data();
    ~ServiceWorkerHost_ClearCachedMetadata_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_ClearCachedMetadata_Params_Data) == 16, "Bad sizeof(ServiceWorkerHost_ClearCachedMetadata_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_GetClients_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::ServiceWorkerClientQueryOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_GetClients_Params_Data>;

    ServiceWorkerHost_GetClients_Params_Data();
    ~ServiceWorkerHost_GetClients_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_GetClients_Params_Data) == 16, "Bad sizeof(ServiceWorkerHost_GetClients_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_GetClients_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::blink::mojom::internal::ServiceWorkerClientInfo_Data>>> clients;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_GetClients_ResponseParams_Data>;

    ServiceWorkerHost_GetClients_ResponseParams_Data();
    ~ServiceWorkerHost_GetClients_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_GetClients_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorkerHost_GetClients_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_GetClient_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> client_uuid;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_GetClient_Params_Data>;

    ServiceWorkerHost_GetClient_Params_Data();
    ~ServiceWorkerHost_GetClient_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_GetClient_Params_Data) == 16, "Bad sizeof(ServiceWorkerHost_GetClient_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_GetClient_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::ServiceWorkerClientInfo_Data> client;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_GetClient_ResponseParams_Data>;

    ServiceWorkerHost_GetClient_ResponseParams_Data();
    ~ServiceWorkerHost_GetClient_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_GetClient_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorkerHost_GetClient_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_OpenNewTab_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_OpenNewTab_Params_Data>;

    ServiceWorkerHost_OpenNewTab_Params_Data();
    ~ServiceWorkerHost_OpenNewTab_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_OpenNewTab_Params_Data) == 16, "Bad sizeof(ServiceWorkerHost_OpenNewTab_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_OpenNewTab_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<::blink::mojom::internal::ServiceWorkerClientInfo_Data> client;
    mojo::internal::Pointer<mojo::internal::String_Data> error_msg;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_OpenNewTab_ResponseParams_Data>;

    ServiceWorkerHost_OpenNewTab_ResponseParams_Data();
    ~ServiceWorkerHost_OpenNewTab_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_OpenNewTab_ResponseParams_Data) == 32, "Bad sizeof(ServiceWorkerHost_OpenNewTab_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_OpenPaymentHandlerWindow_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_OpenPaymentHandlerWindow_Params_Data>;

    ServiceWorkerHost_OpenPaymentHandlerWindow_Params_Data();
    ~ServiceWorkerHost_OpenPaymentHandlerWindow_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_OpenPaymentHandlerWindow_Params_Data) == 16, "Bad sizeof(ServiceWorkerHost_OpenPaymentHandlerWindow_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_OpenPaymentHandlerWindow_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<::blink::mojom::internal::ServiceWorkerClientInfo_Data> client;
    mojo::internal::Pointer<mojo::internal::String_Data> error_msg;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_OpenPaymentHandlerWindow_ResponseParams_Data>;

    ServiceWorkerHost_OpenPaymentHandlerWindow_ResponseParams_Data();
    ~ServiceWorkerHost_OpenPaymentHandlerWindow_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerHost_OpenPaymentHandlerWindow_ResponseParams_Data) == 32, "Bad sizeof(ServiceWorkerHost_OpenPaymentHandlerWindow_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_PostMessageToClient_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> client_uuid;
    mojo::internal::Pointer<::blink::mojom::internal::TransferableMessage_Data> message;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_PostMessageToClient_Params_Data>;

    ServiceWorkerHost_PostMessageToClient_Params_Data();
    ~ServiceWorkerHost_PostMessageToClient_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_PostMessageToClient_Params_Data) == 24, "Bad sizeof(ServiceWorkerHost_PostMessageToClient_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_FocusClient_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> client_uuid;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_FocusClient_Params_Data>;

    ServiceWorkerHost_FocusClient_Params_Data();
    ~ServiceWorkerHost_FocusClient_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_FocusClient_Params_Data) == 16, "Bad sizeof(ServiceWorkerHost_FocusClient_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_FocusClient_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::ServiceWorkerClientInfo_Data> client;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_FocusClient_ResponseParams_Data>;

    ServiceWorkerHost_FocusClient_ResponseParams_Data();
    ~ServiceWorkerHost_FocusClient_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_FocusClient_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorkerHost_FocusClient_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_NavigateClient_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> client_uuid;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_NavigateClient_Params_Data>;

    ServiceWorkerHost_NavigateClient_Params_Data();
    ~ServiceWorkerHost_NavigateClient_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_NavigateClient_Params_Data) == 24, "Bad sizeof(ServiceWorkerHost_NavigateClient_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_NavigateClient_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<::blink::mojom::internal::ServiceWorkerClientInfo_Data> client;
    mojo::internal::Pointer<mojo::internal::String_Data> error_msg;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_NavigateClient_ResponseParams_Data>;

    ServiceWorkerHost_NavigateClient_ResponseParams_Data();
    ~ServiceWorkerHost_NavigateClient_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_NavigateClient_ResponseParams_Data) == 32, "Bad sizeof(ServiceWorkerHost_NavigateClient_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_SkipWaiting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_SkipWaiting_Params_Data>;

    ServiceWorkerHost_SkipWaiting_Params_Data();
    ~ServiceWorkerHost_SkipWaiting_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_SkipWaiting_Params_Data) == 8, "Bad sizeof(ServiceWorkerHost_SkipWaiting_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_SkipWaiting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_SkipWaiting_ResponseParams_Data>;

    ServiceWorkerHost_SkipWaiting_ResponseParams_Data();
    ~ServiceWorkerHost_SkipWaiting_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_SkipWaiting_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorkerHost_SkipWaiting_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_ClaimClients_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_ClaimClients_Params_Data>;

    ServiceWorkerHost_ClaimClients_Params_Data();
    ~ServiceWorkerHost_ClaimClients_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_ClaimClients_Params_Data) == 8, "Bad sizeof(ServiceWorkerHost_ClaimClients_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_ClaimClients_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t error;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> error_msg;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_ClaimClients_ResponseParams_Data>;

    ServiceWorkerHost_ClaimClients_ResponseParams_Data();
    ~ServiceWorkerHost_ClaimClients_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_ClaimClients_ResponseParams_Data) == 24, "Bad sizeof(ServiceWorkerHost_ClaimClients_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_AddRoutes_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::ServiceWorkerRouterRules_Data> rules;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_AddRoutes_Params_Data>;

    ServiceWorkerHost_AddRoutes_Params_Data();
    ~ServiceWorkerHost_AddRoutes_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_AddRoutes_Params_Data) == 16, "Bad sizeof(ServiceWorkerHost_AddRoutes_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorkerHost_AddRoutes_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_parse_error : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerHost_AddRoutes_ResponseParams_Data>;

    ServiceWorkerHost_AddRoutes_ResponseParams_Data();
    ~ServiceWorkerHost_AddRoutes_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerHost_AddRoutes_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorkerHost_AddRoutes_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_InitializeGlobalScope_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data service_worker_host;
    mojo::internal::AssociatedInterface_Data associated_interfaces_to_browser;
    mojo::internal::AssociatedEndpointHandle_Data associated_interfaces_from_browser;
    int32_t fetch_handler_existence;
    mojo::internal::Pointer<::blink::mojom::internal::ServiceWorkerRegistrationObjectInfo_Data> registration_info;
    mojo::internal::Pointer<::blink::mojom::internal::ServiceWorkerObjectInfo_Data> service_worker_info;
    mojo::internal::Handle_Data reporting_observer_receiver;
    int32_t ancestor_frame_type;
    mojo::internal::Pointer<::blink::mojom::internal::StorageKey_Data> storage_key;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_InitializeGlobalScope_Params_Data>;

    ServiceWorker_InitializeGlobalScope_Params_Data();
    ~ServiceWorker_InitializeGlobalScope_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_InitializeGlobalScope_Params_Data) == 64, "Bad sizeof(ServiceWorker_InitializeGlobalScope_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchInstallEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchInstallEvent_Params_Data>;

    ServiceWorker_DispatchInstallEvent_Params_Data();
    ~ServiceWorker_DispatchInstallEvent_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchInstallEvent_Params_Data) == 8, "Bad sizeof(ServiceWorker_DispatchInstallEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchInstallEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint32_t fetch_count;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchInstallEvent_ResponseParams_Data>;

    ServiceWorker_DispatchInstallEvent_ResponseParams_Data();
    ~ServiceWorker_DispatchInstallEvent_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchInstallEvent_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorker_DispatchInstallEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchActivateEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchActivateEvent_Params_Data>;

    ServiceWorker_DispatchActivateEvent_Params_Data();
    ~ServiceWorker_DispatchActivateEvent_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchActivateEvent_Params_Data) == 8, "Bad sizeof(ServiceWorker_DispatchActivateEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchActivateEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchActivateEvent_ResponseParams_Data>;

    ServiceWorker_DispatchActivateEvent_ResponseParams_Data();
    ~ServiceWorker_DispatchActivateEvent_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchActivateEvent_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorker_DispatchActivateEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchBackgroundFetchAbortEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::BackgroundFetchRegistration_Data> registration;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchBackgroundFetchAbortEvent_Params_Data>;

    ServiceWorker_DispatchBackgroundFetchAbortEvent_Params_Data();
    ~ServiceWorker_DispatchBackgroundFetchAbortEvent_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorker_DispatchBackgroundFetchAbortEvent_Params_Data) == 16, "Bad sizeof(ServiceWorker_DispatchBackgroundFetchAbortEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchBackgroundFetchAbortEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchBackgroundFetchAbortEvent_ResponseParams_Data>;

    ServiceWorker_DispatchBackgroundFetchAbortEvent_ResponseParams_Data();
    ~ServiceWorker_DispatchBackgroundFetchAbortEvent_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchBackgroundFetchAbortEvent_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorker_DispatchBackgroundFetchAbortEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchBackgroundFetchClickEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::BackgroundFetchRegistration_Data> registration;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchBackgroundFetchClickEvent_Params_Data>;

    ServiceWorker_DispatchBackgroundFetchClickEvent_Params_Data();
    ~ServiceWorker_DispatchBackgroundFetchClickEvent_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorker_DispatchBackgroundFetchClickEvent_Params_Data) == 16, "Bad sizeof(ServiceWorker_DispatchBackgroundFetchClickEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchBackgroundFetchClickEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchBackgroundFetchClickEvent_ResponseParams_Data>;

    ServiceWorker_DispatchBackgroundFetchClickEvent_ResponseParams_Data();
    ~ServiceWorker_DispatchBackgroundFetchClickEvent_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchBackgroundFetchClickEvent_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorker_DispatchBackgroundFetchClickEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchBackgroundFetchFailEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::BackgroundFetchRegistration_Data> registration;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchBackgroundFetchFailEvent_Params_Data>;

    ServiceWorker_DispatchBackgroundFetchFailEvent_Params_Data();
    ~ServiceWorker_DispatchBackgroundFetchFailEvent_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorker_DispatchBackgroundFetchFailEvent_Params_Data) == 16, "Bad sizeof(ServiceWorker_DispatchBackgroundFetchFailEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchBackgroundFetchFailEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchBackgroundFetchFailEvent_ResponseParams_Data>;

    ServiceWorker_DispatchBackgroundFetchFailEvent_ResponseParams_Data();
    ~ServiceWorker_DispatchBackgroundFetchFailEvent_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchBackgroundFetchFailEvent_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorker_DispatchBackgroundFetchFailEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchBackgroundFetchSuccessEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::BackgroundFetchRegistration_Data> registration;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchBackgroundFetchSuccessEvent_Params_Data>;

    ServiceWorker_DispatchBackgroundFetchSuccessEvent_Params_Data();
    ~ServiceWorker_DispatchBackgroundFetchSuccessEvent_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorker_DispatchBackgroundFetchSuccessEvent_Params_Data) == 16, "Bad sizeof(ServiceWorker_DispatchBackgroundFetchSuccessEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchBackgroundFetchSuccessEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchBackgroundFetchSuccessEvent_ResponseParams_Data>;

    ServiceWorker_DispatchBackgroundFetchSuccessEvent_ResponseParams_Data();
    ~ServiceWorker_DispatchBackgroundFetchSuccessEvent_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchBackgroundFetchSuccessEvent_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorker_DispatchBackgroundFetchSuccessEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchCookieChangeEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::CookieChangeInfo_Data> change;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchCookieChangeEvent_Params_Data>;

    ServiceWorker_DispatchCookieChangeEvent_Params_Data();
    ~ServiceWorker_DispatchCookieChangeEvent_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchCookieChangeEvent_Params_Data) == 16, "Bad sizeof(ServiceWorker_DispatchCookieChangeEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchCookieChangeEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchCookieChangeEvent_ResponseParams_Data>;

    ServiceWorker_DispatchCookieChangeEvent_ResponseParams_Data();
    ~ServiceWorker_DispatchCookieChangeEvent_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(ServiceWorker_DispatchCookieChangeEvent_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorker_DispatchCookieChangeEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchFetchEventForMainResource_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::DispatchFetchEventParams_Data> params;
    mojo::internal::Interface_Data response_callback;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchFetchEventForMainResource_Params_Data>;

    ServiceWorker_DispatchFetchEventForMainResource_Params_Data();
    ~ServiceWorker_DispatchFetchEventForMainResource_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorker_DispatchFetchEventForMainResource_Params_Data) == 24, "Bad sizeof(ServiceWorker_DispatchFetchEventForMainResource_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchFetchEventForMainResource_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchFetchEventForMainResource_ResponseParams_Data>;

    ServiceWorker_DispatchFetchEventForMainResource_ResponseParams_Data();
    ~ServiceWorker_DispatchFetchEventForMainResource_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchFetchEventForMainResource_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorker_DispatchFetchEventForMainResource_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchNotificationClickEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> notification_id;
    mojo::internal::Pointer<::blink::mojom::internal::NotificationData_Data> notification_data;
    int32_t action_index;
    uint8_t pad2_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> reply;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchNotificationClickEvent_Params_Data>;

    ServiceWorker_DispatchNotificationClickEvent_Params_Data();
    ~ServiceWorker_DispatchNotificationClickEvent_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchNotificationClickEvent_Params_Data) == 40, "Bad sizeof(ServiceWorker_DispatchNotificationClickEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchNotificationClickEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchNotificationClickEvent_ResponseParams_Data>;

    ServiceWorker_DispatchNotificationClickEvent_ResponseParams_Data();
    ~ServiceWorker_DispatchNotificationClickEvent_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchNotificationClickEvent_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorker_DispatchNotificationClickEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchNotificationCloseEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> notification_id;
    mojo::internal::Pointer<::blink::mojom::internal::NotificationData_Data> notification_data;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchNotificationCloseEvent_Params_Data>;

    ServiceWorker_DispatchNotificationCloseEvent_Params_Data();
    ~ServiceWorker_DispatchNotificationCloseEvent_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchNotificationCloseEvent_Params_Data) == 24, "Bad sizeof(ServiceWorker_DispatchNotificationCloseEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchNotificationCloseEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchNotificationCloseEvent_ResponseParams_Data>;

    ServiceWorker_DispatchNotificationCloseEvent_ResponseParams_Data();
    ~ServiceWorker_DispatchNotificationCloseEvent_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchNotificationCloseEvent_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorker_DispatchNotificationCloseEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchPushEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> payload;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchPushEvent_Params_Data>;

    ServiceWorker_DispatchPushEvent_Params_Data();
    ~ServiceWorker_DispatchPushEvent_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchPushEvent_Params_Data) == 16, "Bad sizeof(ServiceWorker_DispatchPushEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchPushEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchPushEvent_ResponseParams_Data>;

    ServiceWorker_DispatchPushEvent_ResponseParams_Data();
    ~ServiceWorker_DispatchPushEvent_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchPushEvent_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorker_DispatchPushEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchPushSubscriptionChangeEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::PushSubscription_Data> old_subscription;
    mojo::internal::Pointer<::blink::mojom::internal::PushSubscription_Data> new_subscription;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchPushSubscriptionChangeEvent_Params_Data>;

    ServiceWorker_DispatchPushSubscriptionChangeEvent_Params_Data();
    ~ServiceWorker_DispatchPushSubscriptionChangeEvent_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorker_DispatchPushSubscriptionChangeEvent_Params_Data) == 24, "Bad sizeof(ServiceWorker_DispatchPushSubscriptionChangeEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchPushSubscriptionChangeEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchPushSubscriptionChangeEvent_ResponseParams_Data>;

    ServiceWorker_DispatchPushSubscriptionChangeEvent_ResponseParams_Data();
    ~ServiceWorker_DispatchPushSubscriptionChangeEvent_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchPushSubscriptionChangeEvent_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorker_DispatchPushSubscriptionChangeEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchSyncEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> tag;
    uint8_t last_chance : 1;
    uint8_t pad1_[7];
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> timeout;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchSyncEvent_Params_Data>;

    ServiceWorker_DispatchSyncEvent_Params_Data();
    ~ServiceWorker_DispatchSyncEvent_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchSyncEvent_Params_Data) == 32, "Bad sizeof(ServiceWorker_DispatchSyncEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchSyncEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchSyncEvent_ResponseParams_Data>;

    ServiceWorker_DispatchSyncEvent_ResponseParams_Data();
    ~ServiceWorker_DispatchSyncEvent_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchSyncEvent_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorker_DispatchSyncEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchPeriodicSyncEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> tag;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> timeout;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchPeriodicSyncEvent_Params_Data>;

    ServiceWorker_DispatchPeriodicSyncEvent_Params_Data();
    ~ServiceWorker_DispatchPeriodicSyncEvent_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchPeriodicSyncEvent_Params_Data) == 24, "Bad sizeof(ServiceWorker_DispatchPeriodicSyncEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchPeriodicSyncEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchPeriodicSyncEvent_ResponseParams_Data>;

    ServiceWorker_DispatchPeriodicSyncEvent_ResponseParams_Data();
    ~ServiceWorker_DispatchPeriodicSyncEvent_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(ServiceWorker_DispatchPeriodicSyncEvent_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorker_DispatchPeriodicSyncEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchAbortPaymentEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data result_of_abort_payment;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchAbortPaymentEvent_Params_Data>;

    ServiceWorker_DispatchAbortPaymentEvent_Params_Data();
    ~ServiceWorker_DispatchAbortPaymentEvent_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchAbortPaymentEvent_Params_Data) == 16, "Bad sizeof(ServiceWorker_DispatchAbortPaymentEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchAbortPaymentEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchAbortPaymentEvent_ResponseParams_Data>;

    ServiceWorker_DispatchAbortPaymentEvent_ResponseParams_Data();
    ~ServiceWorker_DispatchAbortPaymentEvent_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(ServiceWorker_DispatchAbortPaymentEvent_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorker_DispatchAbortPaymentEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchCanMakePaymentEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::payments::mojom::internal::CanMakePaymentEventData_Data> event_data;
    mojo::internal::Interface_Data result_of_can_make_payment;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchCanMakePaymentEvent_Params_Data>;

    ServiceWorker_DispatchCanMakePaymentEvent_Params_Data();
    ~ServiceWorker_DispatchCanMakePaymentEvent_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchCanMakePaymentEvent_Params_Data) == 24, "Bad sizeof(ServiceWorker_DispatchCanMakePaymentEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchCanMakePaymentEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchCanMakePaymentEvent_ResponseParams_Data>;

    ServiceWorker_DispatchCanMakePaymentEvent_ResponseParams_Data();
    ~ServiceWorker_DispatchCanMakePaymentEvent_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(ServiceWorker_DispatchCanMakePaymentEvent_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorker_DispatchCanMakePaymentEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchPaymentRequestEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::payments::mojom::internal::PaymentRequestEventData_Data> request_data;
    mojo::internal::Interface_Data response_callback;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchPaymentRequestEvent_Params_Data>;

    ServiceWorker_DispatchPaymentRequestEvent_Params_Data();
    ~ServiceWorker_DispatchPaymentRequestEvent_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchPaymentRequestEvent_Params_Data) == 24, "Bad sizeof(ServiceWorker_DispatchPaymentRequestEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchPaymentRequestEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchPaymentRequestEvent_ResponseParams_Data>;

    ServiceWorker_DispatchPaymentRequestEvent_ResponseParams_Data();
    ~ServiceWorker_DispatchPaymentRequestEvent_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(ServiceWorker_DispatchPaymentRequestEvent_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorker_DispatchPaymentRequestEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchExtendableMessageEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::ExtendableMessageEvent_Data> event;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchExtendableMessageEvent_Params_Data>;

    ServiceWorker_DispatchExtendableMessageEvent_Params_Data();
    ~ServiceWorker_DispatchExtendableMessageEvent_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchExtendableMessageEvent_Params_Data) == 16, "Bad sizeof(ServiceWorker_DispatchExtendableMessageEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchExtendableMessageEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchExtendableMessageEvent_ResponseParams_Data>;

    ServiceWorker_DispatchExtendableMessageEvent_ResponseParams_Data();
    ~ServiceWorker_DispatchExtendableMessageEvent_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchExtendableMessageEvent_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorker_DispatchExtendableMessageEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchContentDeleteEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> id;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchContentDeleteEvent_Params_Data>;

    ServiceWorker_DispatchContentDeleteEvent_Params_Data();
    ~ServiceWorker_DispatchContentDeleteEvent_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_DispatchContentDeleteEvent_Params_Data) == 16, "Bad sizeof(ServiceWorker_DispatchContentDeleteEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_DispatchContentDeleteEvent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_DispatchContentDeleteEvent_ResponseParams_Data>;

    ServiceWorker_DispatchContentDeleteEvent_ResponseParams_Data();
    ~ServiceWorker_DispatchContentDeleteEvent_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(ServiceWorker_DispatchContentDeleteEvent_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorker_DispatchContentDeleteEvent_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_Ping_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_Ping_Params_Data>;

    ServiceWorker_Ping_Params_Data();
    ~ServiceWorker_Ping_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_Ping_Params_Data) == 8, "Bad sizeof(ServiceWorker_Ping_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_Ping_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_Ping_ResponseParams_Data>;

    ServiceWorker_Ping_ResponseParams_Data();
    ~ServiceWorker_Ping_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorker_Ping_ResponseParams_Data) == 8, "Bad sizeof(ServiceWorker_Ping_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_SetIdleDelay_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> delay;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_SetIdleDelay_Params_Data>;

    ServiceWorker_SetIdleDelay_Params_Data();
    ~ServiceWorker_SetIdleDelay_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_SetIdleDelay_Params_Data) == 16, "Bad sizeof(ServiceWorker_SetIdleDelay_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_AddKeepAlive_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_AddKeepAlive_Params_Data>;

    ServiceWorker_AddKeepAlive_Params_Data();
    ~ServiceWorker_AddKeepAlive_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_AddKeepAlive_Params_Data) == 8, "Bad sizeof(ServiceWorker_AddKeepAlive_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_ClearKeepAlive_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_ClearKeepAlive_Params_Data>;

    ServiceWorker_ClearKeepAlive_Params_Data();
    ~ServiceWorker_ClearKeepAlive_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_ClearKeepAlive_Params_Data) == 8, "Bad sizeof(ServiceWorker_ClearKeepAlive_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_AddMessageToConsole_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t level;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> message;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_AddMessageToConsole_Params_Data>;

    ServiceWorker_AddMessageToConsole_Params_Data();
    ~ServiceWorker_AddMessageToConsole_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_AddMessageToConsole_Params_Data) == 24, "Bad sizeof(ServiceWorker_AddMessageToConsole_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_ExecuteScriptForTest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> javascript;
    uint8_t wants_result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_ExecuteScriptForTest_Params_Data>;

    ServiceWorker_ExecuteScriptForTest_Params_Data();
    ~ServiceWorker_ExecuteScriptForTest_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorker_ExecuteScriptForTest_Params_Data) == 24, "Bad sizeof(ServiceWorker_ExecuteScriptForTest_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) ServiceWorker_ExecuteScriptForTest_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::mojo_base::mojom::internal::Value_Data result;
    mojo::internal::Pointer<mojo::internal::String_Data> error;

private:
    friend class mojo::internal::MessageFragment<ServiceWorker_ExecuteScriptForTest_ResponseParams_Data>;

    ServiceWorker_ExecuteScriptForTest_ResponseParams_Data();
    ~ServiceWorker_ExecuteScriptForTest_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorker_ExecuteScriptForTest_ResponseParams_Data) == 32, "Bad sizeof(ServiceWorker_ExecuteScriptForTest_ResponseParams_Data)");

} // namespace internal

class ServiceWorkerHost_SetCachedMetadata_ParamsDataView {
public:
    ServiceWorkerHost_SetCachedMetadata_ParamsDataView() = default;

    ServiceWorkerHost_SetCachedMetadata_ParamsDataView(internal::ServiceWorkerHost_SetCachedMetadata_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetUrlDataView(::url::mojom::UrlDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadUrl(UserType* output)
    {

        auto* pointer = data_->url.Get();
        return mojo::internal::Deserialize<::url::mojom::UrlDataView>(pointer, output, message_);
    }
    inline void GetDataDataView(::mojo_base::mojom::ReadOnlyBufferDataView* output);

