// ui/webui/resources/cr_components/certificate_manager/certificate_manager_v2.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef UI_WEBUI_RESOURCES_CR_COMPONENTS_CERTIFICATE_MANAGER_CERTIFICATE_MANAGER_V2_MOJOM_PARAMS_DATA_H_
#define UI_WEBUI_RESOURCES_CR_COMPONENTS_CERTIFICATE_MANAGER_CERTIFICATE_MANAGER_V2_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace certificate_manager_v2::mojom {
namespace internal {
class CertificateManagerPageHandlerFactory_CreateCertificateManagerPageHandler_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data page;
    mojo::internal::Handle_Data handler;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPageHandlerFactory_CreateCertificateManagerPageHandler_Params_Data>;

    CertificateManagerPageHandlerFactory_CreateCertificateManagerPageHandler_Params_Data();
    ~CertificateManagerPageHandlerFactory_CreateCertificateManagerPageHandler_Params_Data() = delete;
};
static_assert(sizeof(CertificateManagerPageHandlerFactory_CreateCertificateManagerPageHandler_Params_Data) == 24,
    "Bad sizeof(CertificateManagerPageHandlerFactory_CreateCertificateManagerPageHandler_Params_Data)");
class CertificateManagerPageHandler_GetCertificates_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t source;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPageHandler_GetCertificates_Params_Data>;

    CertificateManagerPageHandler_GetCertificates_Params_Data();
    ~CertificateManagerPageHandler_GetCertificates_Params_Data() = delete;
};
static_assert(sizeof(CertificateManagerPageHandler_GetCertificates_Params_Data) == 16, "Bad sizeof(CertificateManagerPageHandler_GetCertificates_Params_Data)");
class CertificateManagerPageHandler_GetCertificates_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::SummaryCertInfo_Data>>> certs;

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPageHandler_GetCertificates_ResponseParams_Data>;

    CertificateManagerPageHandler_GetCertificates_ResponseParams_Data();
    ~CertificateManagerPageHandler_GetCertificates_ResponseParams_Data() = delete;
};
static_assert(sizeof(CertificateManagerPageHandler_GetCertificates_ResponseParams_Data) == 16,
    "Bad sizeof(CertificateManagerPageHandler_GetCertificates_ResponseParams_Data)");
class CertificateManagerPageHandler_GetCertManagementMetadata_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPageHandler_GetCertManagementMetadata_Params_Data>;

    CertificateManagerPageHandler_GetCertManagementMetadata_Params_Data();
    ~CertificateManagerPageHandler_GetCertManagementMetadata_Params_Data() = delete;
};
static_assert(sizeof(CertificateManagerPageHandler_GetCertManagementMetadata_Params_Data) == 8,
    "Bad sizeof(CertificateManagerPageHandler_GetCertManagementMetadata_Params_Data)");
class CertificateManagerPageHandler_GetCertManagementMetadata_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CertManagementMetadata_Data> metadata;

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPageHandler_GetCertManagementMetadata_ResponseParams_Data>;

    CertificateManagerPageHandler_GetCertManagementMetadata_ResponseParams_Data();
    ~CertificateManagerPageHandler_GetCertManagementMetadata_ResponseParams_Data() = delete;
};
static_assert(sizeof(CertificateManagerPageHandler_GetCertManagementMetadata_ResponseParams_Data) == 16,
    "Bad sizeof(CertificateManagerPageHandler_GetCertManagementMetadata_ResponseParams_Data)");
class CertificateManagerPageHandler_ViewCertificate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t source;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> sha256_hash_hex;

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPageHandler_ViewCertificate_Params_Data>;

    CertificateManagerPageHandler_ViewCertificate_Params_Data();
    ~CertificateManagerPageHandler_ViewCertificate_Params_Data() = delete;
};
static_assert(sizeof(CertificateManagerPageHandler_ViewCertificate_Params_Data) == 24, "Bad sizeof(CertificateManagerPageHandler_ViewCertificate_Params_Data)");
class CertificateManagerPageHandler_ExportCertificates_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t source;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPageHandler_ExportCertificates_Params_Data>;

    CertificateManagerPageHandler_ExportCertificates_Params_Data();
    ~CertificateManagerPageHandler_ExportCertificates_Params_Data() = delete;
};
static_assert(
    sizeof(CertificateManagerPageHandler_ExportCertificates_Params_Data) == 16, "Bad sizeof(CertificateManagerPageHandler_ExportCertificates_Params_Data)");
class CertificateManagerPageHandler_ImportCertificate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t source;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPageHandler_ImportCertificate_Params_Data>;

    CertificateManagerPageHandler_ImportCertificate_Params_Data();
    ~CertificateManagerPageHandler_ImportCertificate_Params_Data() = delete;
};
static_assert(
    sizeof(CertificateManagerPageHandler_ImportCertificate_Params_Data) == 16, "Bad sizeof(CertificateManagerPageHandler_ImportCertificate_Params_Data)");
class CertificateManagerPageHandler_ImportCertificate_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::ActionResult_Data result;

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPageHandler_ImportCertificate_ResponseParams_Data>;

    CertificateManagerPageHandler_ImportCertificate_ResponseParams_Data();
    ~CertificateManagerPageHandler_ImportCertificate_ResponseParams_Data() = delete;
};
static_assert(sizeof(CertificateManagerPageHandler_ImportCertificate_ResponseParams_Data) == 24,
    "Bad sizeof(CertificateManagerPageHandler_ImportCertificate_ResponseParams_Data)");
class CertificateManagerPageHandler_ImportAndBindCertificate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t source;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPageHandler_ImportAndBindCertificate_Params_Data>;

    CertificateManagerPageHandler_ImportAndBindCertificate_Params_Data();
    ~CertificateManagerPageHandler_ImportAndBindCertificate_Params_Data() = delete;
};
static_assert(sizeof(CertificateManagerPageHandler_ImportAndBindCertificate_Params_Data) == 16,
    "Bad sizeof(CertificateManagerPageHandler_ImportAndBindCertificate_Params_Data)");
class CertificateManagerPageHandler_ImportAndBindCertificate_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::ActionResult_Data result;

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPageHandler_ImportAndBindCertificate_ResponseParams_Data>;

    CertificateManagerPageHandler_ImportAndBindCertificate_ResponseParams_Data();
    ~CertificateManagerPageHandler_ImportAndBindCertificate_ResponseParams_Data() = delete;
};
static_assert(sizeof(CertificateManagerPageHandler_ImportAndBindCertificate_ResponseParams_Data) == 24,
    "Bad sizeof(CertificateManagerPageHandler_ImportAndBindCertificate_ResponseParams_Data)");
class CertificateManagerPageHandler_DeleteCertificate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t source;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> display_name;
    mojo::internal::Pointer<mojo::internal::String_Data> sha256_hash_hex;

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPageHandler_DeleteCertificate_Params_Data>;

    CertificateManagerPageHandler_DeleteCertificate_Params_Data();
    ~CertificateManagerPageHandler_DeleteCertificate_Params_Data() = delete;
};
static_assert(
    sizeof(CertificateManagerPageHandler_DeleteCertificate_Params_Data) == 32, "Bad sizeof(CertificateManagerPageHandler_DeleteCertificate_Params_Data)");
class CertificateManagerPageHandler_DeleteCertificate_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::ActionResult_Data result;

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPageHandler_DeleteCertificate_ResponseParams_Data>;

    CertificateManagerPageHandler_DeleteCertificate_ResponseParams_Data();
    ~CertificateManagerPageHandler_DeleteCertificate_ResponseParams_Data() = delete;
};
static_assert(sizeof(CertificateManagerPageHandler_DeleteCertificate_ResponseParams_Data) == 24,
    "Bad sizeof(CertificateManagerPageHandler_DeleteCertificate_ResponseParams_Data)");
class CertificateManagerPageHandler_ShowNativeManageCertificates_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPageHandler_ShowNativeManageCertificates_Params_Data>;

    CertificateManagerPageHandler_ShowNativeManageCertificates_Params_Data();
    ~CertificateManagerPageHandler_ShowNativeManageCertificates_Params_Data() = delete;
};
static_assert(sizeof(CertificateManagerPageHandler_ShowNativeManageCertificates_Params_Data) == 8,
    "Bad sizeof(CertificateManagerPageHandler_ShowNativeManageCertificates_Params_Data)");
class CertificateManagerPageHandler_SetIncludeSystemTrustStore_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t include : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPageHandler_SetIncludeSystemTrustStore_Params_Data>;

    CertificateManagerPageHandler_SetIncludeSystemTrustStore_Params_Data();
    ~CertificateManagerPageHandler_SetIncludeSystemTrustStore_Params_Data() = delete;
};
static_assert(sizeof(CertificateManagerPageHandler_SetIncludeSystemTrustStore_Params_Data) == 16,
    "Bad sizeof(CertificateManagerPageHandler_SetIncludeSystemTrustStore_Params_Data)");
class CertificateManagerPage_AskForImportPassword_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPage_AskForImportPassword_Params_Data>;

    CertificateManagerPage_AskForImportPassword_Params_Data();
    ~CertificateManagerPage_AskForImportPassword_Params_Data() = delete;
};
static_assert(sizeof(CertificateManagerPage_AskForImportPassword_Params_Data) == 8, "Bad sizeof(CertificateManagerPage_AskForImportPassword_Params_Data)");
class CertificateManagerPage_AskForImportPassword_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> password;

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPage_AskForImportPassword_ResponseParams_Data>;

    CertificateManagerPage_AskForImportPassword_ResponseParams_Data();
    ~CertificateManagerPage_AskForImportPassword_ResponseParams_Data() = delete;
};
static_assert(sizeof(CertificateManagerPage_AskForImportPassword_ResponseParams_Data) == 16,
    "Bad sizeof(CertificateManagerPage_AskForImportPassword_ResponseParams_Data)");
class CertificateManagerPage_AskForConfirmation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> title;
    mojo::internal::Pointer<mojo::internal::String_Data> message;

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPage_AskForConfirmation_Params_Data>;

    CertificateManagerPage_AskForConfirmation_Params_Data();
    ~CertificateManagerPage_AskForConfirmation_Params_Data() = delete;
};
static_assert(sizeof(CertificateManagerPage_AskForConfirmation_Params_Data) == 24, "Bad sizeof(CertificateManagerPage_AskForConfirmation_Params_Data)");
class CertificateManagerPage_AskForConfirmation_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t confirmed : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<CertificateManagerPage_AskForConfirmation_ResponseParams_Data>;

    CertificateManagerPage_AskForConfirmation_ResponseParams_Data();
    ~CertificateManagerPage_AskForConfirmation_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(CertificateManagerPage_AskForConfirmation_ResponseParams_Data) == 16, "Bad sizeof(CertificateManagerPage_AskForConfirmation_ResponseParams_Data)");

} // namespace internal

class CertificateManagerPageHandlerFactory_CreateCertificateManagerPageHandler_ParamsDataView {
public:
