// services/metrics/public/mojom/ukm_interface.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_METRICS_PUBLIC_MOJOM_UKM_INTERFACE_MOJOM_PARAMS_DATA_H_
#define SERVICES_METRICS_PUBLIC_MOJOM_UKM_INTERFACE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace ukm::mojom {
namespace internal {
class SingularUkmInterface_Submit_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::UkmEntry_Data> entry;

private:
    friend class mojo::internal::MessageFragment<SingularUkmInterface_Submit_Params_Data>;

    SingularUkmInterface_Submit_Params_Data();
    ~SingularUkmInterface_Submit_Params_Data() = delete;
};
static_assert(sizeof(SingularUkmInterface_Submit_Params_Data) == 16, "Bad sizeof(SingularUkmInterface_Submit_Params_Data)");
class UkmRecorderClientInterface_SetParameters_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::UkmRecorderParameters_Data> params;

private:
    friend class mojo::internal::MessageFragment<UkmRecorderClientInterface_SetParameters_Params_Data>;

    UkmRecorderClientInterface_SetParameters_Params_Data();
    ~UkmRecorderClientInterface_SetParameters_Params_Data() = delete;
};
static_assert(sizeof(UkmRecorderClientInterface_SetParameters_Params_Data) == 16, "Bad sizeof(UkmRecorderClientInterface_SetParameters_Params_Data)");
class UkmRecorderInterface_AddEntry_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::UkmEntry_Data> entry;

private:
    friend class mojo::internal::MessageFragment<UkmRecorderInterface_AddEntry_Params_Data>;

    UkmRecorderInterface_AddEntry_Params_Data();
    ~UkmRecorderInterface_AddEntry_Params_Data() = delete;
};
static_assert(sizeof(UkmRecorderInterface_AddEntry_Params_Data) == 16, "Bad sizeof(UkmRecorderInterface_AddEntry_Params_Data)");
class UkmRecorderInterface_UpdateSourceURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t source_id;
    mojo::internal::Pointer<mojo::internal::String_Data> url;

private:
    friend class mojo::internal::MessageFragment<UkmRecorderInterface_UpdateSourceURL_Params_Data>;

    UkmRecorderInterface_UpdateSourceURL_Params_Data();
    ~UkmRecorderInterface_UpdateSourceURL_Params_Data() = delete;
};
static_assert(sizeof(UkmRecorderInterface_UpdateSourceURL_Params_Data) == 24, "Bad sizeof(UkmRecorderInterface_UpdateSourceURL_Params_Data)");
class UkmRecorderFactory_CreateUkmRecorder_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    mojo::internal::Interface_Data client_remote;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<UkmRecorderFactory_CreateUkmRecorder_Params_Data>;

    UkmRecorderFactory_CreateUkmRecorder_Params_Data();
    ~UkmRecorderFactory_CreateUkmRecorder_Params_Data() = delete;
};
static_assert(sizeof(UkmRecorderFactory_CreateUkmRecorder_Params_Data) == 24, "Bad sizeof(UkmRecorderFactory_CreateUkmRecorder_Params_Data)");

} // namespace internal

class SingularUkmInterface_Submit_ParamsDataView {
public:
    SingularUkmInterface_Submit_ParamsDataView() = default;

    SingularUkmInterface_Submit_ParamsDataView(internal::SingularUkmInterface_Submit_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetEntryDataView(UkmEntryDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadEntry(UserType* output)
    {

        auto* pointer = data_->entry.Get();
        return mojo::internal::Deserialize<::ukm::mojom::UkmEntryDataView>(pointer, output, message_);
    }

private:
    internal::SingularUkmInterface_Submit_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class UkmRecorderClientInterface_SetParameters_ParamsDataView {
public:
    UkmRecorderClientInterface_SetParameters_ParamsDataView() = default;

    UkmRecorderClientInterface_SetParameters_ParamsDataView(internal::UkmRecorderClientInterface_SetParameters_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetParamsDataView(UkmRecorderParametersDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadParams(UserType* output)
    {

        auto* pointer = data_->params.Get();
        return mojo::internal::Deserialize<::ukm::mojom::UkmRecorderParametersDataView>(pointer, output, message_);
    }

private:
    internal::UkmRecorderClientInterface_SetParameters_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class UkmRecorderInterface_AddEntry_ParamsDataView {
public:
    UkmRecorderInterface_AddEntry_ParamsDataView() = default;

    UkmRecorderInterface_AddEntry_ParamsDataView(internal::UkmRecorderInterface_AddEntry_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetEntryDataView(UkmEntryDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadEntry(UserType* output)
    {

        auto* pointer = data_->entry.Get();
        return mojo::internal::Deserialize<::ukm::mojom::UkmEntryDataView>(pointer, output, message_);
    }

private:
    internal::UkmRecorderInterface_AddEntry_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class UkmRecorderInterface_UpdateSourceURL_ParamsDataView {
public:
    UkmRecorderInterface_UpdateSourceURL_ParamsDataView() = default;

    UkmRecorderInterface_UpdateSourceURL_ParamsDataView(internal::UkmRecorderInterface_UpdateSourceURL_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    int64_t source_id() const
    {
        return data_->source_id;
    }
    inline void GetUrlDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadUrl(UserType* output)
    {

        auto* pointer = data_->url.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }

private:
    internal::UkmRecorderInterface_UpdateSourceURL_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class UkmRecorderFactory_CreateUkmRecorder_ParamsDataView {
public:
    UkmRecorderFactory_CreateUkmRecorder_ParamsDataView() = default;

    UkmRecorderFactory_CreateUkmRecorder_ParamsDataView(internal::UkmRecorderFactory_CreateUkmRecorder_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeReceiver()
    {
        UserType result;
        bool ret
            = mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::ukm::mojom::UkmRecorderInterfaceInterfaceBase>>(&data_->receiver, &result, message_);
        DCHECK(ret);
        return result;
    }
    template <typename UserType> UserType TakeClientRemote()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::ukm::mojom::UkmRecorderClientInterfaceInterfaceBase>>(
            &data_->client_remote, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::UkmRecorderFactory_CreateUkmRecorder_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

inline void SingularUkmInterface_Submit_ParamsDataView::GetEntryDataView(UkmEntryDataView* output)
{
    auto pointer = data_->entry.Get();
    *output = UkmEntryDataView(pointer, message_);
}

inline void UkmRecorderClientInterface_SetParameters_ParamsDataView::GetParamsDataView(UkmRecorderParametersDataView* output)
{
    auto pointer = data_->params.Get();
    *output = UkmRecorderParametersDataView(pointer, message_);
}

inline void UkmRecorderInterface_AddEntry_ParamsDataView::GetEntryDataView(UkmEntryDataView* output)
{
    auto pointer = data_->entry.Get();
    *output = UkmEntryDataView(pointer, message_);
}

inline void UkmRecorderInterface_UpdateSourceURL_ParamsDataView::GetUrlDataView(mojo::StringDataView* output)
{
    auto pointer = data_->url.Get();
    *output = mojo::StringDataView(pointer, message_);
}

} // ukm::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // SERVICES_METRICS_PUBLIC_MOJOM_UKM_INTERFACE_MOJOM_PARAMS_DATA_H_
