// third_party/blink/public/mojom/shared_storage/shared_storage_worklet_service.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_SHARED_STORAGE_SHARED_STORAGE_WORKLET_SERVICE_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_SHARED_STORAGE_SHARED_STORAGE_WORKLET_SERVICE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageEntriesListener_DidReadEntries_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t has_more_entries : 1;
    uint8_t pad1_[3];
    int32_t total_queued_to_send;
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::SharedStorageKeyAndOrValue_Data>>> entries;

private:
    friend class mojo::internal::MessageFragment<SharedStorageEntriesListener_DidReadEntries_Params_Data>;

    SharedStorageEntriesListener_DidReadEntries_Params_Data();
    ~SharedStorageEntriesListener_DidReadEntries_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageEntriesListener_DidReadEntries_Params_Data) == 32, "Bad sizeof(SharedStorageEntriesListener_DidReadEntries_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletServiceClient_SharedStorageUpdate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::network::mojom::internal::SharedStorageModifierMethod_Data method;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageUpdate_Params_Data>;

    SharedStorageWorkletServiceClient_SharedStorageUpdate_Params_Data();
    ~SharedStorageWorkletServiceClient_SharedStorageUpdate_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageUpdate_Params_Data) == 24,
    "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageUpdate_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletServiceClient_SharedStorageUpdate_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageUpdate_ResponseParams_Data>;

    SharedStorageWorkletServiceClient_SharedStorageUpdate_ResponseParams_Data();
    ~SharedStorageWorkletServiceClient_SharedStorageUpdate_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageUpdate_ResponseParams_Data) == 16,
    "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageUpdate_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletServiceClient_SharedStorageGet_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::SharedStorageKeyArgument_Data> key;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageGet_Params_Data>;

    SharedStorageWorkletServiceClient_SharedStorageGet_Params_Data();
    ~SharedStorageWorkletServiceClient_SharedStorageGet_Params_Data() = delete;
};
static_assert(
    sizeof(SharedStorageWorkletServiceClient_SharedStorageGet_Params_Data) == 16, "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageGet_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletServiceClient_SharedStorageGet_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> value;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageGet_ResponseParams_Data>;

    SharedStorageWorkletServiceClient_SharedStorageGet_ResponseParams_Data();
    ~SharedStorageWorkletServiceClient_SharedStorageGet_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageGet_ResponseParams_Data) == 32,
    "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageGet_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletServiceClient_SharedStorageKeys_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data listener;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageKeys_Params_Data>;

    SharedStorageWorkletServiceClient_SharedStorageKeys_Params_Data();
    ~SharedStorageWorkletServiceClient_SharedStorageKeys_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageKeys_Params_Data) == 16,
    "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageKeys_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletServiceClient_SharedStorageEntries_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data listener;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageEntries_Params_Data>;

    SharedStorageWorkletServiceClient_SharedStorageEntries_Params_Data();
    ~SharedStorageWorkletServiceClient_SharedStorageEntries_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageEntries_Params_Data) == 16,
    "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageEntries_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletServiceClient_SharedStorageLength_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageLength_Params_Data>;

    SharedStorageWorkletServiceClient_SharedStorageLength_Params_Data();
    ~SharedStorageWorkletServiceClient_SharedStorageLength_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageLength_Params_Data) == 8,
    "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageLength_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletServiceClient_SharedStorageLength_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[3];
    uint32_t length;
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageLength_ResponseParams_Data>;

    SharedStorageWorkletServiceClient_SharedStorageLength_ResponseParams_Data();
    ~SharedStorageWorkletServiceClient_SharedStorageLength_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageLength_ResponseParams_Data) == 24,
    "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageLength_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletServiceClient_SharedStorageRemainingBudget_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageRemainingBudget_Params_Data>;

    SharedStorageWorkletServiceClient_SharedStorageRemainingBudget_Params_Data();
    ~SharedStorageWorkletServiceClient_SharedStorageRemainingBudget_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageRemainingBudget_Params_Data) == 8,
    "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageRemainingBudget_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletServiceClient_SharedStorageRemainingBudget_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;
    double bits;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_SharedStorageRemainingBudget_ResponseParams_Data>;

    SharedStorageWorkletServiceClient_SharedStorageRemainingBudget_ResponseParams_Data();
    ~SharedStorageWorkletServiceClient_SharedStorageRemainingBudget_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_SharedStorageRemainingBudget_ResponseParams_Data) == 32,
    "Bad sizeof(SharedStorageWorkletServiceClient_SharedStorageRemainingBudget_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletServiceClient_GetInterestGroups_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_GetInterestGroups_Params_Data>;

    SharedStorageWorkletServiceClient_GetInterestGroups_Params_Data();
    ~SharedStorageWorkletServiceClient_GetInterestGroups_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_GetInterestGroups_Params_Data) == 8,
    "Bad sizeof(SharedStorageWorkletServiceClient_GetInterestGroups_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletServiceClient_GetInterestGroups_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::GetInterestGroupsResult_Data result;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_GetInterestGroups_ResponseParams_Data>;

    SharedStorageWorkletServiceClient_GetInterestGroups_ResponseParams_Data();
    ~SharedStorageWorkletServiceClient_GetInterestGroups_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_GetInterestGroups_ResponseParams_Data) == 24,
    "Bad sizeof(SharedStorageWorkletServiceClient_GetInterestGroups_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletServiceClient_DidAddMessageToConsole_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t log_level;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> message;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_DidAddMessageToConsole_Params_Data>;

    SharedStorageWorkletServiceClient_DidAddMessageToConsole_Params_Data();
    ~SharedStorageWorkletServiceClient_DidAddMessageToConsole_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_DidAddMessageToConsole_Params_Data) == 24,
    "Bad sizeof(SharedStorageWorkletServiceClient_DidAddMessageToConsole_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletServiceClient_RecordUseCounters_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> features;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletServiceClient_RecordUseCounters_Params_Data>;

    SharedStorageWorkletServiceClient_RecordUseCounters_Params_Data();
    ~SharedStorageWorkletServiceClient_RecordUseCounters_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletServiceClient_RecordUseCounters_Params_Data) == 16,
    "Bad sizeof(SharedStorageWorkletServiceClient_RecordUseCounters_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletService_Initialize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data client;
    mojo::internal::Pointer<internal::SharedStorageWorkletPermissionsPolicyState_Data> permissions_policy_state;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> embedder_context;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletService_Initialize_Params_Data>;

    SharedStorageWorkletService_Initialize_Params_Data();
    ~SharedStorageWorkletService_Initialize_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletService_Initialize_Params_Data) == 32, "Bad sizeof(SharedStorageWorkletService_Initialize_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletService_AddModule_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data url_loader_factory;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> script_source_url;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletService_AddModule_Params_Data>;

    SharedStorageWorkletService_AddModule_Params_Data();
    ~SharedStorageWorkletService_AddModule_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletService_AddModule_Params_Data) == 24, "Bad sizeof(SharedStorageWorkletService_AddModule_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletService_AddModule_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletService_AddModule_ResponseParams_Data>;

    SharedStorageWorkletService_AddModule_ResponseParams_Data();
    ~SharedStorageWorkletService_AddModule_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletService_AddModule_ResponseParams_Data) == 24, "Bad sizeof(SharedStorageWorkletService_AddModule_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletService_RunURLSelectionOperation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> name;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Url_Data>>> urls;
    mojo::internal::Pointer<::blink::mojom::internal::CloneableMessage_Data> serialized_data;
    mojo::internal::Pointer<internal::PrivateAggregationOperationDetails_Data> pa_operation_details;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletService_RunURLSelectionOperation_Params_Data>;

    SharedStorageWorkletService_RunURLSelectionOperation_Params_Data();
    ~SharedStorageWorkletService_RunURLSelectionOperation_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletService_RunURLSelectionOperation_Params_Data) == 40,
    "Bad sizeof(SharedStorageWorkletService_RunURLSelectionOperation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletService_RunURLSelectionOperation_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[3];
    uint32_t index;
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletService_RunURLSelectionOperation_ResponseParams_Data>;

    SharedStorageWorkletService_RunURLSelectionOperation_ResponseParams_Data();
    ~SharedStorageWorkletService_RunURLSelectionOperation_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletService_RunURLSelectionOperation_ResponseParams_Data) == 24,
    "Bad sizeof(SharedStorageWorkletService_RunURLSelectionOperation_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletService_RunOperation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> name;
    mojo::internal::Pointer<::blink::mojom::internal::CloneableMessage_Data> serialized_data;
    mojo::internal::Pointer<internal::PrivateAggregationOperationDetails_Data> pa_operation_details;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletService_RunOperation_Params_Data>;

    SharedStorageWorkletService_RunOperation_Params_Data();
    ~SharedStorageWorkletService_RunOperation_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletService_RunOperation_Params_Data) == 32, "Bad sizeof(SharedStorageWorkletService_RunOperation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletService_RunOperation_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletService_RunOperation_ResponseParams_Data>;

    SharedStorageWorkletService_RunOperation_ResponseParams_Data();
    ~SharedStorageWorkletService_RunOperation_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(SharedStorageWorkletService_RunOperation_ResponseParams_Data) == 24, "Bad sizeof(SharedStorageWorkletService_RunOperation_ResponseParams_Data)");

