// third_party/blink/public/mojom/shared_storage/shared_storage.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_SHARED_STORAGE_SHARED_STORAGE_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_SHARED_STORAGE_SHARED_STORAGE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletHost_SelectURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> name;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::SharedStorageUrlWithMetadata_Data>>> urls_with_metadata;
    mojo::internal::Pointer<::blink::mojom::internal::CloneableMessage_Data> serialized_data;
    uint8_t keep_alive_after_operation : 1;
    uint8_t pad3_[7];
    mojo::internal::Pointer<internal::PrivateAggregationConfig_Data> private_aggregation_config;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> saved_query_name;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletHost_SelectURL_Params_Data>;

    SharedStorageWorkletHost_SelectURL_Params_Data();
    ~SharedStorageWorkletHost_SelectURL_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletHost_SelectURL_Params_Data) == 56, "Bad sizeof(SharedStorageWorkletHost_SelectURL_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletHost_SelectURL_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;
    mojo::internal::Pointer<::blink::mojom::internal::FencedFrameConfig_Data> config;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletHost_SelectURL_ResponseParams_Data>;

    SharedStorageWorkletHost_SelectURL_ResponseParams_Data();
    ~SharedStorageWorkletHost_SelectURL_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletHost_SelectURL_ResponseParams_Data) == 32, "Bad sizeof(SharedStorageWorkletHost_SelectURL_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletHost_Run_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> name;
    mojo::internal::Pointer<::blink::mojom::internal::CloneableMessage_Data> serialized_data;
    uint8_t keep_alive_after_operation : 1;
    uint8_t pad2_[7];
    mojo::internal::Pointer<internal::PrivateAggregationConfig_Data> private_aggregation_config;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletHost_Run_Params_Data>;

    SharedStorageWorkletHost_Run_Params_Data();
    ~SharedStorageWorkletHost_Run_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletHost_Run_Params_Data) == 40, "Bad sizeof(SharedStorageWorkletHost_Run_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageWorkletHost_Run_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<SharedStorageWorkletHost_Run_ResponseParams_Data>;

    SharedStorageWorkletHost_Run_ResponseParams_Data();
    ~SharedStorageWorkletHost_Run_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageWorkletHost_Run_ResponseParams_Data) == 24, "Bad sizeof(SharedStorageWorkletHost_Run_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_CreateWorklet_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> script_source_url;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> data_origin;
    int32_t credentials_mode;
    mojo::internal::AssociatedEndpointHandle_Data worklet_host;
    mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> origin_trial_features;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_CreateWorklet_Params_Data>;

    SharedStorageDocumentService_CreateWorklet_Params_Data();
    ~SharedStorageDocumentService_CreateWorklet_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageDocumentService_CreateWorklet_Params_Data) == 40, "Bad sizeof(SharedStorageDocumentService_CreateWorklet_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_CreateWorklet_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_CreateWorklet_ResponseParams_Data>;

    SharedStorageDocumentService_CreateWorklet_ResponseParams_Data();
    ~SharedStorageDocumentService_CreateWorklet_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(SharedStorageDocumentService_CreateWorklet_ResponseParams_Data) == 24, "Bad sizeof(SharedStorageDocumentService_CreateWorklet_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_SharedStorageGet_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::SharedStorageKeyArgument_Data> key;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_SharedStorageGet_Params_Data>;

    SharedStorageDocumentService_SharedStorageGet_Params_Data();
    ~SharedStorageDocumentService_SharedStorageGet_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageDocumentService_SharedStorageGet_Params_Data) == 16, "Bad sizeof(SharedStorageDocumentService_SharedStorageGet_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_SharedStorageGet_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> value;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_SharedStorageGet_ResponseParams_Data>;

    SharedStorageDocumentService_SharedStorageGet_ResponseParams_Data();
    ~SharedStorageDocumentService_SharedStorageGet_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageDocumentService_SharedStorageGet_ResponseParams_Data) == 32,
    "Bad sizeof(SharedStorageDocumentService_SharedStorageGet_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_SharedStorageUpdate_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::network::mojom::internal::SharedStorageModifierMethod_Data method;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_SharedStorageUpdate_Params_Data>;

    SharedStorageDocumentService_SharedStorageUpdate_Params_Data();
    ~SharedStorageDocumentService_SharedStorageUpdate_Params_Data() = delete;
};
static_assert(
    sizeof(SharedStorageDocumentService_SharedStorageUpdate_Params_Data) == 24, "Bad sizeof(SharedStorageDocumentService_SharedStorageUpdate_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_SharedStorageUpdate_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_SharedStorageUpdate_ResponseParams_Data>;

    SharedStorageDocumentService_SharedStorageUpdate_ResponseParams_Data();
    ~SharedStorageDocumentService_SharedStorageUpdate_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageDocumentService_SharedStorageUpdate_ResponseParams_Data) == 16,
    "Bad sizeof(SharedStorageDocumentService_SharedStorageUpdate_ResponseParams_Data)");

} // namespace internal

class SharedStorageWorkletHost_SelectURL_ParamsDataView {
public:
    SharedStorageWorkletHost_SelectURL_ParamsDataView() = default;

    SharedStorageWorkletHost_SelectURL_ParamsDataView(internal::SharedStorageWorkletHost_SelectURL_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetNameDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadName(UserType* output)
    {

        auto* pointer = data_->name.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }
