// services/viz/privileged/mojom/compositing/frame_sink_video_capture.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_VIZ_PRIVILEGED_MOJOM_COMPOSITING_FRAME_SINK_VIDEO_CAPTURE_MOJOM_PARAMS_DATA_H_
#define SERVICES_VIZ_PRIVILEGED_MOJOM_COMPOSITING_FRAME_SINK_VIDEO_CAPTURE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace viz::mojom {
namespace internal {
class FrameSinkVideoConsumerFrameCallbacks_Done_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoConsumerFrameCallbacks_Done_Params_Data>;

    FrameSinkVideoConsumerFrameCallbacks_Done_Params_Data();
    ~FrameSinkVideoConsumerFrameCallbacks_Done_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkVideoConsumerFrameCallbacks_Done_Params_Data) == 8, "Bad sizeof(FrameSinkVideoConsumerFrameCallbacks_Done_Params_Data)");
class FrameSinkVideoConsumerFrameCallbacks_ProvideFeedback_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::mojom::internal::VideoCaptureFeedback_Data> feedback;

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoConsumerFrameCallbacks_ProvideFeedback_Params_Data>;

    FrameSinkVideoConsumerFrameCallbacks_ProvideFeedback_Params_Data();
    ~FrameSinkVideoConsumerFrameCallbacks_ProvideFeedback_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkVideoConsumerFrameCallbacks_ProvideFeedback_Params_Data) == 16,
    "Bad sizeof(FrameSinkVideoConsumerFrameCallbacks_ProvideFeedback_Params_Data)");
class FrameSinkVideoConsumer_OnFrameCaptured_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::media::mojom::internal::VideoBufferHandle_Data data;
    mojo::internal::Pointer<::media::mojom::internal::VideoFrameInfo_Data> info;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> content_rect;
    mojo::internal::Interface_Data callbacks;

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoConsumer_OnFrameCaptured_Params_Data>;

    FrameSinkVideoConsumer_OnFrameCaptured_Params_Data();
    ~FrameSinkVideoConsumer_OnFrameCaptured_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkVideoConsumer_OnFrameCaptured_Params_Data) == 48, "Bad sizeof(FrameSinkVideoConsumer_OnFrameCaptured_Params_Data)");
class FrameSinkVideoConsumer_OnNewSubCaptureTargetVersion_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t sub_capture_target_version;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoConsumer_OnNewSubCaptureTargetVersion_Params_Data>;

    FrameSinkVideoConsumer_OnNewSubCaptureTargetVersion_Params_Data();
    ~FrameSinkVideoConsumer_OnNewSubCaptureTargetVersion_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkVideoConsumer_OnNewSubCaptureTargetVersion_Params_Data) == 16,
    "Bad sizeof(FrameSinkVideoConsumer_OnNewSubCaptureTargetVersion_Params_Data)");
class FrameSinkVideoConsumer_OnFrameWithEmptyRegionCapture_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoConsumer_OnFrameWithEmptyRegionCapture_Params_Data>;

    FrameSinkVideoConsumer_OnFrameWithEmptyRegionCapture_Params_Data();
    ~FrameSinkVideoConsumer_OnFrameWithEmptyRegionCapture_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkVideoConsumer_OnFrameWithEmptyRegionCapture_Params_Data) == 8,
    "Bad sizeof(FrameSinkVideoConsumer_OnFrameWithEmptyRegionCapture_Params_Data)");
class FrameSinkVideoConsumer_OnStopped_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoConsumer_OnStopped_Params_Data>;

    FrameSinkVideoConsumer_OnStopped_Params_Data();
    ~FrameSinkVideoConsumer_OnStopped_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkVideoConsumer_OnStopped_Params_Data) == 8, "Bad sizeof(FrameSinkVideoConsumer_OnStopped_Params_Data)");
class FrameSinkVideoConsumer_OnLog_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> message;

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoConsumer_OnLog_Params_Data>;

    FrameSinkVideoConsumer_OnLog_Params_Data();
    ~FrameSinkVideoConsumer_OnLog_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkVideoConsumer_OnLog_Params_Data) == 16, "Bad sizeof(FrameSinkVideoConsumer_OnLog_Params_Data)");
class FrameSinkVideoCapturer_SetFormat_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t format;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoCapturer_SetFormat_Params_Data>;

    FrameSinkVideoCapturer_SetFormat_Params_Data();
    ~FrameSinkVideoCapturer_SetFormat_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkVideoCapturer_SetFormat_Params_Data) == 16, "Bad sizeof(FrameSinkVideoCapturer_SetFormat_Params_Data)");
class FrameSinkVideoCapturer_SetMinCapturePeriod_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> min_period;

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoCapturer_SetMinCapturePeriod_Params_Data>;

    FrameSinkVideoCapturer_SetMinCapturePeriod_Params_Data();
    ~FrameSinkVideoCapturer_SetMinCapturePeriod_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkVideoCapturer_SetMinCapturePeriod_Params_Data) == 16, "Bad sizeof(FrameSinkVideoCapturer_SetMinCapturePeriod_Params_Data)");
class FrameSinkVideoCapturer_SetMinSizeChangePeriod_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> min_period;

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoCapturer_SetMinSizeChangePeriod_Params_Data>;

    FrameSinkVideoCapturer_SetMinSizeChangePeriod_Params_Data();
    ~FrameSinkVideoCapturer_SetMinSizeChangePeriod_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkVideoCapturer_SetMinSizeChangePeriod_Params_Data) == 16, "Bad sizeof(FrameSinkVideoCapturer_SetMinSizeChangePeriod_Params_Data)");
class FrameSinkVideoCapturer_SetResolutionConstraints_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> min_size;
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> max_size;
    uint8_t use_fixed_aspect_ratio : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoCapturer_SetResolutionConstraints_Params_Data>;

    FrameSinkVideoCapturer_SetResolutionConstraints_Params_Data();
    ~FrameSinkVideoCapturer_SetResolutionConstraints_Params_Data() = delete;
};
static_assert(
    sizeof(FrameSinkVideoCapturer_SetResolutionConstraints_Params_Data) == 32, "Bad sizeof(FrameSinkVideoCapturer_SetResolutionConstraints_Params_Data)");
class FrameSinkVideoCapturer_SetAutoThrottlingEnabled_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t enabled : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoCapturer_SetAutoThrottlingEnabled_Params_Data>;

    FrameSinkVideoCapturer_SetAutoThrottlingEnabled_Params_Data();
    ~FrameSinkVideoCapturer_SetAutoThrottlingEnabled_Params_Data() = delete;
};
static_assert(
    sizeof(FrameSinkVideoCapturer_SetAutoThrottlingEnabled_Params_Data) == 16, "Bad sizeof(FrameSinkVideoCapturer_SetAutoThrottlingEnabled_Params_Data)");
class FrameSinkVideoCapturer_ChangeTarget_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::VideoCaptureTarget_Data> target;
    uint32_t sub_capture_target_version;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoCapturer_ChangeTarget_Params_Data>;

    FrameSinkVideoCapturer_ChangeTarget_Params_Data();
    ~FrameSinkVideoCapturer_ChangeTarget_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkVideoCapturer_ChangeTarget_Params_Data) == 24, "Bad sizeof(FrameSinkVideoCapturer_ChangeTarget_Params_Data)");
class FrameSinkVideoCapturer_Start_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data consumer;
    int32_t buffer_format_preference;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoCapturer_Start_Params_Data>;

    FrameSinkVideoCapturer_Start_Params_Data();
    ~FrameSinkVideoCapturer_Start_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkVideoCapturer_Start_Params_Data) == 24, "Bad sizeof(FrameSinkVideoCapturer_Start_Params_Data)");
class FrameSinkVideoCapturer_Stop_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoCapturer_Stop_Params_Data>;

    FrameSinkVideoCapturer_Stop_Params_Data();
    ~FrameSinkVideoCapturer_Stop_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkVideoCapturer_Stop_Params_Data) == 8, "Bad sizeof(FrameSinkVideoCapturer_Stop_Params_Data)");
class FrameSinkVideoCapturer_RequestRefreshFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoCapturer_RequestRefreshFrame_Params_Data>;

    FrameSinkVideoCapturer_RequestRefreshFrame_Params_Data();
    ~FrameSinkVideoCapturer_RequestRefreshFrame_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkVideoCapturer_RequestRefreshFrame_Params_Data) == 8, "Bad sizeof(FrameSinkVideoCapturer_RequestRefreshFrame_Params_Data)");
class FrameSinkVideoCapturer_CreateOverlay_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t stacking_index;
    mojo::internal::Handle_Data receiver;

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoCapturer_CreateOverlay_Params_Data>;

    FrameSinkVideoCapturer_CreateOverlay_Params_Data();
    ~FrameSinkVideoCapturer_CreateOverlay_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkVideoCapturer_CreateOverlay_Params_Data) == 16, "Bad sizeof(FrameSinkVideoCapturer_CreateOverlay_Params_Data)");
class FrameSinkVideoCaptureOverlay_SetImageAndBounds_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::skia::mojom::internal::BitmapN32_Data> image;
    mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> bounds;

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoCaptureOverlay_SetImageAndBounds_Params_Data>;

    FrameSinkVideoCaptureOverlay_SetImageAndBounds_Params_Data();
    ~FrameSinkVideoCaptureOverlay_SetImageAndBounds_Params_Data() = delete;
};
static_assert(
    sizeof(FrameSinkVideoCaptureOverlay_SetImageAndBounds_Params_Data) == 24, "Bad sizeof(FrameSinkVideoCaptureOverlay_SetImageAndBounds_Params_Data)");
class FrameSinkVideoCaptureOverlay_SetBounds_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> bounds;

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoCaptureOverlay_SetBounds_Params_Data>;

    FrameSinkVideoCaptureOverlay_SetBounds_Params_Data();
    ~FrameSinkVideoCaptureOverlay_SetBounds_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkVideoCaptureOverlay_SetBounds_Params_Data) == 16, "Bad sizeof(FrameSinkVideoCaptureOverlay_SetBounds_Params_Data)");
class FrameSinkVideoCaptureOverlay_OnCapturedMouseEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> coordinates;

private:
    friend class mojo::internal::MessageFragment<FrameSinkVideoCaptureOverlay_OnCapturedMouseEvent_Params_Data>;

    FrameSinkVideoCaptureOverlay_OnCapturedMouseEvent_Params_Data();
    ~FrameSinkVideoCaptureOverlay_OnCapturedMouseEvent_Params_Data() = delete;
};
static_assert(
    sizeof(FrameSinkVideoCaptureOverlay_OnCapturedMouseEvent_Params_Data) == 16, "Bad sizeof(FrameSinkVideoCaptureOverlay_OnCapturedMouseEvent_Params_Data)");

} // namespace internal

class FrameSinkVideoConsumerFrameCallbacks_Done_ParamsDataView {
public:
