// services/viz/privileged/mojom/compositing/frame_sink_manager.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_VIZ_PRIVILEGED_MOJOM_COMPOSITING_FRAME_SINK_MANAGER_MOJOM_PARAMS_DATA_H_
#define SERVICES_VIZ_PRIVILEGED_MOJOM_COMPOSITING_FRAME_SINK_MANAGER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace viz::mojom {
namespace internal {
class FrameSinkManager_RegisterFrameSinkId_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> frame_sink_id;
    uint8_t report_activation : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_RegisterFrameSinkId_Params_Data>;

    FrameSinkManager_RegisterFrameSinkId_Params_Data();
    ~FrameSinkManager_RegisterFrameSinkId_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_RegisterFrameSinkId_Params_Data) == 24, "Bad sizeof(FrameSinkManager_RegisterFrameSinkId_Params_Data)");
class FrameSinkManager_InvalidateFrameSinkId_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> frame_sink_id;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_InvalidateFrameSinkId_Params_Data>;

    FrameSinkManager_InvalidateFrameSinkId_Params_Data();
    ~FrameSinkManager_InvalidateFrameSinkId_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_InvalidateFrameSinkId_Params_Data) == 16, "Bad sizeof(FrameSinkManager_InvalidateFrameSinkId_Params_Data)");
class FrameSinkManager_SetFrameSinkDebugLabel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> frame_sink_id;
    mojo::internal::Pointer<mojo::internal::String_Data> debug_label;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_SetFrameSinkDebugLabel_Params_Data>;

    FrameSinkManager_SetFrameSinkDebugLabel_Params_Data();
    ~FrameSinkManager_SetFrameSinkDebugLabel_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_SetFrameSinkDebugLabel_Params_Data) == 24, "Bad sizeof(FrameSinkManager_SetFrameSinkDebugLabel_Params_Data)");
class FrameSinkManager_CreateRootCompositorFrameSink_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::RootCompositorFrameSinkParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_CreateRootCompositorFrameSink_Params_Data>;

    FrameSinkManager_CreateRootCompositorFrameSink_Params_Data();
    ~FrameSinkManager_CreateRootCompositorFrameSink_Params_Data() = delete;
};
static_assert(
    sizeof(FrameSinkManager_CreateRootCompositorFrameSink_Params_Data) == 16, "Bad sizeof(FrameSinkManager_CreateRootCompositorFrameSink_Params_Data)");
class FrameSinkManager_CreateFrameSinkBundle_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::FrameSinkBundleId_Data> bundle_id;
    mojo::internal::Handle_Data receiver;
    mojo::internal::Interface_Data client;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_CreateFrameSinkBundle_Params_Data>;

    FrameSinkManager_CreateFrameSinkBundle_Params_Data();
    ~FrameSinkManager_CreateFrameSinkBundle_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_CreateFrameSinkBundle_Params_Data) == 32, "Bad sizeof(FrameSinkManager_CreateFrameSinkBundle_Params_Data)");
class FrameSinkManager_CreateCompositorFrameSink_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> frame_sink_id;
    mojo::internal::Pointer<::viz::mojom::internal::FrameSinkBundleId_Data> bundle_id;
    mojo::internal::Handle_Data compositor_frame_sink;
    mojo::internal::Interface_Data compositor_frame_sink_client;
    uint8_t pad3_[4];
    mojo::internal::Pointer<::input::mojom::internal::RenderInputRouterConfig_Data> config;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_CreateCompositorFrameSink_Params_Data>;

    FrameSinkManager_CreateCompositorFrameSink_Params_Data();
    ~FrameSinkManager_CreateCompositorFrameSink_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_CreateCompositorFrameSink_Params_Data) == 48, "Bad sizeof(FrameSinkManager_CreateCompositorFrameSink_Params_Data)");
class FrameSinkManager_DestroyCompositorFrameSink_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> frame_sink_id;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_DestroyCompositorFrameSink_Params_Data>;

    FrameSinkManager_DestroyCompositorFrameSink_Params_Data();
    ~FrameSinkManager_DestroyCompositorFrameSink_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_DestroyCompositorFrameSink_Params_Data) == 16, "Bad sizeof(FrameSinkManager_DestroyCompositorFrameSink_Params_Data)");
class FrameSinkManager_DestroyCompositorFrameSink_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_DestroyCompositorFrameSink_ResponseParams_Data>;

    FrameSinkManager_DestroyCompositorFrameSink_ResponseParams_Data();
    ~FrameSinkManager_DestroyCompositorFrameSink_ResponseParams_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_DestroyCompositorFrameSink_ResponseParams_Data) == 8,
    "Bad sizeof(FrameSinkManager_DestroyCompositorFrameSink_ResponseParams_Data)");
class FrameSinkManager_RegisterFrameSinkHierarchy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> parent_frame_sink_id;
    mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> child_frame_sink_id;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_RegisterFrameSinkHierarchy_Params_Data>;

    FrameSinkManager_RegisterFrameSinkHierarchy_Params_Data();
    ~FrameSinkManager_RegisterFrameSinkHierarchy_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_RegisterFrameSinkHierarchy_Params_Data) == 24, "Bad sizeof(FrameSinkManager_RegisterFrameSinkHierarchy_Params_Data)");
class FrameSinkManager_UnregisterFrameSinkHierarchy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> parent_frame_sink_id;
    mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> child_frame_sink_id;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_UnregisterFrameSinkHierarchy_Params_Data>;

    FrameSinkManager_UnregisterFrameSinkHierarchy_Params_Data();
    ~FrameSinkManager_UnregisterFrameSinkHierarchy_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_UnregisterFrameSinkHierarchy_Params_Data) == 24, "Bad sizeof(FrameSinkManager_UnregisterFrameSinkHierarchy_Params_Data)");
class FrameSinkManager_AddVideoDetectorObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data observer;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_AddVideoDetectorObserver_Params_Data>;

    FrameSinkManager_AddVideoDetectorObserver_Params_Data();
    ~FrameSinkManager_AddVideoDetectorObserver_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_AddVideoDetectorObserver_Params_Data) == 16, "Bad sizeof(FrameSinkManager_AddVideoDetectorObserver_Params_Data)");
class FrameSinkManager_CreateVideoCapturer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_CreateVideoCapturer_Params_Data>;

    FrameSinkManager_CreateVideoCapturer_Params_Data();
    ~FrameSinkManager_CreateVideoCapturer_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_CreateVideoCapturer_Params_Data) == 16, "Bad sizeof(FrameSinkManager_CreateVideoCapturer_Params_Data)");
class FrameSinkManager_EvictSurfaces_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::viz::mojom::internal::SurfaceId_Data>>> surface_ids;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_EvictSurfaces_Params_Data>;

    FrameSinkManager_EvictSurfaces_Params_Data();
    ~FrameSinkManager_EvictSurfaces_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_EvictSurfaces_Params_Data) == 16, "Bad sizeof(FrameSinkManager_EvictSurfaces_Params_Data)");
class FrameSinkManager_Throttle_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data>>> frame_sink_ids;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> interval;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_Throttle_Params_Data>;

    FrameSinkManager_Throttle_Params_Data();
    ~FrameSinkManager_Throttle_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_Throttle_Params_Data) == 24, "Bad sizeof(FrameSinkManager_Throttle_Params_Data)");
class FrameSinkManager_StartThrottlingAllFrameSinks_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> interval;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_StartThrottlingAllFrameSinks_Params_Data>;

    FrameSinkManager_StartThrottlingAllFrameSinks_Params_Data();
    ~FrameSinkManager_StartThrottlingAllFrameSinks_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_StartThrottlingAllFrameSinks_Params_Data) == 16, "Bad sizeof(FrameSinkManager_StartThrottlingAllFrameSinks_Params_Data)");
class FrameSinkManager_StopThrottlingAllFrameSinks_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_StopThrottlingAllFrameSinks_Params_Data>;

    FrameSinkManager_StopThrottlingAllFrameSinks_Params_Data();
    ~FrameSinkManager_StopThrottlingAllFrameSinks_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_StopThrottlingAllFrameSinks_Params_Data) == 8, "Bad sizeof(FrameSinkManager_StopThrottlingAllFrameSinks_Params_Data)");
class FrameSinkManager_RequestCopyOfOutput_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::SurfaceId_Data> surface_id;
    mojo::internal::Pointer<::viz::mojom::internal::CopyOutputRequest_Data> request;
    uint8_t capture_exact_surface_id : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_RequestCopyOfOutput_Params_Data>;

    FrameSinkManager_RequestCopyOfOutput_Params_Data();
    ~FrameSinkManager_RequestCopyOfOutput_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_RequestCopyOfOutput_Params_Data) == 32, "Bad sizeof(FrameSinkManager_RequestCopyOfOutput_Params_Data)");
class FrameSinkManager_UpdateDebugRendererSettings_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::DebugRendererSettings_Data> debug_settings;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_UpdateDebugRendererSettings_Params_Data>;

    FrameSinkManager_UpdateDebugRendererSettings_Params_Data();
    ~FrameSinkManager_UpdateDebugRendererSettings_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_UpdateDebugRendererSettings_Params_Data) == 16, "Bad sizeof(FrameSinkManager_UpdateDebugRendererSettings_Params_Data)");
class FrameSinkManager_ClearUnclaimedViewTransitionResources_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::ViewTransitionToken_Data> transition_token;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_ClearUnclaimedViewTransitionResources_Params_Data>;

    FrameSinkManager_ClearUnclaimedViewTransitionResources_Params_Data();
    ~FrameSinkManager_ClearUnclaimedViewTransitionResources_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_ClearUnclaimedViewTransitionResources_Params_Data) == 16,
    "Bad sizeof(FrameSinkManager_ClearUnclaimedViewTransitionResources_Params_Data)");
class FrameSinkManager_CreateMetricsRecorderForTest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_CreateMetricsRecorderForTest_Params_Data>;

    FrameSinkManager_CreateMetricsRecorderForTest_Params_Data();
    ~FrameSinkManager_CreateMetricsRecorderForTest_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_CreateMetricsRecorderForTest_Params_Data) == 16, "Bad sizeof(FrameSinkManager_CreateMetricsRecorderForTest_Params_Data)");
class FrameSinkManager_EnableFrameSinkManagerTestApi_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_EnableFrameSinkManagerTestApi_Params_Data>;

    FrameSinkManager_EnableFrameSinkManagerTestApi_Params_Data();
    ~FrameSinkManager_EnableFrameSinkManagerTestApi_Params_Data() = delete;
};
static_assert(
    sizeof(FrameSinkManager_EnableFrameSinkManagerTestApi_Params_Data) == 16, "Bad sizeof(FrameSinkManager_EnableFrameSinkManagerTestApi_Params_Data)");
class FrameSinkManager_SetupRenderInputRouterDelegateConnection_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t grouping_id;
    mojo::internal::Interface_Data rir_delegate_client_remote;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameSinkManager_SetupRenderInputRouterDelegateConnection_Params_Data>;

    FrameSinkManager_SetupRenderInputRouterDelegateConnection_Params_Data();
    ~FrameSinkManager_SetupRenderInputRouterDelegateConnection_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_SetupRenderInputRouterDelegateConnection_Params_Data) == 24,
    "Bad sizeof(FrameSinkManager_SetupRenderInputRouterDelegateConnection_Params_Data)");
class FrameSinkManagerClient_OnFirstSurfaceActivation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::SurfaceInfo_Data> surface_info;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManagerClient_OnFirstSurfaceActivation_Params_Data>;

    FrameSinkManagerClient_OnFirstSurfaceActivation_Params_Data();
    ~FrameSinkManagerClient_OnFirstSurfaceActivation_Params_Data() = delete;
};
static_assert(
    sizeof(FrameSinkManagerClient_OnFirstSurfaceActivation_Params_Data) == 16, "Bad sizeof(FrameSinkManagerClient_OnFirstSurfaceActivation_Params_Data)");
class FrameSinkManagerClient_OnAggregatedHitTestRegionListUpdated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> frame_sink_id;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::viz::mojom::internal::AggregatedHitTestRegion_Data>>> hit_test_data;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManagerClient_OnAggregatedHitTestRegionListUpdated_Params_Data>;

    FrameSinkManagerClient_OnAggregatedHitTestRegionListUpdated_Params_Data();
    ~FrameSinkManagerClient_OnAggregatedHitTestRegionListUpdated_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManagerClient_OnAggregatedHitTestRegionListUpdated_Params_Data) == 24,
    "Bad sizeof(FrameSinkManagerClient_OnAggregatedHitTestRegionListUpdated_Params_Data)");
class FrameSinkManagerClient_OnFrameTokenChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> frame_sink_id;
    uint32_t frame_token;
    uint8_t pad1_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeTicks_Data> activation_time;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManagerClient_OnFrameTokenChanged_Params_Data>;

    FrameSinkManagerClient_OnFrameTokenChanged_Params_Data();
    ~FrameSinkManagerClient_OnFrameTokenChanged_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManagerClient_OnFrameTokenChanged_Params_Data) == 32, "Bad sizeof(FrameSinkManagerClient_OnFrameTokenChanged_Params_Data)");
class FrameSinkManagerClient_OnScreenshotCaptured_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::SameDocNavigationScreenshotDestinationToken_Data> destination_token;
    mojo::internal::Pointer<::viz::mojom::internal::CopyOutputResult_Data> copy_output_result;

private:
    friend class mojo::internal::MessageFragment<FrameSinkManagerClient_OnScreenshotCaptured_Params_Data>;

    FrameSinkManagerClient_OnScreenshotCaptured_Params_Data();
    ~FrameSinkManagerClient_OnScreenshotCaptured_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManagerClient_OnScreenshotCaptured_Params_Data) == 24, "Bad sizeof(FrameSinkManagerClient_OnScreenshotCaptured_Params_Data)");

} // namespace internal

class FrameSinkManager_RegisterFrameSinkId_ParamsDataView {
public:
    FrameSinkManager_RegisterFrameSinkId_ParamsDataView() = default;

    FrameSinkManager_RegisterFrameSinkId_ParamsDataView(internal::FrameSinkManager_RegisterFrameSinkId_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetFrameSinkIdDataView(::viz::mojom::FrameSinkIdDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadFrameSinkId(UserType* output)
    {

        auto* pointer = data_->frame_sink_id.Get();
        return mojo::internal::Deserialize<::viz::mojom::FrameSinkIdDataView>(pointer, output, message_);
    }
    bool report_activation() const
    {
