// components/services/storage/public/mojom/quota_client.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_SERVICES_STORAGE_PUBLIC_MOJOM_QUOTA_CLIENT_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_SERVICES_STORAGE_PUBLIC_MOJOM_QUOTA_CLIENT_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace storage::mojom {
namespace internal {
class QuotaClient_GetBucketUsage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::storage::mojom::internal::BucketLocator_Data> bucket;

private:
    friend class mojo::internal::MessageFragment<QuotaClient_GetBucketUsage_Params_Data>;

    QuotaClient_GetBucketUsage_Params_Data();
    ~QuotaClient_GetBucketUsage_Params_Data() = delete;
};
static_assert(sizeof(QuotaClient_GetBucketUsage_Params_Data) == 16, "Bad sizeof(QuotaClient_GetBucketUsage_Params_Data)");
class QuotaClient_GetBucketUsage_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t usage;

private:
    friend class mojo::internal::MessageFragment<QuotaClient_GetBucketUsage_ResponseParams_Data>;

    QuotaClient_GetBucketUsage_ResponseParams_Data();
    ~QuotaClient_GetBucketUsage_ResponseParams_Data() = delete;
};
static_assert(sizeof(QuotaClient_GetBucketUsage_ResponseParams_Data) == 16, "Bad sizeof(QuotaClient_GetBucketUsage_ResponseParams_Data)");
class QuotaClient_GetStorageKeysForType_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<QuotaClient_GetStorageKeysForType_Params_Data>;

    QuotaClient_GetStorageKeysForType_Params_Data();
    ~QuotaClient_GetStorageKeysForType_Params_Data() = delete;
};
static_assert(sizeof(QuotaClient_GetStorageKeysForType_Params_Data) == 16, "Bad sizeof(QuotaClient_GetStorageKeysForType_Params_Data)");
class QuotaClient_GetStorageKeysForType_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::blink::mojom::internal::StorageKey_Data>>> storage_keys;

private:
    friend class mojo::internal::MessageFragment<QuotaClient_GetStorageKeysForType_ResponseParams_Data>;

    QuotaClient_GetStorageKeysForType_ResponseParams_Data();
    ~QuotaClient_GetStorageKeysForType_ResponseParams_Data() = delete;
};
static_assert(sizeof(QuotaClient_GetStorageKeysForType_ResponseParams_Data) == 16, "Bad sizeof(QuotaClient_GetStorageKeysForType_ResponseParams_Data)");
class QuotaClient_DeleteBucketData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::storage::mojom::internal::BucketLocator_Data> bucket;

private:
    friend class mojo::internal::MessageFragment<QuotaClient_DeleteBucketData_Params_Data>;

    QuotaClient_DeleteBucketData_Params_Data();
    ~QuotaClient_DeleteBucketData_Params_Data() = delete;
};
static_assert(sizeof(QuotaClient_DeleteBucketData_Params_Data) == 16, "Bad sizeof(QuotaClient_DeleteBucketData_Params_Data)");
class QuotaClient_DeleteBucketData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<QuotaClient_DeleteBucketData_ResponseParams_Data>;

    QuotaClient_DeleteBucketData_ResponseParams_Data();
    ~QuotaClient_DeleteBucketData_ResponseParams_Data() = delete;
};
static_assert(sizeof(QuotaClient_DeleteBucketData_ResponseParams_Data) == 16, "Bad sizeof(QuotaClient_DeleteBucketData_ResponseParams_Data)");
class QuotaClient_PerformStorageCleanup_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<QuotaClient_PerformStorageCleanup_Params_Data>;

    QuotaClient_PerformStorageCleanup_Params_Data();
    ~QuotaClient_PerformStorageCleanup_Params_Data() = delete;
};
static_assert(sizeof(QuotaClient_PerformStorageCleanup_Params_Data) == 16, "Bad sizeof(QuotaClient_PerformStorageCleanup_Params_Data)");
class QuotaClient_PerformStorageCleanup_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<QuotaClient_PerformStorageCleanup_ResponseParams_Data>;

    QuotaClient_PerformStorageCleanup_ResponseParams_Data();
    ~QuotaClient_PerformStorageCleanup_ResponseParams_Data() = delete;
};
static_assert(sizeof(QuotaClient_PerformStorageCleanup_ResponseParams_Data) == 8, "Bad sizeof(QuotaClient_PerformStorageCleanup_ResponseParams_Data)");

} // namespace internal

class QuotaClient_GetBucketUsage_ParamsDataView {
public:
    QuotaClient_GetBucketUsage_ParamsDataView() = default;

    QuotaClient_GetBucketUsage_ParamsDataView(internal::QuotaClient_GetBucketUsage_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetBucketDataView(::storage::mojom::BucketLocatorDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadBucket(UserType* output)
    {

        auto* pointer = data_->bucket.Get();
        return mojo::internal::Deserialize<::storage::mojom::BucketLocatorDataView>(pointer, output, message_);
    }

private:
    internal::QuotaClient_GetBucketUsage_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class QuotaClient_GetBucketUsage_ResponseParamsDataView {
public:
    QuotaClient_GetBucketUsage_ResponseParamsDataView() = default;

    QuotaClient_GetBucketUsage_ResponseParamsDataView(internal::QuotaClient_GetBucketUsage_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    int64_t usage() const
    {
        return data_->usage;
    }

private:
    internal::QuotaClient_GetBucketUsage_ResponseParams_Data* data_ = nullptr;
};

class QuotaClient_GetStorageKeysForType_ParamsDataView {
public:
    QuotaClient_GetStorageKeysForType_ParamsDataView() = default;

    QuotaClient_GetStorageKeysForType_ParamsDataView(internal::QuotaClient_GetStorageKeysForType_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadType(UserType* output) const
    {
        auto data_value = data_->type;
        return mojo::internal::Deserialize<::blink::mojom::StorageType>(data_value, output);
    }
    ::blink::mojom::StorageType type() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::blink::mojom::StorageType>(data_->type));
    }

private:
    internal::QuotaClient_GetStorageKeysForType_Params_Data* data_ = nullptr;
};

class QuotaClient_GetStorageKeysForType_ResponseParamsDataView {
public:
    QuotaClient_GetStorageKeysForType_ResponseParamsDataView() = default;

    QuotaClient_GetStorageKeysForType_ResponseParamsDataView(internal::QuotaClient_GetStorageKeysForType_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetStorageKeysDataView(mojo::ArrayDataView<::blink::mojom::StorageKeyDataView>* output);

    template <typename UserType> [[nodiscard]] bool ReadStorageKeys(UserType* output)
    {

        auto* pointer = data_->storage_keys.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<::blink::mojom::StorageKeyDataView>>(pointer, output, message_);
    }

private:
    internal::QuotaClient_GetStorageKeysForType_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class QuotaClient_DeleteBucketData_ParamsDataView {
public:
    QuotaClient_DeleteBucketData_ParamsDataView() = default;

    QuotaClient_DeleteBucketData_ParamsDataView(internal::QuotaClient_DeleteBucketData_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetBucketDataView(::storage::mojom::BucketLocatorDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadBucket(UserType* output)
    {

        auto* pointer = data_->bucket.Get();
        return mojo::internal::Deserialize<::storage::mojom::BucketLocatorDataView>(pointer, output, message_);
    }

private:
    internal::QuotaClient_DeleteBucketData_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class QuotaClient_DeleteBucketData_ResponseParamsDataView {
public:
    QuotaClient_DeleteBucketData_ResponseParamsDataView() = default;

    QuotaClient_DeleteBucketData_ResponseParamsDataView(internal::QuotaClient_DeleteBucketData_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadStatus(UserType* output) const
    {
        auto data_value = data_->status;
        return mojo::internal::Deserialize<::blink::mojom::QuotaStatusCode>(data_value, output);
    }
    ::blink::mojom::QuotaStatusCode status() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::blink::mojom::QuotaStatusCode>(data_->status));
    }

private:
    internal::QuotaClient_DeleteBucketData_ResponseParams_Data* data_ = nullptr;
};

class QuotaClient_PerformStorageCleanup_ParamsDataView {
public:
    QuotaClient_PerformStorageCleanup_ParamsDataView() = default;

    QuotaClient_PerformStorageCleanup_ParamsDataView(internal::QuotaClient_PerformStorageCleanup_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadType(UserType* output) const
    {
        auto data_value = data_->type;
        return mojo::internal::Deserialize<::blink::mojom::StorageType>(data_value, output);
    }
    ::blink::mojom::StorageType type() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::blink::mojom::StorageType>(data_->type));
    }

private:
    internal::QuotaClient_PerformStorageCleanup_Params_Data* data_ = nullptr;
};

class QuotaClient_PerformStorageCleanup_ResponseParamsDataView {
public:
    QuotaClient_PerformStorageCleanup_ResponseParamsDataView() = default;

    QuotaClient_PerformStorageCleanup_ResponseParamsDataView(internal::QuotaClient_PerformStorageCleanup_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::QuotaClient_PerformStorageCleanup_ResponseParams_Data* data_ = nullptr;
};

inline void QuotaClient_GetBucketUsage_ParamsDataView::GetBucketDataView(::storage::mojom::BucketLocatorDataView* output)
{
    auto pointer = data_->bucket.Get();
    *output = ::storage::mojom::BucketLocatorDataView(pointer, message_);
}

inline void QuotaClient_GetStorageKeysForType_ResponseParamsDataView::GetStorageKeysDataView(mojo::ArrayDataView<::blink::mojom::StorageKeyDataView>* output)
{
    auto pointer = data_->storage_keys.Get();
    *output = mojo::ArrayDataView<::blink::mojom::StorageKeyDataView>(pointer, message_);
}

inline void QuotaClient_DeleteBucketData_ParamsDataView::GetBucketDataView(::storage::mojom::BucketLocatorDataView* output)
{
    auto pointer = data_->bucket.Get();
    *output = ::storage::mojom::BucketLocatorDataView(pointer, message_);
}

} // storage::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // COMPONENTS_SERVICES_STORAGE_PUBLIC_MOJOM_QUOTA_CLIENT_MOJOM_PARAMS_DATA_H_
