// components/services/storage/public/mojom/service_worker_storage_control.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_SERVICES_STORAGE_PUBLIC_MOJOM_SERVICE_WORKER_STORAGE_CONTROL_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_SERVICES_STORAGE_PUBLIC_MOJOM_SERVICE_WORKER_STORAGE_CONTROL_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace storage::mojom {
namespace internal {
class ServiceWorkerResourceReader_ReadResponseHead_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerResourceReader_ReadResponseHead_Params_Data>;

    ServiceWorkerResourceReader_ReadResponseHead_Params_Data();
    ~ServiceWorkerResourceReader_ReadResponseHead_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerResourceReader_ReadResponseHead_Params_Data) == 8, "Bad sizeof(ServiceWorkerResourceReader_ReadResponseHead_Params_Data)");
class ServiceWorkerResourceReader_ReadResponseHead_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::network::mojom::internal::URLResponseHead_Data> response_head;
    ::mojo_base::mojom::internal::BigBuffer_Data metadata;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerResourceReader_ReadResponseHead_ResponseParams_Data>;

    ServiceWorkerResourceReader_ReadResponseHead_ResponseParams_Data();
    ~ServiceWorkerResourceReader_ReadResponseHead_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerResourceReader_ReadResponseHead_ResponseParams_Data) == 40,
    "Bad sizeof(ServiceWorkerResourceReader_ReadResponseHead_ResponseParams_Data)");
class ServiceWorkerResourceReader_PrepareReadData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t size;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerResourceReader_PrepareReadData_Params_Data>;

    ServiceWorkerResourceReader_PrepareReadData_Params_Data();
    ~ServiceWorkerResourceReader_PrepareReadData_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerResourceReader_PrepareReadData_Params_Data) == 16, "Bad sizeof(ServiceWorkerResourceReader_PrepareReadData_Params_Data)");
class ServiceWorkerResourceReader_PrepareReadData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data pipe;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerResourceReader_PrepareReadData_ResponseParams_Data>;

    ServiceWorkerResourceReader_PrepareReadData_ResponseParams_Data();
    ~ServiceWorkerResourceReader_PrepareReadData_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerResourceReader_PrepareReadData_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorkerResourceReader_PrepareReadData_ResponseParams_Data)");
class ServiceWorkerResourceReader_ReadData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerResourceReader_ReadData_Params_Data>;

    ServiceWorkerResourceReader_ReadData_Params_Data();
    ~ServiceWorkerResourceReader_ReadData_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerResourceReader_ReadData_Params_Data) == 8, "Bad sizeof(ServiceWorkerResourceReader_ReadData_Params_Data)");
class ServiceWorkerResourceReader_ReadData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerResourceReader_ReadData_ResponseParams_Data>;

    ServiceWorkerResourceReader_ReadData_ResponseParams_Data();
    ~ServiceWorkerResourceReader_ReadData_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerResourceReader_ReadData_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorkerResourceReader_ReadData_ResponseParams_Data)");
class ServiceWorkerResourceWriter_WriteResponseHead_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::URLResponseHead_Data> response_head;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerResourceWriter_WriteResponseHead_Params_Data>;

    ServiceWorkerResourceWriter_WriteResponseHead_Params_Data();
    ~ServiceWorkerResourceWriter_WriteResponseHead_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerResourceWriter_WriteResponseHead_Params_Data) == 16, "Bad sizeof(ServiceWorkerResourceWriter_WriteResponseHead_Params_Data)");
class ServiceWorkerResourceWriter_WriteResponseHead_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerResourceWriter_WriteResponseHead_ResponseParams_Data>;

    ServiceWorkerResourceWriter_WriteResponseHead_ResponseParams_Data();
    ~ServiceWorkerResourceWriter_WriteResponseHead_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerResourceWriter_WriteResponseHead_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorkerResourceWriter_WriteResponseHead_ResponseParams_Data)");
class ServiceWorkerResourceWriter_WriteData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::mojo_base::mojom::internal::BigBuffer_Data data;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerResourceWriter_WriteData_Params_Data>;

    ServiceWorkerResourceWriter_WriteData_Params_Data();
    ~ServiceWorkerResourceWriter_WriteData_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerResourceWriter_WriteData_Params_Data) == 24, "Bad sizeof(ServiceWorkerResourceWriter_WriteData_Params_Data)");
class ServiceWorkerResourceWriter_WriteData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerResourceWriter_WriteData_ResponseParams_Data>;

    ServiceWorkerResourceWriter_WriteData_ResponseParams_Data();
    ~ServiceWorkerResourceWriter_WriteData_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerResourceWriter_WriteData_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorkerResourceWriter_WriteData_ResponseParams_Data)");
class ServiceWorkerResourceMetadataWriter_WriteMetadata_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::mojo_base::mojom::internal::BigBuffer_Data data;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerResourceMetadataWriter_WriteMetadata_Params_Data>;

    ServiceWorkerResourceMetadataWriter_WriteMetadata_Params_Data();
    ~ServiceWorkerResourceMetadataWriter_WriteMetadata_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerResourceMetadataWriter_WriteMetadata_Params_Data) == 24, "Bad sizeof(ServiceWorkerResourceMetadataWriter_WriteMetadata_Params_Data)");
class ServiceWorkerResourceMetadataWriter_WriteMetadata_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerResourceMetadataWriter_WriteMetadata_ResponseParams_Data>;

    ServiceWorkerResourceMetadataWriter_WriteMetadata_ResponseParams_Data();
    ~ServiceWorkerResourceMetadataWriter_WriteMetadata_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerResourceMetadataWriter_WriteMetadata_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorkerResourceMetadataWriter_WriteMetadata_ResponseParams_Data)");
class ServiceWorkerStorageControl_Disable_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_Disable_Params_Data>;

    ServiceWorkerStorageControl_Disable_Params_Data();
    ~ServiceWorkerStorageControl_Disable_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_Disable_Params_Data) == 8, "Bad sizeof(ServiceWorkerStorageControl_Disable_Params_Data)");
class ServiceWorkerStorageControl_Disable_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_Disable_ResponseParams_Data>;

    ServiceWorkerStorageControl_Disable_ResponseParams_Data();
    ~ServiceWorkerStorageControl_Disable_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_Disable_ResponseParams_Data) == 8, "Bad sizeof(ServiceWorkerStorageControl_Disable_ResponseParams_Data)");
class ServiceWorkerStorageControl_Delete_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_Delete_Params_Data>;

    ServiceWorkerStorageControl_Delete_Params_Data();
    ~ServiceWorkerStorageControl_Delete_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_Delete_Params_Data) == 8, "Bad sizeof(ServiceWorkerStorageControl_Delete_Params_Data)");
class ServiceWorkerStorageControl_Delete_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_Delete_ResponseParams_Data>;

    ServiceWorkerStorageControl_Delete_ResponseParams_Data();
    ~ServiceWorkerStorageControl_Delete_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_Delete_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorkerStorageControl_Delete_ResponseParams_Data)");
class ServiceWorkerStorageControl_Recover_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::ServiceWorkerLiveVersionInfo_Data>>> versions;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_Recover_Params_Data>;

    ServiceWorkerStorageControl_Recover_Params_Data();
    ~ServiceWorkerStorageControl_Recover_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_Recover_Params_Data) == 16, "Bad sizeof(ServiceWorkerStorageControl_Recover_Params_Data)");
class ServiceWorkerStorageControl_Recover_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_Recover_ResponseParams_Data>;

    ServiceWorkerStorageControl_Recover_ResponseParams_Data();
    ~ServiceWorkerStorageControl_Recover_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_Recover_ResponseParams_Data) == 8, "Bad sizeof(ServiceWorkerStorageControl_Recover_ResponseParams_Data)");
class ServiceWorkerStorageControl_GetRegisteredStorageKeys_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetRegisteredStorageKeys_Params_Data>;

    ServiceWorkerStorageControl_GetRegisteredStorageKeys_Params_Data();
    ~ServiceWorkerStorageControl_GetRegisteredStorageKeys_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetRegisteredStorageKeys_Params_Data) == 8,
    "Bad sizeof(ServiceWorkerStorageControl_GetRegisteredStorageKeys_Params_Data)");
class ServiceWorkerStorageControl_GetRegisteredStorageKeys_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::blink::mojom::internal::StorageKey_Data>>> keys;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetRegisteredStorageKeys_ResponseParams_Data>;

    ServiceWorkerStorageControl_GetRegisteredStorageKeys_ResponseParams_Data();
    ~ServiceWorkerStorageControl_GetRegisteredStorageKeys_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetRegisteredStorageKeys_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_GetRegisteredStorageKeys_ResponseParams_Data)");
class ServiceWorkerStorageControl_FindRegistrationForClientUrl_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> client_url;
    mojo::internal::Pointer<::blink::mojom::internal::StorageKey_Data> key;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_FindRegistrationForClientUrl_Params_Data>;

    ServiceWorkerStorageControl_FindRegistrationForClientUrl_Params_Data();
    ~ServiceWorkerStorageControl_FindRegistrationForClientUrl_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_FindRegistrationForClientUrl_Params_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_FindRegistrationForClientUrl_Params_Data)");
class ServiceWorkerStorageControl_FindRegistrationForClientUrl_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<internal::ServiceWorkerFindRegistrationResult_Data> result;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Url_Data>>> scopes;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_FindRegistrationForClientUrl_ResponseParams_Data>;

    ServiceWorkerStorageControl_FindRegistrationForClientUrl_ResponseParams_Data();
    ~ServiceWorkerStorageControl_FindRegistrationForClientUrl_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_FindRegistrationForClientUrl_ResponseParams_Data) == 32,
    "Bad sizeof(ServiceWorkerStorageControl_FindRegistrationForClientUrl_ResponseParams_Data)");
class ServiceWorkerStorageControl_FindRegistrationForScope_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> scope;
    mojo::internal::Pointer<::blink::mojom::internal::StorageKey_Data> key;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_FindRegistrationForScope_Params_Data>;

    ServiceWorkerStorageControl_FindRegistrationForScope_Params_Data();
    ~ServiceWorkerStorageControl_FindRegistrationForScope_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_FindRegistrationForScope_Params_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_FindRegistrationForScope_Params_Data)");
class ServiceWorkerStorageControl_FindRegistrationForScope_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<internal::ServiceWorkerFindRegistrationResult_Data> result;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_FindRegistrationForScope_ResponseParams_Data>;

    ServiceWorkerStorageControl_FindRegistrationForScope_ResponseParams_Data();
    ~ServiceWorkerStorageControl_FindRegistrationForScope_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_FindRegistrationForScope_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_FindRegistrationForScope_ResponseParams_Data)");
class ServiceWorkerStorageControl_FindRegistrationForId_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t registration_id;
    mojo::internal::Pointer<::blink::mojom::internal::StorageKey_Data> key;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_FindRegistrationForId_Params_Data>;

    ServiceWorkerStorageControl_FindRegistrationForId_Params_Data();
    ~ServiceWorkerStorageControl_FindRegistrationForId_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerStorageControl_FindRegistrationForId_Params_Data) == 24, "Bad sizeof(ServiceWorkerStorageControl_FindRegistrationForId_Params_Data)");
class ServiceWorkerStorageControl_FindRegistrationForId_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<internal::ServiceWorkerFindRegistrationResult_Data> result;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_FindRegistrationForId_ResponseParams_Data>;

    ServiceWorkerStorageControl_FindRegistrationForId_ResponseParams_Data();
    ~ServiceWorkerStorageControl_FindRegistrationForId_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_FindRegistrationForId_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_FindRegistrationForId_ResponseParams_Data)");
class ServiceWorkerStorageControl_GetRegistrationsForStorageKey_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::StorageKey_Data> key;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetRegistrationsForStorageKey_Params_Data>;

    ServiceWorkerStorageControl_GetRegistrationsForStorageKey_Params_Data();
    ~ServiceWorkerStorageControl_GetRegistrationsForStorageKey_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetRegistrationsForStorageKey_Params_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_GetRegistrationsForStorageKey_Params_Data)");
class ServiceWorkerStorageControl_GetRegistrationsForStorageKey_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::ServiceWorkerFindRegistrationResult_Data>>> registrations;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetRegistrationsForStorageKey_ResponseParams_Data>;

    ServiceWorkerStorageControl_GetRegistrationsForStorageKey_ResponseParams_Data();
    ~ServiceWorkerStorageControl_GetRegistrationsForStorageKey_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetRegistrationsForStorageKey_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_GetRegistrationsForStorageKey_ResponseParams_Data)");
class ServiceWorkerStorageControl_GetUsageForStorageKey_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::StorageKey_Data> key;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetUsageForStorageKey_Params_Data>;

    ServiceWorkerStorageControl_GetUsageForStorageKey_Params_Data();
    ~ServiceWorkerStorageControl_GetUsageForStorageKey_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerStorageControl_GetUsageForStorageKey_Params_Data) == 16, "Bad sizeof(ServiceWorkerStorageControl_GetUsageForStorageKey_Params_Data)");
class ServiceWorkerStorageControl_GetUsageForStorageKey_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    int64_t usage;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetUsageForStorageKey_ResponseParams_Data>;

    ServiceWorkerStorageControl_GetUsageForStorageKey_ResponseParams_Data();
    ~ServiceWorkerStorageControl_GetUsageForStorageKey_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetUsageForStorageKey_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_GetUsageForStorageKey_ResponseParams_Data)");
class ServiceWorkerStorageControl_GetAllRegistrationsDeprecated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetAllRegistrationsDeprecated_Params_Data>;

    ServiceWorkerStorageControl_GetAllRegistrationsDeprecated_Params_Data();
    ~ServiceWorkerStorageControl_GetAllRegistrationsDeprecated_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetAllRegistrationsDeprecated_Params_Data) == 8,
    "Bad sizeof(ServiceWorkerStorageControl_GetAllRegistrationsDeprecated_Params_Data)");
class ServiceWorkerStorageControl_GetAllRegistrationsDeprecated_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::storage::mojom::internal::ServiceWorkerRegistrationData_Data>>> registrations;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetAllRegistrationsDeprecated_ResponseParams_Data>;

    ServiceWorkerStorageControl_GetAllRegistrationsDeprecated_ResponseParams_Data();
    ~ServiceWorkerStorageControl_GetAllRegistrationsDeprecated_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetAllRegistrationsDeprecated_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_GetAllRegistrationsDeprecated_ResponseParams_Data)");
class ServiceWorkerStorageControl_StoreRegistration_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::storage::mojom::internal::ServiceWorkerRegistrationData_Data> registration;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::storage::mojom::internal::ServiceWorkerResourceRecord_Data>>> resources;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_StoreRegistration_Params_Data>;

    ServiceWorkerStorageControl_StoreRegistration_Params_Data();
    ~ServiceWorkerStorageControl_StoreRegistration_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_StoreRegistration_Params_Data) == 24, "Bad sizeof(ServiceWorkerStorageControl_StoreRegistration_Params_Data)");
class ServiceWorkerStorageControl_StoreRegistration_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    uint64_t deleted_resources_size;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_StoreRegistration_ResponseParams_Data>;

    ServiceWorkerStorageControl_StoreRegistration_ResponseParams_Data();
    ~ServiceWorkerStorageControl_StoreRegistration_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_StoreRegistration_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_StoreRegistration_ResponseParams_Data)");
class ServiceWorkerStorageControl_DeleteRegistration_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t registration_id;
    mojo::internal::Pointer<::blink::mojom::internal::StorageKey_Data> key;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_DeleteRegistration_Params_Data>;

    ServiceWorkerStorageControl_DeleteRegistration_Params_Data();
    ~ServiceWorkerStorageControl_DeleteRegistration_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerStorageControl_DeleteRegistration_Params_Data) == 24, "Bad sizeof(ServiceWorkerStorageControl_DeleteRegistration_Params_Data)");
class ServiceWorkerStorageControl_DeleteRegistration_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    int32_t storage_key_state;
    uint64_t deleted_resources_size;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_DeleteRegistration_ResponseParams_Data>;

    ServiceWorkerStorageControl_DeleteRegistration_ResponseParams_Data();
    ~ServiceWorkerStorageControl_DeleteRegistration_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_DeleteRegistration_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_DeleteRegistration_ResponseParams_Data)");
class ServiceWorkerStorageControl_UpdateToActiveState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t registration_id;
    mojo::internal::Pointer<::blink::mojom::internal::StorageKey_Data> key;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_UpdateToActiveState_Params_Data>;

    ServiceWorkerStorageControl_UpdateToActiveState_Params_Data();
    ~ServiceWorkerStorageControl_UpdateToActiveState_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerStorageControl_UpdateToActiveState_Params_Data) == 24, "Bad sizeof(ServiceWorkerStorageControl_UpdateToActiveState_Params_Data)");
class ServiceWorkerStorageControl_UpdateToActiveState_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_UpdateToActiveState_ResponseParams_Data>;

    ServiceWorkerStorageControl_UpdateToActiveState_ResponseParams_Data();
    ~ServiceWorkerStorageControl_UpdateToActiveState_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_UpdateToActiveState_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_UpdateToActiveState_ResponseParams_Data)");
class ServiceWorkerStorageControl_UpdateLastUpdateCheckTime_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t registration_id;
    mojo::internal::Pointer<::blink::mojom::internal::StorageKey_Data> key;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Time_Data> last_update_check_time;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_UpdateLastUpdateCheckTime_Params_Data>;

    ServiceWorkerStorageControl_UpdateLastUpdateCheckTime_Params_Data();
    ~ServiceWorkerStorageControl_UpdateLastUpdateCheckTime_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_UpdateLastUpdateCheckTime_Params_Data) == 32,
    "Bad sizeof(ServiceWorkerStorageControl_UpdateLastUpdateCheckTime_Params_Data)");
class ServiceWorkerStorageControl_UpdateLastUpdateCheckTime_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_UpdateLastUpdateCheckTime_ResponseParams_Data>;

    ServiceWorkerStorageControl_UpdateLastUpdateCheckTime_ResponseParams_Data();
    ~ServiceWorkerStorageControl_UpdateLastUpdateCheckTime_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_UpdateLastUpdateCheckTime_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_UpdateLastUpdateCheckTime_ResponseParams_Data)");
class ServiceWorkerStorageControl_UpdateNavigationPreloadEnabled_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t registration_id;
    mojo::internal::Pointer<::blink::mojom::internal::StorageKey_Data> key;
    uint8_t enable : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_UpdateNavigationPreloadEnabled_Params_Data>;

    ServiceWorkerStorageControl_UpdateNavigationPreloadEnabled_Params_Data();
    ~ServiceWorkerStorageControl_UpdateNavigationPreloadEnabled_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_UpdateNavigationPreloadEnabled_Params_Data) == 32,
    "Bad sizeof(ServiceWorkerStorageControl_UpdateNavigationPreloadEnabled_Params_Data)");
class ServiceWorkerStorageControl_UpdateNavigationPreloadEnabled_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_UpdateNavigationPreloadEnabled_ResponseParams_Data>;

    ServiceWorkerStorageControl_UpdateNavigationPreloadEnabled_ResponseParams_Data();
    ~ServiceWorkerStorageControl_UpdateNavigationPreloadEnabled_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_UpdateNavigationPreloadEnabled_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_UpdateNavigationPreloadEnabled_ResponseParams_Data)");
class ServiceWorkerStorageControl_UpdateNavigationPreloadHeader_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t registration_id;
    mojo::internal::Pointer<::blink::mojom::internal::StorageKey_Data> key;
    mojo::internal::Pointer<mojo::internal::String_Data> value;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_UpdateNavigationPreloadHeader_Params_Data>;

    ServiceWorkerStorageControl_UpdateNavigationPreloadHeader_Params_Data();
    ~ServiceWorkerStorageControl_UpdateNavigationPreloadHeader_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_UpdateNavigationPreloadHeader_Params_Data) == 32,
    "Bad sizeof(ServiceWorkerStorageControl_UpdateNavigationPreloadHeader_Params_Data)");
class ServiceWorkerStorageControl_UpdateNavigationPreloadHeader_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_UpdateNavigationPreloadHeader_ResponseParams_Data>;

    ServiceWorkerStorageControl_UpdateNavigationPreloadHeader_ResponseParams_Data();
    ~ServiceWorkerStorageControl_UpdateNavigationPreloadHeader_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_UpdateNavigationPreloadHeader_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_UpdateNavigationPreloadHeader_ResponseParams_Data)");
class ServiceWorkerStorageControl_UpdateFetchHandlerType_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t registration_id;
    mojo::internal::Pointer<::blink::mojom::internal::StorageKey_Data> key;
    int32_t type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_UpdateFetchHandlerType_Params_Data>;

    ServiceWorkerStorageControl_UpdateFetchHandlerType_Params_Data();
    ~ServiceWorkerStorageControl_UpdateFetchHandlerType_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerStorageControl_UpdateFetchHandlerType_Params_Data) == 32, "Bad sizeof(ServiceWorkerStorageControl_UpdateFetchHandlerType_Params_Data)");
class ServiceWorkerStorageControl_UpdateFetchHandlerType_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_UpdateFetchHandlerType_ResponseParams_Data>;

    ServiceWorkerStorageControl_UpdateFetchHandlerType_ResponseParams_Data();
    ~ServiceWorkerStorageControl_UpdateFetchHandlerType_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_UpdateFetchHandlerType_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_UpdateFetchHandlerType_ResponseParams_Data)");
class ServiceWorkerStorageControl_UpdateResourceSha256Checksums_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t registratation_id;
    mojo::internal::Pointer<::blink::mojom::internal::StorageKey_Data> key;
    mojo::internal::Pointer<mojo::internal::Map_Data<int64_t, mojo::internal::Pointer<mojo::internal::String_Data>>> updated_sha256_checksums;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_UpdateResourceSha256Checksums_Params_Data>;

    ServiceWorkerStorageControl_UpdateResourceSha256Checksums_Params_Data();
    ~ServiceWorkerStorageControl_UpdateResourceSha256Checksums_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_UpdateResourceSha256Checksums_Params_Data) == 32,
    "Bad sizeof(ServiceWorkerStorageControl_UpdateResourceSha256Checksums_Params_Data)");
class ServiceWorkerStorageControl_UpdateResourceSha256Checksums_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_UpdateResourceSha256Checksums_ResponseParams_Data>;

    ServiceWorkerStorageControl_UpdateResourceSha256Checksums_ResponseParams_Data();
    ~ServiceWorkerStorageControl_UpdateResourceSha256Checksums_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_UpdateResourceSha256Checksums_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_UpdateResourceSha256Checksums_ResponseParams_Data)");
class ServiceWorkerStorageControl_GetNewRegistrationId_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetNewRegistrationId_Params_Data>;

    ServiceWorkerStorageControl_GetNewRegistrationId_Params_Data();
    ~ServiceWorkerStorageControl_GetNewRegistrationId_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerStorageControl_GetNewRegistrationId_Params_Data) == 8, "Bad sizeof(ServiceWorkerStorageControl_GetNewRegistrationId_Params_Data)");
class ServiceWorkerStorageControl_GetNewRegistrationId_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t registration_id;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetNewRegistrationId_ResponseParams_Data>;

    ServiceWorkerStorageControl_GetNewRegistrationId_ResponseParams_Data();
    ~ServiceWorkerStorageControl_GetNewRegistrationId_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetNewRegistrationId_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_GetNewRegistrationId_ResponseParams_Data)");
class ServiceWorkerStorageControl_GetNewVersionId_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetNewVersionId_Params_Data>;

    ServiceWorkerStorageControl_GetNewVersionId_Params_Data();
    ~ServiceWorkerStorageControl_GetNewVersionId_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetNewVersionId_Params_Data) == 8, "Bad sizeof(ServiceWorkerStorageControl_GetNewVersionId_Params_Data)");
class ServiceWorkerStorageControl_GetNewVersionId_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t version_id;
    mojo::internal::Interface_Data version_reference;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetNewVersionId_ResponseParams_Data>;

    ServiceWorkerStorageControl_GetNewVersionId_ResponseParams_Data();
    ~ServiceWorkerStorageControl_GetNewVersionId_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetNewVersionId_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_GetNewVersionId_ResponseParams_Data)");
class ServiceWorkerStorageControl_GetNewResourceId_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetNewResourceId_Params_Data>;

    ServiceWorkerStorageControl_GetNewResourceId_Params_Data();
    ~ServiceWorkerStorageControl_GetNewResourceId_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetNewResourceId_Params_Data) == 8, "Bad sizeof(ServiceWorkerStorageControl_GetNewResourceId_Params_Data)");
class ServiceWorkerStorageControl_GetNewResourceId_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t resource_id;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetNewResourceId_ResponseParams_Data>;

    ServiceWorkerStorageControl_GetNewResourceId_ResponseParams_Data();
    ~ServiceWorkerStorageControl_GetNewResourceId_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetNewResourceId_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_GetNewResourceId_ResponseParams_Data)");
class ServiceWorkerStorageControl_CreateResourceReader_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t resource_id;
    mojo::internal::Handle_Data reader;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_CreateResourceReader_Params_Data>;

    ServiceWorkerStorageControl_CreateResourceReader_Params_Data();
    ~ServiceWorkerStorageControl_CreateResourceReader_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerStorageControl_CreateResourceReader_Params_Data) == 24, "Bad sizeof(ServiceWorkerStorageControl_CreateResourceReader_Params_Data)");
class ServiceWorkerStorageControl_CreateResourceWriter_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t resource_id;
    mojo::internal::Handle_Data writer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_CreateResourceWriter_Params_Data>;

    ServiceWorkerStorageControl_CreateResourceWriter_Params_Data();
    ~ServiceWorkerStorageControl_CreateResourceWriter_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerStorageControl_CreateResourceWriter_Params_Data) == 24, "Bad sizeof(ServiceWorkerStorageControl_CreateResourceWriter_Params_Data)");
class ServiceWorkerStorageControl_CreateResourceMetadataWriter_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t resource_id;
    mojo::internal::Handle_Data writer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_CreateResourceMetadataWriter_Params_Data>;

    ServiceWorkerStorageControl_CreateResourceMetadataWriter_Params_Data();
    ~ServiceWorkerStorageControl_CreateResourceMetadataWriter_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_CreateResourceMetadataWriter_Params_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_CreateResourceMetadataWriter_Params_Data)");
class ServiceWorkerStorageControl_StoreUncommittedResourceId_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t resource_id;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_StoreUncommittedResourceId_Params_Data>;

    ServiceWorkerStorageControl_StoreUncommittedResourceId_Params_Data();
    ~ServiceWorkerStorageControl_StoreUncommittedResourceId_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_StoreUncommittedResourceId_Params_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_StoreUncommittedResourceId_Params_Data)");
class ServiceWorkerStorageControl_StoreUncommittedResourceId_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_StoreUncommittedResourceId_ResponseParams_Data>;

    ServiceWorkerStorageControl_StoreUncommittedResourceId_ResponseParams_Data();
    ~ServiceWorkerStorageControl_StoreUncommittedResourceId_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_StoreUncommittedResourceId_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_StoreUncommittedResourceId_ResponseParams_Data)");
class ServiceWorkerStorageControl_DoomUncommittedResources_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<int64_t>> resource_ids;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_DoomUncommittedResources_Params_Data>;

    ServiceWorkerStorageControl_DoomUncommittedResources_Params_Data();
    ~ServiceWorkerStorageControl_DoomUncommittedResources_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_DoomUncommittedResources_Params_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_DoomUncommittedResources_Params_Data)");
class ServiceWorkerStorageControl_DoomUncommittedResources_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_DoomUncommittedResources_ResponseParams_Data>;

    ServiceWorkerStorageControl_DoomUncommittedResources_ResponseParams_Data();
    ~ServiceWorkerStorageControl_DoomUncommittedResources_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_DoomUncommittedResources_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_DoomUncommittedResources_ResponseParams_Data)");
class ServiceWorkerStorageControl_GetUserData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t registration_id;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> keys;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetUserData_Params_Data>;

    ServiceWorkerStorageControl_GetUserData_Params_Data();
    ~ServiceWorkerStorageControl_GetUserData_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetUserData_Params_Data) == 24, "Bad sizeof(ServiceWorkerStorageControl_GetUserData_Params_Data)");
class ServiceWorkerStorageControl_GetUserData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::ByteString_Data>>> values;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetUserData_ResponseParams_Data>;

    ServiceWorkerStorageControl_GetUserData_ResponseParams_Data();
    ~ServiceWorkerStorageControl_GetUserData_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerStorageControl_GetUserData_ResponseParams_Data) == 24, "Bad sizeof(ServiceWorkerStorageControl_GetUserData_ResponseParams_Data)");
class ServiceWorkerStorageControl_StoreUserData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t registration_id;
    mojo::internal::Pointer<::blink::mojom::internal::StorageKey_Data> key;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::ServiceWorkerUserData_Data>>> user_data;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_StoreUserData_Params_Data>;

    ServiceWorkerStorageControl_StoreUserData_Params_Data();
    ~ServiceWorkerStorageControl_StoreUserData_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_StoreUserData_Params_Data) == 32, "Bad sizeof(ServiceWorkerStorageControl_StoreUserData_Params_Data)");
class ServiceWorkerStorageControl_StoreUserData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_StoreUserData_ResponseParams_Data>;

    ServiceWorkerStorageControl_StoreUserData_ResponseParams_Data();
    ~ServiceWorkerStorageControl_StoreUserData_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerStorageControl_StoreUserData_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorkerStorageControl_StoreUserData_ResponseParams_Data)");
class ServiceWorkerStorageControl_ClearUserData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t registration_id;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> keys;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_ClearUserData_Params_Data>;

    ServiceWorkerStorageControl_ClearUserData_Params_Data();
    ~ServiceWorkerStorageControl_ClearUserData_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_ClearUserData_Params_Data) == 24, "Bad sizeof(ServiceWorkerStorageControl_ClearUserData_Params_Data)");
class ServiceWorkerStorageControl_ClearUserData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_ClearUserData_ResponseParams_Data>;

    ServiceWorkerStorageControl_ClearUserData_ResponseParams_Data();
    ~ServiceWorkerStorageControl_ClearUserData_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerStorageControl_ClearUserData_ResponseParams_Data) == 16, "Bad sizeof(ServiceWorkerStorageControl_ClearUserData_ResponseParams_Data)");
class ServiceWorkerStorageControl_GetUserDataByKeyPrefix_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t registration_id;
    mojo::internal::Pointer<mojo::internal::String_Data> key_prefix;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetUserDataByKeyPrefix_Params_Data>;

    ServiceWorkerStorageControl_GetUserDataByKeyPrefix_Params_Data();
    ~ServiceWorkerStorageControl_GetUserDataByKeyPrefix_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerStorageControl_GetUserDataByKeyPrefix_Params_Data) == 24, "Bad sizeof(ServiceWorkerStorageControl_GetUserDataByKeyPrefix_Params_Data)");
class ServiceWorkerStorageControl_GetUserDataByKeyPrefix_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::ByteString_Data>>> values;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetUserDataByKeyPrefix_ResponseParams_Data>;

    ServiceWorkerStorageControl_GetUserDataByKeyPrefix_ResponseParams_Data();
    ~ServiceWorkerStorageControl_GetUserDataByKeyPrefix_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetUserDataByKeyPrefix_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_GetUserDataByKeyPrefix_ResponseParams_Data)");
class ServiceWorkerStorageControl_GetUserKeysAndDataByKeyPrefix_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t registration_id;
    mojo::internal::Pointer<mojo::internal::String_Data> key_prefix;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetUserKeysAndDataByKeyPrefix_Params_Data>;

    ServiceWorkerStorageControl_GetUserKeysAndDataByKeyPrefix_Params_Data();
    ~ServiceWorkerStorageControl_GetUserKeysAndDataByKeyPrefix_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetUserKeysAndDataByKeyPrefix_Params_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_GetUserKeysAndDataByKeyPrefix_Params_Data)");
class ServiceWorkerStorageControl_GetUserKeysAndDataByKeyPrefix_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<
        mojo::internal::Map_Data<mojo::internal::Pointer<mojo::internal::String_Data>, mojo::internal::Pointer<::mojo_base::mojom::internal::ByteString_Data>>>
        user_data;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetUserKeysAndDataByKeyPrefix_ResponseParams_Data>;

    ServiceWorkerStorageControl_GetUserKeysAndDataByKeyPrefix_ResponseParams_Data();
    ~ServiceWorkerStorageControl_GetUserKeysAndDataByKeyPrefix_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetUserKeysAndDataByKeyPrefix_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_GetUserKeysAndDataByKeyPrefix_ResponseParams_Data)");
class ServiceWorkerStorageControl_ClearUserDataByKeyPrefixes_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t registratation_id;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> key_prefixes;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_ClearUserDataByKeyPrefixes_Params_Data>;

    ServiceWorkerStorageControl_ClearUserDataByKeyPrefixes_Params_Data();
    ~ServiceWorkerStorageControl_ClearUserDataByKeyPrefixes_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_ClearUserDataByKeyPrefixes_Params_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_ClearUserDataByKeyPrefixes_Params_Data)");
class ServiceWorkerStorageControl_ClearUserDataByKeyPrefixes_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_ClearUserDataByKeyPrefixes_ResponseParams_Data>;

    ServiceWorkerStorageControl_ClearUserDataByKeyPrefixes_ResponseParams_Data();
    ~ServiceWorkerStorageControl_ClearUserDataByKeyPrefixes_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_ClearUserDataByKeyPrefixes_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_ClearUserDataByKeyPrefixes_ResponseParams_Data)");
class ServiceWorkerStorageControl_GetUserDataForAllRegistrations_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> key;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetUserDataForAllRegistrations_Params_Data>;

    ServiceWorkerStorageControl_GetUserDataForAllRegistrations_Params_Data();
    ~ServiceWorkerStorageControl_GetUserDataForAllRegistrations_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetUserDataForAllRegistrations_Params_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_GetUserDataForAllRegistrations_Params_Data)");
class ServiceWorkerStorageControl_GetUserDataForAllRegistrations_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::ServiceWorkerUserData_Data>>> values;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetUserDataForAllRegistrations_ResponseParams_Data>;

    ServiceWorkerStorageControl_GetUserDataForAllRegistrations_ResponseParams_Data();
    ~ServiceWorkerStorageControl_GetUserDataForAllRegistrations_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetUserDataForAllRegistrations_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_GetUserDataForAllRegistrations_ResponseParams_Data)");
class ServiceWorkerStorageControl_GetUserDataForAllRegistrationsByKeyPrefix_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> key_prefix;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetUserDataForAllRegistrationsByKeyPrefix_Params_Data>;

    ServiceWorkerStorageControl_GetUserDataForAllRegistrationsByKeyPrefix_Params_Data();
    ~ServiceWorkerStorageControl_GetUserDataForAllRegistrationsByKeyPrefix_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetUserDataForAllRegistrationsByKeyPrefix_Params_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_GetUserDataForAllRegistrationsByKeyPrefix_Params_Data)");
class ServiceWorkerStorageControl_GetUserDataForAllRegistrationsByKeyPrefix_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::ServiceWorkerUserData_Data>>> values;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetUserDataForAllRegistrationsByKeyPrefix_ResponseParams_Data>;

    ServiceWorkerStorageControl_GetUserDataForAllRegistrationsByKeyPrefix_ResponseParams_Data();
    ~ServiceWorkerStorageControl_GetUserDataForAllRegistrationsByKeyPrefix_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetUserDataForAllRegistrationsByKeyPrefix_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_GetUserDataForAllRegistrationsByKeyPrefix_ResponseParams_Data)");
class ServiceWorkerStorageControl_ClearUserDataForAllRegistrationsByKeyPrefix_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> key_prefix;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_ClearUserDataForAllRegistrationsByKeyPrefix_Params_Data>;

    ServiceWorkerStorageControl_ClearUserDataForAllRegistrationsByKeyPrefix_Params_Data();
    ~ServiceWorkerStorageControl_ClearUserDataForAllRegistrationsByKeyPrefix_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_ClearUserDataForAllRegistrationsByKeyPrefix_Params_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_ClearUserDataForAllRegistrationsByKeyPrefix_Params_Data)");
class ServiceWorkerStorageControl_ClearUserDataForAllRegistrationsByKeyPrefix_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_ClearUserDataForAllRegistrationsByKeyPrefix_ResponseParams_Data>;

    ServiceWorkerStorageControl_ClearUserDataForAllRegistrationsByKeyPrefix_ResponseParams_Data();
    ~ServiceWorkerStorageControl_ClearUserDataForAllRegistrationsByKeyPrefix_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_ClearUserDataForAllRegistrationsByKeyPrefix_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_ClearUserDataForAllRegistrationsByKeyPrefix_ResponseParams_Data)");
class ServiceWorkerStorageControl_PerformStorageCleanup_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_PerformStorageCleanup_Params_Data>;

    ServiceWorkerStorageControl_PerformStorageCleanup_Params_Data();
    ~ServiceWorkerStorageControl_PerformStorageCleanup_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerStorageControl_PerformStorageCleanup_Params_Data) == 8, "Bad sizeof(ServiceWorkerStorageControl_PerformStorageCleanup_Params_Data)");
class ServiceWorkerStorageControl_PerformStorageCleanup_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_PerformStorageCleanup_ResponseParams_Data>;

    ServiceWorkerStorageControl_PerformStorageCleanup_ResponseParams_Data();
    ~ServiceWorkerStorageControl_PerformStorageCleanup_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_PerformStorageCleanup_ResponseParams_Data) == 8,
    "Bad sizeof(ServiceWorkerStorageControl_PerformStorageCleanup_ResponseParams_Data)");
class ServiceWorkerStorageControl_ApplyPolicyUpdates_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::storage::mojom::internal::StoragePolicyUpdate_Data>>> policy_updates;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_ApplyPolicyUpdates_Params_Data>;

    ServiceWorkerStorageControl_ApplyPolicyUpdates_Params_Data();
    ~ServiceWorkerStorageControl_ApplyPolicyUpdates_Params_Data() = delete;
};
static_assert(
    sizeof(ServiceWorkerStorageControl_ApplyPolicyUpdates_Params_Data) == 16, "Bad sizeof(ServiceWorkerStorageControl_ApplyPolicyUpdates_Params_Data)");
class ServiceWorkerStorageControl_ApplyPolicyUpdates_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_ApplyPolicyUpdates_ResponseParams_Data>;

    ServiceWorkerStorageControl_ApplyPolicyUpdates_ResponseParams_Data();
    ~ServiceWorkerStorageControl_ApplyPolicyUpdates_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_ApplyPolicyUpdates_ResponseParams_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_ApplyPolicyUpdates_ResponseParams_Data)");
class ServiceWorkerStorageControl_GetPurgingResourceIdsForTest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetPurgingResourceIdsForTest_Params_Data>;

    ServiceWorkerStorageControl_GetPurgingResourceIdsForTest_Params_Data();
    ~ServiceWorkerStorageControl_GetPurgingResourceIdsForTest_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetPurgingResourceIdsForTest_Params_Data) == 8,
    "Bad sizeof(ServiceWorkerStorageControl_GetPurgingResourceIdsForTest_Params_Data)");
class ServiceWorkerStorageControl_GetPurgingResourceIdsForTest_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<int64_t>> resource_ids;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetPurgingResourceIdsForTest_ResponseParams_Data>;

    ServiceWorkerStorageControl_GetPurgingResourceIdsForTest_ResponseParams_Data();
    ~ServiceWorkerStorageControl_GetPurgingResourceIdsForTest_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetPurgingResourceIdsForTest_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_GetPurgingResourceIdsForTest_ResponseParams_Data)");
class ServiceWorkerStorageControl_GetPurgingResourceIdsForLiveVersionForTest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t version_id;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetPurgingResourceIdsForLiveVersionForTest_Params_Data>;

    ServiceWorkerStorageControl_GetPurgingResourceIdsForLiveVersionForTest_Params_Data();
    ~ServiceWorkerStorageControl_GetPurgingResourceIdsForLiveVersionForTest_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetPurgingResourceIdsForLiveVersionForTest_Params_Data) == 16,
    "Bad sizeof(ServiceWorkerStorageControl_GetPurgingResourceIdsForLiveVersionForTest_Params_Data)");
class ServiceWorkerStorageControl_GetPurgingResourceIdsForLiveVersionForTest_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<int64_t>> resource_ids;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetPurgingResourceIdsForLiveVersionForTest_ResponseParams_Data>;

    ServiceWorkerStorageControl_GetPurgingResourceIdsForLiveVersionForTest_ResponseParams_Data();
    ~ServiceWorkerStorageControl_GetPurgingResourceIdsForLiveVersionForTest_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetPurgingResourceIdsForLiveVersionForTest_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_GetPurgingResourceIdsForLiveVersionForTest_ResponseParams_Data)");
class ServiceWorkerStorageControl_GetPurgeableResourceIdsForTest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetPurgeableResourceIdsForTest_Params_Data>;

    ServiceWorkerStorageControl_GetPurgeableResourceIdsForTest_Params_Data();
    ~ServiceWorkerStorageControl_GetPurgeableResourceIdsForTest_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetPurgeableResourceIdsForTest_Params_Data) == 8,
    "Bad sizeof(ServiceWorkerStorageControl_GetPurgeableResourceIdsForTest_Params_Data)");
class ServiceWorkerStorageControl_GetPurgeableResourceIdsForTest_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<int64_t>> resource_ids;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetPurgeableResourceIdsForTest_ResponseParams_Data>;

    ServiceWorkerStorageControl_GetPurgeableResourceIdsForTest_ResponseParams_Data();
    ~ServiceWorkerStorageControl_GetPurgeableResourceIdsForTest_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetPurgeableResourceIdsForTest_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_GetPurgeableResourceIdsForTest_ResponseParams_Data)");
class ServiceWorkerStorageControl_GetUncommittedResourceIdsForTest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetUncommittedResourceIdsForTest_Params_Data>;

    ServiceWorkerStorageControl_GetUncommittedResourceIdsForTest_Params_Data();
    ~ServiceWorkerStorageControl_GetUncommittedResourceIdsForTest_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetUncommittedResourceIdsForTest_Params_Data) == 8,
    "Bad sizeof(ServiceWorkerStorageControl_GetUncommittedResourceIdsForTest_Params_Data)");
class ServiceWorkerStorageControl_GetUncommittedResourceIdsForTest_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<int64_t>> resource_ids;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_GetUncommittedResourceIdsForTest_ResponseParams_Data>;

    ServiceWorkerStorageControl_GetUncommittedResourceIdsForTest_ResponseParams_Data();
    ~ServiceWorkerStorageControl_GetUncommittedResourceIdsForTest_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_GetUncommittedResourceIdsForTest_ResponseParams_Data) == 24,
    "Bad sizeof(ServiceWorkerStorageControl_GetUncommittedResourceIdsForTest_ResponseParams_Data)");
class ServiceWorkerStorageControl_SetPurgingCompleteCallbackForTest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_SetPurgingCompleteCallbackForTest_Params_Data>;

    ServiceWorkerStorageControl_SetPurgingCompleteCallbackForTest_Params_Data();
    ~ServiceWorkerStorageControl_SetPurgingCompleteCallbackForTest_Params_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_SetPurgingCompleteCallbackForTest_Params_Data) == 8,
    "Bad sizeof(ServiceWorkerStorageControl_SetPurgingCompleteCallbackForTest_Params_Data)");
class ServiceWorkerStorageControl_SetPurgingCompleteCallbackForTest_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ServiceWorkerStorageControl_SetPurgingCompleteCallbackForTest_ResponseParams_Data>;

    ServiceWorkerStorageControl_SetPurgingCompleteCallbackForTest_ResponseParams_Data();
    ~ServiceWorkerStorageControl_SetPurgingCompleteCallbackForTest_ResponseParams_Data() = delete;
};
static_assert(sizeof(ServiceWorkerStorageControl_SetPurgingCompleteCallbackForTest_ResponseParams_Data) == 8,
    "Bad sizeof(ServiceWorkerStorageControl_SetPurgingCompleteCallbackForTest_ResponseParams_Data)");

} // namespace internal

class ServiceWorkerResourceReader_ReadResponseHead_ParamsDataView {
public:
    ServiceWorkerResourceReader_ReadResponseHead_ParamsDataView() = default;

    ServiceWorkerResourceReader_ReadResponseHead_ParamsDataView(
        internal::ServiceWorkerResourceReader_ReadResponseHead_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::ServiceWorkerResourceReader_ReadResponseHead_Params_Data* data_ = nullptr;
};

class ServiceWorkerResourceReader_ReadResponseHead_ResponseParamsDataView {
public:
    ServiceWorkerResourceReader_ReadResponseHead_ResponseParamsDataView() = default;

    ServiceWorkerResourceReader_ReadResponseHead_ResponseParamsDataView(
