// components/services/storage/privileged/mojom/indexed_db_control_test.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_SERVICES_STORAGE_PRIVILEGED_MOJOM_INDEXED_DB_CONTROL_TEST_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_SERVICES_STORAGE_PRIVILEGED_MOJOM_INDEXED_DB_CONTROL_TEST_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace storage::mojom {
namespace internal {
class MockFailureInjector_FailOperation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t failure_class;
    int32_t failure_method;
    int32_t instance_num;
    int32_t call_num;

private:
    friend class mojo::internal::MessageFragment<MockFailureInjector_FailOperation_Params_Data>;

    MockFailureInjector_FailOperation_Params_Data();
    ~MockFailureInjector_FailOperation_Params_Data() = delete;
};
static_assert(sizeof(MockFailureInjector_FailOperation_Params_Data) == 24, "Bad sizeof(MockFailureInjector_FailOperation_Params_Data)");
class IndexedDBControlTest_GetBaseDataPathForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_GetBaseDataPathForTesting_Params_Data>;

    IndexedDBControlTest_GetBaseDataPathForTesting_Params_Data();
    ~IndexedDBControlTest_GetBaseDataPathForTesting_Params_Data() = delete;
};
static_assert(
    sizeof(IndexedDBControlTest_GetBaseDataPathForTesting_Params_Data) == 8, "Bad sizeof(IndexedDBControlTest_GetBaseDataPathForTesting_Params_Data)");
class IndexedDBControlTest_GetBaseDataPathForTesting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> path;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_GetBaseDataPathForTesting_ResponseParams_Data>;

    IndexedDBControlTest_GetBaseDataPathForTesting_ResponseParams_Data();
    ~IndexedDBControlTest_GetBaseDataPathForTesting_ResponseParams_Data() = delete;
};
static_assert(sizeof(IndexedDBControlTest_GetBaseDataPathForTesting_ResponseParams_Data) == 16,
    "Bad sizeof(IndexedDBControlTest_GetBaseDataPathForTesting_ResponseParams_Data)");
class IndexedDBControlTest_GetFilePathForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::storage::mojom::internal::BucketLocator_Data> bucket_locator;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_GetFilePathForTesting_Params_Data>;

    IndexedDBControlTest_GetFilePathForTesting_Params_Data();
    ~IndexedDBControlTest_GetFilePathForTesting_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControlTest_GetFilePathForTesting_Params_Data) == 16, "Bad sizeof(IndexedDBControlTest_GetFilePathForTesting_Params_Data)");
class IndexedDBControlTest_GetFilePathForTesting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> path;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_GetFilePathForTesting_ResponseParams_Data>;

    IndexedDBControlTest_GetFilePathForTesting_ResponseParams_Data();
    ~IndexedDBControlTest_GetFilePathForTesting_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(IndexedDBControlTest_GetFilePathForTesting_ResponseParams_Data) == 16, "Bad sizeof(IndexedDBControlTest_GetFilePathForTesting_ResponseParams_Data)");
class IndexedDBControlTest_ResetCachesForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_ResetCachesForTesting_Params_Data>;

    IndexedDBControlTest_ResetCachesForTesting_Params_Data();
    ~IndexedDBControlTest_ResetCachesForTesting_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControlTest_ResetCachesForTesting_Params_Data) == 8, "Bad sizeof(IndexedDBControlTest_ResetCachesForTesting_Params_Data)");
class IndexedDBControlTest_ResetCachesForTesting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_ResetCachesForTesting_ResponseParams_Data>;

    IndexedDBControlTest_ResetCachesForTesting_ResponseParams_Data();
    ~IndexedDBControlTest_ResetCachesForTesting_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(IndexedDBControlTest_ResetCachesForTesting_ResponseParams_Data) == 8, "Bad sizeof(IndexedDBControlTest_ResetCachesForTesting_ResponseParams_Data)");
class IndexedDBControlTest_WriteToIndexedDBForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::storage::mojom::internal::BucketLocator_Data> bucket_locator;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ByteString_Data> key;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ByteString_Data> value;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_WriteToIndexedDBForTesting_Params_Data>;

    IndexedDBControlTest_WriteToIndexedDBForTesting_Params_Data();
    ~IndexedDBControlTest_WriteToIndexedDBForTesting_Params_Data() = delete;
};
static_assert(
    sizeof(IndexedDBControlTest_WriteToIndexedDBForTesting_Params_Data) == 32, "Bad sizeof(IndexedDBControlTest_WriteToIndexedDBForTesting_Params_Data)");
class IndexedDBControlTest_WriteToIndexedDBForTesting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_WriteToIndexedDBForTesting_ResponseParams_Data>;

    IndexedDBControlTest_WriteToIndexedDBForTesting_ResponseParams_Data();
    ~IndexedDBControlTest_WriteToIndexedDBForTesting_ResponseParams_Data() = delete;
};
static_assert(sizeof(IndexedDBControlTest_WriteToIndexedDBForTesting_ResponseParams_Data) == 8,
    "Bad sizeof(IndexedDBControlTest_WriteToIndexedDBForTesting_ResponseParams_Data)");
class IndexedDBControlTest_GetPathForBlobForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::storage::mojom::internal::BucketLocator_Data> bucket_locator;
    int64_t database_id;
    int64_t blob_number;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_GetPathForBlobForTesting_Params_Data>;

    IndexedDBControlTest_GetPathForBlobForTesting_Params_Data();
    ~IndexedDBControlTest_GetPathForBlobForTesting_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControlTest_GetPathForBlobForTesting_Params_Data) == 32, "Bad sizeof(IndexedDBControlTest_GetPathForBlobForTesting_Params_Data)");
class IndexedDBControlTest_GetPathForBlobForTesting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> path;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_GetPathForBlobForTesting_ResponseParams_Data>;

    IndexedDBControlTest_GetPathForBlobForTesting_ResponseParams_Data();
    ~IndexedDBControlTest_GetPathForBlobForTesting_ResponseParams_Data() = delete;
};
static_assert(sizeof(IndexedDBControlTest_GetPathForBlobForTesting_ResponseParams_Data) == 16,
    "Bad sizeof(IndexedDBControlTest_GetPathForBlobForTesting_ResponseParams_Data)");
class IndexedDBControlTest_CompactBackingStoreForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::storage::mojom::internal::BucketLocator_Data> bucket_locator;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_CompactBackingStoreForTesting_Params_Data>;

    IndexedDBControlTest_CompactBackingStoreForTesting_Params_Data();
    ~IndexedDBControlTest_CompactBackingStoreForTesting_Params_Data() = delete;
};
static_assert(
    sizeof(IndexedDBControlTest_CompactBackingStoreForTesting_Params_Data) == 16, "Bad sizeof(IndexedDBControlTest_CompactBackingStoreForTesting_Params_Data)");
class IndexedDBControlTest_CompactBackingStoreForTesting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_CompactBackingStoreForTesting_ResponseParams_Data>;

    IndexedDBControlTest_CompactBackingStoreForTesting_ResponseParams_Data();
    ~IndexedDBControlTest_CompactBackingStoreForTesting_ResponseParams_Data() = delete;
};
static_assert(sizeof(IndexedDBControlTest_CompactBackingStoreForTesting_ResponseParams_Data) == 8,
    "Bad sizeof(IndexedDBControlTest_CompactBackingStoreForTesting_ResponseParams_Data)");
class IndexedDBControlTest_GetSchedulingPriorityForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_GetSchedulingPriorityForTesting_Params_Data>;

    IndexedDBControlTest_GetSchedulingPriorityForTesting_Params_Data();
    ~IndexedDBControlTest_GetSchedulingPriorityForTesting_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControlTest_GetSchedulingPriorityForTesting_Params_Data) == 8,
    "Bad sizeof(IndexedDBControlTest_GetSchedulingPriorityForTesting_Params_Data)");
class IndexedDBControlTest_GetSchedulingPriorityForTesting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t priority_$flag : 1;
    uint8_t pad0_[3];
    int32_t priority_$value;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_GetSchedulingPriorityForTesting_ResponseParams_Data>;

    IndexedDBControlTest_GetSchedulingPriorityForTesting_ResponseParams_Data();
    ~IndexedDBControlTest_GetSchedulingPriorityForTesting_ResponseParams_Data() = delete;
};
static_assert(sizeof(IndexedDBControlTest_GetSchedulingPriorityForTesting_ResponseParams_Data) == 16,
    "Bad sizeof(IndexedDBControlTest_GetSchedulingPriorityForTesting_ResponseParams_Data)");
class IndexedDBControlTest_GetUsageForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_GetUsageForTesting_Params_Data>;

    IndexedDBControlTest_GetUsageForTesting_Params_Data();
    ~IndexedDBControlTest_GetUsageForTesting_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControlTest_GetUsageForTesting_Params_Data) == 8, "Bad sizeof(IndexedDBControlTest_GetUsageForTesting_Params_Data)");
class IndexedDBControlTest_GetUsageForTesting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t total_usage;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_GetUsageForTesting_ResponseParams_Data>;

    IndexedDBControlTest_GetUsageForTesting_ResponseParams_Data();
    ~IndexedDBControlTest_GetUsageForTesting_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(IndexedDBControlTest_GetUsageForTesting_ResponseParams_Data) == 16, "Bad sizeof(IndexedDBControlTest_GetUsageForTesting_ResponseParams_Data)");
class IndexedDBControlTest_BindMockFailureSingletonForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_BindMockFailureSingletonForTesting_Params_Data>;

    IndexedDBControlTest_BindMockFailureSingletonForTesting_Params_Data();
    ~IndexedDBControlTest_BindMockFailureSingletonForTesting_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControlTest_BindMockFailureSingletonForTesting_Params_Data) == 16,
    "Bad sizeof(IndexedDBControlTest_BindMockFailureSingletonForTesting_Params_Data)");
class IndexedDBControlTest_GetDatabaseKeysForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_GetDatabaseKeysForTesting_Params_Data>;

    IndexedDBControlTest_GetDatabaseKeysForTesting_Params_Data();
    ~IndexedDBControlTest_GetDatabaseKeysForTesting_Params_Data() = delete;
};
static_assert(
    sizeof(IndexedDBControlTest_GetDatabaseKeysForTesting_Params_Data) == 8, "Bad sizeof(IndexedDBControlTest_GetDatabaseKeysForTesting_Params_Data)");
class IndexedDBControlTest_GetDatabaseKeysForTesting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> schema_version_key;
    mojo::internal::Pointer<mojo::internal::String_Data> data_version_key;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_GetDatabaseKeysForTesting_ResponseParams_Data>;

    IndexedDBControlTest_GetDatabaseKeysForTesting_ResponseParams_Data();
    ~IndexedDBControlTest_GetDatabaseKeysForTesting_ResponseParams_Data() = delete;
};
static_assert(sizeof(IndexedDBControlTest_GetDatabaseKeysForTesting_ResponseParams_Data) == 24,
    "Bad sizeof(IndexedDBControlTest_GetDatabaseKeysForTesting_ResponseParams_Data)");
class IndexedDBControlTest_ForceInitializeFromFilesForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_ForceInitializeFromFilesForTesting_Params_Data>;

    IndexedDBControlTest_ForceInitializeFromFilesForTesting_Params_Data();
    ~IndexedDBControlTest_ForceInitializeFromFilesForTesting_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControlTest_ForceInitializeFromFilesForTesting_Params_Data) == 8,
    "Bad sizeof(IndexedDBControlTest_ForceInitializeFromFilesForTesting_Params_Data)");
class IndexedDBControlTest_ForceInitializeFromFilesForTesting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControlTest_ForceInitializeFromFilesForTesting_ResponseParams_Data>;

    IndexedDBControlTest_ForceInitializeFromFilesForTesting_ResponseParams_Data();
    ~IndexedDBControlTest_ForceInitializeFromFilesForTesting_ResponseParams_Data() = delete;
};
static_assert(sizeof(IndexedDBControlTest_ForceInitializeFromFilesForTesting_ResponseParams_Data) == 8,
    "Bad sizeof(IndexedDBControlTest_ForceInitializeFromFilesForTesting_ResponseParams_Data)");

} // namespace internal

class MockFailureInjector_FailOperation_ParamsDataView {
public:
    MockFailureInjector_FailOperation_ParamsDataView() = default;

    MockFailureInjector_FailOperation_ParamsDataView(internal::MockFailureInjector_FailOperation_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadFailureClass(UserType* output) const
    {
        auto data_value = data_->failure_class;
        return mojo::internal::Deserialize<::storage::mojom::FailClass>(data_value, output);
    }
    FailClass failure_class() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::storage::mojom::FailClass>(data_->failure_class));
