// components/global_media_controls/public/mojom/device_service.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_GLOBAL_MEDIA_CONTROLS_PUBLIC_MOJOM_DEVICE_SERVICE_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_GLOBAL_MEDIA_CONTROLS_PUBLIC_MOJOM_DEVICE_SERVICE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace global_media_controls::mojom {
namespace internal {
class DeviceListHost_SelectDevice_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> device_id;

private:
    friend class mojo::internal::MessageFragment<DeviceListHost_SelectDevice_Params_Data>;

    DeviceListHost_SelectDevice_Params_Data();
    ~DeviceListHost_SelectDevice_Params_Data() = delete;
};
static_assert(sizeof(DeviceListHost_SelectDevice_Params_Data) == 16, "Bad sizeof(DeviceListHost_SelectDevice_Params_Data)");
class DeviceListClient_OnDevicesUpdated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::Device_Data>>> devices;

private:
    friend class mojo::internal::MessageFragment<DeviceListClient_OnDevicesUpdated_Params_Data>;

    DeviceListClient_OnDevicesUpdated_Params_Data();
    ~DeviceListClient_OnDevicesUpdated_Params_Data() = delete;
};
static_assert(sizeof(DeviceListClient_OnDevicesUpdated_Params_Data) == 16, "Bad sizeof(DeviceListClient_OnDevicesUpdated_Params_Data)");
class DeviceListClient_OnPermissionRejected_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DeviceListClient_OnPermissionRejected_Params_Data>;

    DeviceListClient_OnPermissionRejected_Params_Data();
    ~DeviceListClient_OnPermissionRejected_Params_Data() = delete;
};
static_assert(sizeof(DeviceListClient_OnPermissionRejected_Params_Data) == 8, "Bad sizeof(DeviceListClient_OnPermissionRejected_Params_Data)");
class DeviceService_GetDeviceListHostForSession_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> session_id;
    mojo::internal::Handle_Data host_receiver;
    mojo::internal::Interface_Data client_remote;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<DeviceService_GetDeviceListHostForSession_Params_Data>;

    DeviceService_GetDeviceListHostForSession_Params_Data();
    ~DeviceService_GetDeviceListHostForSession_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_GetDeviceListHostForSession_Params_Data) == 32, "Bad sizeof(DeviceService_GetDeviceListHostForSession_Params_Data)");
class DeviceService_GetDeviceListHostForPresentation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data host_receiver;
    mojo::internal::Interface_Data client_remote;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<DeviceService_GetDeviceListHostForPresentation_Params_Data>;

    DeviceService_GetDeviceListHostForPresentation_Params_Data();
    ~DeviceService_GetDeviceListHostForPresentation_Params_Data() = delete;
};
static_assert(
    sizeof(DeviceService_GetDeviceListHostForPresentation_Params_Data) == 24, "Bad sizeof(DeviceService_GetDeviceListHostForPresentation_Params_Data)");
class DeviceService_SetDevicePickerProvider_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data provider_remote;

private:
    friend class mojo::internal::MessageFragment<DeviceService_SetDevicePickerProvider_Params_Data>;

    DeviceService_SetDevicePickerProvider_Params_Data();
    ~DeviceService_SetDevicePickerProvider_Params_Data() = delete;
};
static_assert(sizeof(DeviceService_SetDevicePickerProvider_Params_Data) == 16, "Bad sizeof(DeviceService_SetDevicePickerProvider_Params_Data)");
class DevicePickerProvider_CreateItem_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> source_id;

private:
    friend class mojo::internal::MessageFragment<DevicePickerProvider_CreateItem_Params_Data>;

    DevicePickerProvider_CreateItem_Params_Data();
    ~DevicePickerProvider_CreateItem_Params_Data() = delete;
};
static_assert(sizeof(DevicePickerProvider_CreateItem_Params_Data) == 16, "Bad sizeof(DevicePickerProvider_CreateItem_Params_Data)");
class DevicePickerProvider_DeleteItem_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DevicePickerProvider_DeleteItem_Params_Data>;

    DevicePickerProvider_DeleteItem_Params_Data();
    ~DevicePickerProvider_DeleteItem_Params_Data() = delete;
};
static_assert(sizeof(DevicePickerProvider_DeleteItem_Params_Data) == 8, "Bad sizeof(DevicePickerProvider_DeleteItem_Params_Data)");
class DevicePickerProvider_ShowItem_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DevicePickerProvider_ShowItem_Params_Data>;

    DevicePickerProvider_ShowItem_Params_Data();
    ~DevicePickerProvider_ShowItem_Params_Data() = delete;
};
static_assert(sizeof(DevicePickerProvider_ShowItem_Params_Data) == 8, "Bad sizeof(DevicePickerProvider_ShowItem_Params_Data)");
class DevicePickerProvider_HideItem_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DevicePickerProvider_HideItem_Params_Data>;

    DevicePickerProvider_HideItem_Params_Data();
    ~DevicePickerProvider_HideItem_Params_Data() = delete;
};
static_assert(sizeof(DevicePickerProvider_HideItem_Params_Data) == 8, "Bad sizeof(DevicePickerProvider_HideItem_Params_Data)");
class DevicePickerProvider_OnMetadataChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media_session::mojom::internal::MediaMetadata_Data> metadata;

private:
    friend class mojo::internal::MessageFragment<DevicePickerProvider_OnMetadataChanged_Params_Data>;

    DevicePickerProvider_OnMetadataChanged_Params_Data();
    ~DevicePickerProvider_OnMetadataChanged_Params_Data() = delete;
};
static_assert(sizeof(DevicePickerProvider_OnMetadataChanged_Params_Data) == 16, "Bad sizeof(DevicePickerProvider_OnMetadataChanged_Params_Data)");
class DevicePickerProvider_OnArtworkImageChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::ImageSkia_Data> artwork_image;

private:
    friend class mojo::internal::MessageFragment<DevicePickerProvider_OnArtworkImageChanged_Params_Data>;

    DevicePickerProvider_OnArtworkImageChanged_Params_Data();
    ~DevicePickerProvider_OnArtworkImageChanged_Params_Data() = delete;
};
static_assert(sizeof(DevicePickerProvider_OnArtworkImageChanged_Params_Data) == 16, "Bad sizeof(DevicePickerProvider_OnArtworkImageChanged_Params_Data)");
class DevicePickerProvider_OnFaviconImageChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::ImageSkia_Data> favicon_image;

private:
    friend class mojo::internal::MessageFragment<DevicePickerProvider_OnFaviconImageChanged_Params_Data>;

    DevicePickerProvider_OnFaviconImageChanged_Params_Data();
    ~DevicePickerProvider_OnFaviconImageChanged_Params_Data() = delete;
};
static_assert(sizeof(DevicePickerProvider_OnFaviconImageChanged_Params_Data) == 16, "Bad sizeof(DevicePickerProvider_OnFaviconImageChanged_Params_Data)");
class DevicePickerProvider_AddObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data observer;

private:
    friend class mojo::internal::MessageFragment<DevicePickerProvider_AddObserver_Params_Data>;

    DevicePickerProvider_AddObserver_Params_Data();
    ~DevicePickerProvider_AddObserver_Params_Data() = delete;
};
static_assert(sizeof(DevicePickerProvider_AddObserver_Params_Data) == 16, "Bad sizeof(DevicePickerProvider_AddObserver_Params_Data)");
class DevicePickerProvider_HideMediaUI_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DevicePickerProvider_HideMediaUI_Params_Data>;

    DevicePickerProvider_HideMediaUI_Params_Data();
    ~DevicePickerProvider_HideMediaUI_Params_Data() = delete;
};
static_assert(sizeof(DevicePickerProvider_HideMediaUI_Params_Data) == 8, "Bad sizeof(DevicePickerProvider_HideMediaUI_Params_Data)");
class DevicePickerObserver_OnMediaUIOpened_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DevicePickerObserver_OnMediaUIOpened_Params_Data>;

    DevicePickerObserver_OnMediaUIOpened_Params_Data();
    ~DevicePickerObserver_OnMediaUIOpened_Params_Data() = delete;
};
static_assert(sizeof(DevicePickerObserver_OnMediaUIOpened_Params_Data) == 8, "Bad sizeof(DevicePickerObserver_OnMediaUIOpened_Params_Data)");
class DevicePickerObserver_OnMediaUIClosed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DevicePickerObserver_OnMediaUIClosed_Params_Data>;

    DevicePickerObserver_OnMediaUIClosed_Params_Data();
    ~DevicePickerObserver_OnMediaUIClosed_Params_Data() = delete;
};
static_assert(sizeof(DevicePickerObserver_OnMediaUIClosed_Params_Data) == 8, "Bad sizeof(DevicePickerObserver_OnMediaUIClosed_Params_Data)");
class DevicePickerObserver_OnMediaUIUpdated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DevicePickerObserver_OnMediaUIUpdated_Params_Data>;

    DevicePickerObserver_OnMediaUIUpdated_Params_Data();
    ~DevicePickerObserver_OnMediaUIUpdated_Params_Data() = delete;
};
static_assert(sizeof(DevicePickerObserver_OnMediaUIUpdated_Params_Data) == 8, "Bad sizeof(DevicePickerObserver_OnMediaUIUpdated_Params_Data)");
class DevicePickerObserver_OnPickerDismissed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DevicePickerObserver_OnPickerDismissed_Params_Data>;

    DevicePickerObserver_OnPickerDismissed_Params_Data();
    ~DevicePickerObserver_OnPickerDismissed_Params_Data() = delete;
};
static_assert(sizeof(DevicePickerObserver_OnPickerDismissed_Params_Data) == 8, "Bad sizeof(DevicePickerObserver_OnPickerDismissed_Params_Data)");

} // namespace internal

class DeviceListHost_SelectDevice_ParamsDataView {
public:
    DeviceListHost_SelectDevice_ParamsDataView() = default;

    DeviceListHost_SelectDevice_ParamsDataView(internal::DeviceListHost_SelectDevice_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetDeviceIdDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadDeviceId(UserType* output)
    {

        auto* pointer = data_->device_id.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }

private:
    internal::DeviceListHost_SelectDevice_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

