// third_party/blink/public/mojom/frame/find_in_page.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_FRAME_FIND_IN_PAGE_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_FRAME_FIND_IN_PAGE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FindInPage_Find_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t request_id;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> search_text;
    mojo::internal::Pointer<internal::FindOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<FindInPage_Find_Params_Data>;

    FindInPage_Find_Params_Data();
    ~FindInPage_Find_Params_Data() = delete;
};
static_assert(sizeof(FindInPage_Find_Params_Data) == 32, "Bad sizeof(FindInPage_Find_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FindInPage_StopFinding_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t action;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FindInPage_StopFinding_Params_Data>;

    FindInPage_StopFinding_Params_Data();
    ~FindInPage_StopFinding_Params_Data() = delete;
};
static_assert(sizeof(FindInPage_StopFinding_Params_Data) == 16, "Bad sizeof(FindInPage_StopFinding_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FindInPage_ClearActiveFindMatch_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FindInPage_ClearActiveFindMatch_Params_Data>;

    FindInPage_ClearActiveFindMatch_Params_Data();
    ~FindInPage_ClearActiveFindMatch_Params_Data() = delete;
};
static_assert(sizeof(FindInPage_ClearActiveFindMatch_Params_Data) == 8, "Bad sizeof(FindInPage_ClearActiveFindMatch_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FindInPage_SetClient_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data client;

private:
    friend class mojo::internal::MessageFragment<FindInPage_SetClient_Params_Data>;

    FindInPage_SetClient_Params_Data();
    ~FindInPage_SetClient_Params_Data() = delete;
};
static_assert(sizeof(FindInPage_SetClient_Params_Data) == 16, "Bad sizeof(FindInPage_SetClient_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FindInPageClient_SetNumberOfMatches_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t request_id;
    uint32_t number_of_matches;
    int32_t update_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FindInPageClient_SetNumberOfMatches_Params_Data>;

    FindInPageClient_SetNumberOfMatches_Params_Data();
    ~FindInPageClient_SetNumberOfMatches_Params_Data() = delete;
};
static_assert(sizeof(FindInPageClient_SetNumberOfMatches_Params_Data) == 24, "Bad sizeof(FindInPageClient_SetNumberOfMatches_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FindInPageClient_SetActiveMatch_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t request_id;
    int32_t active_match_ordinal;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> active_match_rect;
    int32_t update_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FindInPageClient_SetActiveMatch_Params_Data>;

    FindInPageClient_SetActiveMatch_Params_Data();
    ~FindInPageClient_SetActiveMatch_Params_Data() = delete;
};
static_assert(sizeof(FindInPageClient_SetActiveMatch_Params_Data) == 32, "Bad sizeof(FindInPageClient_SetActiveMatch_Params_Data)");

} // namespace internal

class FindInPage_Find_ParamsDataView {
public:
    FindInPage_Find_ParamsDataView() = default;

    FindInPage_Find_ParamsDataView(internal::FindInPage_Find_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    int32_t request_id() const
    {
        return data_->request_id;
    }
    inline void GetSearchTextDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadSearchText(UserType* output)
    {

        auto* pointer = data_->search_text.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }
    inline void GetOptionsDataView(FindOptionsDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadOptions(UserType* output)
    {

        auto* pointer = data_->options.Get();
        return mojo::internal::Deserialize<::blink::mojom::FindOptionsDataView>(pointer, output, message_);
    }

private:
    internal::FindInPage_Find_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class FindInPage_StopFinding_ParamsDataView {
public:
    FindInPage_StopFinding_ParamsDataView() = default;

    FindInPage_StopFinding_ParamsDataView(internal::FindInPage_StopFinding_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadAction(UserType* output) const
    {
        auto data_value = data_->action;
        return mojo::internal::Deserialize<::blink::mojom::StopFindAction>(data_value, output);
    }
    StopFindAction action() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::blink::mojom::StopFindAction>(data_->action));
    }

private:
    internal::FindInPage_StopFinding_Params_Data* data_ = nullptr;
};

class FindInPage_ClearActiveFindMatch_ParamsDataView {
public:
    FindInPage_ClearActiveFindMatch_ParamsDataView() = default;

    FindInPage_ClearActiveFindMatch_ParamsDataView(internal::FindInPage_ClearActiveFindMatch_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::FindInPage_ClearActiveFindMatch_Params_Data* data_ = nullptr;
};

class FindInPage_SetClient_ParamsDataView {
public:
    FindInPage_SetClient_ParamsDataView() = default;

    FindInPage_SetClient_ParamsDataView(internal::FindInPage_SetClient_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeClient()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::blink::mojom::FindInPageClientInterfaceBase>>(&data_->client, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::FindInPage_SetClient_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class FindInPageClient_SetNumberOfMatches_ParamsDataView {
public:
    FindInPageClient_SetNumberOfMatches_ParamsDataView() = default;

    FindInPageClient_SetNumberOfMatches_ParamsDataView(internal::FindInPageClient_SetNumberOfMatches_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    int32_t request_id() const
    {
        return data_->request_id;
    }
    uint32_t number_of_matches() const
    {
        return data_->number_of_matches;
    }
    template <typename UserType> [[nodiscard]] bool ReadUpdateType(UserType* output) const
    {
        auto data_value = data_->update_type;
        return mojo::internal::Deserialize<::blink::mojom::FindMatchUpdateType>(data_value, output);
    }
    FindMatchUpdateType update_type() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::blink::mojom::FindMatchUpdateType>(data_->update_type));
    }

private:
    internal::FindInPageClient_SetNumberOfMatches_Params_Data* data_ = nullptr;
};

class FindInPageClient_SetActiveMatch_ParamsDataView {
public:
    FindInPageClient_SetActiveMatch_ParamsDataView() = default;

    FindInPageClient_SetActiveMatch_ParamsDataView(internal::FindInPageClient_SetActiveMatch_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    int32_t request_id() const
    {
        return data_->request_id;
    }
    inline void GetActiveMatchRectDataView(::gfx::mojom::RectDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadActiveMatchRect(UserType* output)
    {

        auto* pointer = data_->active_match_rect.Get();
        return mojo::internal::Deserialize<::gfx::mojom::RectDataView>(pointer, output, message_);
    }
    int32_t active_match_ordinal() const
    {
        return data_->active_match_ordinal;
    }
    template <typename UserType> [[nodiscard]] bool ReadUpdateType(UserType* output) const
    {
        auto data_value = data_->update_type;
        return mojo::internal::Deserialize<::blink::mojom::FindMatchUpdateType>(data_value, output);
    }
    FindMatchUpdateType update_type() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::blink::mojom::FindMatchUpdateType>(data_->update_type));
    }

private:
    internal::FindInPageClient_SetActiveMatch_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

inline void FindInPage_Find_ParamsDataView::GetSearchTextDataView(mojo::StringDataView* output)
{
    auto pointer = data_->search_text.Get();
    *output = mojo::StringDataView(pointer, message_);
}
inline void FindInPage_Find_ParamsDataView::GetOptionsDataView(FindOptionsDataView* output)
{
    auto pointer = data_->options.Get();
    *output = FindOptionsDataView(pointer, message_);
}

inline void FindInPageClient_SetActiveMatch_ParamsDataView::GetActiveMatchRectDataView(::gfx::mojom::RectDataView* output)
{
    auto pointer = data_->active_match_rect.Get();
    *output = ::gfx::mojom::RectDataView(pointer, message_);
}

} // blink::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // THIRD_PARTY_BLINK_PUBLIC_MOJOM_FRAME_FIND_IN_PAGE_MOJOM_PARAMS_DATA_H_
