// third_party/blink/public/mojom/frame/frame.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_FRAME_FRAME_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_FRAME_FRAME_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_EnterFullscreen_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FullscreenOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_EnterFullscreen_Params_Data>;

    LocalFrameHost_EnterFullscreen_Params_Data();
    ~LocalFrameHost_EnterFullscreen_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_EnterFullscreen_Params_Data) == 16, "Bad sizeof(LocalFrameHost_EnterFullscreen_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_EnterFullscreen_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t granted : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_EnterFullscreen_ResponseParams_Data>;

    LocalFrameHost_EnterFullscreen_ResponseParams_Data();
    ~LocalFrameHost_EnterFullscreen_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_EnterFullscreen_ResponseParams_Data) == 16, "Bad sizeof(LocalFrameHost_EnterFullscreen_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_ExitFullscreen_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_ExitFullscreen_Params_Data>;

    LocalFrameHost_ExitFullscreen_Params_Data();
    ~LocalFrameHost_ExitFullscreen_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_ExitFullscreen_Params_Data) == 8, "Bad sizeof(LocalFrameHost_ExitFullscreen_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_FullscreenStateChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_fullscreen : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<::blink::mojom::internal::FullscreenOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_FullscreenStateChanged_Params_Data>;

    LocalFrameHost_FullscreenStateChanged_Params_Data();
    ~LocalFrameHost_FullscreenStateChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_FullscreenStateChanged_Params_Data) == 24, "Bad sizeof(LocalFrameHost_FullscreenStateChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RegisterProtocolHandler_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> scheme;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    uint8_t user_gesture : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RegisterProtocolHandler_Params_Data>;

    LocalFrameHost_RegisterProtocolHandler_Params_Data();
    ~LocalFrameHost_RegisterProtocolHandler_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RegisterProtocolHandler_Params_Data) == 32, "Bad sizeof(LocalFrameHost_RegisterProtocolHandler_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_UnregisterProtocolHandler_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> scheme;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    uint8_t user_gesture : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_UnregisterProtocolHandler_Params_Data>;

    LocalFrameHost_UnregisterProtocolHandler_Params_Data();
    ~LocalFrameHost_UnregisterProtocolHandler_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_UnregisterProtocolHandler_Params_Data) == 32, "Bad sizeof(LocalFrameHost_UnregisterProtocolHandler_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidDisplayInsecureContent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidDisplayInsecureContent_Params_Data>;

    LocalFrameHost_DidDisplayInsecureContent_Params_Data();
    ~LocalFrameHost_DidDisplayInsecureContent_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidDisplayInsecureContent_Params_Data) == 8, "Bad sizeof(LocalFrameHost_DidDisplayInsecureContent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidContainInsecureFormAction_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidContainInsecureFormAction_Params_Data>;

    LocalFrameHost_DidContainInsecureFormAction_Params_Data();
    ~LocalFrameHost_DidContainInsecureFormAction_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidContainInsecureFormAction_Params_Data) == 8, "Bad sizeof(LocalFrameHost_DidContainInsecureFormAction_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_MainDocumentElementAvailable_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t uses_temporary_zoom_level : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_MainDocumentElementAvailable_Params_Data>;

    LocalFrameHost_MainDocumentElementAvailable_Params_Data();
    ~LocalFrameHost_MainDocumentElementAvailable_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_MainDocumentElementAvailable_Params_Data) == 16, "Bad sizeof(LocalFrameHost_MainDocumentElementAvailable_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_SetNeedsOcclusionTracking_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t needs_tracking : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_SetNeedsOcclusionTracking_Params_Data>;

    LocalFrameHost_SetNeedsOcclusionTracking_Params_Data();
    ~LocalFrameHost_SetNeedsOcclusionTracking_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_SetNeedsOcclusionTracking_Params_Data) == 16, "Bad sizeof(LocalFrameHost_SetNeedsOcclusionTracking_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_SetVirtualKeyboardMode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_SetVirtualKeyboardMode_Params_Data>;

    LocalFrameHost_SetVirtualKeyboardMode_Params_Data();
    ~LocalFrameHost_SetVirtualKeyboardMode_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_SetVirtualKeyboardMode_Params_Data) == 16, "Bad sizeof(LocalFrameHost_SetVirtualKeyboardMode_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_VisibilityChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t visibility;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_VisibilityChanged_Params_Data>;

    LocalFrameHost_VisibilityChanged_Params_Data();
    ~LocalFrameHost_VisibilityChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_VisibilityChanged_Params_Data) == 16, "Bad sizeof(LocalFrameHost_VisibilityChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidChangeThemeColor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::skia::mojom::internal::SkColor_Data> theme_color;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidChangeThemeColor_Params_Data>;

    LocalFrameHost_DidChangeThemeColor_Params_Data();
    ~LocalFrameHost_DidChangeThemeColor_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidChangeThemeColor_Params_Data) == 16, "Bad sizeof(LocalFrameHost_DidChangeThemeColor_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidChangeBackgroundColor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::skia::mojom::internal::SkColor4f_Data> background_color;
    uint8_t color_adjust : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidChangeBackgroundColor_Params_Data>;

    LocalFrameHost_DidChangeBackgroundColor_Params_Data();
    ~LocalFrameHost_DidChangeBackgroundColor_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidChangeBackgroundColor_Params_Data) == 24, "Bad sizeof(LocalFrameHost_DidChangeBackgroundColor_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidFailLoadWithError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    int32_t error_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidFailLoadWithError_Params_Data>;

    LocalFrameHost_DidFailLoadWithError_Params_Data();
    ~LocalFrameHost_DidFailLoadWithError_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidFailLoadWithError_Params_Data) == 24, "Bad sizeof(LocalFrameHost_DidFailLoadWithError_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidFocusFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidFocusFrame_Params_Data>;

    LocalFrameHost_DidFocusFrame_Params_Data();
    ~LocalFrameHost_DidFocusFrame_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidFocusFrame_Params_Data) == 8, "Bad sizeof(LocalFrameHost_DidFocusFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidCallFocus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidCallFocus_Params_Data>;

    LocalFrameHost_DidCallFocus_Params_Data();
    ~LocalFrameHost_DidCallFocus_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidCallFocus_Params_Data) == 8, "Bad sizeof(LocalFrameHost_DidCallFocus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_EnforceInsecureRequestPolicy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t policy_bitmap;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_EnforceInsecureRequestPolicy_Params_Data>;

    LocalFrameHost_EnforceInsecureRequestPolicy_Params_Data();
    ~LocalFrameHost_EnforceInsecureRequestPolicy_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_EnforceInsecureRequestPolicy_Params_Data) == 16, "Bad sizeof(LocalFrameHost_EnforceInsecureRequestPolicy_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_EnforceInsecureNavigationsSet_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint32_t>> set;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_EnforceInsecureNavigationsSet_Params_Data>;

    LocalFrameHost_EnforceInsecureNavigationsSet_Params_Data();
    ~LocalFrameHost_EnforceInsecureNavigationsSet_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_EnforceInsecureNavigationsSet_Params_Data) == 16, "Bad sizeof(LocalFrameHost_EnforceInsecureNavigationsSet_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_SuddenTerminationDisablerChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t present : 1;
    uint8_t pad0_[3];
    int32_t disabler_type;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_SuddenTerminationDisablerChanged_Params_Data>;

    LocalFrameHost_SuddenTerminationDisablerChanged_Params_Data();
    ~LocalFrameHost_SuddenTerminationDisablerChanged_Params_Data() = delete;
};
static_assert(
    sizeof(LocalFrameHost_SuddenTerminationDisablerChanged_Params_Data) == 16, "Bad sizeof(LocalFrameHost_SuddenTerminationDisablerChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_HadStickyUserActivationBeforeNavigationChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t has_gesture : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_HadStickyUserActivationBeforeNavigationChanged_Params_Data>;

    LocalFrameHost_HadStickyUserActivationBeforeNavigationChanged_Params_Data();
    ~LocalFrameHost_HadStickyUserActivationBeforeNavigationChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_HadStickyUserActivationBeforeNavigationChanged_Params_Data) == 16,
    "Bad sizeof(LocalFrameHost_HadStickyUserActivationBeforeNavigationChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_ScrollRectToVisibleInParentFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> rect_to_scroll;
    mojo::internal::Pointer<::blink::mojom::internal::ScrollIntoViewParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_ScrollRectToVisibleInParentFrame_Params_Data>;

    LocalFrameHost_ScrollRectToVisibleInParentFrame_Params_Data();
    ~LocalFrameHost_ScrollRectToVisibleInParentFrame_Params_Data() = delete;
};
static_assert(
    sizeof(LocalFrameHost_ScrollRectToVisibleInParentFrame_Params_Data) == 24, "Bad sizeof(LocalFrameHost_ScrollRectToVisibleInParentFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_BubbleLogicalScrollInParentFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t direction;
    int32_t granularity;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_BubbleLogicalScrollInParentFrame_Params_Data>;

    LocalFrameHost_BubbleLogicalScrollInParentFrame_Params_Data();
    ~LocalFrameHost_BubbleLogicalScrollInParentFrame_Params_Data() = delete;
};
static_assert(
    sizeof(LocalFrameHost_BubbleLogicalScrollInParentFrame_Params_Data) == 16, "Bad sizeof(LocalFrameHost_BubbleLogicalScrollInParentFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_StartLoadingForAsyncNavigationApiCommit_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_StartLoadingForAsyncNavigationApiCommit_Params_Data>;

    LocalFrameHost_StartLoadingForAsyncNavigationApiCommit_Params_Data();
    ~LocalFrameHost_StartLoadingForAsyncNavigationApiCommit_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_StartLoadingForAsyncNavigationApiCommit_Params_Data) == 8,
    "Bad sizeof(LocalFrameHost_StartLoadingForAsyncNavigationApiCommit_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidBlockNavigation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> blocked_url;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> initiator_url;
    int32_t reason;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidBlockNavigation_Params_Data>;

    LocalFrameHost_DidBlockNavigation_Params_Data();
    ~LocalFrameHost_DidBlockNavigation_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidBlockNavigation_Params_Data) == 32, "Bad sizeof(LocalFrameHost_DidBlockNavigation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidChangeLoadProgress_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    double load_progress;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidChangeLoadProgress_Params_Data>;

    LocalFrameHost_DidChangeLoadProgress_Params_Data();
    ~LocalFrameHost_DidChangeLoadProgress_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidChangeLoadProgress_Params_Data) == 16, "Bad sizeof(LocalFrameHost_DidChangeLoadProgress_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidFinishLoad_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> validated_url;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidFinishLoad_Params_Data>;

    LocalFrameHost_DidFinishLoad_Params_Data();
    ~LocalFrameHost_DidFinishLoad_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidFinishLoad_Params_Data) == 16, "Bad sizeof(LocalFrameHost_DidFinishLoad_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DispatchLoad_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DispatchLoad_Params_Data>;

    LocalFrameHost_DispatchLoad_Params_Data();
    ~LocalFrameHost_DispatchLoad_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DispatchLoad_Params_Data) == 8, "Bad sizeof(LocalFrameHost_DispatchLoad_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_GoToEntryAtOffset_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t offset;
    uint8_t has_user_gesture : 1;
    uint8_t pad1_[3];
    mojo::internal::Pointer<::blink::mojom::internal::TaskAttributionId_Data> soft_navigation_heuristics_task_id;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_GoToEntryAtOffset_Params_Data>;

    LocalFrameHost_GoToEntryAtOffset_Params_Data();
    ~LocalFrameHost_GoToEntryAtOffset_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_GoToEntryAtOffset_Params_Data) == 24, "Bad sizeof(LocalFrameHost_GoToEntryAtOffset_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_NavigateToNavigationApiKey_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> key;
    uint8_t has_user_gesture : 1;
    uint8_t pad1_[7];
    mojo::internal::Pointer<::blink::mojom::internal::TaskAttributionId_Data> soft_navigation_heuristics_task_id;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_NavigateToNavigationApiKey_Params_Data>;

    LocalFrameHost_NavigateToNavigationApiKey_Params_Data();
    ~LocalFrameHost_NavigateToNavigationApiKey_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_NavigateToNavigationApiKey_Params_Data) == 32, "Bad sizeof(LocalFrameHost_NavigateToNavigationApiKey_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_NavigateEventHandlerPresenceChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t present : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_NavigateEventHandlerPresenceChanged_Params_Data>;

    LocalFrameHost_NavigateEventHandlerPresenceChanged_Params_Data();
    ~LocalFrameHost_NavigateEventHandlerPresenceChanged_Params_Data() = delete;
};
static_assert(
    sizeof(LocalFrameHost_NavigateEventHandlerPresenceChanged_Params_Data) == 16, "Bad sizeof(LocalFrameHost_NavigateEventHandlerPresenceChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_UpdateTitle_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> title;
    int32_t title_direction;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_UpdateTitle_Params_Data>;

    LocalFrameHost_UpdateTitle_Params_Data();
    ~LocalFrameHost_UpdateTitle_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_UpdateTitle_Params_Data) == 24, "Bad sizeof(LocalFrameHost_UpdateTitle_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_UpdateAppTitle_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> app_title;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_UpdateAppTitle_Params_Data>;

    LocalFrameHost_UpdateAppTitle_Params_Data();
    ~LocalFrameHost_UpdateAppTitle_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_UpdateAppTitle_Params_Data) == 16, "Bad sizeof(LocalFrameHost_UpdateAppTitle_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_UpdateUserActivationState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t update_type;
    int32_t notification_type;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_UpdateUserActivationState_Params_Data>;

    LocalFrameHost_UpdateUserActivationState_Params_Data();
    ~LocalFrameHost_UpdateUserActivationState_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_UpdateUserActivationState_Params_Data) == 16, "Bad sizeof(LocalFrameHost_UpdateUserActivationState_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidConsumeHistoryUserActivation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidConsumeHistoryUserActivation_Params_Data>;

    LocalFrameHost_DidConsumeHistoryUserActivation_Params_Data();
    ~LocalFrameHost_DidConsumeHistoryUserActivation_Params_Data() = delete;
};
static_assert(
    sizeof(LocalFrameHost_DidConsumeHistoryUserActivation_Params_Data) == 8, "Bad sizeof(LocalFrameHost_DidConsumeHistoryUserActivation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_HandleAccessibilityFindInPageResult_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::FindInPageResultAXParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_HandleAccessibilityFindInPageResult_Params_Data>;

    LocalFrameHost_HandleAccessibilityFindInPageResult_Params_Data();
    ~LocalFrameHost_HandleAccessibilityFindInPageResult_Params_Data() = delete;
};
static_assert(
    sizeof(LocalFrameHost_HandleAccessibilityFindInPageResult_Params_Data) == 16, "Bad sizeof(LocalFrameHost_HandleAccessibilityFindInPageResult_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_HandleAccessibilityFindInPageTermination_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_HandleAccessibilityFindInPageTermination_Params_Data>;

    LocalFrameHost_HandleAccessibilityFindInPageTermination_Params_Data();
    ~LocalFrameHost_HandleAccessibilityFindInPageTermination_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_HandleAccessibilityFindInPageTermination_Params_Data) == 8,
    "Bad sizeof(LocalFrameHost_HandleAccessibilityFindInPageTermination_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DocumentOnLoadCompleted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DocumentOnLoadCompleted_Params_Data>;

    LocalFrameHost_DocumentOnLoadCompleted_Params_Data();
    ~LocalFrameHost_DocumentOnLoadCompleted_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DocumentOnLoadCompleted_Params_Data) == 8, "Bad sizeof(LocalFrameHost_DocumentOnLoadCompleted_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_ForwardResourceTimingToParent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::ResourceTimingInfo_Data> timing;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_ForwardResourceTimingToParent_Params_Data>;

    LocalFrameHost_ForwardResourceTimingToParent_Params_Data();
    ~LocalFrameHost_ForwardResourceTimingToParent_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_ForwardResourceTimingToParent_Params_Data) == 16, "Bad sizeof(LocalFrameHost_ForwardResourceTimingToParent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidDispatchDOMContentLoadedEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidDispatchDOMContentLoadedEvent_Params_Data>;

    LocalFrameHost_DidDispatchDOMContentLoadedEvent_Params_Data();
    ~LocalFrameHost_DidDispatchDOMContentLoadedEvent_Params_Data() = delete;
};
static_assert(
    sizeof(LocalFrameHost_DidDispatchDOMContentLoadedEvent_Params_Data) == 8, "Bad sizeof(LocalFrameHost_DidDispatchDOMContentLoadedEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RunModalAlertDialog_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> alert_message;
    uint8_t disable_third_party_subframe_suppresion : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RunModalAlertDialog_Params_Data>;

    LocalFrameHost_RunModalAlertDialog_Params_Data();
    ~LocalFrameHost_RunModalAlertDialog_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RunModalAlertDialog_Params_Data) == 24, "Bad sizeof(LocalFrameHost_RunModalAlertDialog_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RunModalAlertDialog_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RunModalAlertDialog_ResponseParams_Data>;

    LocalFrameHost_RunModalAlertDialog_ResponseParams_Data();
    ~LocalFrameHost_RunModalAlertDialog_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RunModalAlertDialog_ResponseParams_Data) == 8, "Bad sizeof(LocalFrameHost_RunModalAlertDialog_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RunModalConfirmDialog_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> alert_message;
    uint8_t disable_third_party_subframe_suppresion : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RunModalConfirmDialog_Params_Data>;

    LocalFrameHost_RunModalConfirmDialog_Params_Data();
    ~LocalFrameHost_RunModalConfirmDialog_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RunModalConfirmDialog_Params_Data) == 24, "Bad sizeof(LocalFrameHost_RunModalConfirmDialog_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RunModalConfirmDialog_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RunModalConfirmDialog_ResponseParams_Data>;

    LocalFrameHost_RunModalConfirmDialog_ResponseParams_Data();
    ~LocalFrameHost_RunModalConfirmDialog_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RunModalConfirmDialog_ResponseParams_Data) == 16, "Bad sizeof(LocalFrameHost_RunModalConfirmDialog_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RunModalPromptDialog_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> alert_message;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> default_value;
    uint8_t disable_third_party_subframe_suppresion : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RunModalPromptDialog_Params_Data>;

    LocalFrameHost_RunModalPromptDialog_Params_Data();
    ~LocalFrameHost_RunModalPromptDialog_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RunModalPromptDialog_Params_Data) == 32, "Bad sizeof(LocalFrameHost_RunModalPromptDialog_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RunModalPromptDialog_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> result;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RunModalPromptDialog_ResponseParams_Data>;

    LocalFrameHost_RunModalPromptDialog_ResponseParams_Data();
    ~LocalFrameHost_RunModalPromptDialog_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RunModalPromptDialog_ResponseParams_Data) == 24, "Bad sizeof(LocalFrameHost_RunModalPromptDialog_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RunBeforeUnloadConfirm_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_reload : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RunBeforeUnloadConfirm_Params_Data>;

    LocalFrameHost_RunBeforeUnloadConfirm_Params_Data();
    ~LocalFrameHost_RunBeforeUnloadConfirm_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RunBeforeUnloadConfirm_Params_Data) == 16, "Bad sizeof(LocalFrameHost_RunBeforeUnloadConfirm_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RunBeforeUnloadConfirm_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RunBeforeUnloadConfirm_ResponseParams_Data>;

    LocalFrameHost_RunBeforeUnloadConfirm_ResponseParams_Data();
    ~LocalFrameHost_RunBeforeUnloadConfirm_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RunBeforeUnloadConfirm_ResponseParams_Data) == 16, "Bad sizeof(LocalFrameHost_RunBeforeUnloadConfirm_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_UpdateFaviconURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::blink::mojom::internal::FaviconURL_Data>>> favicon_urls;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_UpdateFaviconURL_Params_Data>;

    LocalFrameHost_UpdateFaviconURL_Params_Data();
    ~LocalFrameHost_UpdateFaviconURL_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_UpdateFaviconURL_Params_Data) == 16, "Bad sizeof(LocalFrameHost_UpdateFaviconURL_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DownloadURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::DownloadURLParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DownloadURL_Params_Data>;

    LocalFrameHost_DownloadURL_Params_Data();
    ~LocalFrameHost_DownloadURL_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DownloadURL_Params_Data) == 16, "Bad sizeof(LocalFrameHost_DownloadURL_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_FocusedElementChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_editable_element : 1;
    uint8_t is_richly_editable_element : 1;
    uint8_t pad1_[3];
    int32_t focus_type;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> bounds_in_frame_widget;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_FocusedElementChanged_Params_Data>;

    LocalFrameHost_FocusedElementChanged_Params_Data();
    ~LocalFrameHost_FocusedElementChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_FocusedElementChanged_Params_Data) == 24, "Bad sizeof(LocalFrameHost_FocusedElementChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_TextSelectionChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> text;
    uint32_t offset;
    uint8_t pad1_[4];
    mojo::internal::Pointer<::gfx::mojom::internal::Range_Data> range;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_TextSelectionChanged_Params_Data>;

    LocalFrameHost_TextSelectionChanged_Params_Data();
    ~LocalFrameHost_TextSelectionChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_TextSelectionChanged_Params_Data) == 32, "Bad sizeof(LocalFrameHost_TextSelectionChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_ShowPopupMenu_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data popup_client;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> bounds;
    int32_t item_height;
    int32_t selected_item;
    double font_size;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::blink::mojom::internal::MenuItem_Data>>> menu_items;
    uint8_t right_aligned : 1;
    uint8_t allow_multiple_selection : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_ShowPopupMenu_Params_Data>;

    LocalFrameHost_ShowPopupMenu_Params_Data();
    ~LocalFrameHost_ShowPopupMenu_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_ShowPopupMenu_Params_Data) == 56, "Bad sizeof(LocalFrameHost_ShowPopupMenu_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_CreateNewPopupWidget_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedEndpointHandle_Data popup_host;
    mojo::internal::AssociatedEndpointHandle_Data blink_widget_host;
    mojo::internal::AssociatedInterface_Data blink_widget;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_CreateNewPopupWidget_Params_Data>;

    LocalFrameHost_CreateNewPopupWidget_Params_Data();
    ~LocalFrameHost_CreateNewPopupWidget_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_CreateNewPopupWidget_Params_Data) == 24, "Bad sizeof(LocalFrameHost_CreateNewPopupWidget_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_ShowContextMenu_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data client;
    mojo::internal::Pointer<::blink::mojom::internal::UntrustworthyContextMenuParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_ShowContextMenu_Params_Data>;

    LocalFrameHost_ShowContextMenu_Params_Data();
    ~LocalFrameHost_ShowContextMenu_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_ShowContextMenu_Params_Data) == 24, "Bad sizeof(LocalFrameHost_ShowContextMenu_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidLoadResourceFromMemoryCache_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<mojo::internal::String_Data> http_method;
    mojo::internal::Pointer<mojo::internal::String_Data> mime_type;
    int32_t request_destination;
    uint8_t include_credentials : 1;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidLoadResourceFromMemoryCache_Params_Data>;

    LocalFrameHost_DidLoadResourceFromMemoryCache_Params_Data();
    ~LocalFrameHost_DidLoadResourceFromMemoryCache_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidLoadResourceFromMemoryCache_Params_Data) == 40, "Bad sizeof(LocalFrameHost_DidLoadResourceFromMemoryCache_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidChangeFrameOwnerProperties_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::blink::mojom::internal::FrameToken_Data child_frame_token;
    mojo::internal::Pointer<::blink::mojom::internal::FrameOwnerProperties_Data> frame_owner_properties;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidChangeFrameOwnerProperties_Params_Data>;

    LocalFrameHost_DidChangeFrameOwnerProperties_Params_Data();
    ~LocalFrameHost_DidChangeFrameOwnerProperties_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidChangeFrameOwnerProperties_Params_Data) == 32, "Bad sizeof(LocalFrameHost_DidChangeFrameOwnerProperties_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidChangeOpener_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::LocalFrameToken_Data> opener_frame;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidChangeOpener_Params_Data>;

    LocalFrameHost_DidChangeOpener_Params_Data();
    ~LocalFrameHost_DidChangeOpener_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidChangeOpener_Params_Data) == 16, "Bad sizeof(LocalFrameHost_DidChangeOpener_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidChangeFramePolicy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::blink::mojom::internal::FrameToken_Data child_frame_token;
    mojo::internal::Pointer<::blink::mojom::internal::FramePolicy_Data> frame_policy;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidChangeFramePolicy_Params_Data>;

    LocalFrameHost_DidChangeFramePolicy_Params_Data();
    ~LocalFrameHost_DidChangeFramePolicy_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidChangeFramePolicy_Params_Data) == 32, "Bad sizeof(LocalFrameHost_DidChangeFramePolicy_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidChangeIframeAttributes_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::blink::mojom::internal::FrameToken_Data child_frame_token;
    mojo::internal::Pointer<internal::IframeAttributes_Data> attributes;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidChangeIframeAttributes_Params_Data>;

    LocalFrameHost_DidChangeIframeAttributes_Params_Data();
    ~LocalFrameHost_DidChangeIframeAttributes_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidChangeIframeAttributes_Params_Data) == 32, "Bad sizeof(LocalFrameHost_DidChangeIframeAttributes_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_CapturePaintPreviewOfSubframe_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> clip_rect;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> guid;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_CapturePaintPreviewOfSubframe_Params_Data>;

    LocalFrameHost_CapturePaintPreviewOfSubframe_Params_Data();
    ~LocalFrameHost_CapturePaintPreviewOfSubframe_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_CapturePaintPreviewOfSubframe_Params_Data) == 24, "Bad sizeof(LocalFrameHost_CapturePaintPreviewOfSubframe_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_SetCloseListener_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data listener;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_SetCloseListener_Params_Data>;

    LocalFrameHost_SetCloseListener_Params_Data();
    ~LocalFrameHost_SetCloseListener_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_SetCloseListener_Params_Data) == 16, "Bad sizeof(LocalFrameHost_SetCloseListener_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_Detach_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_Detach_Params_Data>;

    LocalFrameHost_Detach_Params_Data();
    ~LocalFrameHost_Detach_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_Detach_Params_Data) == 8, "Bad sizeof(LocalFrameHost_Detach_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_GetKeepAliveHandleFactory_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data factory;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_GetKeepAliveHandleFactory_Params_Data>;

    LocalFrameHost_GetKeepAliveHandleFactory_Params_Data();
    ~LocalFrameHost_GetKeepAliveHandleFactory_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_GetKeepAliveHandleFactory_Params_Data) == 16, "Bad sizeof(LocalFrameHost_GetKeepAliveHandleFactory_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidAddMessageToConsole_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t log_level;
    uint32_t line_number;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> msg;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> source_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> untrusted_stack_trace;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidAddMessageToConsole_Params_Data>;

    LocalFrameHost_DidAddMessageToConsole_Params_Data();
    ~LocalFrameHost_DidAddMessageToConsole_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidAddMessageToConsole_Params_Data) == 40, "Bad sizeof(LocalFrameHost_DidAddMessageToConsole_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_FrameSizeChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> size;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_FrameSizeChanged_Params_Data>;

    LocalFrameHost_FrameSizeChanged_Params_Data();
    ~LocalFrameHost_FrameSizeChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_FrameSizeChanged_Params_Data) == 16, "Bad sizeof(LocalFrameHost_FrameSizeChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidInferColorScheme_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t color_scheme;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidInferColorScheme_Params_Data>;

    LocalFrameHost_DidInferColorScheme_Params_Data();
    ~LocalFrameHost_DidInferColorScheme_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidInferColorScheme_Params_Data) == 16, "Bad sizeof(LocalFrameHost_DidInferColorScheme_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidChangeSrcDoc_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::blink::mojom::internal::FrameToken_Data child_frame_token;
    mojo::internal::Pointer<mojo::internal::String_Data> srcdoc_value;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidChangeSrcDoc_Params_Data>;

    LocalFrameHost_DidChangeSrcDoc_Params_Data();
    ~LocalFrameHost_DidChangeSrcDoc_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidChangeSrcDoc_Params_Data) == 32, "Bad sizeof(LocalFrameHost_DidChangeSrcDoc_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_ReceivedDelegatedCapability_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t delegated_capability;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_ReceivedDelegatedCapability_Params_Data>;

    LocalFrameHost_ReceivedDelegatedCapability_Params_Data();
    ~LocalFrameHost_ReceivedDelegatedCapability_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_ReceivedDelegatedCapability_Params_Data) == 16, "Bad sizeof(LocalFrameHost_ReceivedDelegatedCapability_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_SendFencedFrameReportingBeacon_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> event_data;
    mojo::internal::Pointer<mojo::internal::String_Data> event_type;
    mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> destinations;
    uint8_t cross_origin_exposed : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_SendFencedFrameReportingBeacon_Params_Data>;

    LocalFrameHost_SendFencedFrameReportingBeacon_Params_Data();
    ~LocalFrameHost_SendFencedFrameReportingBeacon_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_SendFencedFrameReportingBeacon_Params_Data) == 40, "Bad sizeof(LocalFrameHost_SendFencedFrameReportingBeacon_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_SendFencedFrameReportingBeaconToCustomURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> destination_url;
    uint8_t cross_origin_exposed : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_SendFencedFrameReportingBeaconToCustomURL_Params_Data>;

    LocalFrameHost_SendFencedFrameReportingBeaconToCustomURL_Params_Data();
    ~LocalFrameHost_SendFencedFrameReportingBeaconToCustomURL_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_SendFencedFrameReportingBeaconToCustomURL_Params_Data) == 24,
    "Bad sizeof(LocalFrameHost_SendFencedFrameReportingBeaconToCustomURL_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DisableUntrustedNetworkInFencedFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DisableUntrustedNetworkInFencedFrame_Params_Data>;

    LocalFrameHost_DisableUntrustedNetworkInFencedFrame_Params_Data();
    ~LocalFrameHost_DisableUntrustedNetworkInFencedFrame_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DisableUntrustedNetworkInFencedFrame_Params_Data) == 8,
    "Bad sizeof(LocalFrameHost_DisableUntrustedNetworkInFencedFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DisableUntrustedNetworkInFencedFrame_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DisableUntrustedNetworkInFencedFrame_ResponseParams_Data>;

    LocalFrameHost_DisableUntrustedNetworkInFencedFrame_ResponseParams_Data();
    ~LocalFrameHost_DisableUntrustedNetworkInFencedFrame_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DisableUntrustedNetworkInFencedFrame_ResponseParams_Data) == 8,
    "Bad sizeof(LocalFrameHost_DisableUntrustedNetworkInFencedFrame_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_ExemptUrlFromNetworkRevocationForTesting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> exempted_url;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_ExemptUrlFromNetworkRevocationForTesting_Params_Data>;

    LocalFrameHost_ExemptUrlFromNetworkRevocationForTesting_Params_Data();
    ~LocalFrameHost_ExemptUrlFromNetworkRevocationForTesting_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_ExemptUrlFromNetworkRevocationForTesting_Params_Data) == 16,
    "Bad sizeof(LocalFrameHost_ExemptUrlFromNetworkRevocationForTesting_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_ExemptUrlFromNetworkRevocationForTesting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_ExemptUrlFromNetworkRevocationForTesting_ResponseParams_Data>;

    LocalFrameHost_ExemptUrlFromNetworkRevocationForTesting_ResponseParams_Data();
    ~LocalFrameHost_ExemptUrlFromNetworkRevocationForTesting_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_ExemptUrlFromNetworkRevocationForTesting_ResponseParams_Data) == 8,
    "Bad sizeof(LocalFrameHost_ExemptUrlFromNetworkRevocationForTesting_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_SendLegacyTechEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> type;
    mojo::internal::Pointer<internal::LegacyTechEventCodeLocation_Data> code_location;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_SendLegacyTechEvent_Params_Data>;

    LocalFrameHost_SendLegacyTechEvent_Params_Data();
    ~LocalFrameHost_SendLegacyTechEvent_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_SendLegacyTechEvent_Params_Data) == 24, "Bad sizeof(LocalFrameHost_SendLegacyTechEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_SetFencedFrameAutomaticBeaconReportEventData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t event_type;
    uint8_t once : 1;
    uint8_t cross_origin_exposed : 1;
    uint8_t pad2_[3];
    mojo::internal::Pointer<mojo::internal::String_Data> event_data;
    mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> destinations;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_SetFencedFrameAutomaticBeaconReportEventData_Params_Data>;

    LocalFrameHost_SetFencedFrameAutomaticBeaconReportEventData_Params_Data();
    ~LocalFrameHost_SetFencedFrameAutomaticBeaconReportEventData_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_SetFencedFrameAutomaticBeaconReportEventData_Params_Data) == 32,
    "Bad sizeof(LocalFrameHost_SetFencedFrameAutomaticBeaconReportEventData_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_SendPrivateAggregationRequestsForFencedFrameEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> event_type;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_SendPrivateAggregationRequestsForFencedFrameEvent_Params_Data>;

    LocalFrameHost_SendPrivateAggregationRequestsForFencedFrameEvent_Params_Data();
    ~LocalFrameHost_SendPrivateAggregationRequestsForFencedFrameEvent_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_SendPrivateAggregationRequestsForFencedFrameEvent_Params_Data) == 16,
    "Bad sizeof(LocalFrameHost_SendPrivateAggregationRequestsForFencedFrameEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_CreateFencedFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedEndpointHandle_Data fenced_frame;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameInterfacesFromRenderer_Data> remote_frame_interfaces;
    mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameToken_Data> frame_token;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> devtools_frame_token;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_CreateFencedFrame_Params_Data>;

    LocalFrameHost_CreateFencedFrame_Params_Data();
    ~LocalFrameHost_CreateFencedFrame_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_CreateFencedFrame_Params_Data) == 40, "Bad sizeof(LocalFrameHost_CreateFencedFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_ForwardFencedFrameEventAndUserActivationToEmbedder_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> event_type;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_ForwardFencedFrameEventAndUserActivationToEmbedder_Params_Data>;

    LocalFrameHost_ForwardFencedFrameEventAndUserActivationToEmbedder_Params_Data();
    ~LocalFrameHost_ForwardFencedFrameEventAndUserActivationToEmbedder_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_ForwardFencedFrameEventAndUserActivationToEmbedder_Params_Data) == 16,
    "Bad sizeof(LocalFrameHost_ForwardFencedFrameEventAndUserActivationToEmbedder_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_OnViewTransitionOptInChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t view_transition_opt_in;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_OnViewTransitionOptInChanged_Params_Data>;

    LocalFrameHost_OnViewTransitionOptInChanged_Params_Data();
    ~LocalFrameHost_OnViewTransitionOptInChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_OnViewTransitionOptInChanged_Params_Data) == 16, "Bad sizeof(LocalFrameHost_OnViewTransitionOptInChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_StartDragging_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::DragData_Data> drag_data;
    mojo::internal::Pointer<::blink::mojom::internal::AllowedDragOperations_Data> operations_allowed;
    mojo::internal::Pointer<::skia::mojom::internal::BitmapN32_Data> image;
    mojo::internal::Pointer<::gfx::mojom::internal::Vector2d_Data> cursor_offset_in_dip;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> drag_obj_rect_in_dip;
    mojo::internal::Pointer<::blink::mojom::internal::DragEventSourceInfo_Data> event_info;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_StartDragging_Params_Data>;

    LocalFrameHost_StartDragging_Params_Data();
    ~LocalFrameHost_StartDragging_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_StartDragging_Params_Data) == 56, "Bad sizeof(LocalFrameHost_StartDragging_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_IssueKeepAliveHandle_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_IssueKeepAliveHandle_Params_Data>;

    LocalFrameHost_IssueKeepAliveHandle_Params_Data();
    ~LocalFrameHost_IssueKeepAliveHandle_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_IssueKeepAliveHandle_Params_Data) == 16, "Bad sizeof(LocalFrameHost_IssueKeepAliveHandle_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_NotifyStorageAccessed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t storageType;
    uint8_t blocked : 1;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_NotifyStorageAccessed_Params_Data>;

    LocalFrameHost_NotifyStorageAccessed_Params_Data();
    ~LocalFrameHost_NotifyStorageAccessed_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_NotifyStorageAccessed_Params_Data) == 16, "Bad sizeof(LocalFrameHost_NotifyStorageAccessed_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RecordWindowProxyUsageMetrics_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::blink::mojom::internal::FrameToken_Data target_frame_token;
    int32_t access_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RecordWindowProxyUsageMetrics_Params_Data>;

    LocalFrameHost_RecordWindowProxyUsageMetrics_Params_Data();
    ~LocalFrameHost_RecordWindowProxyUsageMetrics_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RecordWindowProxyUsageMetrics_Params_Data) == 32, "Bad sizeof(LocalFrameHost_RecordWindowProxyUsageMetrics_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_NotifyDocumentInteractive_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_NotifyDocumentInteractive_Params_Data>;

    LocalFrameHost_NotifyDocumentInteractive_Params_Data();
    ~LocalFrameHost_NotifyDocumentInteractive_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_NotifyDocumentInteractive_Params_Data) == 8, "Bad sizeof(LocalFrameHost_NotifyDocumentInteractive_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) NonAssociatedLocalFrameHost_MaybeStartOutermostMainFrameNavigation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Url_Data>>> urls;

private:
    friend class mojo::internal::MessageFragment<NonAssociatedLocalFrameHost_MaybeStartOutermostMainFrameNavigation_Params_Data>;

    NonAssociatedLocalFrameHost_MaybeStartOutermostMainFrameNavigation_Params_Data();
    ~NonAssociatedLocalFrameHost_MaybeStartOutermostMainFrameNavigation_Params_Data() = delete;
};
static_assert(sizeof(NonAssociatedLocalFrameHost_MaybeStartOutermostMainFrameNavigation_Params_Data) == 16,
    "Bad sizeof(NonAssociatedLocalFrameHost_MaybeStartOutermostMainFrameNavigation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_GetTextSurroundingSelection_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t max_length;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_GetTextSurroundingSelection_Params_Data>;

    LocalFrame_GetTextSurroundingSelection_Params_Data();
    ~LocalFrame_GetTextSurroundingSelection_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_GetTextSurroundingSelection_Params_Data) == 16, "Bad sizeof(LocalFrame_GetTextSurroundingSelection_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_GetTextSurroundingSelection_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> content;
    uint32_t start_offset;
    uint32_t end_offset;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_GetTextSurroundingSelection_ResponseParams_Data>;

    LocalFrame_GetTextSurroundingSelection_ResponseParams_Data();
    ~LocalFrame_GetTextSurroundingSelection_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(LocalFrame_GetTextSurroundingSelection_ResponseParams_Data) == 24, "Bad sizeof(LocalFrame_GetTextSurroundingSelection_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_SendInterventionReport_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> id;
    mojo::internal::Pointer<mojo::internal::String_Data> message;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_SendInterventionReport_Params_Data>;

    LocalFrame_SendInterventionReport_Params_Data();
    ~LocalFrame_SendInterventionReport_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_SendInterventionReport_Params_Data) == 24, "Bad sizeof(LocalFrame_SendInterventionReport_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_SetFrameOwnerProperties_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FrameOwnerProperties_Data> properties;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_SetFrameOwnerProperties_Params_Data>;

    LocalFrame_SetFrameOwnerProperties_Params_Data();
    ~LocalFrame_SetFrameOwnerProperties_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_SetFrameOwnerProperties_Params_Data) == 16, "Bad sizeof(LocalFrame_SetFrameOwnerProperties_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_NotifyUserActivation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t notification_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_NotifyUserActivation_Params_Data>;

    LocalFrame_NotifyUserActivation_Params_Data();
    ~LocalFrame_NotifyUserActivation_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_NotifyUserActivation_Params_Data) == 16, "Bad sizeof(LocalFrame_NotifyUserActivation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_NotifyVirtualKeyboardOverlayRect_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> keyboard_rect;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_NotifyVirtualKeyboardOverlayRect_Params_Data>;

    LocalFrame_NotifyVirtualKeyboardOverlayRect_Params_Data();
    ~LocalFrame_NotifyVirtualKeyboardOverlayRect_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_NotifyVirtualKeyboardOverlayRect_Params_Data) == 16, "Bad sizeof(LocalFrame_NotifyVirtualKeyboardOverlayRect_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_AddMessageToConsole_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t level;
    uint8_t discard_duplicates : 1;
    uint8_t pad1_[3];
    mojo::internal::Pointer<mojo::internal::String_Data> message;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_AddMessageToConsole_Params_Data>;

    LocalFrame_AddMessageToConsole_Params_Data();
    ~LocalFrame_AddMessageToConsole_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_AddMessageToConsole_Params_Data) == 24, "Bad sizeof(LocalFrame_AddMessageToConsole_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_SwapInImmediately_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_SwapInImmediately_Params_Data>;

    LocalFrame_SwapInImmediately_Params_Data();
    ~LocalFrame_SwapInImmediately_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_SwapInImmediately_Params_Data) == 8, "Bad sizeof(LocalFrame_SwapInImmediately_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_CheckCompleted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_CheckCompleted_Params_Data>;

    LocalFrame_CheckCompleted_Params_Data();
    ~LocalFrame_CheckCompleted_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_CheckCompleted_Params_Data) == 8, "Bad sizeof(LocalFrame_CheckCompleted_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_StopLoading_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_StopLoading_Params_Data>;

    LocalFrame_StopLoading_Params_Data();
    ~LocalFrame_StopLoading_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_StopLoading_Params_Data) == 8, "Bad sizeof(LocalFrame_StopLoading_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_Collapse_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t collapsed : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_Collapse_Params_Data>;

    LocalFrame_Collapse_Params_Data();
    ~LocalFrame_Collapse_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_Collapse_Params_Data) == 16, "Bad sizeof(LocalFrame_Collapse_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_EnableViewSourceMode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_EnableViewSourceMode_Params_Data>;

    LocalFrame_EnableViewSourceMode_Params_Data();
    ~LocalFrame_EnableViewSourceMode_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_EnableViewSourceMode_Params_Data) == 8, "Bad sizeof(LocalFrame_EnableViewSourceMode_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_Focus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_Focus_Params_Data>;

    LocalFrame_Focus_Params_Data();
    ~LocalFrame_Focus_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_Focus_Params_Data) == 8, "Bad sizeof(LocalFrame_Focus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_ClearFocusedElement_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_ClearFocusedElement_Params_Data>;

    LocalFrame_ClearFocusedElement_Params_Data();
    ~LocalFrame_ClearFocusedElement_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_ClearFocusedElement_Params_Data) == 8, "Bad sizeof(LocalFrame_ClearFocusedElement_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_CopyImageAt_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> window_point;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_CopyImageAt_Params_Data>;

    LocalFrame_CopyImageAt_Params_Data();
    ~LocalFrame_CopyImageAt_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_CopyImageAt_Params_Data) == 16, "Bad sizeof(LocalFrame_CopyImageAt_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_SaveImageAt_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> window_point;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_SaveImageAt_Params_Data>;

    LocalFrame_SaveImageAt_Params_Data();
    ~LocalFrame_SaveImageAt_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_SaveImageAt_Params_Data) == 16, "Bad sizeof(LocalFrame_SaveImageAt_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_ReportBlinkFeatureUsage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> features;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_ReportBlinkFeatureUsage_Params_Data>;

    LocalFrame_ReportBlinkFeatureUsage_Params_Data();
    ~LocalFrame_ReportBlinkFeatureUsage_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_ReportBlinkFeatureUsage_Params_Data) == 16, "Bad sizeof(LocalFrame_ReportBlinkFeatureUsage_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_RenderFallbackContent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_RenderFallbackContent_Params_Data>;

    LocalFrame_RenderFallbackContent_Params_Data();
    ~LocalFrame_RenderFallbackContent_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_RenderFallbackContent_Params_Data) == 8, "Bad sizeof(LocalFrame_RenderFallbackContent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_BeforeUnload_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_reload : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_BeforeUnload_Params_Data>;

    LocalFrame_BeforeUnload_Params_Data();
    ~LocalFrame_BeforeUnload_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_BeforeUnload_Params_Data) == 16, "Bad sizeof(LocalFrame_BeforeUnload_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_BeforeUnload_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t proceed : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeTicks_Data> before_unload_start_time;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeTicks_Data> before_unload_end_time;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_BeforeUnload_ResponseParams_Data>;

    LocalFrame_BeforeUnload_ResponseParams_Data();
    ~LocalFrame_BeforeUnload_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrame_BeforeUnload_ResponseParams_Data) == 32, "Bad sizeof(LocalFrame_BeforeUnload_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_MediaPlayerActionAt_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> location;
    mojo::internal::Pointer<::blink::mojom::internal::MediaPlayerAction_Data> action;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_MediaPlayerActionAt_Params_Data>;

    LocalFrame_MediaPlayerActionAt_Params_Data();
    ~LocalFrame_MediaPlayerActionAt_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_MediaPlayerActionAt_Params_Data) == 24, "Bad sizeof(LocalFrame_MediaPlayerActionAt_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_RequestVideoFrameAtWithBoundsHint_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> location;
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> max_size;
    int32_t max_area;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_RequestVideoFrameAtWithBoundsHint_Params_Data>;

    LocalFrame_RequestVideoFrameAtWithBoundsHint_Params_Data();
    ~LocalFrame_RequestVideoFrameAtWithBoundsHint_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_RequestVideoFrameAtWithBoundsHint_Params_Data) == 32, "Bad sizeof(LocalFrame_RequestVideoFrameAtWithBoundsHint_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_RequestVideoFrameAtWithBoundsHint_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::skia::mojom::internal::BitmapN32_Data> bitmap;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> bounds;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_RequestVideoFrameAtWithBoundsHint_ResponseParams_Data>;

    LocalFrame_RequestVideoFrameAtWithBoundsHint_ResponseParams_Data();
    ~LocalFrame_RequestVideoFrameAtWithBoundsHint_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrame_RequestVideoFrameAtWithBoundsHint_ResponseParams_Data) == 24,
    "Bad sizeof(LocalFrame_RequestVideoFrameAtWithBoundsHint_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_PluginActionAt_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> location;
    int32_t action;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_PluginActionAt_Params_Data>;

    LocalFrame_PluginActionAt_Params_Data();
    ~LocalFrame_PluginActionAt_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_PluginActionAt_Params_Data) == 24, "Bad sizeof(LocalFrame_PluginActionAt_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_AdvanceFocusInFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t focus_type;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameToken_Data> source_frame_token;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_AdvanceFocusInFrame_Params_Data>;

    LocalFrame_AdvanceFocusInFrame_Params_Data();
    ~LocalFrame_AdvanceFocusInFrame_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_AdvanceFocusInFrame_Params_Data) == 24, "Bad sizeof(LocalFrame_AdvanceFocusInFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_AdvanceFocusForIME_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t focus_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_AdvanceFocusForIME_Params_Data>;

    LocalFrame_AdvanceFocusForIME_Params_Data();
    ~LocalFrame_AdvanceFocusForIME_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_AdvanceFocusForIME_Params_Data) == 16, "Bad sizeof(LocalFrame_AdvanceFocusForIME_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_ReportContentSecurityPolicyViolation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::CSPViolation_Data> violation;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_ReportContentSecurityPolicyViolation_Params_Data>;

    LocalFrame_ReportContentSecurityPolicyViolation_Params_Data();
    ~LocalFrame_ReportContentSecurityPolicyViolation_Params_Data() = delete;
};
static_assert(
    sizeof(LocalFrame_ReportContentSecurityPolicyViolation_Params_Data) == 16, "Bad sizeof(LocalFrame_ReportContentSecurityPolicyViolation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_DidUpdateFramePolicy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FramePolicy_Data> frame_policy;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_DidUpdateFramePolicy_Params_Data>;

    LocalFrame_DidUpdateFramePolicy_Params_Data();
    ~LocalFrame_DidUpdateFramePolicy_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_DidUpdateFramePolicy_Params_Data) == 16, "Bad sizeof(LocalFrame_DidUpdateFramePolicy_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_OnFrameVisibilityChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t visibility;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_OnFrameVisibilityChanged_Params_Data>;

    LocalFrame_OnFrameVisibilityChanged_Params_Data();
    ~LocalFrame_OnFrameVisibilityChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_OnFrameVisibilityChanged_Params_Data) == 16, "Bad sizeof(LocalFrame_OnFrameVisibilityChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_PostMessageEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameToken_Data> source_frame_token;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> source_origin;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> target_origin;
    mojo::internal::Pointer<::blink::mojom::internal::TransferableMessage_Data> message;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_PostMessageEvent_Params_Data>;

    LocalFrame_PostMessageEvent_Params_Data();
    ~LocalFrame_PostMessageEvent_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_PostMessageEvent_Params_Data) == 40, "Bad sizeof(LocalFrame_PostMessageEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_JavaScriptMethodExecuteRequest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> object_name;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> method_name;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ListValue_Data> arguments;
    uint8_t wants_result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_JavaScriptMethodExecuteRequest_Params_Data>;

    LocalFrame_JavaScriptMethodExecuteRequest_Params_Data();
    ~LocalFrame_JavaScriptMethodExecuteRequest_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_JavaScriptMethodExecuteRequest_Params_Data) == 40, "Bad sizeof(LocalFrame_JavaScriptMethodExecuteRequest_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_JavaScriptMethodExecuteRequest_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::mojo_base::mojom::internal::Value_Data result;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_JavaScriptMethodExecuteRequest_ResponseParams_Data>;

    LocalFrame_JavaScriptMethodExecuteRequest_ResponseParams_Data();
    ~LocalFrame_JavaScriptMethodExecuteRequest_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(LocalFrame_JavaScriptMethodExecuteRequest_ResponseParams_Data) == 24, "Bad sizeof(LocalFrame_JavaScriptMethodExecuteRequest_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_JavaScriptExecuteRequest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> javascript;
    uint8_t wants_result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_JavaScriptExecuteRequest_Params_Data>;

    LocalFrame_JavaScriptExecuteRequest_Params_Data();
    ~LocalFrame_JavaScriptExecuteRequest_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_JavaScriptExecuteRequest_Params_Data) == 24, "Bad sizeof(LocalFrame_JavaScriptExecuteRequest_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_JavaScriptExecuteRequest_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::mojo_base::mojom::internal::Value_Data result;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_JavaScriptExecuteRequest_ResponseParams_Data>;

    LocalFrame_JavaScriptExecuteRequest_ResponseParams_Data();
    ~LocalFrame_JavaScriptExecuteRequest_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrame_JavaScriptExecuteRequest_ResponseParams_Data) == 24, "Bad sizeof(LocalFrame_JavaScriptExecuteRequest_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_JavaScriptExecuteRequestForTests_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> javascript;
    uint8_t has_user_gesture : 1;
    uint8_t resolve_promises : 1;
    uint8_t honor_js_content_settings : 1;
    uint8_t pad3_[3];
    int32_t world_id;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_JavaScriptExecuteRequestForTests_Params_Data>;

    LocalFrame_JavaScriptExecuteRequestForTests_Params_Data();
    ~LocalFrame_JavaScriptExecuteRequestForTests_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_JavaScriptExecuteRequestForTests_Params_Data) == 24, "Bad sizeof(LocalFrame_JavaScriptExecuteRequestForTests_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_JavaScriptExecuteRequestForTests_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result_type;
    uint8_t pad0_[4];
    ::mojo_base::mojom::internal::Value_Data result;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_JavaScriptExecuteRequestForTests_ResponseParams_Data>;

    LocalFrame_JavaScriptExecuteRequestForTests_ResponseParams_Data();
    ~LocalFrame_JavaScriptExecuteRequestForTests_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrame_JavaScriptExecuteRequestForTests_ResponseParams_Data) == 32,
    "Bad sizeof(LocalFrame_JavaScriptExecuteRequestForTests_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> javascript;
    uint8_t wants_result : 1;
    uint8_t pad1_[3];
    int32_t world_id;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_Params_Data>;

    LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_Params_Data();
    ~LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_Params_Data() = delete;
};
static_assert(
    sizeof(LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_Params_Data) == 24, "Bad sizeof(LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::mojo_base::mojom::internal::Value_Data result;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_ResponseParams_Data>;

    LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_ResponseParams_Data();
    ~LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_ResponseParams_Data) == 24,
    "Bad sizeof(LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_BindReportingObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_BindReportingObserver_Params_Data>;

    LocalFrame_BindReportingObserver_Params_Data();
    ~LocalFrame_BindReportingObserver_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_BindReportingObserver_Params_Data) == 16, "Bad sizeof(LocalFrame_BindReportingObserver_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_UpdateOpener_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::blink::mojom::internal::FrameToken_Data opener_frame_token;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_UpdateOpener_Params_Data>;

    LocalFrame_UpdateOpener_Params_Data();
    ~LocalFrame_UpdateOpener_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_UpdateOpener_Params_Data) == 24, "Bad sizeof(LocalFrame_UpdateOpener_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_GetSavableResourceLinks_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_GetSavableResourceLinks_Params_Data>;

    LocalFrame_GetSavableResourceLinks_Params_Data();
    ~LocalFrame_GetSavableResourceLinks_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_GetSavableResourceLinks_Params_Data) == 8, "Bad sizeof(LocalFrame_GetSavableResourceLinks_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_GetSavableResourceLinks_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::GetSavableResourceLinksReply_Data> reply;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_GetSavableResourceLinks_ResponseParams_Data>;

    LocalFrame_GetSavableResourceLinks_ResponseParams_Data();
    ~LocalFrame_GetSavableResourceLinks_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrame_GetSavableResourceLinks_ResponseParams_Data) == 16, "Bad sizeof(LocalFrame_GetSavableResourceLinks_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_MixedContentFound_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> main_resource_url;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> mixed_content_url;
    int32_t request_context;
    uint8_t was_allowed : 1;
    uint8_t had_redirect : 1;
    uint8_t pad4_[3];
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url_before_redirects;
    mojo::internal::Pointer<::network::mojom::internal::SourceLocation_Data> source_location;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_MixedContentFound_Params_Data>;

    LocalFrame_MixedContentFound_Params_Data();
    ~LocalFrame_MixedContentFound_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_MixedContentFound_Params_Data) == 48, "Bad sizeof(LocalFrame_MixedContentFound_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_BindDevToolsAgent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data agent_host;
    mojo::internal::AssociatedEndpointHandle_Data agent;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_BindDevToolsAgent_Params_Data>;

    LocalFrame_BindDevToolsAgent_Params_Data();
    ~LocalFrame_BindDevToolsAgent_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_BindDevToolsAgent_Params_Data) == 24, "Bad sizeof(LocalFrame_BindDevToolsAgent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_HandleRendererDebugURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_HandleRendererDebugURL_Params_Data>;

    LocalFrame_HandleRendererDebugURL_Params_Data();
    ~LocalFrame_HandleRendererDebugURL_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_HandleRendererDebugURL_Params_Data) == 16, "Bad sizeof(LocalFrame_HandleRendererDebugURL_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_GetCanonicalUrlForSharing_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_GetCanonicalUrlForSharing_Params_Data>;

    LocalFrame_GetCanonicalUrlForSharing_Params_Data();
    ~LocalFrame_GetCanonicalUrlForSharing_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_GetCanonicalUrlForSharing_Params_Data) == 8, "Bad sizeof(LocalFrame_GetCanonicalUrlForSharing_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_GetCanonicalUrlForSharing_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> canonical_url;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_GetCanonicalUrlForSharing_ResponseParams_Data>;

    LocalFrame_GetCanonicalUrlForSharing_ResponseParams_Data();
    ~LocalFrame_GetCanonicalUrlForSharing_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrame_GetCanonicalUrlForSharing_ResponseParams_Data) == 16, "Bad sizeof(LocalFrame_GetCanonicalUrlForSharing_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_GetOpenGraphMetadata_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_GetOpenGraphMetadata_Params_Data>;

    LocalFrame_GetOpenGraphMetadata_Params_Data();
    ~LocalFrame_GetOpenGraphMetadata_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_GetOpenGraphMetadata_Params_Data) == 8, "Bad sizeof(LocalFrame_GetOpenGraphMetadata_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_GetOpenGraphMetadata_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::OpenGraphMetadata_Data> metadata;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_GetOpenGraphMetadata_ResponseParams_Data>;

    LocalFrame_GetOpenGraphMetadata_ResponseParams_Data();
    ~LocalFrame_GetOpenGraphMetadata_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrame_GetOpenGraphMetadata_ResponseParams_Data) == 16, "Bad sizeof(LocalFrame_GetOpenGraphMetadata_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_SetNavigationApiHistoryEntriesForRestore_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::NavigationApiHistoryEntryArrays_Data> entry_arrays;
    int32_t restore_reason;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_SetNavigationApiHistoryEntriesForRestore_Params_Data>;

    LocalFrame_SetNavigationApiHistoryEntriesForRestore_Params_Data();
    ~LocalFrame_SetNavigationApiHistoryEntriesForRestore_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_SetNavigationApiHistoryEntriesForRestore_Params_Data) == 24,
    "Bad sizeof(LocalFrame_SetNavigationApiHistoryEntriesForRestore_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_UpdatePrerenderURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> matched_url;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_UpdatePrerenderURL_Params_Data>;

    LocalFrame_UpdatePrerenderURL_Params_Data();
    ~LocalFrame_UpdatePrerenderURL_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_UpdatePrerenderURL_Params_Data) == 16, "Bad sizeof(LocalFrame_UpdatePrerenderURL_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_UpdatePrerenderURL_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_UpdatePrerenderURL_ResponseParams_Data>;

    LocalFrame_UpdatePrerenderURL_ResponseParams_Data();
    ~LocalFrame_UpdatePrerenderURL_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrame_UpdatePrerenderURL_ResponseParams_Data) == 8, "Bad sizeof(LocalFrame_UpdatePrerenderURL_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_NotifyNavigationApiOfDisposedEntries_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> keys;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_NotifyNavigationApiOfDisposedEntries_Params_Data>;

    LocalFrame_NotifyNavigationApiOfDisposedEntries_Params_Data();
    ~LocalFrame_NotifyNavigationApiOfDisposedEntries_Params_Data() = delete;
};
static_assert(
    sizeof(LocalFrame_NotifyNavigationApiOfDisposedEntries_Params_Data) == 16, "Bad sizeof(LocalFrame_NotifyNavigationApiOfDisposedEntries_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_TraverseCancelled_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> navigation_api_key;
    int32_t reason;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_TraverseCancelled_Params_Data>;

    LocalFrame_TraverseCancelled_Params_Data();
    ~LocalFrame_TraverseCancelled_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_TraverseCancelled_Params_Data) == 24, "Bad sizeof(LocalFrame_TraverseCancelled_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_DispatchNavigateEventForCrossDocumentTraversal_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ByteString_Data> page_state;
    uint8_t is_browser_initiated : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_DispatchNavigateEventForCrossDocumentTraversal_Params_Data>;

    LocalFrame_DispatchNavigateEventForCrossDocumentTraversal_Params_Data();
    ~LocalFrame_DispatchNavigateEventForCrossDocumentTraversal_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_DispatchNavigateEventForCrossDocumentTraversal_Params_Data) == 32,
    "Bad sizeof(LocalFrame_DispatchNavigateEventForCrossDocumentTraversal_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_SnapshotDocumentForViewTransition_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::ViewTransitionToken_Data> transition_token;
    mojo::internal::Pointer<::blink::mojom::internal::PageSwapEventParams_Data> page_swap_event_params;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_SnapshotDocumentForViewTransition_Params_Data>;

    LocalFrame_SnapshotDocumentForViewTransition_Params_Data();
    ~LocalFrame_SnapshotDocumentForViewTransition_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_SnapshotDocumentForViewTransition_Params_Data) == 24, "Bad sizeof(LocalFrame_SnapshotDocumentForViewTransition_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_SnapshotDocumentForViewTransition_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::ViewTransitionState_Data> view_transition_state;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_SnapshotDocumentForViewTransition_ResponseParams_Data>;

    LocalFrame_SnapshotDocumentForViewTransition_ResponseParams_Data();
    ~LocalFrame_SnapshotDocumentForViewTransition_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrame_SnapshotDocumentForViewTransition_ResponseParams_Data) == 16,
    "Bad sizeof(LocalFrame_SnapshotDocumentForViewTransition_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_NotifyViewTransitionAbortedToOldDocument_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_NotifyViewTransitionAbortedToOldDocument_Params_Data>;

    LocalFrame_NotifyViewTransitionAbortedToOldDocument_Params_Data();
    ~LocalFrame_NotifyViewTransitionAbortedToOldDocument_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_NotifyViewTransitionAbortedToOldDocument_Params_Data) == 8,
    "Bad sizeof(LocalFrame_NotifyViewTransitionAbortedToOldDocument_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_DispatchPageSwap_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::PageSwapEventParams_Data> page_swap_event_params;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_DispatchPageSwap_Params_Data>;

    LocalFrame_DispatchPageSwap_Params_Data();
    ~LocalFrame_DispatchPageSwap_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_DispatchPageSwap_Params_Data) == 16, "Bad sizeof(LocalFrame_DispatchPageSwap_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_AddResourceTimingEntryForFailedSubframeNavigation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::blink::mojom::internal::FrameToken_Data subframe_token;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> initial_url;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeTicks_Data> start_time;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeTicks_Data> redirect_time;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeTicks_Data> request_start;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeTicks_Data> response_start;
    uint32_t response_code;
    int32_t connection_info;
    mojo::internal::Pointer<mojo::internal::String_Data> mime_type;
    mojo::internal::Pointer<::network::mojom::internal::LoadTimingInfo_Data> load_timing_info;
    mojo::internal::Pointer<mojo::internal::String_Data> alpn_negotiated_protocol;
    uint8_t is_secure_transport : 1;
    uint8_t is_validated : 1;
    uint8_t pad12_[7];
    mojo::internal::Pointer<mojo::internal::String_Data> normalized_server_timing;
    mojo::internal::Pointer<::network::mojom::internal::URLLoaderCompletionStatus_Data> completion_status;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_AddResourceTimingEntryForFailedSubframeNavigation_Params_Data>;

    LocalFrame_AddResourceTimingEntryForFailedSubframeNavigation_Params_Data();
    ~LocalFrame_AddResourceTimingEntryForFailedSubframeNavigation_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_AddResourceTimingEntryForFailedSubframeNavigation_Params_Data) == 120,
    "Bad sizeof(LocalFrame_AddResourceTimingEntryForFailedSubframeNavigation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_AnimateDoubleTapZoom_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> point;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> rect;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_AnimateDoubleTapZoom_Params_Data>;

    LocalMainFrame_AnimateDoubleTapZoom_Params_Data();
    ~LocalMainFrame_AnimateDoubleTapZoom_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_AnimateDoubleTapZoom_Params_Data) == 24, "Bad sizeof(LocalMainFrame_AnimateDoubleTapZoom_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_SetScaleFactor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    float scale;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_SetScaleFactor_Params_Data>;

    LocalMainFrame_SetScaleFactor_Params_Data();
    ~LocalMainFrame_SetScaleFactor_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_SetScaleFactor_Params_Data) == 16, "Bad sizeof(LocalMainFrame_SetScaleFactor_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_ClosePage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_ClosePage_Params_Data>;

    LocalMainFrame_ClosePage_Params_Data();
    ~LocalMainFrame_ClosePage_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_ClosePage_Params_Data) == 8, "Bad sizeof(LocalMainFrame_ClosePage_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_ClosePage_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_ClosePage_ResponseParams_Data>;

    LocalMainFrame_ClosePage_ResponseParams_Data();
    ~LocalMainFrame_ClosePage_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_ClosePage_ResponseParams_Data) == 8, "Bad sizeof(LocalMainFrame_ClosePage_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_GetFullPageSize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_GetFullPageSize_Params_Data>;

    LocalMainFrame_GetFullPageSize_Params_Data();
    ~LocalMainFrame_GetFullPageSize_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_GetFullPageSize_Params_Data) == 8, "Bad sizeof(LocalMainFrame_GetFullPageSize_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_GetFullPageSize_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> full_page_size;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_GetFullPageSize_ResponseParams_Data>;

    LocalMainFrame_GetFullPageSize_ResponseParams_Data();
    ~LocalMainFrame_GetFullPageSize_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_GetFullPageSize_ResponseParams_Data) == 16, "Bad sizeof(LocalMainFrame_GetFullPageSize_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_SetInitialFocus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t reverse : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_SetInitialFocus_Params_Data>;

    LocalMainFrame_SetInitialFocus_Params_Data();
    ~LocalMainFrame_SetInitialFocus_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_SetInitialFocus_Params_Data) == 16, "Bad sizeof(LocalMainFrame_SetInitialFocus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_EnablePreferredSizeChangedMode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_EnablePreferredSizeChangedMode_Params_Data>;

    LocalMainFrame_EnablePreferredSizeChangedMode_Params_Data();
    ~LocalMainFrame_EnablePreferredSizeChangedMode_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_EnablePreferredSizeChangedMode_Params_Data) == 8, "Bad sizeof(LocalMainFrame_EnablePreferredSizeChangedMode_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_ZoomToFindInPageRect_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> rect_in_root_frame;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_ZoomToFindInPageRect_Params_Data>;

    LocalMainFrame_ZoomToFindInPageRect_Params_Data();
    ~LocalMainFrame_ZoomToFindInPageRect_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_ZoomToFindInPageRect_Params_Data) == 16, "Bad sizeof(LocalMainFrame_ZoomToFindInPageRect_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_InstallCoopAccessMonitor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::blink::mojom::internal::FrameToken_Data accessed_window;
    mojo::internal::Pointer<::network::mojom::internal::CrossOriginOpenerPolicyReporterParams_Data> coop_reporter_info;
    uint8_t is_in_same_virtual_coop_related_group : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_InstallCoopAccessMonitor_Params_Data>;

    LocalMainFrame_InstallCoopAccessMonitor_Params_Data();
    ~LocalMainFrame_InstallCoopAccessMonitor_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_InstallCoopAccessMonitor_Params_Data) == 40, "Bad sizeof(LocalMainFrame_InstallCoopAccessMonitor_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_UpdateBrowserControlsState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t constraints;
    int32_t current;
    uint8_t animate : 1;
    uint8_t pad2_[7];
    mojo::internal::Pointer<::cc::mojom::internal::BrowserControlsOffsetTagsInfo_Data> offset_tags_info;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_UpdateBrowserControlsState_Params_Data>;

    LocalMainFrame_UpdateBrowserControlsState_Params_Data();
    ~LocalMainFrame_UpdateBrowserControlsState_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_UpdateBrowserControlsState_Params_Data) == 32, "Bad sizeof(LocalMainFrame_UpdateBrowserControlsState_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_SetV8CompileHints_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> data;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_SetV8CompileHints_Params_Data>;

    LocalMainFrame_SetV8CompileHints_Params_Data();
    ~LocalMainFrame_SetV8CompileHints_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_SetV8CompileHints_Params_Data) == 16, "Bad sizeof(LocalMainFrame_SetV8CompileHints_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_Discard_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_Discard_Params_Data>;

    LocalMainFrame_Discard_Params_Data();
    ~LocalMainFrame_Discard_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_Discard_Params_Data) == 8, "Bad sizeof(LocalMainFrame_Discard_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_FinalizeNavigationConfidence_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    double randomized_trigger_rate;
    int32_t confidence;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_FinalizeNavigationConfidence_Params_Data>;

    LocalMainFrame_FinalizeNavigationConfidence_Params_Data();
    ~LocalMainFrame_FinalizeNavigationConfidence_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_FinalizeNavigationConfidence_Params_Data) == 24, "Bad sizeof(LocalMainFrame_FinalizeNavigationConfidence_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_ScaleFactorChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    float scale;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_ScaleFactorChanged_Params_Data>;

    LocalMainFrameHost_ScaleFactorChanged_Params_Data();
    ~LocalMainFrameHost_ScaleFactorChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_ScaleFactorChanged_Params_Data) == 16, "Bad sizeof(LocalMainFrameHost_ScaleFactorChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_ContentsPreferredSizeChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> pref_size;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_ContentsPreferredSizeChanged_Params_Data>;

    LocalMainFrameHost_ContentsPreferredSizeChanged_Params_Data();
    ~LocalMainFrameHost_ContentsPreferredSizeChanged_Params_Data() = delete;
};
static_assert(
    sizeof(LocalMainFrameHost_ContentsPreferredSizeChanged_Params_Data) == 16, "Bad sizeof(LocalMainFrameHost_ContentsPreferredSizeChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_TextAutosizerPageInfoChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::TextAutosizerPageInfo_Data> page_info;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_TextAutosizerPageInfoChanged_Params_Data>;

    LocalMainFrameHost_TextAutosizerPageInfoChanged_Params_Data();
    ~LocalMainFrameHost_TextAutosizerPageInfoChanged_Params_Data() = delete;
};
static_assert(
    sizeof(LocalMainFrameHost_TextAutosizerPageInfoChanged_Params_Data) == 16, "Bad sizeof(LocalMainFrameHost_TextAutosizerPageInfoChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_FocusPage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_FocusPage_Params_Data>;

    LocalMainFrameHost_FocusPage_Params_Data();
    ~LocalMainFrameHost_FocusPage_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_FocusPage_Params_Data) == 8, "Bad sizeof(LocalMainFrameHost_FocusPage_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_TakeFocus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t reverse : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_TakeFocus_Params_Data>;

    LocalMainFrameHost_TakeFocus_Params_Data();
    ~LocalMainFrameHost_TakeFocus_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_TakeFocus_Params_Data) == 16, "Bad sizeof(LocalMainFrameHost_TakeFocus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_UpdateTargetURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_UpdateTargetURL_Params_Data>;

    LocalMainFrameHost_UpdateTargetURL_Params_Data();
    ~LocalMainFrameHost_UpdateTargetURL_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_UpdateTargetURL_Params_Data) == 16, "Bad sizeof(LocalMainFrameHost_UpdateTargetURL_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_UpdateTargetURL_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_UpdateTargetURL_ResponseParams_Data>;

    LocalMainFrameHost_UpdateTargetURL_ResponseParams_Data();
    ~LocalMainFrameHost_UpdateTargetURL_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_UpdateTargetURL_ResponseParams_Data) == 8, "Bad sizeof(LocalMainFrameHost_UpdateTargetURL_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_RequestClose_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_RequestClose_Params_Data>;

    LocalMainFrameHost_RequestClose_Params_Data();
    ~LocalMainFrameHost_RequestClose_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_RequestClose_Params_Data) == 8, "Bad sizeof(LocalMainFrameHost_RequestClose_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_ShowCreatedWindow_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::LocalFrameToken_Data> opener_frame_token;
    int32_t disposition;
    uint8_t opened_by_user_gesture : 1;
    uint8_t pad2_[3];
    mojo::internal::Pointer<::blink::mojom::internal::WindowFeatures_Data> window_features;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_ShowCreatedWindow_Params_Data>;

    LocalMainFrameHost_ShowCreatedWindow_Params_Data();
    ~LocalMainFrameHost_ShowCreatedWindow_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_ShowCreatedWindow_Params_Data) == 32, "Bad sizeof(LocalMainFrameHost_ShowCreatedWindow_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_ShowCreatedWindow_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_ShowCreatedWindow_ResponseParams_Data>;

    LocalMainFrameHost_ShowCreatedWindow_ResponseParams_Data();
    ~LocalMainFrameHost_ShowCreatedWindow_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_ShowCreatedWindow_ResponseParams_Data) == 8, "Bad sizeof(LocalMainFrameHost_ShowCreatedWindow_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_SetWindowRect_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> bounds;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_SetWindowRect_Params_Data>;

    LocalMainFrameHost_SetWindowRect_Params_Data();
    ~LocalMainFrameHost_SetWindowRect_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_SetWindowRect_Params_Data) == 16, "Bad sizeof(LocalMainFrameHost_SetWindowRect_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_SetWindowRect_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_SetWindowRect_ResponseParams_Data>;

    LocalMainFrameHost_SetWindowRect_ResponseParams_Data();
    ~LocalMainFrameHost_SetWindowRect_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_SetWindowRect_ResponseParams_Data) == 8, "Bad sizeof(LocalMainFrameHost_SetWindowRect_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_DidFirstVisuallyNonEmptyPaint_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_DidFirstVisuallyNonEmptyPaint_Params_Data>;

    LocalMainFrameHost_DidFirstVisuallyNonEmptyPaint_Params_Data();
    ~LocalMainFrameHost_DidFirstVisuallyNonEmptyPaint_Params_Data() = delete;
};
static_assert(
    sizeof(LocalMainFrameHost_DidFirstVisuallyNonEmptyPaint_Params_Data) == 8, "Bad sizeof(LocalMainFrameHost_DidFirstVisuallyNonEmptyPaint_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_DidAccessInitialMainDocument_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_DidAccessInitialMainDocument_Params_Data>;

    LocalMainFrameHost_DidAccessInitialMainDocument_Params_Data();
    ~LocalMainFrameHost_DidAccessInitialMainDocument_Params_Data() = delete;
};
static_assert(
    sizeof(LocalMainFrameHost_DidAccessInitialMainDocument_Params_Data) == 8, "Bad sizeof(LocalMainFrameHost_DidAccessInitialMainDocument_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_Maximize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_Maximize_Params_Data>;

    LocalMainFrameHost_Maximize_Params_Data();
    ~LocalMainFrameHost_Maximize_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_Maximize_Params_Data) == 8, "Bad sizeof(LocalMainFrameHost_Maximize_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_Minimize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_Minimize_Params_Data>;

    LocalMainFrameHost_Minimize_Params_Data();
    ~LocalMainFrameHost_Minimize_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_Minimize_Params_Data) == 8, "Bad sizeof(LocalMainFrameHost_Minimize_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_Restore_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_Restore_Params_Data>;

    LocalMainFrameHost_Restore_Params_Data();
    ~LocalMainFrameHost_Restore_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_Restore_Params_Data) == 8, "Bad sizeof(LocalMainFrameHost_Restore_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_SetResizable_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t resizable : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_SetResizable_Params_Data>;

    LocalMainFrameHost_SetResizable_Params_Data();
    ~LocalMainFrameHost_SetResizable_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_SetResizable_Params_Data) == 16, "Bad sizeof(LocalMainFrameHost_SetResizable_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_DraggableRegionsChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::blink::mojom::internal::DraggableRegion_Data>>> regions;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_DraggableRegionsChanged_Params_Data>;

    LocalMainFrameHost_DraggableRegionsChanged_Params_Data();
    ~LocalMainFrameHost_DraggableRegionsChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_DraggableRegionsChanged_Params_Data) == 16, "Bad sizeof(LocalMainFrameHost_DraggableRegionsChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_OnFirstContentfulPaint_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_OnFirstContentfulPaint_Params_Data>;

    LocalMainFrameHost_OnFirstContentfulPaint_Params_Data();
    ~LocalMainFrameHost_OnFirstContentfulPaint_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_OnFirstContentfulPaint_Params_Data) == 8, "Bad sizeof(LocalMainFrameHost_OnFirstContentfulPaint_Params_Data)");

} // namespace internal

class LocalFrameHost_EnterFullscreen_ParamsDataView {
public:
    LocalFrameHost_EnterFullscreen_ParamsDataView() = default;

    LocalFrameHost_EnterFullscreen_ParamsDataView(internal::LocalFrameHost_EnterFullscreen_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetOptionsDataView(::blink::mojom::FullscreenOptionsDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadOptions(UserType* output)
    {

        auto* pointer = data_->options.Get();
        return mojo::internal::Deserialize<::blink::mojom::FullscreenOptionsDataView>(pointer, output, message_);
    }

private:
    internal::LocalFrameHost_EnterFullscreen_Params_Data* data_ = nullptr;
