// third_party/blink/public/mojom/frame/remote_frame.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_FRAME_REMOTE_FRAME_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_FRAME_REMOTE_FRAME_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrameHost_SetInheritedEffectiveTouchAction_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t touch_action;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<RemoteFrameHost_SetInheritedEffectiveTouchAction_Params_Data>;

    RemoteFrameHost_SetInheritedEffectiveTouchAction_Params_Data();
    ~RemoteFrameHost_SetInheritedEffectiveTouchAction_Params_Data() = delete;
};
static_assert(
    sizeof(RemoteFrameHost_SetInheritedEffectiveTouchAction_Params_Data) == 16, "Bad sizeof(RemoteFrameHost_SetInheritedEffectiveTouchAction_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrameHost_UpdateRenderThrottlingStatus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_throttled : 1;
    uint8_t subtree_throttled : 1;
    uint8_t display_locked : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<RemoteFrameHost_UpdateRenderThrottlingStatus_Params_Data>;

    RemoteFrameHost_UpdateRenderThrottlingStatus_Params_Data();
    ~RemoteFrameHost_UpdateRenderThrottlingStatus_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrameHost_UpdateRenderThrottlingStatus_Params_Data) == 16, "Bad sizeof(RemoteFrameHost_UpdateRenderThrottlingStatus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrameHost_VisibilityChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t visibility;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<RemoteFrameHost_VisibilityChanged_Params_Data>;

    RemoteFrameHost_VisibilityChanged_Params_Data();
    ~RemoteFrameHost_VisibilityChanged_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrameHost_VisibilityChanged_Params_Data) == 16, "Bad sizeof(RemoteFrameHost_VisibilityChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrameHost_DidFocusFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RemoteFrameHost_DidFocusFrame_Params_Data>;

    RemoteFrameHost_DidFocusFrame_Params_Data();
    ~RemoteFrameHost_DidFocusFrame_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrameHost_DidFocusFrame_Params_Data) == 8, "Bad sizeof(RemoteFrameHost_DidFocusFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrameHost_CheckCompleted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RemoteFrameHost_CheckCompleted_Params_Data>;

    RemoteFrameHost_CheckCompleted_Params_Data();
    ~RemoteFrameHost_CheckCompleted_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrameHost_CheckCompleted_Params_Data) == 8, "Bad sizeof(RemoteFrameHost_CheckCompleted_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrameHost_CapturePaintPreviewOfCrossProcessSubframe_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> clip_rect;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> guid;

private:
    friend class mojo::internal::MessageFragment<RemoteFrameHost_CapturePaintPreviewOfCrossProcessSubframe_Params_Data>;

    RemoteFrameHost_CapturePaintPreviewOfCrossProcessSubframe_Params_Data();
    ~RemoteFrameHost_CapturePaintPreviewOfCrossProcessSubframe_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrameHost_CapturePaintPreviewOfCrossProcessSubframe_Params_Data) == 24,
    "Bad sizeof(RemoteFrameHost_CapturePaintPreviewOfCrossProcessSubframe_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrameHost_SetIsInert_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t inert : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<RemoteFrameHost_SetIsInert_Params_Data>;

    RemoteFrameHost_SetIsInert_Params_Data();
    ~RemoteFrameHost_SetIsInert_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrameHost_SetIsInert_Params_Data) == 16, "Bad sizeof(RemoteFrameHost_SetIsInert_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrameHost_DidChangeOpener_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::LocalFrameToken_Data> opener_frame;

private:
    friend class mojo::internal::MessageFragment<RemoteFrameHost_DidChangeOpener_Params_Data>;

    RemoteFrameHost_DidChangeOpener_Params_Data();
    ~RemoteFrameHost_DidChangeOpener_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrameHost_DidChangeOpener_Params_Data) == 16, "Bad sizeof(RemoteFrameHost_DidChangeOpener_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrameHost_AdvanceFocus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t focus_type;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::blink::mojom::internal::LocalFrameToken_Data> source_frame_token;

private:
    friend class mojo::internal::MessageFragment<RemoteFrameHost_AdvanceFocus_Params_Data>;

    RemoteFrameHost_AdvanceFocus_Params_Data();
    ~RemoteFrameHost_AdvanceFocus_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrameHost_AdvanceFocus_Params_Data) == 24, "Bad sizeof(RemoteFrameHost_AdvanceFocus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrameHost_RouteMessageEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::LocalFrameToken_Data> source_frame_token;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> source_origin;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> target_origin;
    mojo::internal::Pointer<::blink::mojom::internal::TransferableMessage_Data> message;

private:
    friend class mojo::internal::MessageFragment<RemoteFrameHost_RouteMessageEvent_Params_Data>;

    RemoteFrameHost_RouteMessageEvent_Params_Data();
    ~RemoteFrameHost_RouteMessageEvent_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrameHost_RouteMessageEvent_Params_Data) == 40, "Bad sizeof(RemoteFrameHost_RouteMessageEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrameHost_PrintCrossProcessSubframe_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> frame_content_rect;
    int32_t document_cookie;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<RemoteFrameHost_PrintCrossProcessSubframe_Params_Data>;

    RemoteFrameHost_PrintCrossProcessSubframe_Params_Data();
    ~RemoteFrameHost_PrintCrossProcessSubframe_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrameHost_PrintCrossProcessSubframe_Params_Data) == 24, "Bad sizeof(RemoteFrameHost_PrintCrossProcessSubframe_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrameHost_Detach_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RemoteFrameHost_Detach_Params_Data>;

    RemoteFrameHost_Detach_Params_Data();
    ~RemoteFrameHost_Detach_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrameHost_Detach_Params_Data) == 8, "Bad sizeof(RemoteFrameHost_Detach_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrameHost_UpdateViewportIntersection_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::ViewportIntersectionState_Data> intersection_state;
    mojo::internal::Pointer<::blink::mojom::internal::FrameVisualProperties_Data> visual_properties;

private:
    friend class mojo::internal::MessageFragment<RemoteFrameHost_UpdateViewportIntersection_Params_Data>;

    RemoteFrameHost_UpdateViewportIntersection_Params_Data();
    ~RemoteFrameHost_UpdateViewportIntersection_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrameHost_UpdateViewportIntersection_Params_Data) == 24, "Bad sizeof(RemoteFrameHost_UpdateViewportIntersection_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrameHost_SynchronizeVisualProperties_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FrameVisualProperties_Data> properties;

private:
    friend class mojo::internal::MessageFragment<RemoteFrameHost_SynchronizeVisualProperties_Params_Data>;

    RemoteFrameHost_SynchronizeVisualProperties_Params_Data();
    ~RemoteFrameHost_SynchronizeVisualProperties_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrameHost_SynchronizeVisualProperties_Params_Data) == 16, "Bad sizeof(RemoteFrameHost_SynchronizeVisualProperties_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrameHost_OpenURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::OpenURLParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<RemoteFrameHost_OpenURL_Params_Data>;

    RemoteFrameHost_OpenURL_Params_Data();
    ~RemoteFrameHost_OpenURL_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrameHost_OpenURL_Params_Data) == 16, "Bad sizeof(RemoteFrameHost_OpenURL_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_WillEnterFullscreen_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FullscreenOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_WillEnterFullscreen_Params_Data>;

    RemoteFrame_WillEnterFullscreen_Params_Data();
    ~RemoteFrame_WillEnterFullscreen_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_WillEnterFullscreen_Params_Data) == 16, "Bad sizeof(RemoteFrame_WillEnterFullscreen_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_EnforceInsecureNavigationsSet_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint32_t>> set;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_EnforceInsecureNavigationsSet_Params_Data>;

    RemoteFrame_EnforceInsecureNavigationsSet_Params_Data();
    ~RemoteFrame_EnforceInsecureNavigationsSet_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_EnforceInsecureNavigationsSet_Params_Data) == 16, "Bad sizeof(RemoteFrame_EnforceInsecureNavigationsSet_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_SetFrameOwnerProperties_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FrameOwnerProperties_Data> properties;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_SetFrameOwnerProperties_Params_Data>;

    RemoteFrame_SetFrameOwnerProperties_Params_Data();
    ~RemoteFrame_SetFrameOwnerProperties_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_SetFrameOwnerProperties_Params_Data) == 16, "Bad sizeof(RemoteFrame_SetFrameOwnerProperties_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_EnforceInsecureRequestPolicy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t policy;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_EnforceInsecureRequestPolicy_Params_Data>;

    RemoteFrame_EnforceInsecureRequestPolicy_Params_Data();
    ~RemoteFrame_EnforceInsecureRequestPolicy_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_EnforceInsecureRequestPolicy_Params_Data) == 16, "Bad sizeof(RemoteFrame_EnforceInsecureRequestPolicy_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_SetReplicatedOrigin_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> origin;
    uint8_t is_potentially_trustworthy_unique_origin : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_SetReplicatedOrigin_Params_Data>;

    RemoteFrame_SetReplicatedOrigin_Params_Data();
    ~RemoteFrame_SetReplicatedOrigin_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_SetReplicatedOrigin_Params_Data) == 24, "Bad sizeof(RemoteFrame_SetReplicatedOrigin_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_SetReplicatedIsAdFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_ad_frame : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_SetReplicatedIsAdFrame_Params_Data>;

    RemoteFrame_SetReplicatedIsAdFrame_Params_Data();
    ~RemoteFrame_SetReplicatedIsAdFrame_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_SetReplicatedIsAdFrame_Params_Data) == 16, "Bad sizeof(RemoteFrame_SetReplicatedIsAdFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_SetReplicatedName_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> name;
    mojo::internal::Pointer<mojo::internal::String_Data> unique_name;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_SetReplicatedName_Params_Data>;

    RemoteFrame_SetReplicatedName_Params_Data();
    ~RemoteFrame_SetReplicatedName_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_SetReplicatedName_Params_Data) == 24, "Bad sizeof(RemoteFrame_SetReplicatedName_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_DispatchLoadEventForFrameOwner_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_DispatchLoadEventForFrameOwner_Params_Data>;

    RemoteFrame_DispatchLoadEventForFrameOwner_Params_Data();
    ~RemoteFrame_DispatchLoadEventForFrameOwner_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_DispatchLoadEventForFrameOwner_Params_Data) == 8, "Bad sizeof(RemoteFrame_DispatchLoadEventForFrameOwner_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_SetNeedsOcclusionTracking_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t needs_tracking : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_SetNeedsOcclusionTracking_Params_Data>;

    RemoteFrame_SetNeedsOcclusionTracking_Params_Data();
    ~RemoteFrame_SetNeedsOcclusionTracking_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_SetNeedsOcclusionTracking_Params_Data) == 16, "Bad sizeof(RemoteFrame_SetNeedsOcclusionTracking_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_Collapse_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t collapsed : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_Collapse_Params_Data>;

    RemoteFrame_Collapse_Params_Data();
    ~RemoteFrame_Collapse_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_Collapse_Params_Data) == 16, "Bad sizeof(RemoteFrame_Collapse_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_Focus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_Focus_Params_Data>;

    RemoteFrame_Focus_Params_Data();
    ~RemoteFrame_Focus_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_Focus_Params_Data) == 8, "Bad sizeof(RemoteFrame_Focus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_SetHadStickyUserActivationBeforeNavigation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t has_gesture : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_SetHadStickyUserActivationBeforeNavigation_Params_Data>;

    RemoteFrame_SetHadStickyUserActivationBeforeNavigation_Params_Data();
    ~RemoteFrame_SetHadStickyUserActivationBeforeNavigation_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_SetHadStickyUserActivationBeforeNavigation_Params_Data) == 16,
    "Bad sizeof(RemoteFrame_SetHadStickyUserActivationBeforeNavigation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_BubbleLogicalScroll_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t direction;
    int32_t granularity;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_BubbleLogicalScroll_Params_Data>;

    RemoteFrame_BubbleLogicalScroll_Params_Data();
    ~RemoteFrame_BubbleLogicalScroll_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_BubbleLogicalScroll_Params_Data) == 16, "Bad sizeof(RemoteFrame_BubbleLogicalScroll_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_UpdateUserActivationState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t state_update_type;
    int32_t notification_type;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_UpdateUserActivationState_Params_Data>;

    RemoteFrame_UpdateUserActivationState_Params_Data();
    ~RemoteFrame_UpdateUserActivationState_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_UpdateUserActivationState_Params_Data) == 16, "Bad sizeof(RemoteFrame_UpdateUserActivationState_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_SetEmbeddingToken_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> embedding_token;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_SetEmbeddingToken_Params_Data>;

    RemoteFrame_SetEmbeddingToken_Params_Data();
    ~RemoteFrame_SetEmbeddingToken_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_SetEmbeddingToken_Params_Data) == 16, "Bad sizeof(RemoteFrame_SetEmbeddingToken_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_SetPageFocus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_focused : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_SetPageFocus_Params_Data>;

    RemoteFrame_SetPageFocus_Params_Data();
    ~RemoteFrame_SetPageFocus_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_SetPageFocus_Params_Data) == 16, "Bad sizeof(RemoteFrame_SetPageFocus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_RenderFallbackContent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_RenderFallbackContent_Params_Data>;

    RemoteFrame_RenderFallbackContent_Params_Data();
    ~RemoteFrame_RenderFallbackContent_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_RenderFallbackContent_Params_Data) == 8, "Bad sizeof(RemoteFrame_RenderFallbackContent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_AddResourceTimingFromChild_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::ResourceTimingInfo_Data> timing;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_AddResourceTimingFromChild_Params_Data>;

    RemoteFrame_AddResourceTimingFromChild_Params_Data();
    ~RemoteFrame_AddResourceTimingFromChild_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_AddResourceTimingFromChild_Params_Data) == 16, "Bad sizeof(RemoteFrame_AddResourceTimingFromChild_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_ScrollRectToVisible_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> rect;
    mojo::internal::Pointer<::blink::mojom::internal::ScrollIntoViewParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_ScrollRectToVisible_Params_Data>;

    RemoteFrame_ScrollRectToVisible_Params_Data();
    ~RemoteFrame_ScrollRectToVisible_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_ScrollRectToVisible_Params_Data) == 24, "Bad sizeof(RemoteFrame_ScrollRectToVisible_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_DidStartLoading_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_DidStartLoading_Params_Data>;

    RemoteFrame_DidStartLoading_Params_Data();
    ~RemoteFrame_DidStartLoading_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_DidStartLoading_Params_Data) == 8, "Bad sizeof(RemoteFrame_DidStartLoading_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_DidStopLoading_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_DidStopLoading_Params_Data>;

    RemoteFrame_DidStopLoading_Params_Data();
    ~RemoteFrame_DidStopLoading_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_DidStopLoading_Params_Data) == 8, "Bad sizeof(RemoteFrame_DidStopLoading_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_IntrinsicSizingInfoOfChildChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::IntrinsicSizingInfo_Data> sizing_info;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_IntrinsicSizingInfoOfChildChanged_Params_Data>;

    RemoteFrame_IntrinsicSizingInfoOfChildChanged_Params_Data();
    ~RemoteFrame_IntrinsicSizingInfoOfChildChanged_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_IntrinsicSizingInfoOfChildChanged_Params_Data) == 16, "Bad sizeof(RemoteFrame_IntrinsicSizingInfoOfChildChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_DidSetFramePolicyHeaders_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t sandbox_flags;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::blink::mojom::internal::ParsedPermissionsPolicyDeclaration_Data>>>
        parsed_permissions_policy;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_DidSetFramePolicyHeaders_Params_Data>;

    RemoteFrame_DidSetFramePolicyHeaders_Params_Data();
    ~RemoteFrame_DidSetFramePolicyHeaders_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_DidSetFramePolicyHeaders_Params_Data) == 24, "Bad sizeof(RemoteFrame_DidSetFramePolicyHeaders_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_DidUpdateFramePolicy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FramePolicy_Data> frame_policy;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_DidUpdateFramePolicy_Params_Data>;

    RemoteFrame_DidUpdateFramePolicy_Params_Data();
    ~RemoteFrame_DidUpdateFramePolicy_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_DidUpdateFramePolicy_Params_Data) == 16, "Bad sizeof(RemoteFrame_DidUpdateFramePolicy_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_UpdateOpener_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::blink::mojom::internal::FrameToken_Data opener_frame_token;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_UpdateOpener_Params_Data>;

    RemoteFrame_UpdateOpener_Params_Data();
    ~RemoteFrame_UpdateOpener_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_UpdateOpener_Params_Data) == 24, "Bad sizeof(RemoteFrame_UpdateOpener_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_DetachAndDispose_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_DetachAndDispose_Params_Data>;

    RemoteFrame_DetachAndDispose_Params_Data();
    ~RemoteFrame_DetachAndDispose_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_DetachAndDispose_Params_Data) == 8, "Bad sizeof(RemoteFrame_DetachAndDispose_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_EnableAutoResize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> min_size;
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> max_size;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_EnableAutoResize_Params_Data>;

    RemoteFrame_EnableAutoResize_Params_Data();
    ~RemoteFrame_EnableAutoResize_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_EnableAutoResize_Params_Data) == 24, "Bad sizeof(RemoteFrame_EnableAutoResize_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_DisableAutoResize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_DisableAutoResize_Params_Data>;

    RemoteFrame_DisableAutoResize_Params_Data();
    ~RemoteFrame_DisableAutoResize_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_DisableAutoResize_Params_Data) == 8, "Bad sizeof(RemoteFrame_DisableAutoResize_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_DidUpdateVisualProperties_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::cc::mojom::internal::RenderFrameMetadata_Data> metadata;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_DidUpdateVisualProperties_Params_Data>;

    RemoteFrame_DidUpdateVisualProperties_Params_Data();
    ~RemoteFrame_DidUpdateVisualProperties_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_DidUpdateVisualProperties_Params_Data) == 16, "Bad sizeof(RemoteFrame_DidUpdateVisualProperties_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_SetFrameSinkId_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> frame_sink_id;
    uint8_t allow_paint_holding : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_SetFrameSinkId_Params_Data>;

    RemoteFrame_SetFrameSinkId_Params_Data();
    ~RemoteFrame_SetFrameSinkId_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_SetFrameSinkId_Params_Data) == 24, "Bad sizeof(RemoteFrame_SetFrameSinkId_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_ChildProcessGone_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_ChildProcessGone_Params_Data>;

    RemoteFrame_ChildProcessGone_Params_Data();
    ~RemoteFrame_ChildProcessGone_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_ChildProcessGone_Params_Data) == 8, "Bad sizeof(RemoteFrame_ChildProcessGone_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_CreateRemoteChild_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameToken_Data> token;
    ::blink::mojom::internal::FrameToken_Data opener_frame_token;
    int32_t tree_scope_type;
    uint8_t is_loading : 1;
    uint8_t pad3_[3];
    mojo::internal::Pointer<::blink::mojom::internal::FrameReplicationState_Data> replication_state;
    mojo::internal::Pointer<::blink::mojom::internal::FrameOwnerProperties_Data> owner_properties;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> devtools_frame_token;
    mojo::internal::Pointer<internal::RemoteFrameInterfacesFromBrowser_Data> remote_frame_interfaces;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_CreateRemoteChild_Params_Data>;

    RemoteFrame_CreateRemoteChild_Params_Data();
    ~RemoteFrame_CreateRemoteChild_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_CreateRemoteChild_Params_Data) == 72, "Bad sizeof(RemoteFrame_CreateRemoteChild_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_CreateRemoteChildren_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::CreateRemoteChildParams_Data>>> params;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_CreateRemoteChildren_Params_Data>;

    RemoteFrame_CreateRemoteChildren_Params_Data();
    ~RemoteFrame_CreateRemoteChildren_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_CreateRemoteChildren_Params_Data) == 16, "Bad sizeof(RemoteFrame_CreateRemoteChildren_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteFrame_ForwardFencedFrameEventToEmbedder_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> event_type;

private:
    friend class mojo::internal::MessageFragment<RemoteFrame_ForwardFencedFrameEventToEmbedder_Params_Data>;

    RemoteFrame_ForwardFencedFrameEventToEmbedder_Params_Data();
    ~RemoteFrame_ForwardFencedFrameEventToEmbedder_Params_Data() = delete;
};
static_assert(sizeof(RemoteFrame_ForwardFencedFrameEventToEmbedder_Params_Data) == 16, "Bad sizeof(RemoteFrame_ForwardFencedFrameEventToEmbedder_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteMainFrame_UpdateTextAutosizerPageInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::TextAutosizerPageInfo_Data> page_info;

private:
    friend class mojo::internal::MessageFragment<RemoteMainFrame_UpdateTextAutosizerPageInfo_Params_Data>;

    RemoteMainFrame_UpdateTextAutosizerPageInfo_Params_Data();
    ~RemoteMainFrame_UpdateTextAutosizerPageInfo_Params_Data() = delete;
};
static_assert(sizeof(RemoteMainFrame_UpdateTextAutosizerPageInfo_Params_Data) == 16, "Bad sizeof(RemoteMainFrame_UpdateTextAutosizerPageInfo_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteMainFrameHost_FocusPage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RemoteMainFrameHost_FocusPage_Params_Data>;

    RemoteMainFrameHost_FocusPage_Params_Data();
    ~RemoteMainFrameHost_FocusPage_Params_Data() = delete;
};
static_assert(sizeof(RemoteMainFrameHost_FocusPage_Params_Data) == 8, "Bad sizeof(RemoteMainFrameHost_FocusPage_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteMainFrameHost_TakeFocus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t reverse : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<RemoteMainFrameHost_TakeFocus_Params_Data>;

    RemoteMainFrameHost_TakeFocus_Params_Data();
    ~RemoteMainFrameHost_TakeFocus_Params_Data() = delete;
};
static_assert(sizeof(RemoteMainFrameHost_TakeFocus_Params_Data) == 16, "Bad sizeof(RemoteMainFrameHost_TakeFocus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteMainFrameHost_UpdateTargetURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<RemoteMainFrameHost_UpdateTargetURL_Params_Data>;

    RemoteMainFrameHost_UpdateTargetURL_Params_Data();
    ~RemoteMainFrameHost_UpdateTargetURL_Params_Data() = delete;
};
static_assert(sizeof(RemoteMainFrameHost_UpdateTargetURL_Params_Data) == 16, "Bad sizeof(RemoteMainFrameHost_UpdateTargetURL_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteMainFrameHost_UpdateTargetURL_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RemoteMainFrameHost_UpdateTargetURL_ResponseParams_Data>;

    RemoteMainFrameHost_UpdateTargetURL_ResponseParams_Data();
    ~RemoteMainFrameHost_UpdateTargetURL_ResponseParams_Data() = delete;
};
static_assert(sizeof(RemoteMainFrameHost_UpdateTargetURL_ResponseParams_Data) == 8, "Bad sizeof(RemoteMainFrameHost_UpdateTargetURL_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) RemoteMainFrameHost_RouteCloseEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<RemoteMainFrameHost_RouteCloseEvent_Params_Data>;

    RemoteMainFrameHost_RouteCloseEvent_Params_Data();
    ~RemoteMainFrameHost_RouteCloseEvent_Params_Data() = delete;
};
static_assert(sizeof(RemoteMainFrameHost_RouteCloseEvent_Params_Data) == 8, "Bad sizeof(RemoteMainFrameHost_RouteCloseEvent_Params_Data)");

} // namespace internal

class RemoteFrameHost_SetInheritedEffectiveTouchAction_ParamsDataView {
public:
    RemoteFrameHost_SetInheritedEffectiveTouchAction_ParamsDataView() = default;

    RemoteFrameHost_SetInheritedEffectiveTouchAction_ParamsDataView(
        internal::RemoteFrameHost_SetInheritedEffectiveTouchAction_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> [[nodiscard]] bool ReadTouchAction(UserType* output) const
    {
        auto data_value = data_->touch_action;
        return mojo::internal::Deserialize<::cc::mojom::TouchAction>(data_value, output);
    }
    ::cc::mojom::TouchAction touch_action() const
    {
