// services/viz/public/mojom/compositing/compositor_frame_sink.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_VIZ_PUBLIC_MOJOM_COMPOSITING_COMPOSITOR_FRAME_SINK_MOJOM_PARAMS_DATA_H_
#define SERVICES_VIZ_PUBLIC_MOJOM_COMPOSITING_COMPOSITOR_FRAME_SINK_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace viz::mojom {
namespace internal {
class CompositorFrameSink_SetNeedsBeginFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t needs_begin_frame : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<CompositorFrameSink_SetNeedsBeginFrame_Params_Data>;

    CompositorFrameSink_SetNeedsBeginFrame_Params_Data();
    ~CompositorFrameSink_SetNeedsBeginFrame_Params_Data() = delete;
};
static_assert(sizeof(CompositorFrameSink_SetNeedsBeginFrame_Params_Data) == 16, "Bad sizeof(CompositorFrameSink_SetNeedsBeginFrame_Params_Data)");
class CompositorFrameSink_SetWantsAnimateOnlyBeginFrames_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CompositorFrameSink_SetWantsAnimateOnlyBeginFrames_Params_Data>;

    CompositorFrameSink_SetWantsAnimateOnlyBeginFrames_Params_Data();
    ~CompositorFrameSink_SetWantsAnimateOnlyBeginFrames_Params_Data() = delete;
};
static_assert(
    sizeof(CompositorFrameSink_SetWantsAnimateOnlyBeginFrames_Params_Data) == 8, "Bad sizeof(CompositorFrameSink_SetWantsAnimateOnlyBeginFrames_Params_Data)");
class CompositorFrameSink_SetWantsBeginFrameAcks_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CompositorFrameSink_SetWantsBeginFrameAcks_Params_Data>;

    CompositorFrameSink_SetWantsBeginFrameAcks_Params_Data();
    ~CompositorFrameSink_SetWantsBeginFrameAcks_Params_Data() = delete;
};
static_assert(sizeof(CompositorFrameSink_SetWantsBeginFrameAcks_Params_Data) == 8, "Bad sizeof(CompositorFrameSink_SetWantsBeginFrameAcks_Params_Data)");
class CompositorFrameSink_SetAutoNeedsBeginFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CompositorFrameSink_SetAutoNeedsBeginFrame_Params_Data>;

    CompositorFrameSink_SetAutoNeedsBeginFrame_Params_Data();
    ~CompositorFrameSink_SetAutoNeedsBeginFrame_Params_Data() = delete;
};
static_assert(sizeof(CompositorFrameSink_SetAutoNeedsBeginFrame_Params_Data) == 8, "Bad sizeof(CompositorFrameSink_SetAutoNeedsBeginFrame_Params_Data)");
class CompositorFrameSink_SubmitCompositorFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::LocalSurfaceId_Data> local_surface_id;
    mojo::internal::Pointer<::viz::mojom::internal::CompositorFrame_Data> frame;
    mojo::internal::Pointer<::viz::mojom::internal::HitTestRegionList_Data> hit_test_region_list;
    uint64_t submit_time;

private:
    friend class mojo::internal::MessageFragment<CompositorFrameSink_SubmitCompositorFrame_Params_Data>;

    CompositorFrameSink_SubmitCompositorFrame_Params_Data();
    ~CompositorFrameSink_SubmitCompositorFrame_Params_Data() = delete;
};
static_assert(sizeof(CompositorFrameSink_SubmitCompositorFrame_Params_Data) == 40, "Bad sizeof(CompositorFrameSink_SubmitCompositorFrame_Params_Data)");
class CompositorFrameSink_SubmitCompositorFrameSync_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::LocalSurfaceId_Data> local_surface_id;
    mojo::internal::Pointer<::viz::mojom::internal::CompositorFrame_Data> frame;
    mojo::internal::Pointer<::viz::mojom::internal::HitTestRegionList_Data> hit_test_region_list;
    uint64_t submit_time;

private:
    friend class mojo::internal::MessageFragment<CompositorFrameSink_SubmitCompositorFrameSync_Params_Data>;

    CompositorFrameSink_SubmitCompositorFrameSync_Params_Data();
    ~CompositorFrameSink_SubmitCompositorFrameSync_Params_Data() = delete;
};
static_assert(sizeof(CompositorFrameSink_SubmitCompositorFrameSync_Params_Data) == 40, "Bad sizeof(CompositorFrameSink_SubmitCompositorFrameSync_Params_Data)");
class CompositorFrameSink_SubmitCompositorFrameSync_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::viz::mojom::internal::ReturnedResource_Data>>> resources;

private:
    friend class mojo::internal::MessageFragment<CompositorFrameSink_SubmitCompositorFrameSync_ResponseParams_Data>;

    CompositorFrameSink_SubmitCompositorFrameSync_ResponseParams_Data();
    ~CompositorFrameSink_SubmitCompositorFrameSync_ResponseParams_Data() = delete;
};
static_assert(sizeof(CompositorFrameSink_SubmitCompositorFrameSync_ResponseParams_Data) == 16,
    "Bad sizeof(CompositorFrameSink_SubmitCompositorFrameSync_ResponseParams_Data)");
class CompositorFrameSink_DidNotProduceFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::BeginFrameAck_Data> ack;

private:
    friend class mojo::internal::MessageFragment<CompositorFrameSink_DidNotProduceFrame_Params_Data>;

    CompositorFrameSink_DidNotProduceFrame_Params_Data();
    ~CompositorFrameSink_DidNotProduceFrame_Params_Data() = delete;
};
static_assert(sizeof(CompositorFrameSink_DidNotProduceFrame_Params_Data) == 16, "Bad sizeof(CompositorFrameSink_DidNotProduceFrame_Params_Data)");
class CompositorFrameSink_DidAllocateSharedBitmap_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> region;
    mojo::internal::Pointer<::viz::mojom::internal::SharedBitmapId_Data> id;

private:
    friend class mojo::internal::MessageFragment<CompositorFrameSink_DidAllocateSharedBitmap_Params_Data>;

    CompositorFrameSink_DidAllocateSharedBitmap_Params_Data();
    ~CompositorFrameSink_DidAllocateSharedBitmap_Params_Data() = delete;
};
static_assert(sizeof(CompositorFrameSink_DidAllocateSharedBitmap_Params_Data) == 24, "Bad sizeof(CompositorFrameSink_DidAllocateSharedBitmap_Params_Data)");
class CompositorFrameSink_DidDeleteSharedBitmap_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::SharedBitmapId_Data> id;

private:
    friend class mojo::internal::MessageFragment<CompositorFrameSink_DidDeleteSharedBitmap_Params_Data>;

    CompositorFrameSink_DidDeleteSharedBitmap_Params_Data();
    ~CompositorFrameSink_DidDeleteSharedBitmap_Params_Data() = delete;
};
static_assert(sizeof(CompositorFrameSink_DidDeleteSharedBitmap_Params_Data) == 16, "Bad sizeof(CompositorFrameSink_DidDeleteSharedBitmap_Params_Data)");
class CompositorFrameSink_InitializeCompositorFrameSinkType_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CompositorFrameSink_InitializeCompositorFrameSinkType_Params_Data>;

    CompositorFrameSink_InitializeCompositorFrameSinkType_Params_Data();
    ~CompositorFrameSink_InitializeCompositorFrameSinkType_Params_Data() = delete;
};
static_assert(sizeof(CompositorFrameSink_InitializeCompositorFrameSinkType_Params_Data) == 16,
    "Bad sizeof(CompositorFrameSink_InitializeCompositorFrameSinkType_Params_Data)");
class CompositorFrameSink_BindLayerContext_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::PendingLayerContext_Data> context;

private:
    friend class mojo::internal::MessageFragment<CompositorFrameSink_BindLayerContext_Params_Data>;

    CompositorFrameSink_BindLayerContext_Params_Data();
    ~CompositorFrameSink_BindLayerContext_Params_Data() = delete;
};
static_assert(sizeof(CompositorFrameSink_BindLayerContext_Params_Data) == 16, "Bad sizeof(CompositorFrameSink_BindLayerContext_Params_Data)");
class CompositorFrameSinkClient_DidReceiveCompositorFrameAck_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::viz::mojom::internal::ReturnedResource_Data>>> resources;

private:
    friend class mojo::internal::MessageFragment<CompositorFrameSinkClient_DidReceiveCompositorFrameAck_Params_Data>;

    CompositorFrameSinkClient_DidReceiveCompositorFrameAck_Params_Data();
    ~CompositorFrameSinkClient_DidReceiveCompositorFrameAck_Params_Data() = delete;
};
static_assert(sizeof(CompositorFrameSinkClient_DidReceiveCompositorFrameAck_Params_Data) == 16,
    "Bad sizeof(CompositorFrameSinkClient_DidReceiveCompositorFrameAck_Params_Data)");
class CompositorFrameSinkClient_OnBeginFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::BeginFrameArgs_Data> args;
    mojo::internal::Pointer<mojo::internal::Map_Data<uint32_t, mojo::internal::Pointer<::viz::mojom::internal::FrameTimingDetails_Data>>> details;
    uint8_t frame_ack : 1;
    uint8_t pad2_[7];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::viz::mojom::internal::ReturnedResource_Data>>> resources;

private:
    friend class mojo::internal::MessageFragment<CompositorFrameSinkClient_OnBeginFrame_Params_Data>;

    CompositorFrameSinkClient_OnBeginFrame_Params_Data();
    ~CompositorFrameSinkClient_OnBeginFrame_Params_Data() = delete;
};
static_assert(sizeof(CompositorFrameSinkClient_OnBeginFrame_Params_Data) == 40, "Bad sizeof(CompositorFrameSinkClient_OnBeginFrame_Params_Data)");
class CompositorFrameSinkClient_OnBeginFramePausedChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t paused : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<CompositorFrameSinkClient_OnBeginFramePausedChanged_Params_Data>;

    CompositorFrameSinkClient_OnBeginFramePausedChanged_Params_Data();
    ~CompositorFrameSinkClient_OnBeginFramePausedChanged_Params_Data() = delete;
};
static_assert(sizeof(CompositorFrameSinkClient_OnBeginFramePausedChanged_Params_Data) == 16,
    "Bad sizeof(CompositorFrameSinkClient_OnBeginFramePausedChanged_Params_Data)");
class CompositorFrameSinkClient_ReclaimResources_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::viz::mojom::internal::ReturnedResource_Data>>> resources;

private:
    friend class mojo::internal::MessageFragment<CompositorFrameSinkClient_ReclaimResources_Params_Data>;

    CompositorFrameSinkClient_ReclaimResources_Params_Data();
    ~CompositorFrameSinkClient_ReclaimResources_Params_Data() = delete;
};
static_assert(sizeof(CompositorFrameSinkClient_ReclaimResources_Params_Data) == 16, "Bad sizeof(CompositorFrameSinkClient_ReclaimResources_Params_Data)");
class CompositorFrameSinkClient_OnCompositorFrameTransitionDirectiveProcessed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t sequence_id;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CompositorFrameSinkClient_OnCompositorFrameTransitionDirectiveProcessed_Params_Data>;

    CompositorFrameSinkClient_OnCompositorFrameTransitionDirectiveProcessed_Params_Data();
    ~CompositorFrameSinkClient_OnCompositorFrameTransitionDirectiveProcessed_Params_Data() = delete;
};
static_assert(sizeof(CompositorFrameSinkClient_OnCompositorFrameTransitionDirectiveProcessed_Params_Data) == 16,
    "Bad sizeof(CompositorFrameSinkClient_OnCompositorFrameTransitionDirectiveProcessed_Params_Data)");
class CompositorFrameSinkClient_OnSurfaceEvicted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::viz::mojom::internal::LocalSurfaceId_Data> local_surface_id;

private:
    friend class mojo::internal::MessageFragment<CompositorFrameSinkClient_OnSurfaceEvicted_Params_Data>;

    CompositorFrameSinkClient_OnSurfaceEvicted_Params_Data();
    ~CompositorFrameSinkClient_OnSurfaceEvicted_Params_Data() = delete;
};
static_assert(sizeof(CompositorFrameSinkClient_OnSurfaceEvicted_Params_Data) == 16, "Bad sizeof(CompositorFrameSinkClient_OnSurfaceEvicted_Params_Data)");

} // namespace internal

class CompositorFrameSink_SetNeedsBeginFrame_ParamsDataView {
public:
    CompositorFrameSink_SetNeedsBeginFrame_ParamsDataView() = default;

    CompositorFrameSink_SetNeedsBeginFrame_ParamsDataView(internal::CompositorFrameSink_SetNeedsBeginFrame_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    bool needs_begin_frame() const
    {
        return data_->needs_begin_frame;
    }

private:
    internal::CompositorFrameSink_SetNeedsBeginFrame_Params_Data* data_ = nullptr;
};

class CompositorFrameSink_SetWantsAnimateOnlyBeginFrames_ParamsDataView {
public:
    CompositorFrameSink_SetWantsAnimateOnlyBeginFrames_ParamsDataView() = default;

    CompositorFrameSink_SetWantsAnimateOnlyBeginFrames_ParamsDataView(
