// components/web_package/mojom/web_bundle_parser.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_WEB_PACKAGE_MOJOM_WEB_BUNDLE_PARSER_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_WEB_PACKAGE_MOJOM_WEB_BUNDLE_PARSER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace web_package::mojom {
namespace internal {
class WebBundleParserFactory_GetParserForDataSource_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> base_url;
    mojo::internal::Interface_Data data_source;

private:
    friend class mojo::internal::MessageFragment<WebBundleParserFactory_GetParserForDataSource_Params_Data>;

    WebBundleParserFactory_GetParserForDataSource_Params_Data();
    ~WebBundleParserFactory_GetParserForDataSource_Params_Data() = delete;
};
static_assert(sizeof(WebBundleParserFactory_GetParserForDataSource_Params_Data) == 32, "Bad sizeof(WebBundleParserFactory_GetParserForDataSource_Params_Data)");
class WebBundleParserFactory_BindFileDataSource_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data data_source;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyFile_Data> file;

private:
    friend class mojo::internal::MessageFragment<WebBundleParserFactory_BindFileDataSource_Params_Data>;

    WebBundleParserFactory_BindFileDataSource_Params_Data();
    ~WebBundleParserFactory_BindFileDataSource_Params_Data() = delete;
};
static_assert(sizeof(WebBundleParserFactory_BindFileDataSource_Params_Data) == 24, "Bad sizeof(WebBundleParserFactory_BindFileDataSource_Params_Data)");
class WebBundleParser_ParseIntegrityBlock_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WebBundleParser_ParseIntegrityBlock_Params_Data>;

    WebBundleParser_ParseIntegrityBlock_Params_Data();
    ~WebBundleParser_ParseIntegrityBlock_Params_Data() = delete;
};
static_assert(sizeof(WebBundleParser_ParseIntegrityBlock_Params_Data) == 8, "Bad sizeof(WebBundleParser_ParseIntegrityBlock_Params_Data)");
class WebBundleParser_ParseIntegrityBlock_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::BundleIntegrityBlock_Data> Result;
    mojo::internal::Pointer<internal::BundleIntegrityBlockParseError_Data> error;

private:
    friend class mojo::internal::MessageFragment<WebBundleParser_ParseIntegrityBlock_ResponseParams_Data>;

    WebBundleParser_ParseIntegrityBlock_ResponseParams_Data();
    ~WebBundleParser_ParseIntegrityBlock_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebBundleParser_ParseIntegrityBlock_ResponseParams_Data) == 24, "Bad sizeof(WebBundleParser_ParseIntegrityBlock_ResponseParams_Data)");
class WebBundleParser_ParseMetadata_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t offset_$flag : 1;
    uint8_t pad0_[7];
    uint64_t offset_$value;

private:
    friend class mojo::internal::MessageFragment<WebBundleParser_ParseMetadata_Params_Data>;

    WebBundleParser_ParseMetadata_Params_Data();
    ~WebBundleParser_ParseMetadata_Params_Data() = delete;
};
static_assert(sizeof(WebBundleParser_ParseMetadata_Params_Data) == 24, "Bad sizeof(WebBundleParser_ParseMetadata_Params_Data)");
class WebBundleParser_ParseMetadata_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::BundleMetadata_Data> Result;
    mojo::internal::Pointer<internal::BundleMetadataParseError_Data> error;

private:
    friend class mojo::internal::MessageFragment<WebBundleParser_ParseMetadata_ResponseParams_Data>;

    WebBundleParser_ParseMetadata_ResponseParams_Data();
    ~WebBundleParser_ParseMetadata_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebBundleParser_ParseMetadata_ResponseParams_Data) == 24, "Bad sizeof(WebBundleParser_ParseMetadata_ResponseParams_Data)");
class WebBundleParser_ParseResponse_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t response_offset;
    uint64_t response_length;

private:
    friend class mojo::internal::MessageFragment<WebBundleParser_ParseResponse_Params_Data>;

    WebBundleParser_ParseResponse_Params_Data();
    ~WebBundleParser_ParseResponse_Params_Data() = delete;
};
static_assert(sizeof(WebBundleParser_ParseResponse_Params_Data) == 24, "Bad sizeof(WebBundleParser_ParseResponse_Params_Data)");
class WebBundleParser_ParseResponse_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::BundleResponse_Data> Result;
    mojo::internal::Pointer<internal::BundleResponseParseError_Data> error;

private:
    friend class mojo::internal::MessageFragment<WebBundleParser_ParseResponse_ResponseParams_Data>;

    WebBundleParser_ParseResponse_ResponseParams_Data();
    ~WebBundleParser_ParseResponse_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebBundleParser_ParseResponse_ResponseParams_Data) == 24, "Bad sizeof(WebBundleParser_ParseResponse_ResponseParams_Data)");
class WebBundleParser_Close_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WebBundleParser_Close_Params_Data>;

    WebBundleParser_Close_Params_Data();
    ~WebBundleParser_Close_Params_Data() = delete;
};
static_assert(sizeof(WebBundleParser_Close_Params_Data) == 8, "Bad sizeof(WebBundleParser_Close_Params_Data)");
class WebBundleParser_Close_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WebBundleParser_Close_ResponseParams_Data>;

    WebBundleParser_Close_ResponseParams_Data();
    ~WebBundleParser_Close_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebBundleParser_Close_ResponseParams_Data) == 8, "Bad sizeof(WebBundleParser_Close_ResponseParams_Data)");
class BundleDataSource_Read_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t offset;
    uint64_t length;

private:
    friend class mojo::internal::MessageFragment<BundleDataSource_Read_Params_Data>;

    BundleDataSource_Read_Params_Data();
    ~BundleDataSource_Read_Params_Data() = delete;
};
static_assert(sizeof(BundleDataSource_Read_Params_Data) == 24, "Bad sizeof(BundleDataSource_Read_Params_Data)");
class BundleDataSource_Read_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> buffer;

private:
    friend class mojo::internal::MessageFragment<BundleDataSource_Read_ResponseParams_Data>;

    BundleDataSource_Read_ResponseParams_Data();
    ~BundleDataSource_Read_ResponseParams_Data() = delete;
};
static_assert(sizeof(BundleDataSource_Read_ResponseParams_Data) == 16, "Bad sizeof(BundleDataSource_Read_ResponseParams_Data)");
class BundleDataSource_Length_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<BundleDataSource_Length_Params_Data>;

    BundleDataSource_Length_Params_Data();
    ~BundleDataSource_Length_Params_Data() = delete;
};
static_assert(sizeof(BundleDataSource_Length_Params_Data) == 8, "Bad sizeof(BundleDataSource_Length_Params_Data)");
class BundleDataSource_Length_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t length;

private:
    friend class mojo::internal::MessageFragment<BundleDataSource_Length_ResponseParams_Data>;

    BundleDataSource_Length_ResponseParams_Data();
    ~BundleDataSource_Length_ResponseParams_Data() = delete;
};
static_assert(sizeof(BundleDataSource_Length_ResponseParams_Data) == 16, "Bad sizeof(BundleDataSource_Length_ResponseParams_Data)");
class BundleDataSource_IsRandomAccessContext_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<BundleDataSource_IsRandomAccessContext_Params_Data>;

    BundleDataSource_IsRandomAccessContext_Params_Data();
    ~BundleDataSource_IsRandomAccessContext_Params_Data() = delete;
};
static_assert(sizeof(BundleDataSource_IsRandomAccessContext_Params_Data) == 8, "Bad sizeof(BundleDataSource_IsRandomAccessContext_Params_Data)");
class BundleDataSource_IsRandomAccessContext_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_random_access : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<BundleDataSource_IsRandomAccessContext_ResponseParams_Data>;

    BundleDataSource_IsRandomAccessContext_ResponseParams_Data();
    ~BundleDataSource_IsRandomAccessContext_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(BundleDataSource_IsRandomAccessContext_ResponseParams_Data) == 16, "Bad sizeof(BundleDataSource_IsRandomAccessContext_ResponseParams_Data)");
class BundleDataSource_Close_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<BundleDataSource_Close_Params_Data>;

    BundleDataSource_Close_Params_Data();
    ~BundleDataSource_Close_Params_Data() = delete;
};
static_assert(sizeof(BundleDataSource_Close_Params_Data) == 8, "Bad sizeof(BundleDataSource_Close_Params_Data)");
class BundleDataSource_Close_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<BundleDataSource_Close_ResponseParams_Data>;

    BundleDataSource_Close_ResponseParams_Data();
    ~BundleDataSource_Close_ResponseParams_Data() = delete;
};
static_assert(sizeof(BundleDataSource_Close_ResponseParams_Data) == 8, "Bad sizeof(BundleDataSource_Close_ResponseParams_Data)");

} // namespace internal

class WebBundleParserFactory_GetParserForDataSource_ParamsDataView {
public:
    WebBundleParserFactory_GetParserForDataSource_ParamsDataView() = default;

    WebBundleParserFactory_GetParserForDataSource_ParamsDataView(
        internal::WebBundleParserFactory_GetParserForDataSource_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeReceiver()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::web_package::mojom::WebBundleParserInterfaceBase>>(
            &data_->receiver, &result, message_);
        DCHECK(ret);
        return result;
    }
    inline void GetBaseUrlDataView(::url::mojom::UrlDataView* output);

