// media/mojo/mojom/stable/stable_video_decoder.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MEDIA_MOJO_MOJOM_STABLE_STABLE_VIDEO_DECODER_MOJOM_PARAMS_DATA_H_
#define MEDIA_MOJO_MOJOM_STABLE_STABLE_VIDEO_DECODER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media::stable::mojom {
namespace internal {
class MediaLog_AddLogRecord_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::stable::mojom::internal::MediaLogRecord_Data> event;

private:
    friend class mojo::internal::MessageFragment<MediaLog_AddLogRecord_Params_Data>;

    MediaLog_AddLogRecord_Params_Data();
    ~MediaLog_AddLogRecord_Params_Data() = delete;
};
static_assert(sizeof(MediaLog_AddLogRecord_Params_Data) == 16, "Bad sizeof(MediaLog_AddLogRecord_Params_Data)");
class VideoFrameHandleReleaser_ReleaseVideoFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> release_token;

private:
    friend class mojo::internal::MessageFragment<VideoFrameHandleReleaser_ReleaseVideoFrame_Params_Data>;

    VideoFrameHandleReleaser_ReleaseVideoFrame_Params_Data();
    ~VideoFrameHandleReleaser_ReleaseVideoFrame_Params_Data() = delete;
};
static_assert(sizeof(VideoFrameHandleReleaser_ReleaseVideoFrame_Params_Data) == 16, "Bad sizeof(VideoFrameHandleReleaser_ReleaseVideoFrame_Params_Data)");
class VideoDecoderClient_OnVideoFrameDecoded_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::stable::mojom::internal::VideoFrame_Data> frame;
    uint8_t can_read_without_stalling : 1;
    uint8_t pad1_[7];
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> release_token;

private:
    friend class mojo::internal::MessageFragment<VideoDecoderClient_OnVideoFrameDecoded_Params_Data>;

    VideoDecoderClient_OnVideoFrameDecoded_Params_Data();
    ~VideoDecoderClient_OnVideoFrameDecoded_Params_Data() = delete;
};
static_assert(sizeof(VideoDecoderClient_OnVideoFrameDecoded_Params_Data) == 32, "Bad sizeof(VideoDecoderClient_OnVideoFrameDecoded_Params_Data)");
class VideoDecoderClient_OnWaiting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t reason;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<VideoDecoderClient_OnWaiting_Params_Data>;

    VideoDecoderClient_OnWaiting_Params_Data();
    ~VideoDecoderClient_OnWaiting_Params_Data() = delete;
};
static_assert(sizeof(VideoDecoderClient_OnWaiting_Params_Data) == 16, "Bad sizeof(VideoDecoderClient_OnWaiting_Params_Data)");
class CdmContextEventCallback_EventCallback_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t event;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CdmContextEventCallback_EventCallback_Params_Data>;

    CdmContextEventCallback_EventCallback_Params_Data();
    ~CdmContextEventCallback_EventCallback_Params_Data() = delete;
};
static_assert(sizeof(CdmContextEventCallback_EventCallback_Params_Data) == 16, "Bad sizeof(CdmContextEventCallback_EventCallback_Params_Data)");
class StableCdmContext_GetHwKeyData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::stable::mojom::internal::DecryptConfig_Data> decrypt_config;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> hw_identifier;

private:
    friend class mojo::internal::MessageFragment<StableCdmContext_GetHwKeyData_Params_Data>;

    StableCdmContext_GetHwKeyData_Params_Data();
    ~StableCdmContext_GetHwKeyData_Params_Data() = delete;
};
static_assert(sizeof(StableCdmContext_GetHwKeyData_Params_Data) == 24, "Bad sizeof(StableCdmContext_GetHwKeyData_Params_Data)");
class StableCdmContext_GetHwKeyData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> key_data;

private:
    friend class mojo::internal::MessageFragment<StableCdmContext_GetHwKeyData_ResponseParams_Data>;

    StableCdmContext_GetHwKeyData_ResponseParams_Data();
    ~StableCdmContext_GetHwKeyData_ResponseParams_Data() = delete;
};
static_assert(sizeof(StableCdmContext_GetHwKeyData_ResponseParams_Data) == 24, "Bad sizeof(StableCdmContext_GetHwKeyData_ResponseParams_Data)");
class StableCdmContext_RegisterEventCallback_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data callback;

private:
    friend class mojo::internal::MessageFragment<StableCdmContext_RegisterEventCallback_Params_Data>;

    StableCdmContext_RegisterEventCallback_Params_Data();
    ~StableCdmContext_RegisterEventCallback_Params_Data() = delete;
};
static_assert(sizeof(StableCdmContext_RegisterEventCallback_Params_Data) == 16, "Bad sizeof(StableCdmContext_RegisterEventCallback_Params_Data)");
class StableCdmContext_GetHwConfigData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<StableCdmContext_GetHwConfigData_Params_Data>;

    StableCdmContext_GetHwConfigData_Params_Data();
    ~StableCdmContext_GetHwConfigData_Params_Data() = delete;
};
static_assert(sizeof(StableCdmContext_GetHwConfigData_Params_Data) == 8, "Bad sizeof(StableCdmContext_GetHwConfigData_Params_Data)");
class StableCdmContext_GetHwConfigData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> config_data;

private:
    friend class mojo::internal::MessageFragment<StableCdmContext_GetHwConfigData_ResponseParams_Data>;

    StableCdmContext_GetHwConfigData_ResponseParams_Data();
    ~StableCdmContext_GetHwConfigData_ResponseParams_Data() = delete;
};
static_assert(sizeof(StableCdmContext_GetHwConfigData_ResponseParams_Data) == 24, "Bad sizeof(StableCdmContext_GetHwConfigData_ResponseParams_Data)");
class StableCdmContext_GetScreenResolutions_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<StableCdmContext_GetScreenResolutions_Params_Data>;

    StableCdmContext_GetScreenResolutions_Params_Data();
    ~StableCdmContext_GetScreenResolutions_Params_Data() = delete;
};
static_assert(sizeof(StableCdmContext_GetScreenResolutions_Params_Data) == 8, "Bad sizeof(StableCdmContext_GetScreenResolutions_Params_Data)");
class StableCdmContext_GetScreenResolutions_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::gfx::mojom::internal::Size_Data>>> resolutions;

private:
    friend class mojo::internal::MessageFragment<StableCdmContext_GetScreenResolutions_ResponseParams_Data>;

    StableCdmContext_GetScreenResolutions_ResponseParams_Data();
    ~StableCdmContext_GetScreenResolutions_ResponseParams_Data() = delete;
};
static_assert(sizeof(StableCdmContext_GetScreenResolutions_ResponseParams_Data) == 16, "Bad sizeof(StableCdmContext_GetScreenResolutions_ResponseParams_Data)");
class StableCdmContext_AllocateSecureBuffer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t size;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<StableCdmContext_AllocateSecureBuffer_Params_Data>;

    StableCdmContext_AllocateSecureBuffer_Params_Data();
    ~StableCdmContext_AllocateSecureBuffer_Params_Data() = delete;
};
static_assert(sizeof(StableCdmContext_AllocateSecureBuffer_Params_Data) == 16, "Bad sizeof(StableCdmContext_AllocateSecureBuffer_Params_Data)");
class StableCdmContext_AllocateSecureBuffer_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data secure_buffer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<StableCdmContext_AllocateSecureBuffer_ResponseParams_Data>;

    StableCdmContext_AllocateSecureBuffer_ResponseParams_Data();
    ~StableCdmContext_AllocateSecureBuffer_ResponseParams_Data() = delete;
};
static_assert(sizeof(StableCdmContext_AllocateSecureBuffer_ResponseParams_Data) == 16, "Bad sizeof(StableCdmContext_AllocateSecureBuffer_ResponseParams_Data)");
class StableCdmContext_ParseEncryptedSliceHeader_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t secure_handle;
    uint32_t offset;
    uint8_t pad1_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> stream_data;

private:
    friend class mojo::internal::MessageFragment<StableCdmContext_ParseEncryptedSliceHeader_Params_Data>;

    StableCdmContext_ParseEncryptedSliceHeader_Params_Data();
    ~StableCdmContext_ParseEncryptedSliceHeader_Params_Data() = delete;
};
static_assert(sizeof(StableCdmContext_ParseEncryptedSliceHeader_Params_Data) == 32, "Bad sizeof(StableCdmContext_ParseEncryptedSliceHeader_Params_Data)");
class StableCdmContext_ParseEncryptedSliceHeader_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> slice_header;

private:
    friend class mojo::internal::MessageFragment<StableCdmContext_ParseEncryptedSliceHeader_ResponseParams_Data>;

    StableCdmContext_ParseEncryptedSliceHeader_ResponseParams_Data();
    ~StableCdmContext_ParseEncryptedSliceHeader_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(StableCdmContext_ParseEncryptedSliceHeader_ResponseParams_Data) == 24, "Bad sizeof(StableCdmContext_ParseEncryptedSliceHeader_ResponseParams_Data)");
class StableCdmContext_DecryptVideoBuffer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::stable::mojom::internal::DecoderBuffer_Data> buffer;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> bytes;

private:
    friend class mojo::internal::MessageFragment<StableCdmContext_DecryptVideoBuffer_Params_Data>;

    StableCdmContext_DecryptVideoBuffer_Params_Data();
    ~StableCdmContext_DecryptVideoBuffer_Params_Data() = delete;
};
static_assert(sizeof(StableCdmContext_DecryptVideoBuffer_Params_Data) == 24, "Bad sizeof(StableCdmContext_DecryptVideoBuffer_Params_Data)");
class StableCdmContext_DecryptVideoBuffer_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::media::stable::mojom::internal::DecoderBuffer_Data> decoder_buffer;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> bytes;

private:
    friend class mojo::internal::MessageFragment<StableCdmContext_DecryptVideoBuffer_ResponseParams_Data>;

    StableCdmContext_DecryptVideoBuffer_ResponseParams_Data();
    ~StableCdmContext_DecryptVideoBuffer_ResponseParams_Data() = delete;
};
static_assert(sizeof(StableCdmContext_DecryptVideoBuffer_ResponseParams_Data) == 32, "Bad sizeof(StableCdmContext_DecryptVideoBuffer_ResponseParams_Data)");
class StableVideoDecoder_GetSupportedConfigs_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<StableVideoDecoder_GetSupportedConfigs_Params_Data>;

    StableVideoDecoder_GetSupportedConfigs_Params_Data();
    ~StableVideoDecoder_GetSupportedConfigs_Params_Data() = delete;
};
static_assert(sizeof(StableVideoDecoder_GetSupportedConfigs_Params_Data) == 8, "Bad sizeof(StableVideoDecoder_GetSupportedConfigs_Params_Data)");
class StableVideoDecoder_GetSupportedConfigs_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::media::stable::mojom::internal::SupportedVideoDecoderConfig_Data>>>
        supported_configs;
    int32_t decoder_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<StableVideoDecoder_GetSupportedConfigs_ResponseParams_Data>;

    StableVideoDecoder_GetSupportedConfigs_ResponseParams_Data();
    ~StableVideoDecoder_GetSupportedConfigs_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(StableVideoDecoder_GetSupportedConfigs_ResponseParams_Data) == 24, "Bad sizeof(StableVideoDecoder_GetSupportedConfigs_ResponseParams_Data)");
class StableVideoDecoder_Construct_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data client;
    mojo::internal::Interface_Data media_log;
    mojo::internal::Handle_Data video_frame_handle_releaser;
    mojo::internal::Handle_Data decoder_buffer_pipe;
    mojo::internal::Pointer<::media::stable::mojom::internal::ColorSpace_Data> target_color_space;

private:
    friend class mojo::internal::MessageFragment<StableVideoDecoder_Construct_Params_Data>;

    StableVideoDecoder_Construct_Params_Data();
    ~StableVideoDecoder_Construct_Params_Data() = delete;
};
static_assert(sizeof(StableVideoDecoder_Construct_Params_Data) == 40, "Bad sizeof(StableVideoDecoder_Construct_Params_Data)");
class StableVideoDecoder_Initialize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::stable::mojom::internal::VideoDecoderConfig_Data> config;
    uint8_t low_delay : 1;
    uint8_t pad1_[3];
    mojo::internal::Interface_Data cdm_context;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<StableVideoDecoder_Initialize_Params_Data>;

    StableVideoDecoder_Initialize_Params_Data();
    ~StableVideoDecoder_Initialize_Params_Data() = delete;
};
static_assert(sizeof(StableVideoDecoder_Initialize_Params_Data) == 32, "Bad sizeof(StableVideoDecoder_Initialize_Params_Data)");
class StableVideoDecoder_Initialize_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::stable::mojom::internal::Status_Data> status;
    uint8_t needs_bitstream_conversion : 1;
    uint8_t needs_transcryption : 1;
    uint8_t pad2_[3];
    int32_t max_decode_requests;
    int32_t decoder_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<StableVideoDecoder_Initialize_ResponseParams_Data>;

    StableVideoDecoder_Initialize_ResponseParams_Data();
    ~StableVideoDecoder_Initialize_ResponseParams_Data() = delete;
};
static_assert(sizeof(StableVideoDecoder_Initialize_ResponseParams_Data) == 32, "Bad sizeof(StableVideoDecoder_Initialize_ResponseParams_Data)");
class StableVideoDecoder_Decode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::stable::mojom::internal::DecoderBuffer_Data> buffer;

private:
    friend class mojo::internal::MessageFragment<StableVideoDecoder_Decode_Params_Data>;

    StableVideoDecoder_Decode_Params_Data();
    ~StableVideoDecoder_Decode_Params_Data() = delete;
};
static_assert(sizeof(StableVideoDecoder_Decode_Params_Data) == 16, "Bad sizeof(StableVideoDecoder_Decode_Params_Data)");
class StableVideoDecoder_Decode_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media::stable::mojom::internal::Status_Data> status;

private:
    friend class mojo::internal::MessageFragment<StableVideoDecoder_Decode_ResponseParams_Data>;

    StableVideoDecoder_Decode_ResponseParams_Data();
    ~StableVideoDecoder_Decode_ResponseParams_Data() = delete;
};
static_assert(sizeof(StableVideoDecoder_Decode_ResponseParams_Data) == 16, "Bad sizeof(StableVideoDecoder_Decode_ResponseParams_Data)");
class StableVideoDecoder_Reset_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<StableVideoDecoder_Reset_Params_Data>;

    StableVideoDecoder_Reset_Params_Data();
    ~StableVideoDecoder_Reset_Params_Data() = delete;
};
static_assert(sizeof(StableVideoDecoder_Reset_Params_Data) == 8, "Bad sizeof(StableVideoDecoder_Reset_Params_Data)");
class StableVideoDecoder_Reset_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<StableVideoDecoder_Reset_ResponseParams_Data>;

    StableVideoDecoder_Reset_ResponseParams_Data();
    ~StableVideoDecoder_Reset_ResponseParams_Data() = delete;
};
static_assert(sizeof(StableVideoDecoder_Reset_ResponseParams_Data) == 8, "Bad sizeof(StableVideoDecoder_Reset_ResponseParams_Data)");
class StableVideoDecoderFactory_CreateStableVideoDecoder_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    mojo::internal::Interface_Data tracker;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<StableVideoDecoderFactory_CreateStableVideoDecoder_Params_Data>;

    StableVideoDecoderFactory_CreateStableVideoDecoder_Params_Data();
    ~StableVideoDecoderFactory_CreateStableVideoDecoder_Params_Data() = delete;
};
static_assert(
    sizeof(StableVideoDecoderFactory_CreateStableVideoDecoder_Params_Data) == 24, "Bad sizeof(StableVideoDecoderFactory_CreateStableVideoDecoder_Params_Data)");

} // namespace internal

class MediaLog_AddLogRecord_ParamsDataView {
public:
