// ui/webui/resources/cr_components/theme_color_picker/theme_color_picker.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef UI_WEBUI_RESOURCES_CR_COMPONENTS_THEME_COLOR_PICKER_THEME_COLOR_PICKER_MOJOM_PARAMS_DATA_H_
#define UI_WEBUI_RESOURCES_CR_COMPONENTS_THEME_COLOR_PICKER_THEME_COLOR_PICKER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace theme_color_picker::mojom {
namespace internal {
class ThemeColorPickerHandlerFactory_CreateThemeColorPickerHandler_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data handler;
    mojo::internal::Interface_Data client;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ThemeColorPickerHandlerFactory_CreateThemeColorPickerHandler_Params_Data>;

    ThemeColorPickerHandlerFactory_CreateThemeColorPickerHandler_Params_Data();
    ~ThemeColorPickerHandlerFactory_CreateThemeColorPickerHandler_Params_Data() = delete;
};
static_assert(sizeof(ThemeColorPickerHandlerFactory_CreateThemeColorPickerHandler_Params_Data) == 24,
    "Bad sizeof(ThemeColorPickerHandlerFactory_CreateThemeColorPickerHandler_Params_Data)");
class ThemeColorPickerHandler_GetChromeColors_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_dark_mode : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<ThemeColorPickerHandler_GetChromeColors_Params_Data>;

    ThemeColorPickerHandler_GetChromeColors_Params_Data();
    ~ThemeColorPickerHandler_GetChromeColors_Params_Data() = delete;
};
static_assert(sizeof(ThemeColorPickerHandler_GetChromeColors_Params_Data) == 16, "Bad sizeof(ThemeColorPickerHandler_GetChromeColors_Params_Data)");
class ThemeColorPickerHandler_GetChromeColors_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::ChromeColor_Data>>> colors;

private:
    friend class mojo::internal::MessageFragment<ThemeColorPickerHandler_GetChromeColors_ResponseParams_Data>;

    ThemeColorPickerHandler_GetChromeColors_ResponseParams_Data();
    ~ThemeColorPickerHandler_GetChromeColors_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(ThemeColorPickerHandler_GetChromeColors_ResponseParams_Data) == 16, "Bad sizeof(ThemeColorPickerHandler_GetChromeColors_ResponseParams_Data)");
class ThemeColorPickerHandler_UpdateTheme_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ThemeColorPickerHandler_UpdateTheme_Params_Data>;

    ThemeColorPickerHandler_UpdateTheme_Params_Data();
    ~ThemeColorPickerHandler_UpdateTheme_Params_Data() = delete;
};
static_assert(sizeof(ThemeColorPickerHandler_UpdateTheme_Params_Data) == 8, "Bad sizeof(ThemeColorPickerHandler_UpdateTheme_Params_Data)");
class ThemeColorPickerHandler_SetDefaultColor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ThemeColorPickerHandler_SetDefaultColor_Params_Data>;

    ThemeColorPickerHandler_SetDefaultColor_Params_Data();
    ~ThemeColorPickerHandler_SetDefaultColor_Params_Data() = delete;
};
static_assert(sizeof(ThemeColorPickerHandler_SetDefaultColor_Params_Data) == 8, "Bad sizeof(ThemeColorPickerHandler_SetDefaultColor_Params_Data)");
class ThemeColorPickerHandler_SetGreyDefaultColor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ThemeColorPickerHandler_SetGreyDefaultColor_Params_Data>;

    ThemeColorPickerHandler_SetGreyDefaultColor_Params_Data();
    ~ThemeColorPickerHandler_SetGreyDefaultColor_Params_Data() = delete;
};
static_assert(sizeof(ThemeColorPickerHandler_SetGreyDefaultColor_Params_Data) == 8, "Bad sizeof(ThemeColorPickerHandler_SetGreyDefaultColor_Params_Data)");
class ThemeColorPickerHandler_SetSeedColor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::skia::mojom::internal::SkColor_Data> seed_color;
    int32_t variant;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ThemeColorPickerHandler_SetSeedColor_Params_Data>;

    ThemeColorPickerHandler_SetSeedColor_Params_Data();
    ~ThemeColorPickerHandler_SetSeedColor_Params_Data() = delete;
};
static_assert(sizeof(ThemeColorPickerHandler_SetSeedColor_Params_Data) == 24, "Bad sizeof(ThemeColorPickerHandler_SetSeedColor_Params_Data)");
class ThemeColorPickerHandler_SetSeedColorFromHue_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    float hue;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ThemeColorPickerHandler_SetSeedColorFromHue_Params_Data>;

    ThemeColorPickerHandler_SetSeedColorFromHue_Params_Data();
    ~ThemeColorPickerHandler_SetSeedColorFromHue_Params_Data() = delete;
};
static_assert(sizeof(ThemeColorPickerHandler_SetSeedColorFromHue_Params_Data) == 16, "Bad sizeof(ThemeColorPickerHandler_SetSeedColorFromHue_Params_Data)");
class ThemeColorPickerHandler_RemoveBackgroundImage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ThemeColorPickerHandler_RemoveBackgroundImage_Params_Data>;

    ThemeColorPickerHandler_RemoveBackgroundImage_Params_Data();
    ~ThemeColorPickerHandler_RemoveBackgroundImage_Params_Data() = delete;
};
static_assert(sizeof(ThemeColorPickerHandler_RemoveBackgroundImage_Params_Data) == 8, "Bad sizeof(ThemeColorPickerHandler_RemoveBackgroundImage_Params_Data)");
class ThemeColorPickerClient_SetTheme_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::Theme_Data> theme;

private:
    friend class mojo::internal::MessageFragment<ThemeColorPickerClient_SetTheme_Params_Data>;

    ThemeColorPickerClient_SetTheme_Params_Data();
    ~ThemeColorPickerClient_SetTheme_Params_Data() = delete;
};
static_assert(sizeof(ThemeColorPickerClient_SetTheme_Params_Data) == 16, "Bad sizeof(ThemeColorPickerClient_SetTheme_Params_Data)");

} // namespace internal

class ThemeColorPickerHandlerFactory_CreateThemeColorPickerHandler_ParamsDataView {
public:
    ThemeColorPickerHandlerFactory_CreateThemeColorPickerHandler_ParamsDataView() = default;

    ThemeColorPickerHandlerFactory_CreateThemeColorPickerHandler_ParamsDataView(
        internal::ThemeColorPickerHandlerFactory_CreateThemeColorPickerHandler_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeHandler()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::theme_color_picker::mojom::ThemeColorPickerHandlerInterfaceBase>>(
            &data_->handler, &result, message_);
        DCHECK(ret);
        return result;
    }
    template <typename UserType> UserType TakeClient()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::theme_color_picker::mojom::ThemeColorPickerClientInterfaceBase>>(
            &data_->client, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::ThemeColorPickerHandlerFactory_CreateThemeColorPickerHandler_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class ThemeColorPickerHandler_GetChromeColors_ParamsDataView {
public:
    ThemeColorPickerHandler_GetChromeColors_ParamsDataView() = default;

    ThemeColorPickerHandler_GetChromeColors_ParamsDataView(internal::ThemeColorPickerHandler_GetChromeColors_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    bool is_dark_mode() const
    {
        return data_->is_dark_mode;
    }

private:
    internal::ThemeColorPickerHandler_GetChromeColors_Params_Data* data_ = nullptr;
};

class ThemeColorPickerHandler_GetChromeColors_ResponseParamsDataView {
public:
    ThemeColorPickerHandler_GetChromeColors_ResponseParamsDataView() = default;

    ThemeColorPickerHandler_GetChromeColors_ResponseParamsDataView(
        internal::ThemeColorPickerHandler_GetChromeColors_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetColorsDataView(mojo::ArrayDataView<ChromeColorDataView>* output);

    template <typename UserType> [[nodiscard]] bool ReadColors(UserType* output)
    {

        auto* pointer = data_->colors.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<::theme_color_picker::mojom::ChromeColorDataView>>(pointer, output, message_);
    }

private:
    internal::ThemeColorPickerHandler_GetChromeColors_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class ThemeColorPickerHandler_UpdateTheme_ParamsDataView {
public:
    ThemeColorPickerHandler_UpdateTheme_ParamsDataView() = default;

    ThemeColorPickerHandler_UpdateTheme_ParamsDataView(internal::ThemeColorPickerHandler_UpdateTheme_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::ThemeColorPickerHandler_UpdateTheme_Params_Data* data_ = nullptr;
};

class ThemeColorPickerHandler_SetDefaultColor_ParamsDataView {
public:
    ThemeColorPickerHandler_SetDefaultColor_ParamsDataView() = default;

    ThemeColorPickerHandler_SetDefaultColor_ParamsDataView(internal::ThemeColorPickerHandler_SetDefaultColor_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::ThemeColorPickerHandler_SetDefaultColor_Params_Data* data_ = nullptr;
};

class ThemeColorPickerHandler_SetGreyDefaultColor_ParamsDataView {
public:
    ThemeColorPickerHandler_SetGreyDefaultColor_ParamsDataView() = default;

    ThemeColorPickerHandler_SetGreyDefaultColor_ParamsDataView(internal::ThemeColorPickerHandler_SetGreyDefaultColor_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::ThemeColorPickerHandler_SetGreyDefaultColor_Params_Data* data_ = nullptr;
};

class ThemeColorPickerHandler_SetSeedColor_ParamsDataView {
public:
    ThemeColorPickerHandler_SetSeedColor_ParamsDataView() = default;

    ThemeColorPickerHandler_SetSeedColor_ParamsDataView(internal::ThemeColorPickerHandler_SetSeedColor_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetSeedColorDataView(::skia::mojom::SkColorDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadSeedColor(UserType* output)
    {

        auto* pointer = data_->seed_color.Get();
        return mojo::internal::Deserialize<::skia::mojom::SkColorDataView>(pointer, output, message_);
    }
    template <typename UserType> [[nodiscard]] bool ReadVariant(UserType* output) const
    {
        auto data_value = data_->variant;
        return mojo::internal::Deserialize<::ui::mojom::BrowserColorVariant>(data_value, output);
    }
    ::ui::mojom::BrowserColorVariant variant() const
    {
        return ::mojo::internal::ToKnownEnumValueHelper(static_cast<::ui::mojom::BrowserColorVariant>(data_->variant));
    }

private:
    internal::ThemeColorPickerHandler_SetSeedColor_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class ThemeColorPickerHandler_SetSeedColorFromHue_ParamsDataView {
public:
    ThemeColorPickerHandler_SetSeedColorFromHue_ParamsDataView() = default;

    ThemeColorPickerHandler_SetSeedColorFromHue_ParamsDataView(internal::ThemeColorPickerHandler_SetSeedColorFromHue_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    float hue() const
    {
        return data_->hue;
    }

private:
    internal::ThemeColorPickerHandler_SetSeedColorFromHue_Params_Data* data_ = nullptr;
};

class ThemeColorPickerHandler_RemoveBackgroundImage_ParamsDataView {
public:
    ThemeColorPickerHandler_RemoveBackgroundImage_ParamsDataView() = default;

    ThemeColorPickerHandler_RemoveBackgroundImage_ParamsDataView(
        internal::ThemeColorPickerHandler_RemoveBackgroundImage_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::ThemeColorPickerHandler_RemoveBackgroundImage_Params_Data* data_ = nullptr;
};

class ThemeColorPickerClient_SetTheme_ParamsDataView {
public:
    ThemeColorPickerClient_SetTheme_ParamsDataView() = default;

    ThemeColorPickerClient_SetTheme_ParamsDataView(internal::ThemeColorPickerClient_SetTheme_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetThemeDataView(ThemeDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadTheme(UserType* output)
    {

        auto* pointer = data_->theme.Get();
        return mojo::internal::Deserialize<::theme_color_picker::mojom::ThemeDataView>(pointer, output, message_);
    }

private:
    internal::ThemeColorPickerClient_SetTheme_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

inline void ThemeColorPickerHandler_GetChromeColors_ResponseParamsDataView::GetColorsDataView(mojo::ArrayDataView<ChromeColorDataView>* output)
{
    auto pointer = data_->colors.Get();
    *output = mojo::ArrayDataView<ChromeColorDataView>(pointer, message_);
}

inline void ThemeColorPickerHandler_SetSeedColor_ParamsDataView::GetSeedColorDataView(::skia::mojom::SkColorDataView* output)
{
    auto pointer = data_->seed_color.Get();
    *output = ::skia::mojom::SkColorDataView(pointer, message_);
}

inline void ThemeColorPickerClient_SetTheme_ParamsDataView::GetThemeDataView(ThemeDataView* output)
{
    auto pointer = data_->theme.Get();
    *output = ThemeDataView(pointer, message_);
}

} // theme_color_picker::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // UI_WEBUI_RESOURCES_CR_COMPONENTS_THEME_COLOR_PICKER_THEME_COLOR_PICKER_MOJOM_PARAMS_DATA_H_
