// components/content_capture/common/content_capture.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_CONTENT_CAPTURE_COMMON_CONTENT_CAPTURE_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_CONTENT_CAPTURE_COMMON_CONTENT_CAPTURE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace content_capture::mojom {
namespace internal {
class ContentCaptureReceiver_DidCaptureContent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::content_capture::mojom::internal::ContentCaptureData_Data> data;
    uint8_t first_data : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<ContentCaptureReceiver_DidCaptureContent_Params_Data>;

    ContentCaptureReceiver_DidCaptureContent_Params_Data();
    ~ContentCaptureReceiver_DidCaptureContent_Params_Data() = delete;
};
static_assert(sizeof(ContentCaptureReceiver_DidCaptureContent_Params_Data) == 24, "Bad sizeof(ContentCaptureReceiver_DidCaptureContent_Params_Data)");
class ContentCaptureReceiver_DidUpdateContent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::content_capture::mojom::internal::ContentCaptureData_Data> data;

private:
    friend class mojo::internal::MessageFragment<ContentCaptureReceiver_DidUpdateContent_Params_Data>;

    ContentCaptureReceiver_DidUpdateContent_Params_Data();
    ~ContentCaptureReceiver_DidUpdateContent_Params_Data() = delete;
};
static_assert(sizeof(ContentCaptureReceiver_DidUpdateContent_Params_Data) == 16, "Bad sizeof(ContentCaptureReceiver_DidUpdateContent_Params_Data)");
class ContentCaptureReceiver_DidRemoveContent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<int64_t>> ids;

private:
    friend class mojo::internal::MessageFragment<ContentCaptureReceiver_DidRemoveContent_Params_Data>;

    ContentCaptureReceiver_DidRemoveContent_Params_Data();
    ~ContentCaptureReceiver_DidRemoveContent_Params_Data() = delete;
};
static_assert(sizeof(ContentCaptureReceiver_DidRemoveContent_Params_Data) == 16, "Bad sizeof(ContentCaptureReceiver_DidRemoveContent_Params_Data)");
class ContentCaptureSender_StartCapture_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ContentCaptureSender_StartCapture_Params_Data>;

    ContentCaptureSender_StartCapture_Params_Data();
    ~ContentCaptureSender_StartCapture_Params_Data() = delete;
};
static_assert(sizeof(ContentCaptureSender_StartCapture_Params_Data) == 8, "Bad sizeof(ContentCaptureSender_StartCapture_Params_Data)");
class ContentCaptureSender_StopCapture_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ContentCaptureSender_StopCapture_Params_Data>;

    ContentCaptureSender_StopCapture_Params_Data();
    ~ContentCaptureSender_StopCapture_Params_Data() = delete;
};
static_assert(sizeof(ContentCaptureSender_StopCapture_Params_Data) == 8, "Bad sizeof(ContentCaptureSender_StopCapture_Params_Data)");

} // namespace internal

class ContentCaptureReceiver_DidCaptureContent_ParamsDataView {
public:
    ContentCaptureReceiver_DidCaptureContent_ParamsDataView() = default;

    ContentCaptureReceiver_DidCaptureContent_ParamsDataView(internal::ContentCaptureReceiver_DidCaptureContent_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetDataDataView(::content_capture::mojom::ContentCaptureDataDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadData(UserType* output)
    {

        auto* pointer = data_->data.Get();
        return mojo::internal::Deserialize<::content_capture::mojom::ContentCaptureDataDataView>(pointer, output, message_);
    }
    bool first_data() const
    {
        return data_->first_data;
    }

private:
    internal::ContentCaptureReceiver_DidCaptureContent_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class ContentCaptureReceiver_DidUpdateContent_ParamsDataView {
public:
    ContentCaptureReceiver_DidUpdateContent_ParamsDataView() = default;

    ContentCaptureReceiver_DidUpdateContent_ParamsDataView(internal::ContentCaptureReceiver_DidUpdateContent_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetDataDataView(::content_capture::mojom::ContentCaptureDataDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadData(UserType* output)
    {

        auto* pointer = data_->data.Get();
        return mojo::internal::Deserialize<::content_capture::mojom::ContentCaptureDataDataView>(pointer, output, message_);
    }

private:
    internal::ContentCaptureReceiver_DidUpdateContent_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class ContentCaptureReceiver_DidRemoveContent_ParamsDataView {
public:
    ContentCaptureReceiver_DidRemoveContent_ParamsDataView() = default;

    ContentCaptureReceiver_DidRemoveContent_ParamsDataView(internal::ContentCaptureReceiver_DidRemoveContent_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetIdsDataView(mojo::ArrayDataView<int64_t>* output);

    template <typename UserType> [[nodiscard]] bool ReadIds(UserType* output)
    {

        auto* pointer = data_->ids.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<int64_t>>(pointer, output, message_);
    }

private:
    internal::ContentCaptureReceiver_DidRemoveContent_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class ContentCaptureSender_StartCapture_ParamsDataView {
public:
    ContentCaptureSender_StartCapture_ParamsDataView() = default;

    ContentCaptureSender_StartCapture_ParamsDataView(internal::ContentCaptureSender_StartCapture_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::ContentCaptureSender_StartCapture_Params_Data* data_ = nullptr;
};

class ContentCaptureSender_StopCapture_ParamsDataView {
public:
    ContentCaptureSender_StopCapture_ParamsDataView() = default;

    ContentCaptureSender_StopCapture_ParamsDataView(internal::ContentCaptureSender_StopCapture_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::ContentCaptureSender_StopCapture_Params_Data* data_ = nullptr;
};

inline void ContentCaptureReceiver_DidCaptureContent_ParamsDataView::GetDataDataView(::content_capture::mojom::ContentCaptureDataDataView* output)
{
    auto pointer = data_->data.Get();
    *output = ::content_capture::mojom::ContentCaptureDataDataView(pointer, message_);
}

inline void ContentCaptureReceiver_DidUpdateContent_ParamsDataView::GetDataDataView(::content_capture::mojom::ContentCaptureDataDataView* output)
{
    auto pointer = data_->data.Get();
    *output = ::content_capture::mojom::ContentCaptureDataDataView(pointer, message_);
}

inline void ContentCaptureReceiver_DidRemoveContent_ParamsDataView::GetIdsDataView(mojo::ArrayDataView<int64_t>* output)
{
    auto pointer = data_->ids.Get();
    *output = mojo::ArrayDataView<int64_t>(pointer, message_);
}

} // content_capture::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // COMPONENTS_CONTENT_CAPTURE_COMMON_CONTENT_CAPTURE_MOJOM_PARAMS_DATA_H_
