// third_party/blink/public/mojom/bluetooth/web_bluetooth.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_BLUETOOTH_WEB_BLUETOOTH_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_BLUETOOTH_WEB_BLUETOOTH_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_GetAvailability_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_GetAvailability_Params_Data>;

    WebBluetoothService_GetAvailability_Params_Data();
    ~WebBluetoothService_GetAvailability_Params_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_GetAvailability_Params_Data) == 8, "Bad sizeof(WebBluetoothService_GetAvailability_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_GetAvailability_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_available : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_GetAvailability_ResponseParams_Data>;

    WebBluetoothService_GetAvailability_ResponseParams_Data();
    ~WebBluetoothService_GetAvailability_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_GetAvailability_ResponseParams_Data) == 16, "Bad sizeof(WebBluetoothService_GetAvailability_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RequestDevice_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::WebBluetoothRequestDeviceOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RequestDevice_Params_Data>;

    WebBluetoothService_RequestDevice_Params_Data();
    ~WebBluetoothService_RequestDevice_Params_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RequestDevice_Params_Data) == 16, "Bad sizeof(WebBluetoothService_RequestDevice_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RequestDevice_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t pad0_[4];
    mojo::internal::Pointer<internal::WebBluetoothDevice_Data> device;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RequestDevice_ResponseParams_Data>;

    WebBluetoothService_RequestDevice_ResponseParams_Data();
    ~WebBluetoothService_RequestDevice_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RequestDevice_ResponseParams_Data) == 24, "Bad sizeof(WebBluetoothService_RequestDevice_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_GetDevices_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_GetDevices_Params_Data>;

    WebBluetoothService_GetDevices_Params_Data();
    ~WebBluetoothService_GetDevices_Params_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_GetDevices_Params_Data) == 8, "Bad sizeof(WebBluetoothService_GetDevices_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_GetDevices_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::WebBluetoothDevice_Data>>> devices;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_GetDevices_ResponseParams_Data>;

    WebBluetoothService_GetDevices_ResponseParams_Data();
    ~WebBluetoothService_GetDevices_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_GetDevices_ResponseParams_Data) == 16, "Bad sizeof(WebBluetoothService_GetDevices_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_ForgetDevice_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::WebBluetoothDeviceId_Data> device_id;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_ForgetDevice_Params_Data>;

    WebBluetoothService_ForgetDevice_Params_Data();
    ~WebBluetoothService_ForgetDevice_Params_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_ForgetDevice_Params_Data) == 16, "Bad sizeof(WebBluetoothService_ForgetDevice_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_ForgetDevice_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_ForgetDevice_ResponseParams_Data>;

    WebBluetoothService_ForgetDevice_ResponseParams_Data();
    ~WebBluetoothService_ForgetDevice_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_ForgetDevice_ResponseParams_Data) == 8, "Bad sizeof(WebBluetoothService_ForgetDevice_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteServerConnect_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::WebBluetoothDeviceId_Data> device_id;
    mojo::internal::AssociatedInterface_Data client;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteServerConnect_Params_Data>;

    WebBluetoothService_RemoteServerConnect_Params_Data();
    ~WebBluetoothService_RemoteServerConnect_Params_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RemoteServerConnect_Params_Data) == 24, "Bad sizeof(WebBluetoothService_RemoteServerConnect_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteServerConnect_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteServerConnect_ResponseParams_Data>;

    WebBluetoothService_RemoteServerConnect_ResponseParams_Data();
    ~WebBluetoothService_RemoteServerConnect_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(WebBluetoothService_RemoteServerConnect_ResponseParams_Data) == 16, "Bad sizeof(WebBluetoothService_RemoteServerConnect_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteServerDisconnect_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::WebBluetoothDeviceId_Data> device_id;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteServerDisconnect_Params_Data>;

    WebBluetoothService_RemoteServerDisconnect_Params_Data();
    ~WebBluetoothService_RemoteServerDisconnect_Params_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RemoteServerDisconnect_Params_Data) == 16, "Bad sizeof(WebBluetoothService_RemoteServerDisconnect_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteServerGetPrimaryServices_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::WebBluetoothDeviceId_Data> device_id;
    int32_t quantity;
    uint8_t pad1_[4];
    mojo::internal::Pointer<::bluetooth::mojom::internal::UUID_Data> services_uuid;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteServerGetPrimaryServices_Params_Data>;

    WebBluetoothService_RemoteServerGetPrimaryServices_Params_Data();
    ~WebBluetoothService_RemoteServerGetPrimaryServices_Params_Data() = delete;
};
static_assert(
    sizeof(WebBluetoothService_RemoteServerGetPrimaryServices_Params_Data) == 32, "Bad sizeof(WebBluetoothService_RemoteServerGetPrimaryServices_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteServerGetPrimaryServices_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::WebBluetoothRemoteGATTService_Data>>> services;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteServerGetPrimaryServices_ResponseParams_Data>;

    WebBluetoothService_RemoteServerGetPrimaryServices_ResponseParams_Data();
    ~WebBluetoothService_RemoteServerGetPrimaryServices_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RemoteServerGetPrimaryServices_ResponseParams_Data) == 24,
    "Bad sizeof(WebBluetoothService_RemoteServerGetPrimaryServices_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteServiceGetCharacteristics_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> service_instance_id;
    int32_t quantity;
    uint8_t pad1_[4];
    mojo::internal::Pointer<::bluetooth::mojom::internal::UUID_Data> characteristics_uuid;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteServiceGetCharacteristics_Params_Data>;

    WebBluetoothService_RemoteServiceGetCharacteristics_Params_Data();
    ~WebBluetoothService_RemoteServiceGetCharacteristics_Params_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RemoteServiceGetCharacteristics_Params_Data) == 32,
    "Bad sizeof(WebBluetoothService_RemoteServiceGetCharacteristics_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteServiceGetCharacteristics_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::WebBluetoothRemoteGATTCharacteristic_Data>>> characteristics;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteServiceGetCharacteristics_ResponseParams_Data>;

    WebBluetoothService_RemoteServiceGetCharacteristics_ResponseParams_Data();
    ~WebBluetoothService_RemoteServiceGetCharacteristics_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RemoteServiceGetCharacteristics_ResponseParams_Data) == 24,
    "Bad sizeof(WebBluetoothService_RemoteServiceGetCharacteristics_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteCharacteristicReadValue_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> characteristic_instance_id;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteCharacteristicReadValue_Params_Data>;

    WebBluetoothService_RemoteCharacteristicReadValue_Params_Data();
    ~WebBluetoothService_RemoteCharacteristicReadValue_Params_Data() = delete;
};
static_assert(
    sizeof(WebBluetoothService_RemoteCharacteristicReadValue_Params_Data) == 16, "Bad sizeof(WebBluetoothService_RemoteCharacteristicReadValue_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteCharacteristicReadValue_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> value;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteCharacteristicReadValue_ResponseParams_Data>;

    WebBluetoothService_RemoteCharacteristicReadValue_ResponseParams_Data();
    ~WebBluetoothService_RemoteCharacteristicReadValue_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RemoteCharacteristicReadValue_ResponseParams_Data) == 24,
    "Bad sizeof(WebBluetoothService_RemoteCharacteristicReadValue_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteCharacteristicWriteValue_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> characteristic_instance_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> value;
    int32_t write_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteCharacteristicWriteValue_Params_Data>;

    WebBluetoothService_RemoteCharacteristicWriteValue_Params_Data();
    ~WebBluetoothService_RemoteCharacteristicWriteValue_Params_Data() = delete;
};
static_assert(
    sizeof(WebBluetoothService_RemoteCharacteristicWriteValue_Params_Data) == 32, "Bad sizeof(WebBluetoothService_RemoteCharacteristicWriteValue_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteCharacteristicWriteValue_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteCharacteristicWriteValue_ResponseParams_Data>;

    WebBluetoothService_RemoteCharacteristicWriteValue_ResponseParams_Data();
    ~WebBluetoothService_RemoteCharacteristicWriteValue_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RemoteCharacteristicWriteValue_ResponseParams_Data) == 16,
    "Bad sizeof(WebBluetoothService_RemoteCharacteristicWriteValue_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteCharacteristicStartNotifications_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> characteristic_instance_id;
    mojo::internal::AssociatedInterface_Data client;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteCharacteristicStartNotifications_Params_Data>;

    WebBluetoothService_RemoteCharacteristicStartNotifications_Params_Data();
    ~WebBluetoothService_RemoteCharacteristicStartNotifications_Params_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RemoteCharacteristicStartNotifications_Params_Data) == 24,
    "Bad sizeof(WebBluetoothService_RemoteCharacteristicStartNotifications_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteCharacteristicStartNotifications_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteCharacteristicStartNotifications_ResponseParams_Data>;

    WebBluetoothService_RemoteCharacteristicStartNotifications_ResponseParams_Data();
    ~WebBluetoothService_RemoteCharacteristicStartNotifications_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RemoteCharacteristicStartNotifications_ResponseParams_Data) == 16,
    "Bad sizeof(WebBluetoothService_RemoteCharacteristicStartNotifications_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteCharacteristicStopNotifications_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> characteristic_instance_id;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteCharacteristicStopNotifications_Params_Data>;

    WebBluetoothService_RemoteCharacteristicStopNotifications_Params_Data();
    ~WebBluetoothService_RemoteCharacteristicStopNotifications_Params_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RemoteCharacteristicStopNotifications_Params_Data) == 16,
    "Bad sizeof(WebBluetoothService_RemoteCharacteristicStopNotifications_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteCharacteristicStopNotifications_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteCharacteristicStopNotifications_ResponseParams_Data>;

    WebBluetoothService_RemoteCharacteristicStopNotifications_ResponseParams_Data();
    ~WebBluetoothService_RemoteCharacteristicStopNotifications_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RemoteCharacteristicStopNotifications_ResponseParams_Data) == 8,
    "Bad sizeof(WebBluetoothService_RemoteCharacteristicStopNotifications_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteCharacteristicGetDescriptors_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> characteristics_instance_id;
    int32_t quantity;
    uint8_t pad1_[4];
    mojo::internal::Pointer<::bluetooth::mojom::internal::UUID_Data> descriptor_uuid;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteCharacteristicGetDescriptors_Params_Data>;

    WebBluetoothService_RemoteCharacteristicGetDescriptors_Params_Data();
    ~WebBluetoothService_RemoteCharacteristicGetDescriptors_Params_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RemoteCharacteristicGetDescriptors_Params_Data) == 32,
    "Bad sizeof(WebBluetoothService_RemoteCharacteristicGetDescriptors_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteCharacteristicGetDescriptors_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::WebBluetoothRemoteGATTDescriptor_Data>>> descriptors;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteCharacteristicGetDescriptors_ResponseParams_Data>;

    WebBluetoothService_RemoteCharacteristicGetDescriptors_ResponseParams_Data();
    ~WebBluetoothService_RemoteCharacteristicGetDescriptors_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RemoteCharacteristicGetDescriptors_ResponseParams_Data) == 24,
    "Bad sizeof(WebBluetoothService_RemoteCharacteristicGetDescriptors_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteDescriptorReadValue_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> descriptor_instance_id;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteDescriptorReadValue_Params_Data>;

    WebBluetoothService_RemoteDescriptorReadValue_Params_Data();
    ~WebBluetoothService_RemoteDescriptorReadValue_Params_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RemoteDescriptorReadValue_Params_Data) == 16, "Bad sizeof(WebBluetoothService_RemoteDescriptorReadValue_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteDescriptorReadValue_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> value;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteDescriptorReadValue_ResponseParams_Data>;

    WebBluetoothService_RemoteDescriptorReadValue_ResponseParams_Data();
    ~WebBluetoothService_RemoteDescriptorReadValue_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RemoteDescriptorReadValue_ResponseParams_Data) == 24,
    "Bad sizeof(WebBluetoothService_RemoteDescriptorReadValue_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteDescriptorWriteValue_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> descriptor_instance_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> value;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteDescriptorWriteValue_Params_Data>;

    WebBluetoothService_RemoteDescriptorWriteValue_Params_Data();
    ~WebBluetoothService_RemoteDescriptorWriteValue_Params_Data() = delete;
};
static_assert(
    sizeof(WebBluetoothService_RemoteDescriptorWriteValue_Params_Data) == 24, "Bad sizeof(WebBluetoothService_RemoteDescriptorWriteValue_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RemoteDescriptorWriteValue_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RemoteDescriptorWriteValue_ResponseParams_Data>;

    WebBluetoothService_RemoteDescriptorWriteValue_ResponseParams_Data();
    ~WebBluetoothService_RemoteDescriptorWriteValue_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RemoteDescriptorWriteValue_ResponseParams_Data) == 16,
    "Bad sizeof(WebBluetoothService_RemoteDescriptorWriteValue_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RequestScanningStart_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data client;
    mojo::internal::Pointer<internal::WebBluetoothRequestLEScanOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RequestScanningStart_Params_Data>;

    WebBluetoothService_RequestScanningStart_Params_Data();
    ~WebBluetoothService_RequestScanningStart_Params_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_RequestScanningStart_Params_Data) == 24, "Bad sizeof(WebBluetoothService_RequestScanningStart_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_RequestScanningStart_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_RequestScanningStart_ResponseParams_Data>;

    WebBluetoothService_RequestScanningStart_ResponseParams_Data();
    ~WebBluetoothService_RequestScanningStart_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(WebBluetoothService_RequestScanningStart_ResponseParams_Data) == 16, "Bad sizeof(WebBluetoothService_RequestScanningStart_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_WatchAdvertisementsForDevice_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::WebBluetoothDeviceId_Data> device_id;
    mojo::internal::AssociatedInterface_Data client;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_WatchAdvertisementsForDevice_Params_Data>;

    WebBluetoothService_WatchAdvertisementsForDevice_Params_Data();
    ~WebBluetoothService_WatchAdvertisementsForDevice_Params_Data() = delete;
};
static_assert(
    sizeof(WebBluetoothService_WatchAdvertisementsForDevice_Params_Data) == 24, "Bad sizeof(WebBluetoothService_WatchAdvertisementsForDevice_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothService_WatchAdvertisementsForDevice_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<WebBluetoothService_WatchAdvertisementsForDevice_ResponseParams_Data>;

    WebBluetoothService_WatchAdvertisementsForDevice_ResponseParams_Data();
    ~WebBluetoothService_WatchAdvertisementsForDevice_ResponseParams_Data() = delete;
};
static_assert(sizeof(WebBluetoothService_WatchAdvertisementsForDevice_ResponseParams_Data) == 16,
    "Bad sizeof(WebBluetoothService_WatchAdvertisementsForDevice_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothServerClient_GATTServerDisconnected_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothServerClient_GATTServerDisconnected_Params_Data>;

    WebBluetoothServerClient_GATTServerDisconnected_Params_Data();
    ~WebBluetoothServerClient_GATTServerDisconnected_Params_Data() = delete;
};
static_assert(
    sizeof(WebBluetoothServerClient_GATTServerDisconnected_Params_Data) == 8, "Bad sizeof(WebBluetoothServerClient_GATTServerDisconnected_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothCharacteristicClient_RemoteCharacteristicValueChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyBuffer_Data> value;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothCharacteristicClient_RemoteCharacteristicValueChanged_Params_Data>;

    WebBluetoothCharacteristicClient_RemoteCharacteristicValueChanged_Params_Data();
    ~WebBluetoothCharacteristicClient_RemoteCharacteristicValueChanged_Params_Data() = delete;
};
static_assert(sizeof(WebBluetoothCharacteristicClient_RemoteCharacteristicValueChanged_Params_Data) == 16,
    "Bad sizeof(WebBluetoothCharacteristicClient_RemoteCharacteristicValueChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) WebBluetoothAdvertisementClient_AdvertisingEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::WebBluetoothAdvertisingEvent_Data> result;

private:
    friend class mojo::internal::MessageFragment<WebBluetoothAdvertisementClient_AdvertisingEvent_Params_Data>;

    WebBluetoothAdvertisementClient_AdvertisingEvent_Params_Data();
    ~WebBluetoothAdvertisementClient_AdvertisingEvent_Params_Data() = delete;
};
static_assert(
    sizeof(WebBluetoothAdvertisementClient_AdvertisingEvent_Params_Data) == 16, "Bad sizeof(WebBluetoothAdvertisementClient_AdvertisingEvent_Params_Data)");

