// services/resource_coordinator/public/mojom/memory_instrumentation/memory_instrumentation.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_RESOURCE_COORDINATOR_PUBLIC_MOJOM_MEMORY_INSTRUMENTATION_MEMORY_INSTRUMENTATION_MOJOM_PARAMS_DATA_H_
#define SERVICES_RESOURCE_COORDINATOR_PUBLIC_MOJOM_MEMORY_INSTRUMENTATION_MEMORY_INSTRUMENTATION_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace memory_instrumentation::mojom {
namespace internal {
class COMPONENT_EXPORT(RESOURCE_COORDINATOR_PUBLIC_MOJOM_SHARED) ClientProcess_RequestChromeMemoryDump_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::RequestArgs_Data> args;

private:
    friend class mojo::internal::MessageFragment<ClientProcess_RequestChromeMemoryDump_Params_Data>;

    ClientProcess_RequestChromeMemoryDump_Params_Data();
    ~ClientProcess_RequestChromeMemoryDump_Params_Data() = delete;
};
static_assert(sizeof(ClientProcess_RequestChromeMemoryDump_Params_Data) == 16, "Bad sizeof(ClientProcess_RequestChromeMemoryDump_Params_Data)");
class COMPONENT_EXPORT(RESOURCE_COORDINATOR_PUBLIC_MOJOM_SHARED) ClientProcess_RequestChromeMemoryDump_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    uint64_t dump_id;
    mojo::internal::Pointer<internal::RawProcessMemoryDump_Data> raw_process_memory_dump;

private:
    friend class mojo::internal::MessageFragment<ClientProcess_RequestChromeMemoryDump_ResponseParams_Data>;

    ClientProcess_RequestChromeMemoryDump_ResponseParams_Data();
    ~ClientProcess_RequestChromeMemoryDump_ResponseParams_Data() = delete;
};
static_assert(sizeof(ClientProcess_RequestChromeMemoryDump_ResponseParams_Data) == 32, "Bad sizeof(ClientProcess_RequestChromeMemoryDump_ResponseParams_Data)");
class COMPONENT_EXPORT(RESOURCE_COORDINATOR_PUBLIC_MOJOM_SHARED) ClientProcess_RequestOSMemoryDump_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t option;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::ProcessId_Data>>> pids;

private:
    friend class mojo::internal::MessageFragment<ClientProcess_RequestOSMemoryDump_Params_Data>;

    ClientProcess_RequestOSMemoryDump_Params_Data();
    ~ClientProcess_RequestOSMemoryDump_Params_Data() = delete;
};
static_assert(sizeof(ClientProcess_RequestOSMemoryDump_Params_Data) == 24, "Bad sizeof(ClientProcess_RequestOSMemoryDump_Params_Data)");
class COMPONENT_EXPORT(RESOURCE_COORDINATOR_PUBLIC_MOJOM_SHARED) ClientProcess_RequestOSMemoryDump_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<
        mojo::internal::Map_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::ProcessId_Data>, mojo::internal::Pointer<internal::RawOSMemDump_Data>>>
        dumps;

private:
    friend class mojo::internal::MessageFragment<ClientProcess_RequestOSMemoryDump_ResponseParams_Data>;

    ClientProcess_RequestOSMemoryDump_ResponseParams_Data();
    ~ClientProcess_RequestOSMemoryDump_ResponseParams_Data() = delete;
};
static_assert(sizeof(ClientProcess_RequestOSMemoryDump_ResponseParams_Data) == 24, "Bad sizeof(ClientProcess_RequestOSMemoryDump_ResponseParams_Data)");
class COMPONENT_EXPORT(RESOURCE_COORDINATOR_PUBLIC_MOJOM_SHARED) HeapProfiler_DumpProcessesForTracing_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t strip_path_from_mapped_files : 1;
    uint8_t write_proto : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<HeapProfiler_DumpProcessesForTracing_Params_Data>;

    HeapProfiler_DumpProcessesForTracing_Params_Data();
    ~HeapProfiler_DumpProcessesForTracing_Params_Data() = delete;
};
static_assert(sizeof(HeapProfiler_DumpProcessesForTracing_Params_Data) == 16, "Bad sizeof(HeapProfiler_DumpProcessesForTracing_Params_Data)");
class COMPONENT_EXPORT(RESOURCE_COORDINATOR_PUBLIC_MOJOM_SHARED) HeapProfiler_DumpProcessesForTracing_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::HeapProfileResult_Data>>> results;

private:
    friend class mojo::internal::MessageFragment<HeapProfiler_DumpProcessesForTracing_ResponseParams_Data>;

    HeapProfiler_DumpProcessesForTracing_ResponseParams_Data();
    ~HeapProfiler_DumpProcessesForTracing_ResponseParams_Data() = delete;
};
static_assert(sizeof(HeapProfiler_DumpProcessesForTracing_ResponseParams_Data) == 16, "Bad sizeof(HeapProfiler_DumpProcessesForTracing_ResponseParams_Data)");
class COMPONENT_EXPORT(RESOURCE_COORDINATOR_PUBLIC_MOJOM_SHARED) HeapProfilerHelper_GetVmRegionsForHeapProfiler_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::ProcessId_Data>>> pids;

private:
    friend class mojo::internal::MessageFragment<HeapProfilerHelper_GetVmRegionsForHeapProfiler_Params_Data>;

    HeapProfilerHelper_GetVmRegionsForHeapProfiler_Params_Data();
    ~HeapProfilerHelper_GetVmRegionsForHeapProfiler_Params_Data() = delete;
};
static_assert(
    sizeof(HeapProfilerHelper_GetVmRegionsForHeapProfiler_Params_Data) == 16, "Bad sizeof(HeapProfilerHelper_GetVmRegionsForHeapProfiler_Params_Data)");
class COMPONENT_EXPORT(RESOURCE_COORDINATOR_PUBLIC_MOJOM_SHARED) HeapProfilerHelper_GetVmRegionsForHeapProfiler_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Map_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::ProcessId_Data>,
        mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::VmRegion_Data>>>>>
        vm_regions;

private:
    friend class mojo::internal::MessageFragment<HeapProfilerHelper_GetVmRegionsForHeapProfiler_ResponseParams_Data>;

    HeapProfilerHelper_GetVmRegionsForHeapProfiler_ResponseParams_Data();
    ~HeapProfilerHelper_GetVmRegionsForHeapProfiler_ResponseParams_Data() = delete;
};
static_assert(sizeof(HeapProfilerHelper_GetVmRegionsForHeapProfiler_ResponseParams_Data) == 16,
    "Bad sizeof(HeapProfilerHelper_GetVmRegionsForHeapProfiler_ResponseParams_Data)");
class COMPONENT_EXPORT(RESOURCE_COORDINATOR_PUBLIC_MOJOM_SHARED) Coordinator_RequestGlobalMemoryDump_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t dump_type;
    int32_t level_of_detail;
    int32_t determinism;
    uint8_t pad2_[4];
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> allocator_dump_names;

private:
    friend class mojo::internal::MessageFragment<Coordinator_RequestGlobalMemoryDump_Params_Data>;

    Coordinator_RequestGlobalMemoryDump_Params_Data();
    ~Coordinator_RequestGlobalMemoryDump_Params_Data() = delete;
};
static_assert(sizeof(Coordinator_RequestGlobalMemoryDump_Params_Data) == 32, "Bad sizeof(Coordinator_RequestGlobalMemoryDump_Params_Data)");
class COMPONENT_EXPORT(RESOURCE_COORDINATOR_PUBLIC_MOJOM_SHARED) Coordinator_RequestGlobalMemoryDump_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<internal::GlobalMemoryDump_Data> global_memory_dump;

private:
    friend class mojo::internal::MessageFragment<Coordinator_RequestGlobalMemoryDump_ResponseParams_Data>;

    Coordinator_RequestGlobalMemoryDump_ResponseParams_Data();
    ~Coordinator_RequestGlobalMemoryDump_ResponseParams_Data() = delete;
};
static_assert(sizeof(Coordinator_RequestGlobalMemoryDump_ResponseParams_Data) == 24, "Bad sizeof(Coordinator_RequestGlobalMemoryDump_ResponseParams_Data)");
class COMPONENT_EXPORT(RESOURCE_COORDINATOR_PUBLIC_MOJOM_SHARED) Coordinator_RequestGlobalMemoryDumpForPid_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ProcessId_Data> pid;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> allocator_dump_names;

private:
    friend class mojo::internal::MessageFragment<Coordinator_RequestGlobalMemoryDumpForPid_Params_Data>;

    Coordinator_RequestGlobalMemoryDumpForPid_Params_Data();
    ~Coordinator_RequestGlobalMemoryDumpForPid_Params_Data() = delete;
};
static_assert(sizeof(Coordinator_RequestGlobalMemoryDumpForPid_Params_Data) == 24, "Bad sizeof(Coordinator_RequestGlobalMemoryDumpForPid_Params_Data)");
class COMPONENT_EXPORT(RESOURCE_COORDINATOR_PUBLIC_MOJOM_SHARED) Coordinator_RequestGlobalMemoryDumpForPid_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<internal::GlobalMemoryDump_Data> global_memory_dump;

private:
    friend class mojo::internal::MessageFragment<Coordinator_RequestGlobalMemoryDumpForPid_ResponseParams_Data>;

    Coordinator_RequestGlobalMemoryDumpForPid_ResponseParams_Data();
    ~Coordinator_RequestGlobalMemoryDumpForPid_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(Coordinator_RequestGlobalMemoryDumpForPid_ResponseParams_Data) == 24, "Bad sizeof(Coordinator_RequestGlobalMemoryDumpForPid_ResponseParams_Data)");
class COMPONENT_EXPORT(RESOURCE_COORDINATOR_PUBLIC_MOJOM_SHARED) Coordinator_RequestPrivateMemoryFootprint_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ProcessId_Data> pid;

private:
    friend class mojo::internal::MessageFragment<Coordinator_RequestPrivateMemoryFootprint_Params_Data>;

    Coordinator_RequestPrivateMemoryFootprint_Params_Data();
    ~Coordinator_RequestPrivateMemoryFootprint_Params_Data() = delete;
};
static_assert(sizeof(Coordinator_RequestPrivateMemoryFootprint_Params_Data) == 16, "Bad sizeof(Coordinator_RequestPrivateMemoryFootprint_Params_Data)");
class COMPONENT_EXPORT(RESOURCE_COORDINATOR_PUBLIC_MOJOM_SHARED) Coordinator_RequestPrivateMemoryFootprint_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<internal::GlobalMemoryDump_Data> global_memory_dump;

private:
    friend class mojo::internal::MessageFragment<Coordinator_RequestPrivateMemoryFootprint_ResponseParams_Data>;

    Coordinator_RequestPrivateMemoryFootprint_ResponseParams_Data();
    ~Coordinator_RequestPrivateMemoryFootprint_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(Coordinator_RequestPrivateMemoryFootprint_ResponseParams_Data) == 24, "Bad sizeof(Coordinator_RequestPrivateMemoryFootprint_ResponseParams_Data)");
class COMPONENT_EXPORT(RESOURCE_COORDINATOR_PUBLIC_MOJOM_SHARED) Coordinator_RequestGlobalMemoryDumpAndAppendToTrace_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t dump_type;
    int32_t level_of_detail;
    int32_t determinism;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Coordinator_RequestGlobalMemoryDumpAndAppendToTrace_Params_Data>;

    Coordinator_RequestGlobalMemoryDumpAndAppendToTrace_Params_Data();
    ~Coordinator_RequestGlobalMemoryDumpAndAppendToTrace_Params_Data() = delete;
};
static_assert(sizeof(Coordinator_RequestGlobalMemoryDumpAndAppendToTrace_Params_Data) == 24,
    "Bad sizeof(Coordinator_RequestGlobalMemoryDumpAndAppendToTrace_Params_Data)");
class COMPONENT_EXPORT(RESOURCE_COORDINATOR_PUBLIC_MOJOM_SHARED) Coordinator_RequestGlobalMemoryDumpAndAppendToTrace_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    uint64_t dump_id;

private:
    friend class mojo::internal::MessageFragment<Coordinator_RequestGlobalMemoryDumpAndAppendToTrace_ResponseParams_Data>;

    Coordinator_RequestGlobalMemoryDumpAndAppendToTrace_ResponseParams_Data();
    ~Coordinator_RequestGlobalMemoryDumpAndAppendToTrace_ResponseParams_Data() = delete;
};
static_assert(sizeof(Coordinator_RequestGlobalMemoryDumpAndAppendToTrace_ResponseParams_Data) == 24,
    "Bad sizeof(Coordinator_RequestGlobalMemoryDumpAndAppendToTrace_ResponseParams_Data)");
class COMPONENT_EXPORT(RESOURCE_COORDINATOR_PUBLIC_MOJOM_SHARED) CoordinatorConnector_RegisterCoordinatorClient_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    mojo::internal::Interface_Data client_process;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CoordinatorConnector_RegisterCoordinatorClient_Params_Data>;

    CoordinatorConnector_RegisterCoordinatorClient_Params_Data();
    ~CoordinatorConnector_RegisterCoordinatorClient_Params_Data() = delete;
};
static_assert(
