// third_party/blink/public/mojom/page/widget.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_PAGE_WIDGET_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_PAGE_WIDGET_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_DragTargetDragEnter_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::DragData_Data> drag_data;
    mojo::internal::Pointer<::gfx::mojom::internal::PointF_Data> point_in_viewport;
    mojo::internal::Pointer<::gfx::mojom::internal::PointF_Data> screen_point;
    mojo::internal::Pointer<::blink::mojom::internal::AllowedDragOperations_Data> operations_allowed;
    uint32_t key_modifiers;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameWidget_DragTargetDragEnter_Params_Data>;

    FrameWidget_DragTargetDragEnter_Params_Data();
    ~FrameWidget_DragTargetDragEnter_Params_Data() = delete;
};
static_assert(sizeof(FrameWidget_DragTargetDragEnter_Params_Data) == 48, "Bad sizeof(FrameWidget_DragTargetDragEnter_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_DragTargetDragEnter_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t operation;
    uint8_t document_is_handling_drag : 1;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<FrameWidget_DragTargetDragEnter_ResponseParams_Data>;

    FrameWidget_DragTargetDragEnter_ResponseParams_Data();
    ~FrameWidget_DragTargetDragEnter_ResponseParams_Data() = delete;
};
static_assert(sizeof(FrameWidget_DragTargetDragEnter_ResponseParams_Data) == 16, "Bad sizeof(FrameWidget_DragTargetDragEnter_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_DragTargetDragOver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::PointF_Data> point_in_viewport;
    mojo::internal::Pointer<::gfx::mojom::internal::PointF_Data> screen_point;
    mojo::internal::Pointer<::blink::mojom::internal::AllowedDragOperations_Data> operations_allowed;
    uint32_t key_modifiers;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameWidget_DragTargetDragOver_Params_Data>;

    FrameWidget_DragTargetDragOver_Params_Data();
    ~FrameWidget_DragTargetDragOver_Params_Data() = delete;
};
static_assert(sizeof(FrameWidget_DragTargetDragOver_Params_Data) == 40, "Bad sizeof(FrameWidget_DragTargetDragOver_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_DragTargetDragOver_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t operation;
    uint8_t document_is_handling_drag : 1;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<FrameWidget_DragTargetDragOver_ResponseParams_Data>;

    FrameWidget_DragTargetDragOver_ResponseParams_Data();
    ~FrameWidget_DragTargetDragOver_ResponseParams_Data() = delete;
};
static_assert(sizeof(FrameWidget_DragTargetDragOver_ResponseParams_Data) == 16, "Bad sizeof(FrameWidget_DragTargetDragOver_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_DragTargetDragLeave_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::PointF_Data> point_in_viewport;
    mojo::internal::Pointer<::gfx::mojom::internal::PointF_Data> screen_point;

private:
    friend class mojo::internal::MessageFragment<FrameWidget_DragTargetDragLeave_Params_Data>;

    FrameWidget_DragTargetDragLeave_Params_Data();
    ~FrameWidget_DragTargetDragLeave_Params_Data() = delete;
};
static_assert(sizeof(FrameWidget_DragTargetDragLeave_Params_Data) == 24, "Bad sizeof(FrameWidget_DragTargetDragLeave_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_DragTargetDrop_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::DragData_Data> drag_data;
    mojo::internal::Pointer<::gfx::mojom::internal::PointF_Data> point_in_viewport;
    mojo::internal::Pointer<::gfx::mojom::internal::PointF_Data> screen_point;
    uint32_t key_modifiers;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameWidget_DragTargetDrop_Params_Data>;

    FrameWidget_DragTargetDrop_Params_Data();
    ~FrameWidget_DragTargetDrop_Params_Data() = delete;
};
static_assert(sizeof(FrameWidget_DragTargetDrop_Params_Data) == 40, "Bad sizeof(FrameWidget_DragTargetDrop_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_DragTargetDrop_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidget_DragTargetDrop_ResponseParams_Data>;

    FrameWidget_DragTargetDrop_ResponseParams_Data();
    ~FrameWidget_DragTargetDrop_ResponseParams_Data() = delete;
};
static_assert(sizeof(FrameWidget_DragTargetDrop_ResponseParams_Data) == 8, "Bad sizeof(FrameWidget_DragTargetDrop_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_DragSourceEndedAt_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::PointF_Data> point_in_viewport;
    mojo::internal::Pointer<::gfx::mojom::internal::PointF_Data> screen_point;
    int32_t drag_operation;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameWidget_DragSourceEndedAt_Params_Data>;

    FrameWidget_DragSourceEndedAt_Params_Data();
    ~FrameWidget_DragSourceEndedAt_Params_Data() = delete;
};
static_assert(sizeof(FrameWidget_DragSourceEndedAt_Params_Data) == 32, "Bad sizeof(FrameWidget_DragSourceEndedAt_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_DragSourceEndedAt_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidget_DragSourceEndedAt_ResponseParams_Data>;

    FrameWidget_DragSourceEndedAt_ResponseParams_Data();
    ~FrameWidget_DragSourceEndedAt_ResponseParams_Data() = delete;
};
static_assert(sizeof(FrameWidget_DragSourceEndedAt_ResponseParams_Data) == 8, "Bad sizeof(FrameWidget_DragSourceEndedAt_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_DragSourceSystemDragEnded_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidget_DragSourceSystemDragEnded_Params_Data>;

    FrameWidget_DragSourceSystemDragEnded_Params_Data();
    ~FrameWidget_DragSourceSystemDragEnded_Params_Data() = delete;
};
static_assert(sizeof(FrameWidget_DragSourceSystemDragEnded_Params_Data) == 8, "Bad sizeof(FrameWidget_DragSourceSystemDragEnded_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_OnStartStylusWriting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> focus_rect_in_widget;

private:
    friend class mojo::internal::MessageFragment<FrameWidget_OnStartStylusWriting_Params_Data>;

    FrameWidget_OnStartStylusWriting_Params_Data();
    ~FrameWidget_OnStartStylusWriting_Params_Data() = delete;
};
static_assert(sizeof(FrameWidget_OnStartStylusWriting_Params_Data) == 16, "Bad sizeof(FrameWidget_OnStartStylusWriting_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_OnStartStylusWriting_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::StylusWritingFocusResult_Data> focus_result;

private:
    friend class mojo::internal::MessageFragment<FrameWidget_OnStartStylusWriting_ResponseParams_Data>;

    FrameWidget_OnStartStylusWriting_ResponseParams_Data();
    ~FrameWidget_OnStartStylusWriting_ResponseParams_Data() = delete;
};
static_assert(sizeof(FrameWidget_OnStartStylusWriting_ResponseParams_Data) == 16, "Bad sizeof(FrameWidget_OnStartStylusWriting_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_SetBackgroundOpaque_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t opaque : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FrameWidget_SetBackgroundOpaque_Params_Data>;

    FrameWidget_SetBackgroundOpaque_Params_Data();
    ~FrameWidget_SetBackgroundOpaque_Params_Data() = delete;
};
static_assert(sizeof(FrameWidget_SetBackgroundOpaque_Params_Data) == 16, "Bad sizeof(FrameWidget_SetBackgroundOpaque_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_SetTextDirection_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t direction;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameWidget_SetTextDirection_Params_Data>;

    FrameWidget_SetTextDirection_Params_Data();
    ~FrameWidget_SetTextDirection_Params_Data() = delete;
};
static_assert(sizeof(FrameWidget_SetTextDirection_Params_Data) == 16, "Bad sizeof(FrameWidget_SetTextDirection_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_SetActive_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t active : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FrameWidget_SetActive_Params_Data>;

    FrameWidget_SetActive_Params_Data();
    ~FrameWidget_SetActive_Params_Data() = delete;
};
static_assert(sizeof(FrameWidget_SetActive_Params_Data) == 16, "Bad sizeof(FrameWidget_SetActive_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_SetInheritedEffectiveTouchActionForSubFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t touch_action;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameWidget_SetInheritedEffectiveTouchActionForSubFrame_Params_Data>;

    FrameWidget_SetInheritedEffectiveTouchActionForSubFrame_Params_Data();
    ~FrameWidget_SetInheritedEffectiveTouchActionForSubFrame_Params_Data() = delete;
};
static_assert(sizeof(FrameWidget_SetInheritedEffectiveTouchActionForSubFrame_Params_Data) == 16,
    "Bad sizeof(FrameWidget_SetInheritedEffectiveTouchActionForSubFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_UpdateRenderThrottlingStatusForSubFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_throttled : 1;
    uint8_t subtree_throttled : 1;
    uint8_t display_locked : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FrameWidget_UpdateRenderThrottlingStatusForSubFrame_Params_Data>;

    FrameWidget_UpdateRenderThrottlingStatusForSubFrame_Params_Data();
    ~FrameWidget_UpdateRenderThrottlingStatusForSubFrame_Params_Data() = delete;
};
static_assert(sizeof(FrameWidget_UpdateRenderThrottlingStatusForSubFrame_Params_Data) == 16,
    "Bad sizeof(FrameWidget_UpdateRenderThrottlingStatusForSubFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_SetIsInertForSubFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t inert : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<FrameWidget_SetIsInertForSubFrame_Params_Data>;

    FrameWidget_SetIsInertForSubFrame_Params_Data();
    ~FrameWidget_SetIsInertForSubFrame_Params_Data() = delete;
};
static_assert(sizeof(FrameWidget_SetIsInertForSubFrame_Params_Data) == 16, "Bad sizeof(FrameWidget_SetIsInertForSubFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_EnableDeviceEmulation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::DeviceEmulationParams_Data> parameters;

private:
    friend class mojo::internal::MessageFragment<FrameWidget_EnableDeviceEmulation_Params_Data>;

    FrameWidget_EnableDeviceEmulation_Params_Data();
    ~FrameWidget_EnableDeviceEmulation_Params_Data() = delete;
};
static_assert(sizeof(FrameWidget_EnableDeviceEmulation_Params_Data) == 16, "Bad sizeof(FrameWidget_EnableDeviceEmulation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_DisableDeviceEmulation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidget_DisableDeviceEmulation_Params_Data>;

    FrameWidget_DisableDeviceEmulation_Params_Data();
    ~FrameWidget_DisableDeviceEmulation_Params_Data() = delete;
};
static_assert(sizeof(FrameWidget_DisableDeviceEmulation_Params_Data) == 8, "Bad sizeof(FrameWidget_DisableDeviceEmulation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_BindWidgetCompositor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data host;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<FrameWidget_BindWidgetCompositor_Params_Data>;

    FrameWidget_BindWidgetCompositor_Params_Data();
    ~FrameWidget_BindWidgetCompositor_Params_Data() = delete;
};
static_assert(sizeof(FrameWidget_BindWidgetCompositor_Params_Data) == 16, "Bad sizeof(FrameWidget_BindWidgetCompositor_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_SetViewportIntersection_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::ViewportIntersectionState_Data> intersection_state;
    mojo::internal::Pointer<::blink::mojom::internal::VisualProperties_Data> visual_properties;

private:
    friend class mojo::internal::MessageFragment<FrameWidget_SetViewportIntersection_Params_Data>;

    FrameWidget_SetViewportIntersection_Params_Data();
    ~FrameWidget_SetViewportIntersection_Params_Data() = delete;
};
static_assert(sizeof(FrameWidget_SetViewportIntersection_Params_Data) == 24, "Bad sizeof(FrameWidget_SetViewportIntersection_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidget_NotifyClearedDisplayedGraphics_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidget_NotifyClearedDisplayedGraphics_Params_Data>;

    FrameWidget_NotifyClearedDisplayedGraphics_Params_Data();
    ~FrameWidget_NotifyClearedDisplayedGraphics_Params_Data() = delete;
};
static_assert(sizeof(FrameWidget_NotifyClearedDisplayedGraphics_Params_Data) == 8, "Bad sizeof(FrameWidget_NotifyClearedDisplayedGraphics_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetHost_AnimateDoubleTapZoomInMainFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> tap_point;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> rect_to_zoom;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetHost_AnimateDoubleTapZoomInMainFrame_Params_Data>;

    FrameWidgetHost_AnimateDoubleTapZoomInMainFrame_Params_Data();
    ~FrameWidgetHost_AnimateDoubleTapZoomInMainFrame_Params_Data() = delete;
};
static_assert(
    sizeof(FrameWidgetHost_AnimateDoubleTapZoomInMainFrame_Params_Data) == 24, "Bad sizeof(FrameWidgetHost_AnimateDoubleTapZoomInMainFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetHost_ZoomToFindInPageRectInMainFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> rect_to_zoom;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetHost_ZoomToFindInPageRectInMainFrame_Params_Data>;

    FrameWidgetHost_ZoomToFindInPageRectInMainFrame_Params_Data();
    ~FrameWidgetHost_ZoomToFindInPageRectInMainFrame_Params_Data() = delete;
};
static_assert(
    sizeof(FrameWidgetHost_ZoomToFindInPageRectInMainFrame_Params_Data) == 16, "Bad sizeof(FrameWidgetHost_ZoomToFindInPageRectInMainFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetHost_SetHasTouchEventConsumers_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::TouchEventConsumers_Data> touch_event_consumers;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetHost_SetHasTouchEventConsumers_Params_Data>;

    FrameWidgetHost_SetHasTouchEventConsumers_Params_Data();
    ~FrameWidgetHost_SetHasTouchEventConsumers_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetHost_SetHasTouchEventConsumers_Params_Data) == 16, "Bad sizeof(FrameWidgetHost_SetHasTouchEventConsumers_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetHost_IntrinsicSizingInfoChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::IntrinsicSizingInfo_Data> sizing_info;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetHost_IntrinsicSizingInfoChanged_Params_Data>;

    FrameWidgetHost_IntrinsicSizingInfoChanged_Params_Data();
    ~FrameWidgetHost_IntrinsicSizingInfoChanged_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetHost_IntrinsicSizingInfoChanged_Params_Data) == 16, "Bad sizeof(FrameWidgetHost_IntrinsicSizingInfoChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetHost_AutoscrollStart_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::PointF_Data> position;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetHost_AutoscrollStart_Params_Data>;

    FrameWidgetHost_AutoscrollStart_Params_Data();
    ~FrameWidgetHost_AutoscrollStart_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetHost_AutoscrollStart_Params_Data) == 16, "Bad sizeof(FrameWidgetHost_AutoscrollStart_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetHost_AutoscrollFling_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Vector2dF_Data> velocity;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetHost_AutoscrollFling_Params_Data>;

    FrameWidgetHost_AutoscrollFling_Params_Data();
    ~FrameWidgetHost_AutoscrollFling_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetHost_AutoscrollFling_Params_Data) == 16, "Bad sizeof(FrameWidgetHost_AutoscrollFling_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) FrameWidgetHost_AutoscrollEnd_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<FrameWidgetHost_AutoscrollEnd_Params_Data>;

    FrameWidgetHost_AutoscrollEnd_Params_Data();
    ~FrameWidgetHost_AutoscrollEnd_Params_Data() = delete;
};
static_assert(sizeof(FrameWidgetHost_AutoscrollEnd_Params_Data) == 8, "Bad sizeof(FrameWidgetHost_AutoscrollEnd_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PopupWidgetHost_RequestClosePopup_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PopupWidgetHost_RequestClosePopup_Params_Data>;

    PopupWidgetHost_RequestClosePopup_Params_Data();
    ~PopupWidgetHost_RequestClosePopup_Params_Data() = delete;
};
static_assert(sizeof(PopupWidgetHost_RequestClosePopup_Params_Data) == 8, "Bad sizeof(PopupWidgetHost_RequestClosePopup_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PopupWidgetHost_ShowPopup_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> initial_rect;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> anchor_rect;

private:
    friend class mojo::internal::MessageFragment<PopupWidgetHost_ShowPopup_Params_Data>;

    PopupWidgetHost_ShowPopup_Params_Data();
    ~PopupWidgetHost_ShowPopup_Params_Data() = delete;
};
static_assert(sizeof(PopupWidgetHost_ShowPopup_Params_Data) == 24, "Bad sizeof(PopupWidgetHost_ShowPopup_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PopupWidgetHost_ShowPopup_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PopupWidgetHost_ShowPopup_ResponseParams_Data>;

    PopupWidgetHost_ShowPopup_ResponseParams_Data();
    ~PopupWidgetHost_ShowPopup_ResponseParams_Data() = delete;
};
static_assert(sizeof(PopupWidgetHost_ShowPopup_ResponseParams_Data) == 8, "Bad sizeof(PopupWidgetHost_ShowPopup_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PopupWidgetHost_SetPopupBounds_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> bounds;

private:
    friend class mojo::internal::MessageFragment<PopupWidgetHost_SetPopupBounds_Params_Data>;

    PopupWidgetHost_SetPopupBounds_Params_Data();
    ~PopupWidgetHost_SetPopupBounds_Params_Data() = delete;
};
static_assert(sizeof(PopupWidgetHost_SetPopupBounds_Params_Data) == 16, "Bad sizeof(PopupWidgetHost_SetPopupBounds_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PopupWidgetHost_SetPopupBounds_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PopupWidgetHost_SetPopupBounds_ResponseParams_Data>;

    PopupWidgetHost_SetPopupBounds_ResponseParams_Data();
    ~PopupWidgetHost_SetPopupBounds_ResponseParams_Data() = delete;
};
static_assert(sizeof(PopupWidgetHost_SetPopupBounds_ResponseParams_Data) == 8, "Bad sizeof(PopupWidgetHost_SetPopupBounds_ResponseParams_Data)");

} // namespace internal

class FrameWidget_DragTargetDragEnter_ParamsDataView {
public:
    FrameWidget_DragTargetDragEnter_ParamsDataView() = default;

    FrameWidget_DragTargetDragEnter_ParamsDataView(internal::FrameWidget_DragTargetDragEnter_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetDragDataDataView(::blink::mojom::DragDataDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadDragData(UserType* output)
    {

        auto* pointer = data_->drag_data.Get();
        return mojo::internal::Deserialize<::blink::mojom::DragDataDataView>(pointer, output, message_);
    }
    inline void GetPointInViewportDataView(::gfx::mojom::PointFDataView* output);

