// services/media_session/public/mojom/audio_focus.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_MEDIA_SESSION_PUBLIC_MOJOM_AUDIO_FOCUS_MOJOM_PARAMS_DATA_H_
#define SERVICES_MEDIA_SESSION_PUBLIC_MOJOM_AUDIO_FOCUS_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media_session::mojom {
namespace internal {
class AudioFocusObserver_OnFocusGained_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::AudioFocusRequestState_Data> state;

private:
    friend class mojo::internal::MessageFragment<AudioFocusObserver_OnFocusGained_Params_Data>;

    AudioFocusObserver_OnFocusGained_Params_Data();
    ~AudioFocusObserver_OnFocusGained_Params_Data() = delete;
};
static_assert(sizeof(AudioFocusObserver_OnFocusGained_Params_Data) == 16, "Bad sizeof(AudioFocusObserver_OnFocusGained_Params_Data)");
class AudioFocusObserver_OnFocusLost_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::AudioFocusRequestState_Data> state;

private:
    friend class mojo::internal::MessageFragment<AudioFocusObserver_OnFocusLost_Params_Data>;

    AudioFocusObserver_OnFocusLost_Params_Data();
    ~AudioFocusObserver_OnFocusLost_Params_Data() = delete;
};
static_assert(sizeof(AudioFocusObserver_OnFocusLost_Params_Data) == 16, "Bad sizeof(AudioFocusObserver_OnFocusLost_Params_Data)");
class AudioFocusObserver_OnRequestIdReleased_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> request_id;

private:
    friend class mojo::internal::MessageFragment<AudioFocusObserver_OnRequestIdReleased_Params_Data>;

    AudioFocusObserver_OnRequestIdReleased_Params_Data();
    ~AudioFocusObserver_OnRequestIdReleased_Params_Data() = delete;
};
static_assert(sizeof(AudioFocusObserver_OnRequestIdReleased_Params_Data) == 16, "Bad sizeof(AudioFocusObserver_OnRequestIdReleased_Params_Data)");
class AudioFocusRequestClient_RequestAudioFocus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media_session::mojom::internal::MediaSessionInfo_Data> session_info;
    int32_t type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<AudioFocusRequestClient_RequestAudioFocus_Params_Data>;

    AudioFocusRequestClient_RequestAudioFocus_Params_Data();
    ~AudioFocusRequestClient_RequestAudioFocus_Params_Data() = delete;
};
static_assert(sizeof(AudioFocusRequestClient_RequestAudioFocus_Params_Data) == 24, "Bad sizeof(AudioFocusRequestClient_RequestAudioFocus_Params_Data)");
class AudioFocusRequestClient_RequestAudioFocus_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AudioFocusRequestClient_RequestAudioFocus_ResponseParams_Data>;

    AudioFocusRequestClient_RequestAudioFocus_ResponseParams_Data();
    ~AudioFocusRequestClient_RequestAudioFocus_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(AudioFocusRequestClient_RequestAudioFocus_ResponseParams_Data) == 8, "Bad sizeof(AudioFocusRequestClient_RequestAudioFocus_ResponseParams_Data)");
class AudioFocusRequestClient_AbandonAudioFocus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AudioFocusRequestClient_AbandonAudioFocus_Params_Data>;

    AudioFocusRequestClient_AbandonAudioFocus_Params_Data();
    ~AudioFocusRequestClient_AbandonAudioFocus_Params_Data() = delete;
};
static_assert(sizeof(AudioFocusRequestClient_AbandonAudioFocus_Params_Data) == 8, "Bad sizeof(AudioFocusRequestClient_AbandonAudioFocus_Params_Data)");
class AudioFocusRequestClient_MediaSessionInfoChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media_session::mojom::internal::MediaSessionInfo_Data> session_info;

private:
    friend class mojo::internal::MessageFragment<AudioFocusRequestClient_MediaSessionInfoChanged_Params_Data>;

    AudioFocusRequestClient_MediaSessionInfoChanged_Params_Data();
    ~AudioFocusRequestClient_MediaSessionInfoChanged_Params_Data() = delete;
};
static_assert(
    sizeof(AudioFocusRequestClient_MediaSessionInfoChanged_Params_Data) == 16, "Bad sizeof(AudioFocusRequestClient_MediaSessionInfoChanged_Params_Data)");
class AudioFocusManager_RequestAudioFocus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data client;
    mojo::internal::Interface_Data session;
    int32_t type;
    mojo::internal::Pointer<::media_session::mojom::internal::MediaSessionInfo_Data> session_info;

private:
    friend class mojo::internal::MessageFragment<AudioFocusManager_RequestAudioFocus_Params_Data>;

    AudioFocusManager_RequestAudioFocus_Params_Data();
    ~AudioFocusManager_RequestAudioFocus_Params_Data() = delete;
};
static_assert(sizeof(AudioFocusManager_RequestAudioFocus_Params_Data) == 32, "Bad sizeof(AudioFocusManager_RequestAudioFocus_Params_Data)");
class AudioFocusManager_RequestAudioFocus_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> request_id;

private:
    friend class mojo::internal::MessageFragment<AudioFocusManager_RequestAudioFocus_ResponseParams_Data>;

    AudioFocusManager_RequestAudioFocus_ResponseParams_Data();
    ~AudioFocusManager_RequestAudioFocus_ResponseParams_Data() = delete;
};
static_assert(sizeof(AudioFocusManager_RequestAudioFocus_ResponseParams_Data) == 16, "Bad sizeof(AudioFocusManager_RequestAudioFocus_ResponseParams_Data)");
class AudioFocusManager_RequestGroupedAudioFocus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> request_id;
    mojo::internal::Handle_Data client;
    mojo::internal::Interface_Data session;
    int32_t type;
    mojo::internal::Pointer<::media_session::mojom::internal::MediaSessionInfo_Data> session_info;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> group_id;

private:
    friend class mojo::internal::MessageFragment<AudioFocusManager_RequestGroupedAudioFocus_Params_Data>;

    AudioFocusManager_RequestGroupedAudioFocus_Params_Data();
    ~AudioFocusManager_RequestGroupedAudioFocus_Params_Data() = delete;
};
static_assert(sizeof(AudioFocusManager_RequestGroupedAudioFocus_Params_Data) == 48, "Bad sizeof(AudioFocusManager_RequestGroupedAudioFocus_Params_Data)");
class AudioFocusManager_RequestGroupedAudioFocus_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<AudioFocusManager_RequestGroupedAudioFocus_ResponseParams_Data>;

    AudioFocusManager_RequestGroupedAudioFocus_ResponseParams_Data();
    ~AudioFocusManager_RequestGroupedAudioFocus_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(AudioFocusManager_RequestGroupedAudioFocus_ResponseParams_Data) == 16, "Bad sizeof(AudioFocusManager_RequestGroupedAudioFocus_ResponseParams_Data)");
class AudioFocusManager_GetFocusRequests_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<AudioFocusManager_GetFocusRequests_Params_Data>;

    AudioFocusManager_GetFocusRequests_Params_Data();
    ~AudioFocusManager_GetFocusRequests_Params_Data() = delete;
};
static_assert(sizeof(AudioFocusManager_GetFocusRequests_Params_Data) == 8, "Bad sizeof(AudioFocusManager_GetFocusRequests_Params_Data)");
class AudioFocusManager_GetFocusRequests_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::AudioFocusRequestState_Data>>> requests;

private:
    friend class mojo::internal::MessageFragment<AudioFocusManager_GetFocusRequests_ResponseParams_Data>;

    AudioFocusManager_GetFocusRequests_ResponseParams_Data();
    ~AudioFocusManager_GetFocusRequests_ResponseParams_Data() = delete;
};
static_assert(sizeof(AudioFocusManager_GetFocusRequests_ResponseParams_Data) == 16, "Bad sizeof(AudioFocusManager_GetFocusRequests_ResponseParams_Data)");
class AudioFocusManager_AddObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data observer;

private:
    friend class mojo::internal::MessageFragment<AudioFocusManager_AddObserver_Params_Data>;

    AudioFocusManager_AddObserver_Params_Data();
    ~AudioFocusManager_AddObserver_Params_Data() = delete;
};
static_assert(sizeof(AudioFocusManager_AddObserver_Params_Data) == 16, "Bad sizeof(AudioFocusManager_AddObserver_Params_Data)");
class AudioFocusManager_SetSource_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> identity;
    mojo::internal::Pointer<mojo::internal::String_Data> name;

private:
    friend class mojo::internal::MessageFragment<AudioFocusManager_SetSource_Params_Data>;

    AudioFocusManager_SetSource_Params_Data();
    ~AudioFocusManager_SetSource_Params_Data() = delete;
};
static_assert(sizeof(AudioFocusManager_SetSource_Params_Data) == 24, "Bad sizeof(AudioFocusManager_SetSource_Params_Data)");
class AudioFocusManager_SetEnforcementMode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t mode;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<AudioFocusManager_SetEnforcementMode_Params_Data>;

    AudioFocusManager_SetEnforcementMode_Params_Data();
    ~AudioFocusManager_SetEnforcementMode_Params_Data() = delete;
};
static_assert(sizeof(AudioFocusManager_SetEnforcementMode_Params_Data) == 16, "Bad sizeof(AudioFocusManager_SetEnforcementMode_Params_Data)");
class AudioFocusManager_AddSourceObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> source_id;
    mojo::internal::Interface_Data observer;

private:
    friend class mojo::internal::MessageFragment<AudioFocusManager_AddSourceObserver_Params_Data>;

    AudioFocusManager_AddSourceObserver_Params_Data();
    ~AudioFocusManager_AddSourceObserver_Params_Data() = delete;
};
static_assert(sizeof(AudioFocusManager_AddSourceObserver_Params_Data) == 24, "Bad sizeof(AudioFocusManager_AddSourceObserver_Params_Data)");
class AudioFocusManager_GetSourceFocusRequests_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> source_id;

private:
    friend class mojo::internal::MessageFragment<AudioFocusManager_GetSourceFocusRequests_Params_Data>;

    AudioFocusManager_GetSourceFocusRequests_Params_Data();
    ~AudioFocusManager_GetSourceFocusRequests_Params_Data() = delete;
};
static_assert(sizeof(AudioFocusManager_GetSourceFocusRequests_Params_Data) == 16, "Bad sizeof(AudioFocusManager_GetSourceFocusRequests_Params_Data)");
class AudioFocusManager_GetSourceFocusRequests_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::AudioFocusRequestState_Data>>> requests;

private:
    friend class mojo::internal::MessageFragment<AudioFocusManager_GetSourceFocusRequests_ResponseParams_Data>;

    AudioFocusManager_GetSourceFocusRequests_ResponseParams_Data();
    ~AudioFocusManager_GetSourceFocusRequests_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(AudioFocusManager_GetSourceFocusRequests_ResponseParams_Data) == 16, "Bad sizeof(AudioFocusManager_GetSourceFocusRequests_ResponseParams_Data)");
class AudioFocusManager_RequestIdReleased_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> request_id;

private:
    friend class mojo::internal::MessageFragment<AudioFocusManager_RequestIdReleased_Params_Data>;

    AudioFocusManager_RequestIdReleased_Params_Data();
    ~AudioFocusManager_RequestIdReleased_Params_Data() = delete;
};
static_assert(sizeof(AudioFocusManager_RequestIdReleased_Params_Data) == 16, "Bad sizeof(AudioFocusManager_RequestIdReleased_Params_Data)");
class AudioFocusManagerDebug_GetDebugInfoForRequest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> request_id;

private:
    friend class mojo::internal::MessageFragment<AudioFocusManagerDebug_GetDebugInfoForRequest_Params_Data>;

    AudioFocusManagerDebug_GetDebugInfoForRequest_Params_Data();
    ~AudioFocusManagerDebug_GetDebugInfoForRequest_Params_Data() = delete;
};
static_assert(sizeof(AudioFocusManagerDebug_GetDebugInfoForRequest_Params_Data) == 16, "Bad sizeof(AudioFocusManagerDebug_GetDebugInfoForRequest_Params_Data)");
class AudioFocusManagerDebug_GetDebugInfoForRequest_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media_session::mojom::internal::MediaSessionDebugInfo_Data> debug_info;

private:
    friend class mojo::internal::MessageFragment<AudioFocusManagerDebug_GetDebugInfoForRequest_ResponseParams_Data>;

    AudioFocusManagerDebug_GetDebugInfoForRequest_ResponseParams_Data();
    ~AudioFocusManagerDebug_GetDebugInfoForRequest_ResponseParams_Data() = delete;
};
static_assert(sizeof(AudioFocusManagerDebug_GetDebugInfoForRequest_ResponseParams_Data) == 16,
    "Bad sizeof(AudioFocusManagerDebug_GetDebugInfoForRequest_ResponseParams_Data)");

} // namespace internal

class AudioFocusObserver_OnFocusGained_ParamsDataView {
public:
    AudioFocusObserver_OnFocusGained_ParamsDataView() = default;

    AudioFocusObserver_OnFocusGained_ParamsDataView(internal::AudioFocusObserver_OnFocusGained_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetStateDataView(AudioFocusRequestStateDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadState(UserType* output)
    {

        auto* pointer = data_->state.Get();
        return mojo::internal::Deserialize<::media_session::mojom::AudioFocusRequestStateDataView>(pointer, output, message_);
    }

private:
