// services/media_session/public/mojom/media_controller.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_MEDIA_SESSION_PUBLIC_MOJOM_MEDIA_CONTROLLER_MOJOM_PARAMS_DATA_H_
#define SERVICES_MEDIA_SESSION_PUBLIC_MOJOM_MEDIA_CONTROLLER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media_session::mojom {
namespace internal {
class MediaControllerManager_CreateMediaControllerForSession_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> request_id;

private:
    friend class mojo::internal::MessageFragment<MediaControllerManager_CreateMediaControllerForSession_Params_Data>;

    MediaControllerManager_CreateMediaControllerForSession_Params_Data();
    ~MediaControllerManager_CreateMediaControllerForSession_Params_Data() = delete;
};
static_assert(sizeof(MediaControllerManager_CreateMediaControllerForSession_Params_Data) == 24,
    "Bad sizeof(MediaControllerManager_CreateMediaControllerForSession_Params_Data)");
class MediaControllerManager_CreateActiveMediaController_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaControllerManager_CreateActiveMediaController_Params_Data>;

    MediaControllerManager_CreateActiveMediaController_Params_Data();
    ~MediaControllerManager_CreateActiveMediaController_Params_Data() = delete;
};
static_assert(
    sizeof(MediaControllerManager_CreateActiveMediaController_Params_Data) == 16, "Bad sizeof(MediaControllerManager_CreateActiveMediaController_Params_Data)");
class MediaControllerManager_SuspendAllSessions_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaControllerManager_SuspendAllSessions_Params_Data>;

    MediaControllerManager_SuspendAllSessions_Params_Data();
    ~MediaControllerManager_SuspendAllSessions_Params_Data() = delete;
};
static_assert(sizeof(MediaControllerManager_SuspendAllSessions_Params_Data) == 8, "Bad sizeof(MediaControllerManager_SuspendAllSessions_Params_Data)");
class MediaController_Suspend_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_Suspend_Params_Data>;

    MediaController_Suspend_Params_Data();
    ~MediaController_Suspend_Params_Data() = delete;
};
static_assert(sizeof(MediaController_Suspend_Params_Data) == 8, "Bad sizeof(MediaController_Suspend_Params_Data)");
class MediaController_Resume_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_Resume_Params_Data>;

    MediaController_Resume_Params_Data();
    ~MediaController_Resume_Params_Data() = delete;
};
static_assert(sizeof(MediaController_Resume_Params_Data) == 8, "Bad sizeof(MediaController_Resume_Params_Data)");
class MediaController_Stop_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_Stop_Params_Data>;

    MediaController_Stop_Params_Data();
    ~MediaController_Stop_Params_Data() = delete;
};
static_assert(sizeof(MediaController_Stop_Params_Data) == 8, "Bad sizeof(MediaController_Stop_Params_Data)");
class MediaController_ToggleSuspendResume_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_ToggleSuspendResume_Params_Data>;

    MediaController_ToggleSuspendResume_Params_Data();
    ~MediaController_ToggleSuspendResume_Params_Data() = delete;
};
static_assert(sizeof(MediaController_ToggleSuspendResume_Params_Data) == 8, "Bad sizeof(MediaController_ToggleSuspendResume_Params_Data)");
class MediaController_AddObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data observer;

private:
    friend class mojo::internal::MessageFragment<MediaController_AddObserver_Params_Data>;

    MediaController_AddObserver_Params_Data();
    ~MediaController_AddObserver_Params_Data() = delete;
};
static_assert(sizeof(MediaController_AddObserver_Params_Data) == 16, "Bad sizeof(MediaController_AddObserver_Params_Data)");
class MediaController_PreviousTrack_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_PreviousTrack_Params_Data>;

    MediaController_PreviousTrack_Params_Data();
    ~MediaController_PreviousTrack_Params_Data() = delete;
};
static_assert(sizeof(MediaController_PreviousTrack_Params_Data) == 8, "Bad sizeof(MediaController_PreviousTrack_Params_Data)");
class MediaController_NextTrack_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_NextTrack_Params_Data>;

    MediaController_NextTrack_Params_Data();
    ~MediaController_NextTrack_Params_Data() = delete;
};
static_assert(sizeof(MediaController_NextTrack_Params_Data) == 8, "Bad sizeof(MediaController_NextTrack_Params_Data)");
class MediaController_Seek_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> seek_time;

private:
    friend class mojo::internal::MessageFragment<MediaController_Seek_Params_Data>;

    MediaController_Seek_Params_Data();
    ~MediaController_Seek_Params_Data() = delete;
};
static_assert(sizeof(MediaController_Seek_Params_Data) == 16, "Bad sizeof(MediaController_Seek_Params_Data)");
class MediaController_ObserveImages_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t type;
    int32_t minimum_size_px;
    int32_t desired_size_px;
    mojo::internal::Interface_Data observer;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaController_ObserveImages_Params_Data>;

    MediaController_ObserveImages_Params_Data();
    ~MediaController_ObserveImages_Params_Data() = delete;
};
static_assert(sizeof(MediaController_ObserveImages_Params_Data) == 32, "Bad sizeof(MediaController_ObserveImages_Params_Data)");
class MediaController_SeekTo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> seek_time;

private:
    friend class mojo::internal::MessageFragment<MediaController_SeekTo_Params_Data>;

    MediaController_SeekTo_Params_Data();
    ~MediaController_SeekTo_Params_Data() = delete;
};
static_assert(sizeof(MediaController_SeekTo_Params_Data) == 16, "Bad sizeof(MediaController_SeekTo_Params_Data)");
class MediaController_ScrubTo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> seek_time;

private:
    friend class mojo::internal::MessageFragment<MediaController_ScrubTo_Params_Data>;

    MediaController_ScrubTo_Params_Data();
    ~MediaController_ScrubTo_Params_Data() = delete;
};
static_assert(sizeof(MediaController_ScrubTo_Params_Data) == 16, "Bad sizeof(MediaController_ScrubTo_Params_Data)");
class MediaController_EnterPictureInPicture_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_EnterPictureInPicture_Params_Data>;

    MediaController_EnterPictureInPicture_Params_Data();
    ~MediaController_EnterPictureInPicture_Params_Data() = delete;
};
static_assert(sizeof(MediaController_EnterPictureInPicture_Params_Data) == 8, "Bad sizeof(MediaController_EnterPictureInPicture_Params_Data)");
class MediaController_ExitPictureInPicture_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_ExitPictureInPicture_Params_Data>;

    MediaController_ExitPictureInPicture_Params_Data();
    ~MediaController_ExitPictureInPicture_Params_Data() = delete;
};
static_assert(sizeof(MediaController_ExitPictureInPicture_Params_Data) == 8, "Bad sizeof(MediaController_ExitPictureInPicture_Params_Data)");
class MediaController_SetAudioSinkId_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> id;

private:
    friend class mojo::internal::MessageFragment<MediaController_SetAudioSinkId_Params_Data>;

    MediaController_SetAudioSinkId_Params_Data();
    ~MediaController_SetAudioSinkId_Params_Data() = delete;
};
static_assert(sizeof(MediaController_SetAudioSinkId_Params_Data) == 16, "Bad sizeof(MediaController_SetAudioSinkId_Params_Data)");
class MediaController_ToggleMicrophone_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_ToggleMicrophone_Params_Data>;

    MediaController_ToggleMicrophone_Params_Data();
    ~MediaController_ToggleMicrophone_Params_Data() = delete;
};
static_assert(sizeof(MediaController_ToggleMicrophone_Params_Data) == 8, "Bad sizeof(MediaController_ToggleMicrophone_Params_Data)");
class MediaController_ToggleCamera_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_ToggleCamera_Params_Data>;

    MediaController_ToggleCamera_Params_Data();
    ~MediaController_ToggleCamera_Params_Data() = delete;
};
static_assert(sizeof(MediaController_ToggleCamera_Params_Data) == 8, "Bad sizeof(MediaController_ToggleCamera_Params_Data)");
class MediaController_HangUp_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_HangUp_Params_Data>;

    MediaController_HangUp_Params_Data();
    ~MediaController_HangUp_Params_Data() = delete;
};
static_assert(sizeof(MediaController_HangUp_Params_Data) == 8, "Bad sizeof(MediaController_HangUp_Params_Data)");
class MediaController_Raise_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_Raise_Params_Data>;

    MediaController_Raise_Params_Data();
    ~MediaController_Raise_Params_Data() = delete;
};
static_assert(sizeof(MediaController_Raise_Params_Data) == 8, "Bad sizeof(MediaController_Raise_Params_Data)");
class MediaController_SetMute_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t mute : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaController_SetMute_Params_Data>;

    MediaController_SetMute_Params_Data();
    ~MediaController_SetMute_Params_Data() = delete;
};
static_assert(sizeof(MediaController_SetMute_Params_Data) == 16, "Bad sizeof(MediaController_SetMute_Params_Data)");
class MediaController_RequestMediaRemoting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_RequestMediaRemoting_Params_Data>;

    MediaController_RequestMediaRemoting_Params_Data();
    ~MediaController_RequestMediaRemoting_Params_Data() = delete;
};
static_assert(sizeof(MediaController_RequestMediaRemoting_Params_Data) == 8, "Bad sizeof(MediaController_RequestMediaRemoting_Params_Data)");
class MediaController_EnterAutoPictureInPicture_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_EnterAutoPictureInPicture_Params_Data>;

    MediaController_EnterAutoPictureInPicture_Params_Data();
    ~MediaController_EnterAutoPictureInPicture_Params_Data() = delete;
};
static_assert(sizeof(MediaController_EnterAutoPictureInPicture_Params_Data) == 8, "Bad sizeof(MediaController_EnterAutoPictureInPicture_Params_Data)");
class MediaController_SkipAd_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaController_SkipAd_Params_Data>;

    MediaController_SkipAd_Params_Data();
    ~MediaController_SkipAd_Params_Data() = delete;
};
static_assert(sizeof(MediaController_SkipAd_Params_Data) == 8, "Bad sizeof(MediaController_SkipAd_Params_Data)");
class MediaControllerObserver_MediaSessionInfoChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media_session::mojom::internal::MediaSessionInfo_Data> info;

private:
    friend class mojo::internal::MessageFragment<MediaControllerObserver_MediaSessionInfoChanged_Params_Data>;

    MediaControllerObserver_MediaSessionInfoChanged_Params_Data();
    ~MediaControllerObserver_MediaSessionInfoChanged_Params_Data() = delete;
};
static_assert(
    sizeof(MediaControllerObserver_MediaSessionInfoChanged_Params_Data) == 16, "Bad sizeof(MediaControllerObserver_MediaSessionInfoChanged_Params_Data)");
class MediaControllerObserver_MediaSessionMetadataChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media_session::mojom::internal::MediaMetadata_Data> metadata;

private:
    friend class mojo::internal::MessageFragment<MediaControllerObserver_MediaSessionMetadataChanged_Params_Data>;

    MediaControllerObserver_MediaSessionMetadataChanged_Params_Data();
    ~MediaControllerObserver_MediaSessionMetadataChanged_Params_Data() = delete;
};
static_assert(sizeof(MediaControllerObserver_MediaSessionMetadataChanged_Params_Data) == 16,
    "Bad sizeof(MediaControllerObserver_MediaSessionMetadataChanged_Params_Data)");
class MediaControllerObserver_MediaSessionActionsChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> action;

private:
    friend class mojo::internal::MessageFragment<MediaControllerObserver_MediaSessionActionsChanged_Params_Data>;

    MediaControllerObserver_MediaSessionActionsChanged_Params_Data();
    ~MediaControllerObserver_MediaSessionActionsChanged_Params_Data() = delete;
};
static_assert(
    sizeof(MediaControllerObserver_MediaSessionActionsChanged_Params_Data) == 16, "Bad sizeof(MediaControllerObserver_MediaSessionActionsChanged_Params_Data)");
class MediaControllerObserver_MediaSessionChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> request_id;

private:
    friend class mojo::internal::MessageFragment<MediaControllerObserver_MediaSessionChanged_Params_Data>;

    MediaControllerObserver_MediaSessionChanged_Params_Data();
    ~MediaControllerObserver_MediaSessionChanged_Params_Data() = delete;
};
static_assert(sizeof(MediaControllerObserver_MediaSessionChanged_Params_Data) == 16, "Bad sizeof(MediaControllerObserver_MediaSessionChanged_Params_Data)");
class MediaControllerObserver_MediaSessionPositionChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::media_session::mojom::internal::MediaPosition_Data> position;

private:
    friend class mojo::internal::MessageFragment<MediaControllerObserver_MediaSessionPositionChanged_Params_Data>;

    MediaControllerObserver_MediaSessionPositionChanged_Params_Data();
    ~MediaControllerObserver_MediaSessionPositionChanged_Params_Data() = delete;
};
static_assert(sizeof(MediaControllerObserver_MediaSessionPositionChanged_Params_Data) == 16,
    "Bad sizeof(MediaControllerObserver_MediaSessionPositionChanged_Params_Data)");
class MediaControllerImageObserver_MediaControllerImageChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t type;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::media_session::mojom::internal::MediaImageBitmap_Data> bitmap;

private:
    friend class mojo::internal::MessageFragment<MediaControllerImageObserver_MediaControllerImageChanged_Params_Data>;

    MediaControllerImageObserver_MediaControllerImageChanged_Params_Data();
    ~MediaControllerImageObserver_MediaControllerImageChanged_Params_Data() = delete;
};
static_assert(sizeof(MediaControllerImageObserver_MediaControllerImageChanged_Params_Data) == 24,
    "Bad sizeof(MediaControllerImageObserver_MediaControllerImageChanged_Params_Data)");
class MediaControllerImageObserver_MediaControllerChapterImageChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t index;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::media_session::mojom::internal::MediaImageBitmap_Data> bitmap;

private:
    friend class mojo::internal::MessageFragment<MediaControllerImageObserver_MediaControllerChapterImageChanged_Params_Data>;

    MediaControllerImageObserver_MediaControllerChapterImageChanged_Params_Data();
    ~MediaControllerImageObserver_MediaControllerChapterImageChanged_Params_Data() = delete;
};
static_assert(sizeof(MediaControllerImageObserver_MediaControllerChapterImageChanged_Params_Data) == 24,
    "Bad sizeof(MediaControllerImageObserver_MediaControllerChapterImageChanged_Params_Data)");

} // namespace internal

class MediaControllerManager_CreateMediaControllerForSession_ParamsDataView {
public:
    MediaControllerManager_CreateMediaControllerForSession_ParamsDataView() = default;

    MediaControllerManager_CreateMediaControllerForSession_ParamsDataView(
        internal::MediaControllerManager_CreateMediaControllerForSession_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeReceiver()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::media_session::mojom::MediaControllerInterfaceBase>>(
            &data_->receiver, &result, message_);
