// services/media_session/public/mojom/media_session.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_MEDIA_SESSION_PUBLIC_MOJOM_MEDIA_SESSION_MOJOM_PARAMS_DATA_H_
#define SERVICES_MEDIA_SESSION_PUBLIC_MOJOM_MEDIA_SESSION_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace media_session::mojom {
namespace internal {
class MediaSessionObserver_MediaSessionInfoChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::MediaSessionInfo_Data> info;

private:
    friend class mojo::internal::MessageFragment<MediaSessionObserver_MediaSessionInfoChanged_Params_Data>;

    MediaSessionObserver_MediaSessionInfoChanged_Params_Data();
    ~MediaSessionObserver_MediaSessionInfoChanged_Params_Data() = delete;
};
static_assert(sizeof(MediaSessionObserver_MediaSessionInfoChanged_Params_Data) == 16, "Bad sizeof(MediaSessionObserver_MediaSessionInfoChanged_Params_Data)");
class MediaSessionObserver_MediaSessionMetadataChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::MediaMetadata_Data> metadata;

private:
    friend class mojo::internal::MessageFragment<MediaSessionObserver_MediaSessionMetadataChanged_Params_Data>;

    MediaSessionObserver_MediaSessionMetadataChanged_Params_Data();
    ~MediaSessionObserver_MediaSessionMetadataChanged_Params_Data() = delete;
};
static_assert(
    sizeof(MediaSessionObserver_MediaSessionMetadataChanged_Params_Data) == 16, "Bad sizeof(MediaSessionObserver_MediaSessionMetadataChanged_Params_Data)");
class MediaSessionObserver_MediaSessionActionsChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> action;

private:
    friend class mojo::internal::MessageFragment<MediaSessionObserver_MediaSessionActionsChanged_Params_Data>;

    MediaSessionObserver_MediaSessionActionsChanged_Params_Data();
    ~MediaSessionObserver_MediaSessionActionsChanged_Params_Data() = delete;
};
static_assert(
    sizeof(MediaSessionObserver_MediaSessionActionsChanged_Params_Data) == 16, "Bad sizeof(MediaSessionObserver_MediaSessionActionsChanged_Params_Data)");
class MediaSessionObserver_MediaSessionImagesChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<
        mojo::internal::Map_Data<int32_t, mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::MediaImage_Data>>>>>
        images;

private:
    friend class mojo::internal::MessageFragment<MediaSessionObserver_MediaSessionImagesChanged_Params_Data>;

    MediaSessionObserver_MediaSessionImagesChanged_Params_Data();
    ~MediaSessionObserver_MediaSessionImagesChanged_Params_Data() = delete;
};
static_assert(
    sizeof(MediaSessionObserver_MediaSessionImagesChanged_Params_Data) == 16, "Bad sizeof(MediaSessionObserver_MediaSessionImagesChanged_Params_Data)");
class MediaSessionObserver_MediaSessionPositionChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::MediaPosition_Data> position;

private:
    friend class mojo::internal::MessageFragment<MediaSessionObserver_MediaSessionPositionChanged_Params_Data>;

    MediaSessionObserver_MediaSessionPositionChanged_Params_Data();
    ~MediaSessionObserver_MediaSessionPositionChanged_Params_Data() = delete;
};
static_assert(
    sizeof(MediaSessionObserver_MediaSessionPositionChanged_Params_Data) == 16, "Bad sizeof(MediaSessionObserver_MediaSessionPositionChanged_Params_Data)");
class MediaSession_GetMediaSessionInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaSession_GetMediaSessionInfo_Params_Data>;

    MediaSession_GetMediaSessionInfo_Params_Data();
    ~MediaSession_GetMediaSessionInfo_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_GetMediaSessionInfo_Params_Data) == 8, "Bad sizeof(MediaSession_GetMediaSessionInfo_Params_Data)");
class MediaSession_GetMediaSessionInfo_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::MediaSessionInfo_Data> info;

private:
    friend class mojo::internal::MessageFragment<MediaSession_GetMediaSessionInfo_ResponseParams_Data>;

    MediaSession_GetMediaSessionInfo_ResponseParams_Data();
    ~MediaSession_GetMediaSessionInfo_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaSession_GetMediaSessionInfo_ResponseParams_Data) == 16, "Bad sizeof(MediaSession_GetMediaSessionInfo_ResponseParams_Data)");
class MediaSession_GetDebugInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaSession_GetDebugInfo_Params_Data>;

    MediaSession_GetDebugInfo_Params_Data();
    ~MediaSession_GetDebugInfo_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_GetDebugInfo_Params_Data) == 8, "Bad sizeof(MediaSession_GetDebugInfo_Params_Data)");
class MediaSession_GetDebugInfo_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::MediaSessionDebugInfo_Data> info;

private:
    friend class mojo::internal::MessageFragment<MediaSession_GetDebugInfo_ResponseParams_Data>;

    MediaSession_GetDebugInfo_ResponseParams_Data();
    ~MediaSession_GetDebugInfo_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaSession_GetDebugInfo_ResponseParams_Data) == 16, "Bad sizeof(MediaSession_GetDebugInfo_ResponseParams_Data)");
class MediaSession_StartDucking_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaSession_StartDucking_Params_Data>;

    MediaSession_StartDucking_Params_Data();
    ~MediaSession_StartDucking_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_StartDucking_Params_Data) == 8, "Bad sizeof(MediaSession_StartDucking_Params_Data)");
class MediaSession_StopDucking_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaSession_StopDucking_Params_Data>;

    MediaSession_StopDucking_Params_Data();
    ~MediaSession_StopDucking_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_StopDucking_Params_Data) == 8, "Bad sizeof(MediaSession_StopDucking_Params_Data)");
class MediaSession_Suspend_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t suspend_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaSession_Suspend_Params_Data>;

    MediaSession_Suspend_Params_Data();
    ~MediaSession_Suspend_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_Suspend_Params_Data) == 16, "Bad sizeof(MediaSession_Suspend_Params_Data)");
class MediaSession_Resume_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t suspend_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaSession_Resume_Params_Data>;

    MediaSession_Resume_Params_Data();
    ~MediaSession_Resume_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_Resume_Params_Data) == 16, "Bad sizeof(MediaSession_Resume_Params_Data)");
class MediaSession_AddObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data observer;

private:
    friend class mojo::internal::MessageFragment<MediaSession_AddObserver_Params_Data>;

    MediaSession_AddObserver_Params_Data();
    ~MediaSession_AddObserver_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_AddObserver_Params_Data) == 16, "Bad sizeof(MediaSession_AddObserver_Params_Data)");
class MediaSession_PreviousTrack_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaSession_PreviousTrack_Params_Data>;

    MediaSession_PreviousTrack_Params_Data();
    ~MediaSession_PreviousTrack_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_PreviousTrack_Params_Data) == 8, "Bad sizeof(MediaSession_PreviousTrack_Params_Data)");
class MediaSession_NextTrack_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaSession_NextTrack_Params_Data>;

    MediaSession_NextTrack_Params_Data();
    ~MediaSession_NextTrack_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_NextTrack_Params_Data) == 8, "Bad sizeof(MediaSession_NextTrack_Params_Data)");
class MediaSession_Seek_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> seek_time;

private:
    friend class mojo::internal::MessageFragment<MediaSession_Seek_Params_Data>;

    MediaSession_Seek_Params_Data();
    ~MediaSession_Seek_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_Seek_Params_Data) == 16, "Bad sizeof(MediaSession_Seek_Params_Data)");
class MediaSession_Stop_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t suspend_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaSession_Stop_Params_Data>;

    MediaSession_Stop_Params_Data();
    ~MediaSession_Stop_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_Stop_Params_Data) == 16, "Bad sizeof(MediaSession_Stop_Params_Data)");
class MediaSession_SkipAd_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaSession_SkipAd_Params_Data>;

    MediaSession_SkipAd_Params_Data();
    ~MediaSession_SkipAd_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_SkipAd_Params_Data) == 8, "Bad sizeof(MediaSession_SkipAd_Params_Data)");
class MediaSession_GetMediaImageBitmap_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::MediaImage_Data> image;
    int32_t minimum_size_px;
    int32_t desired_size_px;

private:
    friend class mojo::internal::MessageFragment<MediaSession_GetMediaImageBitmap_Params_Data>;

    MediaSession_GetMediaImageBitmap_Params_Data();
    ~MediaSession_GetMediaImageBitmap_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_GetMediaImageBitmap_Params_Data) == 24, "Bad sizeof(MediaSession_GetMediaImageBitmap_Params_Data)");
class MediaSession_GetMediaImageBitmap_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::MediaImageBitmap_Data> image;

private:
    friend class mojo::internal::MessageFragment<MediaSession_GetMediaImageBitmap_ResponseParams_Data>;

    MediaSession_GetMediaImageBitmap_ResponseParams_Data();
    ~MediaSession_GetMediaImageBitmap_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaSession_GetMediaImageBitmap_ResponseParams_Data) == 16, "Bad sizeof(MediaSession_GetMediaImageBitmap_ResponseParams_Data)");
class MediaSession_SeekTo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> seek_time;

private:
    friend class mojo::internal::MessageFragment<MediaSession_SeekTo_Params_Data>;

    MediaSession_SeekTo_Params_Data();
    ~MediaSession_SeekTo_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_SeekTo_Params_Data) == 16, "Bad sizeof(MediaSession_SeekTo_Params_Data)");
class MediaSession_ScrubTo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> seek_time;

private:
    friend class mojo::internal::MessageFragment<MediaSession_ScrubTo_Params_Data>;

    MediaSession_ScrubTo_Params_Data();
    ~MediaSession_ScrubTo_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_ScrubTo_Params_Data) == 16, "Bad sizeof(MediaSession_ScrubTo_Params_Data)");
class MediaSession_EnterPictureInPicture_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaSession_EnterPictureInPicture_Params_Data>;

    MediaSession_EnterPictureInPicture_Params_Data();
    ~MediaSession_EnterPictureInPicture_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_EnterPictureInPicture_Params_Data) == 8, "Bad sizeof(MediaSession_EnterPictureInPicture_Params_Data)");
class MediaSession_ExitPictureInPicture_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaSession_ExitPictureInPicture_Params_Data>;

    MediaSession_ExitPictureInPicture_Params_Data();
    ~MediaSession_ExitPictureInPicture_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_ExitPictureInPicture_Params_Data) == 8, "Bad sizeof(MediaSession_ExitPictureInPicture_Params_Data)");
class MediaSession_SetAudioSinkId_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> id;

private:
    friend class mojo::internal::MessageFragment<MediaSession_SetAudioSinkId_Params_Data>;

    MediaSession_SetAudioSinkId_Params_Data();
    ~MediaSession_SetAudioSinkId_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_SetAudioSinkId_Params_Data) == 16, "Bad sizeof(MediaSession_SetAudioSinkId_Params_Data)");
class MediaSession_ToggleMicrophone_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaSession_ToggleMicrophone_Params_Data>;

    MediaSession_ToggleMicrophone_Params_Data();
    ~MediaSession_ToggleMicrophone_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_ToggleMicrophone_Params_Data) == 8, "Bad sizeof(MediaSession_ToggleMicrophone_Params_Data)");
class MediaSession_ToggleCamera_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaSession_ToggleCamera_Params_Data>;

    MediaSession_ToggleCamera_Params_Data();
    ~MediaSession_ToggleCamera_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_ToggleCamera_Params_Data) == 8, "Bad sizeof(MediaSession_ToggleCamera_Params_Data)");
class MediaSession_HangUp_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaSession_HangUp_Params_Data>;

    MediaSession_HangUp_Params_Data();
    ~MediaSession_HangUp_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_HangUp_Params_Data) == 8, "Bad sizeof(MediaSession_HangUp_Params_Data)");
class MediaSession_Raise_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaSession_Raise_Params_Data>;

    MediaSession_Raise_Params_Data();
    ~MediaSession_Raise_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_Raise_Params_Data) == 8, "Bad sizeof(MediaSession_Raise_Params_Data)");
class MediaSession_SetMute_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t mute : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaSession_SetMute_Params_Data>;

    MediaSession_SetMute_Params_Data();
    ~MediaSession_SetMute_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_SetMute_Params_Data) == 16, "Bad sizeof(MediaSession_SetMute_Params_Data)");
class MediaSession_RequestMediaRemoting_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaSession_RequestMediaRemoting_Params_Data>;

    MediaSession_RequestMediaRemoting_Params_Data();
    ~MediaSession_RequestMediaRemoting_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_RequestMediaRemoting_Params_Data) == 8, "Bad sizeof(MediaSession_RequestMediaRemoting_Params_Data)");
class MediaSession_PreviousSlide_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaSession_PreviousSlide_Params_Data>;

    MediaSession_PreviousSlide_Params_Data();
    ~MediaSession_PreviousSlide_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_PreviousSlide_Params_Data) == 8, "Bad sizeof(MediaSession_PreviousSlide_Params_Data)");
class MediaSession_NextSlide_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaSession_NextSlide_Params_Data>;

    MediaSession_NextSlide_Params_Data();
    ~MediaSession_NextSlide_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_NextSlide_Params_Data) == 8, "Bad sizeof(MediaSession_NextSlide_Params_Data)");
class MediaSession_EnterAutoPictureInPicture_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaSession_EnterAutoPictureInPicture_Params_Data>;

    MediaSession_EnterAutoPictureInPicture_Params_Data();
    ~MediaSession_EnterAutoPictureInPicture_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_EnterAutoPictureInPicture_Params_Data) == 8, "Bad sizeof(MediaSession_EnterAutoPictureInPicture_Params_Data)");
class MediaSession_GetVisibility_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<MediaSession_GetVisibility_Params_Data>;

    MediaSession_GetVisibility_Params_Data();
    ~MediaSession_GetVisibility_Params_Data() = delete;
};
static_assert(sizeof(MediaSession_GetVisibility_Params_Data) == 8, "Bad sizeof(MediaSession_GetVisibility_Params_Data)");
class MediaSession_GetVisibility_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t has_sufficiently_visible_video : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaSession_GetVisibility_ResponseParams_Data>;

    MediaSession_GetVisibility_ResponseParams_Data();
    ~MediaSession_GetVisibility_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaSession_GetVisibility_ResponseParams_Data) == 16, "Bad sizeof(MediaSession_GetVisibility_ResponseParams_Data)");

} // namespace internal

class MediaSessionObserver_MediaSessionInfoChanged_ParamsDataView {
public:
    MediaSessionObserver_MediaSessionInfoChanged_ParamsDataView() = default;

    MediaSessionObserver_MediaSessionInfoChanged_ParamsDataView(
        internal::MediaSessionObserver_MediaSessionInfoChanged_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetInfoDataView(MediaSessionInfoDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadInfo(UserType* output)
    {

        auto* pointer = data_->info.Get();
        return mojo::internal::Deserialize<::media_session::mojom::MediaSessionInfoDataView>(pointer, output, message_);
    }

private:
