// services/image_annotation/public/mojom/image_annotation.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_IMAGE_ANNOTATION_PUBLIC_MOJOM_IMAGE_ANNOTATION_MOJOM_PARAMS_DATA_H_
#define SERVICES_IMAGE_ANNOTATION_PUBLIC_MOJOM_IMAGE_ANNOTATION_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace image_annotation::mojom {
namespace internal {
class ImageProcessor_GetJpgImageData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ImageProcessor_GetJpgImageData_Params_Data>;

    ImageProcessor_GetJpgImageData_Params_Data();
    ~ImageProcessor_GetJpgImageData_Params_Data() = delete;
};
static_assert(sizeof(ImageProcessor_GetJpgImageData_Params_Data) == 8, "Bad sizeof(ImageProcessor_GetJpgImageData_Params_Data)");
class ImageProcessor_GetJpgImageData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> bytes;
    int32_t width;
    int32_t height;

private:
    friend class mojo::internal::MessageFragment<ImageProcessor_GetJpgImageData_ResponseParams_Data>;

    ImageProcessor_GetJpgImageData_ResponseParams_Data();
    ~ImageProcessor_GetJpgImageData_ResponseParams_Data() = delete;
};
static_assert(sizeof(ImageProcessor_GetJpgImageData_ResponseParams_Data) == 24, "Bad sizeof(ImageProcessor_GetJpgImageData_ResponseParams_Data)");
class Annotator_AnnotateImage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> source_id;
    mojo::internal::Pointer<mojo::internal::String_Data> description_language_tag;
    mojo::internal::Interface_Data image_processor;

private:
    friend class mojo::internal::MessageFragment<Annotator_AnnotateImage_Params_Data>;

    Annotator_AnnotateImage_Params_Data();
    ~Annotator_AnnotateImage_Params_Data() = delete;
};
static_assert(sizeof(Annotator_AnnotateImage_Params_Data) == 32, "Bad sizeof(Annotator_AnnotateImage_Params_Data)");
class Annotator_AnnotateImage_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    internal::AnnotateImageResult_Data result;

private:
    friend class mojo::internal::MessageFragment<Annotator_AnnotateImage_ResponseParams_Data>;

    Annotator_AnnotateImage_ResponseParams_Data();
    ~Annotator_AnnotateImage_ResponseParams_Data() = delete;
};
static_assert(sizeof(Annotator_AnnotateImage_ResponseParams_Data) == 24, "Bad sizeof(Annotator_AnnotateImage_ResponseParams_Data)");
class ImageAnnotationService_BindAnnotator_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ImageAnnotationService_BindAnnotator_Params_Data>;

    ImageAnnotationService_BindAnnotator_Params_Data();
    ~ImageAnnotationService_BindAnnotator_Params_Data() = delete;
};
static_assert(sizeof(ImageAnnotationService_BindAnnotator_Params_Data) == 16, "Bad sizeof(ImageAnnotationService_BindAnnotator_Params_Data)");

} // namespace internal

class ImageProcessor_GetJpgImageData_ParamsDataView {
public:
    ImageProcessor_GetJpgImageData_ParamsDataView() = default;

    ImageProcessor_GetJpgImageData_ParamsDataView(internal::ImageProcessor_GetJpgImageData_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const
    {
        return !data_;
    }

private:
    internal::ImageProcessor_GetJpgImageData_Params_Data* data_ = nullptr;
};

class ImageProcessor_GetJpgImageData_ResponseParamsDataView {
public:
    ImageProcessor_GetJpgImageData_ResponseParamsDataView() = default;

    ImageProcessor_GetJpgImageData_ResponseParamsDataView(internal::ImageProcessor_GetJpgImageData_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetBytesDataView(mojo::ArrayDataView<uint8_t>* output);

    template <typename UserType> [[nodiscard]] bool ReadBytes(UserType* output)
    {

        auto* pointer = data_->bytes.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<uint8_t>>(pointer, output, message_);
    }
    int32_t width() const
    {
        return data_->width;
    }
    int32_t height() const
    {
        return data_->height;
    }

private:
    internal::ImageProcessor_GetJpgImageData_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class Annotator_AnnotateImage_ParamsDataView {
public:
    Annotator_AnnotateImage_ParamsDataView() = default;

    Annotator_AnnotateImage_ParamsDataView(internal::Annotator_AnnotateImage_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetSourceIdDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadSourceId(UserType* output)
    {

        auto* pointer = data_->source_id.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }
    inline void GetDescriptionLanguageTagDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadDescriptionLanguageTag(UserType* output)
    {

        auto* pointer = data_->description_language_tag.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }
    template <typename UserType> UserType TakeImageProcessor()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::image_annotation::mojom::ImageProcessorInterfaceBase>>(
            &data_->image_processor, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::Annotator_AnnotateImage_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class Annotator_AnnotateImage_ResponseParamsDataView {
public:
    Annotator_AnnotateImage_ResponseParamsDataView() = default;

    Annotator_AnnotateImage_ResponseParamsDataView(internal::Annotator_AnnotateImage_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetResultDataView(AnnotateImageResultDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadResult(UserType* output)
    {

        auto* pointer = !data_->result.is_null() ? &data_->result : nullptr;
        return mojo::internal::Deserialize<::image_annotation::mojom::AnnotateImageResultDataView>(pointer, output, message_);
    }

private:
    internal::Annotator_AnnotateImage_ResponseParams_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class ImageAnnotationService_BindAnnotator_ParamsDataView {
public:
    ImageAnnotationService_BindAnnotator_ParamsDataView() = default;

    ImageAnnotationService_BindAnnotator_ParamsDataView(internal::ImageAnnotationService_BindAnnotator_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakeReceiver()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::image_annotation::mojom::AnnotatorInterfaceBase>>(
            &data_->receiver, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
    internal::ImageAnnotationService_BindAnnotator_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

inline void ImageProcessor_GetJpgImageData_ResponseParamsDataView::GetBytesDataView(mojo::ArrayDataView<uint8_t>* output)
{
    auto pointer = data_->bytes.Get();
    *output = mojo::ArrayDataView<uint8_t>(pointer, message_);
}

inline void Annotator_AnnotateImage_ParamsDataView::GetSourceIdDataView(mojo::StringDataView* output)
{
    auto pointer = data_->source_id.Get();
    *output = mojo::StringDataView(pointer, message_);
}
inline void Annotator_AnnotateImage_ParamsDataView::GetDescriptionLanguageTagDataView(mojo::StringDataView* output)
{
    auto pointer = data_->description_language_tag.Get();
    *output = mojo::StringDataView(pointer, message_);
}

inline void Annotator_AnnotateImage_ResponseParamsDataView::GetResultDataView(AnnotateImageResultDataView* output)
{
    auto pointer = &data_->result;
    *output = AnnotateImageResultDataView(pointer, message_);
}

} // image_annotation::mojom

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // SERVICES_IMAGE_ANNOTATION_PUBLIC_MOJOM_IMAGE_ANNOTATION_MOJOM_PARAMS_DATA_H_
