// services/tracing/public/mojom/perfetto_service.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_TRACING_PUBLIC_MOJOM_PERFETTO_SERVICE_MOJOM_PARAMS_DATA_H_
#define SERVICES_TRACING_PUBLIC_MOJOM_PERFETTO_SERVICE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace tracing::mojom {
namespace internal {
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) ProducerHost_CommitData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CommitDataRequest_Data> data_request;

private:
    friend class mojo::internal::MessageFragment<ProducerHost_CommitData_Params_Data>;

    ProducerHost_CommitData_Params_Data();
    ~ProducerHost_CommitData_Params_Data() = delete;
};
static_assert(sizeof(ProducerHost_CommitData_Params_Data) == 16, "Bad sizeof(ProducerHost_CommitData_Params_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) ProducerHost_CommitData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ProducerHost_CommitData_ResponseParams_Data>;

    ProducerHost_CommitData_ResponseParams_Data();
    ~ProducerHost_CommitData_ResponseParams_Data() = delete;
};
static_assert(sizeof(ProducerHost_CommitData_ResponseParams_Data) == 8, "Bad sizeof(ProducerHost_CommitData_ResponseParams_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) ProducerHost_RegisterDataSource_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::DataSourceRegistration_Data> registration_info;

private:
    friend class mojo::internal::MessageFragment<ProducerHost_RegisterDataSource_Params_Data>;

    ProducerHost_RegisterDataSource_Params_Data();
    ~ProducerHost_RegisterDataSource_Params_Data() = delete;
};
static_assert(sizeof(ProducerHost_RegisterDataSource_Params_Data) == 16, "Bad sizeof(ProducerHost_RegisterDataSource_Params_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) ProducerHost_RegisterTraceWriter_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t writer_id;
    uint32_t target_buffer;

private:
    friend class mojo::internal::MessageFragment<ProducerHost_RegisterTraceWriter_Params_Data>;

    ProducerHost_RegisterTraceWriter_Params_Data();
    ~ProducerHost_RegisterTraceWriter_Params_Data() = delete;
};
static_assert(sizeof(ProducerHost_RegisterTraceWriter_Params_Data) == 16, "Bad sizeof(ProducerHost_RegisterTraceWriter_Params_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) ProducerHost_UnregisterTraceWriter_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t writer_id;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ProducerHost_UnregisterTraceWriter_Params_Data>;

    ProducerHost_UnregisterTraceWriter_Params_Data();
    ~ProducerHost_UnregisterTraceWriter_Params_Data() = delete;
};
static_assert(sizeof(ProducerHost_UnregisterTraceWriter_Params_Data) == 16, "Bad sizeof(ProducerHost_UnregisterTraceWriter_Params_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) ProducerClient_OnTracingStart_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ProducerClient_OnTracingStart_Params_Data>;

    ProducerClient_OnTracingStart_Params_Data();
    ~ProducerClient_OnTracingStart_Params_Data() = delete;
};
static_assert(sizeof(ProducerClient_OnTracingStart_Params_Data) == 8, "Bad sizeof(ProducerClient_OnTracingStart_Params_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) ProducerClient_StartDataSource_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t id;
    mojo::internal::Pointer<internal::DataSourceConfig_Data> data_source_config;

private:
    friend class mojo::internal::MessageFragment<ProducerClient_StartDataSource_Params_Data>;

    ProducerClient_StartDataSource_Params_Data();
    ~ProducerClient_StartDataSource_Params_Data() = delete;
};
static_assert(sizeof(ProducerClient_StartDataSource_Params_Data) == 24, "Bad sizeof(ProducerClient_StartDataSource_Params_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) ProducerClient_StartDataSource_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ProducerClient_StartDataSource_ResponseParams_Data>;

    ProducerClient_StartDataSource_ResponseParams_Data();
    ~ProducerClient_StartDataSource_ResponseParams_Data() = delete;
};
static_assert(sizeof(ProducerClient_StartDataSource_ResponseParams_Data) == 8, "Bad sizeof(ProducerClient_StartDataSource_ResponseParams_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) ProducerClient_StopDataSource_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t id;

private:
    friend class mojo::internal::MessageFragment<ProducerClient_StopDataSource_Params_Data>;

    ProducerClient_StopDataSource_Params_Data();
    ~ProducerClient_StopDataSource_Params_Data() = delete;
};
static_assert(sizeof(ProducerClient_StopDataSource_Params_Data) == 16, "Bad sizeof(ProducerClient_StopDataSource_Params_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) ProducerClient_StopDataSource_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ProducerClient_StopDataSource_ResponseParams_Data>;

    ProducerClient_StopDataSource_ResponseParams_Data();
    ~ProducerClient_StopDataSource_ResponseParams_Data() = delete;
};
static_assert(sizeof(ProducerClient_StopDataSource_ResponseParams_Data) == 8, "Bad sizeof(ProducerClient_StopDataSource_ResponseParams_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) ProducerClient_Flush_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t flush_request_id;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint64_t>> data_source_ids;

private:
    friend class mojo::internal::MessageFragment<ProducerClient_Flush_Params_Data>;

    ProducerClient_Flush_Params_Data();
    ~ProducerClient_Flush_Params_Data() = delete;
};
static_assert(sizeof(ProducerClient_Flush_Params_Data) == 24, "Bad sizeof(ProducerClient_Flush_Params_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) ProducerClient_ClearIncrementalState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ProducerClient_ClearIncrementalState_Params_Data>;

    ProducerClient_ClearIncrementalState_Params_Data();
    ~ProducerClient_ClearIncrementalState_Params_Data() = delete;
};
static_assert(sizeof(ProducerClient_ClearIncrementalState_Params_Data) == 8, "Bad sizeof(ProducerClient_ClearIncrementalState_Params_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) PerfettoService_ConnectToProducerHost_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data producer_client;
    mojo::internal::Handle_Data producer_host_receiver;
    uint8_t pad1_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnsafeSharedMemoryRegion_Data> shared_memory;
    uint64_t shared_memory_buffer_page_size_bytes;

private:
    friend class mojo::internal::MessageFragment<PerfettoService_ConnectToProducerHost_Params_Data>;

    PerfettoService_ConnectToProducerHost_Params_Data();
    ~PerfettoService_ConnectToProducerHost_Params_Data() = delete;
};
static_assert(sizeof(PerfettoService_ConnectToProducerHost_Params_Data) == 40, "Bad sizeof(PerfettoService_ConnectToProducerHost_Params_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) ConsumerHost_EnableTracing_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data tracing_session_host;
    mojo::internal::Interface_Data tracing_session_client;
    uint8_t pad1_[4];
    mojo::internal::Pointer<internal::TraceConfig_Data> config;
    mojo::internal::Pointer<::mojo_base::mojom::internal::File_Data> output_file;

private:
    friend class mojo::internal::MessageFragment<ConsumerHost_EnableTracing_Params_Data>;

    ConsumerHost_EnableTracing_Params_Data();
    ~ConsumerHost_EnableTracing_Params_Data() = delete;
};
static_assert(sizeof(ConsumerHost_EnableTracing_Params_Data) == 40, "Bad sizeof(ConsumerHost_EnableTracing_Params_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) ConsumerHost_CloneSession_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data tracing_session_host;
    mojo::internal::Interface_Data tracing_session_client;
    uint8_t pad1_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> unguessable_name;

private:
    friend class mojo::internal::MessageFragment<ConsumerHost_CloneSession_Params_Data>;

    ConsumerHost_CloneSession_Params_Data();
    ~ConsumerHost_CloneSession_Params_Data() = delete;
};
static_assert(sizeof(ConsumerHost_CloneSession_Params_Data) == 32, "Bad sizeof(ConsumerHost_CloneSession_Params_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) ConsumerHost_CloneSession_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::String_Data> error;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Token_Data> uuid;

private:
    friend class mojo::internal::MessageFragment<ConsumerHost_CloneSession_ResponseParams_Data>;

    ConsumerHost_CloneSession_ResponseParams_Data();
    ~ConsumerHost_CloneSession_ResponseParams_Data() = delete;
};
static_assert(sizeof(ConsumerHost_CloneSession_ResponseParams_Data) == 32, "Bad sizeof(ConsumerHost_CloneSession_ResponseParams_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) TracingSessionHost_ChangeTraceConfig_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::TraceConfig_Data> config;

private:
    friend class mojo::internal::MessageFragment<TracingSessionHost_ChangeTraceConfig_Params_Data>;

    TracingSessionHost_ChangeTraceConfig_Params_Data();
    ~TracingSessionHost_ChangeTraceConfig_Params_Data() = delete;
};
static_assert(sizeof(TracingSessionHost_ChangeTraceConfig_Params_Data) == 16, "Bad sizeof(TracingSessionHost_ChangeTraceConfig_Params_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) TracingSessionHost_DisableTracing_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<TracingSessionHost_DisableTracing_Params_Data>;

    TracingSessionHost_DisableTracing_Params_Data();
    ~TracingSessionHost_DisableTracing_Params_Data() = delete;
};
static_assert(sizeof(TracingSessionHost_DisableTracing_Params_Data) == 8, "Bad sizeof(TracingSessionHost_DisableTracing_Params_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) TracingSessionHost_ReadBuffers_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data stream;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<TracingSessionHost_ReadBuffers_Params_Data>;

    TracingSessionHost_ReadBuffers_Params_Data();
    ~TracingSessionHost_ReadBuffers_Params_Data() = delete;
};
static_assert(sizeof(TracingSessionHost_ReadBuffers_Params_Data) == 16, "Bad sizeof(TracingSessionHost_ReadBuffers_Params_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) TracingSessionHost_ReadBuffers_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<TracingSessionHost_ReadBuffers_ResponseParams_Data>;

    TracingSessionHost_ReadBuffers_ResponseParams_Data();
    ~TracingSessionHost_ReadBuffers_ResponseParams_Data() = delete;
};
static_assert(sizeof(TracingSessionHost_ReadBuffers_ResponseParams_Data) == 8, "Bad sizeof(TracingSessionHost_ReadBuffers_ResponseParams_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) TracingSessionHost_RequestBufferUsage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<TracingSessionHost_RequestBufferUsage_Params_Data>;

    TracingSessionHost_RequestBufferUsage_Params_Data();
    ~TracingSessionHost_RequestBufferUsage_Params_Data() = delete;
};
static_assert(sizeof(TracingSessionHost_RequestBufferUsage_Params_Data) == 8, "Bad sizeof(TracingSessionHost_RequestBufferUsage_Params_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) TracingSessionHost_RequestBufferUsage_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t data_loss : 1;
    uint8_t pad1_[3];
    float percent_full;

private:
    friend class mojo::internal::MessageFragment<TracingSessionHost_RequestBufferUsage_ResponseParams_Data>;

    TracingSessionHost_RequestBufferUsage_ResponseParams_Data();
    ~TracingSessionHost_RequestBufferUsage_ResponseParams_Data() = delete;
};
static_assert(sizeof(TracingSessionHost_RequestBufferUsage_ResponseParams_Data) == 16, "Bad sizeof(TracingSessionHost_RequestBufferUsage_ResponseParams_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) TracingSessionHost_DisableTracingAndEmitJson_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> agent_label_filter;
    mojo::internal::Handle_Data stream;
    uint8_t privacy_filtering_enabled : 1;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<TracingSessionHost_DisableTracingAndEmitJson_Params_Data>;

    TracingSessionHost_DisableTracingAndEmitJson_Params_Data();
    ~TracingSessionHost_DisableTracingAndEmitJson_Params_Data() = delete;
};
static_assert(sizeof(TracingSessionHost_DisableTracingAndEmitJson_Params_Data) == 24, "Bad sizeof(TracingSessionHost_DisableTracingAndEmitJson_Params_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) TracingSessionHost_DisableTracingAndEmitJson_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<TracingSessionHost_DisableTracingAndEmitJson_ResponseParams_Data>;

    TracingSessionHost_DisableTracingAndEmitJson_ResponseParams_Data();
    ~TracingSessionHost_DisableTracingAndEmitJson_ResponseParams_Data() = delete;
};
static_assert(sizeof(TracingSessionHost_DisableTracingAndEmitJson_ResponseParams_Data) == 8,
    "Bad sizeof(TracingSessionHost_DisableTracingAndEmitJson_ResponseParams_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) TracingSessionClient_OnTracingEnabled_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<TracingSessionClient_OnTracingEnabled_Params_Data>;

    TracingSessionClient_OnTracingEnabled_Params_Data();
    ~TracingSessionClient_OnTracingEnabled_Params_Data() = delete;
};
static_assert(sizeof(TracingSessionClient_OnTracingEnabled_Params_Data) == 8, "Bad sizeof(TracingSessionClient_OnTracingEnabled_Params_Data)");
class COMPONENT_EXPORT(TRACING_MOJOM_SHARED) TracingSessionClient_OnTracingDisabled_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t tracing_succeeded : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<TracingSessionClient_OnTracingDisabled_Params_Data>;

    TracingSessionClient_OnTracingDisabled_Params_Data();
    ~TracingSessionClient_OnTracingDisabled_Params_Data() = delete;
};
static_assert(sizeof(TracingSessionClient_OnTracingDisabled_Params_Data) == 16, "Bad sizeof(TracingSessionClient_OnTracingDisabled_Params_Data)");

} // namespace internal

class ProducerHost_CommitData_ParamsDataView {
public:
    ProducerHost_CommitData_ParamsDataView() = default;

    ProducerHost_CommitData_ParamsDataView(internal::ProducerHost_CommitData_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetDataRequestDataView(CommitDataRequestDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadDataRequest(UserType* output)
    {

        auto* pointer = data_->data_request.Get();
        return mojo::internal::Deserialize<::tracing::mojom::CommitDataRequestDataView>(pointer, output, message_);
    }

private:
    internal::ProducerHost_CommitData_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

