// third_party/blink/public/mojom/dom_storage/storage_area.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_DOM_STORAGE_STORAGE_AREA_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_DOM_STORAGE_STORAGE_AREA_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace blink::mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageAreaObserver_KeyChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> key;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> new_value;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> old_value;
    mojo::internal::Pointer<mojo::internal::String_Data> source;

private:
    friend class mojo::internal::MessageFragment<StorageAreaObserver_KeyChanged_Params_Data>;

    StorageAreaObserver_KeyChanged_Params_Data();
    ~StorageAreaObserver_KeyChanged_Params_Data() = delete;
};
static_assert(sizeof(StorageAreaObserver_KeyChanged_Params_Data) == 40, "Bad sizeof(StorageAreaObserver_KeyChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageAreaObserver_KeyChangeFailed_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> key;
    mojo::internal::Pointer<mojo::internal::String_Data> source;

private:
    friend class mojo::internal::MessageFragment<StorageAreaObserver_KeyChangeFailed_Params_Data>;

    StorageAreaObserver_KeyChangeFailed_Params_Data();
    ~StorageAreaObserver_KeyChangeFailed_Params_Data() = delete;
};
static_assert(sizeof(StorageAreaObserver_KeyChangeFailed_Params_Data) == 24, "Bad sizeof(StorageAreaObserver_KeyChangeFailed_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageAreaObserver_KeyDeleted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> key;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> old_value;
    mojo::internal::Pointer<mojo::internal::String_Data> source;

private:
    friend class mojo::internal::MessageFragment<StorageAreaObserver_KeyDeleted_Params_Data>;

    StorageAreaObserver_KeyDeleted_Params_Data();
    ~StorageAreaObserver_KeyDeleted_Params_Data() = delete;
};
static_assert(sizeof(StorageAreaObserver_KeyDeleted_Params_Data) == 32, "Bad sizeof(StorageAreaObserver_KeyDeleted_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageAreaObserver_AllDeleted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t was_nonempty : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::String_Data> source;

private:
    friend class mojo::internal::MessageFragment<StorageAreaObserver_AllDeleted_Params_Data>;

    StorageAreaObserver_AllDeleted_Params_Data();
    ~StorageAreaObserver_AllDeleted_Params_Data() = delete;
};
static_assert(sizeof(StorageAreaObserver_AllDeleted_Params_Data) == 24, "Bad sizeof(StorageAreaObserver_AllDeleted_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageAreaObserver_ShouldSendOldValueOnMutations_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t value : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<StorageAreaObserver_ShouldSendOldValueOnMutations_Params_Data>;

    StorageAreaObserver_ShouldSendOldValueOnMutations_Params_Data();
    ~StorageAreaObserver_ShouldSendOldValueOnMutations_Params_Data() = delete;
};
static_assert(
    sizeof(StorageAreaObserver_ShouldSendOldValueOnMutations_Params_Data) == 16, "Bad sizeof(StorageAreaObserver_ShouldSendOldValueOnMutations_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageArea_AddObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data observer;

private:
    friend class mojo::internal::MessageFragment<StorageArea_AddObserver_Params_Data>;

    StorageArea_AddObserver_Params_Data();
    ~StorageArea_AddObserver_Params_Data() = delete;
};
static_assert(sizeof(StorageArea_AddObserver_Params_Data) == 16, "Bad sizeof(StorageArea_AddObserver_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageArea_Put_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> key;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> value;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> client_old_value;
    mojo::internal::Pointer<mojo::internal::String_Data> source;

private:
    friend class mojo::internal::MessageFragment<StorageArea_Put_Params_Data>;

    StorageArea_Put_Params_Data();
    ~StorageArea_Put_Params_Data() = delete;
};
static_assert(sizeof(StorageArea_Put_Params_Data) == 40, "Bad sizeof(StorageArea_Put_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageArea_Put_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<StorageArea_Put_ResponseParams_Data>;

    StorageArea_Put_ResponseParams_Data();
    ~StorageArea_Put_ResponseParams_Data() = delete;
};
static_assert(sizeof(StorageArea_Put_ResponseParams_Data) == 16, "Bad sizeof(StorageArea_Put_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageArea_Delete_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> key;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> client_old_value;
    mojo::internal::Pointer<mojo::internal::String_Data> source;

private:
    friend class mojo::internal::MessageFragment<StorageArea_Delete_Params_Data>;

    StorageArea_Delete_Params_Data();
    ~StorageArea_Delete_Params_Data() = delete;
};
static_assert(sizeof(StorageArea_Delete_Params_Data) == 32, "Bad sizeof(StorageArea_Delete_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageArea_Delete_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<StorageArea_Delete_ResponseParams_Data>;

    StorageArea_Delete_ResponseParams_Data();
    ~StorageArea_Delete_ResponseParams_Data() = delete;
};
static_assert(sizeof(StorageArea_Delete_ResponseParams_Data) == 16, "Bad sizeof(StorageArea_Delete_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageArea_DeleteAll_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> source;
    mojo::internal::Interface_Data new_observer;

private:
    friend class mojo::internal::MessageFragment<StorageArea_DeleteAll_Params_Data>;

    StorageArea_DeleteAll_Params_Data();
    ~StorageArea_DeleteAll_Params_Data() = delete;
};
static_assert(sizeof(StorageArea_DeleteAll_Params_Data) == 24, "Bad sizeof(StorageArea_DeleteAll_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageArea_DeleteAll_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<StorageArea_DeleteAll_ResponseParams_Data>;

    StorageArea_DeleteAll_ResponseParams_Data();
    ~StorageArea_DeleteAll_ResponseParams_Data() = delete;
};
static_assert(sizeof(StorageArea_DeleteAll_ResponseParams_Data) == 16, "Bad sizeof(StorageArea_DeleteAll_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageArea_Get_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> key;

private:
    friend class mojo::internal::MessageFragment<StorageArea_Get_Params_Data>;

    StorageArea_Get_Params_Data();
    ~StorageArea_Get_Params_Data() = delete;
};
static_assert(sizeof(StorageArea_Get_Params_Data) == 16, "Bad sizeof(StorageArea_Get_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageArea_Get_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> value;

private:
    friend class mojo::internal::MessageFragment<StorageArea_Get_ResponseParams_Data>;

    StorageArea_Get_ResponseParams_Data();
    ~StorageArea_Get_ResponseParams_Data() = delete;
};
static_assert(sizeof(StorageArea_Get_ResponseParams_Data) == 24, "Bad sizeof(StorageArea_Get_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageArea_GetAll_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data new_observer;

private:
    friend class mojo::internal::MessageFragment<StorageArea_GetAll_Params_Data>;

    StorageArea_GetAll_Params_Data();
    ~StorageArea_GetAll_Params_Data() = delete;
};
static_assert(sizeof(StorageArea_GetAll_Params_Data) == 16, "Bad sizeof(StorageArea_GetAll_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageArea_GetAll_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::KeyValue_Data>>> data;

private:
    friend class mojo::internal::MessageFragment<StorageArea_GetAll_ResponseParams_Data>;

    StorageArea_GetAll_ResponseParams_Data();
    ~StorageArea_GetAll_ResponseParams_Data() = delete;
};
static_assert(sizeof(StorageArea_GetAll_ResponseParams_Data) == 16, "Bad sizeof(StorageArea_GetAll_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) StorageArea_Checkpoint_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<StorageArea_Checkpoint_Params_Data>;

    StorageArea_Checkpoint_Params_Data();
    ~StorageArea_Checkpoint_Params_Data() = delete;
};
static_assert(sizeof(StorageArea_Checkpoint_Params_Data) == 8, "Bad sizeof(StorageArea_Checkpoint_Params_Data)");

} // namespace internal

class StorageAreaObserver_KeyChanged_ParamsDataView {
public:
    StorageAreaObserver_KeyChanged_ParamsDataView() = default;

    StorageAreaObserver_KeyChanged_ParamsDataView(internal::StorageAreaObserver_KeyChanged_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    inline void GetKeyDataView(mojo::ArrayDataView<uint8_t>* output);

    template <typename UserType> [[nodiscard]] bool ReadKey(UserType* output)
    {

        auto* pointer = data_->key.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<uint8_t>>(pointer, output, message_);
    }
    inline void GetNewValueDataView(mojo::ArrayDataView<uint8_t>* output);

    template <typename UserType> [[nodiscard]] bool ReadNewValue(UserType* output)
    {

