// components/commerce/core/mojom/shopping_service.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_COMMERCE_CORE_MOJOM_SHOPPING_SERVICE_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_COMMERCE_CORE_MOJOM_SHOPPING_SERVICE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}

namespace shopping_service::mojom {
namespace internal {
class ShoppingServiceHandlerFactory_CreateShoppingServiceHandler_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data page;
    mojo::internal::Handle_Data handler;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandlerFactory_CreateShoppingServiceHandler_Params_Data>;

    ShoppingServiceHandlerFactory_CreateShoppingServiceHandler_Params_Data();
    ~ShoppingServiceHandlerFactory_CreateShoppingServiceHandler_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandlerFactory_CreateShoppingServiceHandler_Params_Data) == 24,
    "Bad sizeof(ShoppingServiceHandlerFactory_CreateShoppingServiceHandler_Params_Data)");
class ShoppingServiceHandler_GetAllPriceTrackedBookmarkProductInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetAllPriceTrackedBookmarkProductInfo_Params_Data>;

    ShoppingServiceHandler_GetAllPriceTrackedBookmarkProductInfo_Params_Data();
    ~ShoppingServiceHandler_GetAllPriceTrackedBookmarkProductInfo_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetAllPriceTrackedBookmarkProductInfo_Params_Data) == 8,
    "Bad sizeof(ShoppingServiceHandler_GetAllPriceTrackedBookmarkProductInfo_Params_Data)");
class ShoppingServiceHandler_GetAllPriceTrackedBookmarkProductInfo_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::BookmarkProductInfo_Data>>> productInfos;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetAllPriceTrackedBookmarkProductInfo_ResponseParams_Data>;

    ShoppingServiceHandler_GetAllPriceTrackedBookmarkProductInfo_ResponseParams_Data();
    ~ShoppingServiceHandler_GetAllPriceTrackedBookmarkProductInfo_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetAllPriceTrackedBookmarkProductInfo_ResponseParams_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_GetAllPriceTrackedBookmarkProductInfo_ResponseParams_Data)");
class ShoppingServiceHandler_GetAllShoppingBookmarkProductInfo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetAllShoppingBookmarkProductInfo_Params_Data>;

    ShoppingServiceHandler_GetAllShoppingBookmarkProductInfo_Params_Data();
    ~ShoppingServiceHandler_GetAllShoppingBookmarkProductInfo_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetAllShoppingBookmarkProductInfo_Params_Data) == 8,
    "Bad sizeof(ShoppingServiceHandler_GetAllShoppingBookmarkProductInfo_Params_Data)");
class ShoppingServiceHandler_GetAllShoppingBookmarkProductInfo_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::BookmarkProductInfo_Data>>> productInfos;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetAllShoppingBookmarkProductInfo_ResponseParams_Data>;

    ShoppingServiceHandler_GetAllShoppingBookmarkProductInfo_ResponseParams_Data();
    ~ShoppingServiceHandler_GetAllShoppingBookmarkProductInfo_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetAllShoppingBookmarkProductInfo_ResponseParams_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_GetAllShoppingBookmarkProductInfo_ResponseParams_Data)");
class ShoppingServiceHandler_TrackPriceForBookmark_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t bookmark_id;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_TrackPriceForBookmark_Params_Data>;

    ShoppingServiceHandler_TrackPriceForBookmark_Params_Data();
    ~ShoppingServiceHandler_TrackPriceForBookmark_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_TrackPriceForBookmark_Params_Data) == 16, "Bad sizeof(ShoppingServiceHandler_TrackPriceForBookmark_Params_Data)");
class ShoppingServiceHandler_UntrackPriceForBookmark_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t bookmark_id;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_UntrackPriceForBookmark_Params_Data>;

    ShoppingServiceHandler_UntrackPriceForBookmark_Params_Data();
    ~ShoppingServiceHandler_UntrackPriceForBookmark_Params_Data() = delete;
};
static_assert(
    sizeof(ShoppingServiceHandler_UntrackPriceForBookmark_Params_Data) == 16, "Bad sizeof(ShoppingServiceHandler_UntrackPriceForBookmark_Params_Data)");
class ShoppingServiceHandler_GetProductInfoForCurrentUrl_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetProductInfoForCurrentUrl_Params_Data>;

    ShoppingServiceHandler_GetProductInfoForCurrentUrl_Params_Data();
    ~ShoppingServiceHandler_GetProductInfoForCurrentUrl_Params_Data() = delete;
};
static_assert(
    sizeof(ShoppingServiceHandler_GetProductInfoForCurrentUrl_Params_Data) == 8, "Bad sizeof(ShoppingServiceHandler_GetProductInfoForCurrentUrl_Params_Data)");
class ShoppingServiceHandler_GetProductInfoForCurrentUrl_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::ProductInfo_Data> productInfo;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetProductInfoForCurrentUrl_ResponseParams_Data>;

    ShoppingServiceHandler_GetProductInfoForCurrentUrl_ResponseParams_Data();
    ~ShoppingServiceHandler_GetProductInfoForCurrentUrl_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetProductInfoForCurrentUrl_ResponseParams_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_GetProductInfoForCurrentUrl_ResponseParams_Data)");
class ShoppingServiceHandler_GetProductInfoForUrl_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetProductInfoForUrl_Params_Data>;

    ShoppingServiceHandler_GetProductInfoForUrl_Params_Data();
    ~ShoppingServiceHandler_GetProductInfoForUrl_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetProductInfoForUrl_Params_Data) == 16, "Bad sizeof(ShoppingServiceHandler_GetProductInfoForUrl_Params_Data)");
class ShoppingServiceHandler_GetProductInfoForUrl_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<internal::ProductInfo_Data> productInfo;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetProductInfoForUrl_ResponseParams_Data>;

    ShoppingServiceHandler_GetProductInfoForUrl_ResponseParams_Data();
    ~ShoppingServiceHandler_GetProductInfoForUrl_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetProductInfoForUrl_ResponseParams_Data) == 24,
    "Bad sizeof(ShoppingServiceHandler_GetProductInfoForUrl_ResponseParams_Data)");
class ShoppingServiceHandler_GetPriceInsightsInfoForCurrentUrl_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetPriceInsightsInfoForCurrentUrl_Params_Data>;

    ShoppingServiceHandler_GetPriceInsightsInfoForCurrentUrl_Params_Data();
    ~ShoppingServiceHandler_GetPriceInsightsInfoForCurrentUrl_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetPriceInsightsInfoForCurrentUrl_Params_Data) == 8,
    "Bad sizeof(ShoppingServiceHandler_GetPriceInsightsInfoForCurrentUrl_Params_Data)");
class ShoppingServiceHandler_GetPriceInsightsInfoForCurrentUrl_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::PriceInsightsInfo_Data> priceInsightsInfo;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetPriceInsightsInfoForCurrentUrl_ResponseParams_Data>;

    ShoppingServiceHandler_GetPriceInsightsInfoForCurrentUrl_ResponseParams_Data();
    ~ShoppingServiceHandler_GetPriceInsightsInfoForCurrentUrl_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetPriceInsightsInfoForCurrentUrl_ResponseParams_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_GetPriceInsightsInfoForCurrentUrl_ResponseParams_Data)");
class ShoppingServiceHandler_GetPriceInsightsInfoForUrl_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetPriceInsightsInfoForUrl_Params_Data>;

    ShoppingServiceHandler_GetPriceInsightsInfoForUrl_Params_Data();
    ~ShoppingServiceHandler_GetPriceInsightsInfoForUrl_Params_Data() = delete;
};
static_assert(
    sizeof(ShoppingServiceHandler_GetPriceInsightsInfoForUrl_Params_Data) == 16, "Bad sizeof(ShoppingServiceHandler_GetPriceInsightsInfoForUrl_Params_Data)");
class ShoppingServiceHandler_GetPriceInsightsInfoForUrl_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<internal::PriceInsightsInfo_Data> priceInsightsInfo;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetPriceInsightsInfoForUrl_ResponseParams_Data>;

    ShoppingServiceHandler_GetPriceInsightsInfoForUrl_ResponseParams_Data();
    ~ShoppingServiceHandler_GetPriceInsightsInfoForUrl_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetPriceInsightsInfoForUrl_ResponseParams_Data) == 24,
    "Bad sizeof(ShoppingServiceHandler_GetPriceInsightsInfoForUrl_ResponseParams_Data)");
class ShoppingServiceHandler_GetProductSpecificationsForUrls_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Url_Data>>> urls;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetProductSpecificationsForUrls_Params_Data>;

    ShoppingServiceHandler_GetProductSpecificationsForUrls_Params_Data();
    ~ShoppingServiceHandler_GetProductSpecificationsForUrls_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetProductSpecificationsForUrls_Params_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_GetProductSpecificationsForUrls_Params_Data)");
class ShoppingServiceHandler_GetProductSpecificationsForUrls_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::ProductSpecifications_Data> productSpecs;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetProductSpecificationsForUrls_ResponseParams_Data>;

    ShoppingServiceHandler_GetProductSpecificationsForUrls_ResponseParams_Data();
    ~ShoppingServiceHandler_GetProductSpecificationsForUrls_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetProductSpecificationsForUrls_ResponseParams_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_GetProductSpecificationsForUrls_ResponseParams_Data)");
class ShoppingServiceHandler_GetUrlInfosForProductTabs_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetUrlInfosForProductTabs_Params_Data>;

    ShoppingServiceHandler_GetUrlInfosForProductTabs_Params_Data();
    ~ShoppingServiceHandler_GetUrlInfosForProductTabs_Params_Data() = delete;
};
static_assert(
    sizeof(ShoppingServiceHandler_GetUrlInfosForProductTabs_Params_Data) == 8, "Bad sizeof(ShoppingServiceHandler_GetUrlInfosForProductTabs_Params_Data)");
class ShoppingServiceHandler_GetUrlInfosForProductTabs_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::UrlInfo_Data>>> url_infos;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetUrlInfosForProductTabs_ResponseParams_Data>;

    ShoppingServiceHandler_GetUrlInfosForProductTabs_ResponseParams_Data();
    ~ShoppingServiceHandler_GetUrlInfosForProductTabs_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetUrlInfosForProductTabs_ResponseParams_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_GetUrlInfosForProductTabs_ResponseParams_Data)");
class ShoppingServiceHandler_GetUrlInfosForRecentlyViewedTabs_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetUrlInfosForRecentlyViewedTabs_Params_Data>;

    ShoppingServiceHandler_GetUrlInfosForRecentlyViewedTabs_Params_Data();
    ~ShoppingServiceHandler_GetUrlInfosForRecentlyViewedTabs_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetUrlInfosForRecentlyViewedTabs_Params_Data) == 8,
    "Bad sizeof(ShoppingServiceHandler_GetUrlInfosForRecentlyViewedTabs_Params_Data)");
class ShoppingServiceHandler_GetUrlInfosForRecentlyViewedTabs_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::UrlInfo_Data>>> url_infos;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetUrlInfosForRecentlyViewedTabs_ResponseParams_Data>;

    ShoppingServiceHandler_GetUrlInfosForRecentlyViewedTabs_ResponseParams_Data();
    ~ShoppingServiceHandler_GetUrlInfosForRecentlyViewedTabs_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetUrlInfosForRecentlyViewedTabs_ResponseParams_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_GetUrlInfosForRecentlyViewedTabs_ResponseParams_Data)");
class ShoppingServiceHandler_ShowInsightsSidePanelUI_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_ShowInsightsSidePanelUI_Params_Data>;

    ShoppingServiceHandler_ShowInsightsSidePanelUI_Params_Data();
    ~ShoppingServiceHandler_ShowInsightsSidePanelUI_Params_Data() = delete;
};
static_assert(
    sizeof(ShoppingServiceHandler_ShowInsightsSidePanelUI_Params_Data) == 8, "Bad sizeof(ShoppingServiceHandler_ShowInsightsSidePanelUI_Params_Data)");
class ShoppingServiceHandler_IsShoppingListEligible_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_IsShoppingListEligible_Params_Data>;

    ShoppingServiceHandler_IsShoppingListEligible_Params_Data();
    ~ShoppingServiceHandler_IsShoppingListEligible_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_IsShoppingListEligible_Params_Data) == 8, "Bad sizeof(ShoppingServiceHandler_IsShoppingListEligible_Params_Data)");
class ShoppingServiceHandler_IsShoppingListEligible_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t eligible : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_IsShoppingListEligible_ResponseParams_Data>;

    ShoppingServiceHandler_IsShoppingListEligible_ResponseParams_Data();
    ~ShoppingServiceHandler_IsShoppingListEligible_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_IsShoppingListEligible_ResponseParams_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_IsShoppingListEligible_ResponseParams_Data)");
class ShoppingServiceHandler_GetShoppingCollectionBookmarkFolderId_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetShoppingCollectionBookmarkFolderId_Params_Data>;

    ShoppingServiceHandler_GetShoppingCollectionBookmarkFolderId_Params_Data();
    ~ShoppingServiceHandler_GetShoppingCollectionBookmarkFolderId_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetShoppingCollectionBookmarkFolderId_Params_Data) == 8,
    "Bad sizeof(ShoppingServiceHandler_GetShoppingCollectionBookmarkFolderId_Params_Data)");
class ShoppingServiceHandler_GetShoppingCollectionBookmarkFolderId_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int64_t collectionId;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetShoppingCollectionBookmarkFolderId_ResponseParams_Data>;

    ShoppingServiceHandler_GetShoppingCollectionBookmarkFolderId_ResponseParams_Data();
    ~ShoppingServiceHandler_GetShoppingCollectionBookmarkFolderId_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetShoppingCollectionBookmarkFolderId_ResponseParams_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_GetShoppingCollectionBookmarkFolderId_ResponseParams_Data)");
class ShoppingServiceHandler_GetPriceTrackingStatusForCurrentUrl_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetPriceTrackingStatusForCurrentUrl_Params_Data>;

    ShoppingServiceHandler_GetPriceTrackingStatusForCurrentUrl_Params_Data();
    ~ShoppingServiceHandler_GetPriceTrackingStatusForCurrentUrl_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetPriceTrackingStatusForCurrentUrl_Params_Data) == 8,
    "Bad sizeof(ShoppingServiceHandler_GetPriceTrackingStatusForCurrentUrl_Params_Data)");
class ShoppingServiceHandler_GetPriceTrackingStatusForCurrentUrl_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t tracked : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetPriceTrackingStatusForCurrentUrl_ResponseParams_Data>;

    ShoppingServiceHandler_GetPriceTrackingStatusForCurrentUrl_ResponseParams_Data();
    ~ShoppingServiceHandler_GetPriceTrackingStatusForCurrentUrl_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetPriceTrackingStatusForCurrentUrl_ResponseParams_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_GetPriceTrackingStatusForCurrentUrl_ResponseParams_Data)");
class ShoppingServiceHandler_SetPriceTrackingStatusForCurrentUrl_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t track : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_SetPriceTrackingStatusForCurrentUrl_Params_Data>;

    ShoppingServiceHandler_SetPriceTrackingStatusForCurrentUrl_Params_Data();
    ~ShoppingServiceHandler_SetPriceTrackingStatusForCurrentUrl_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_SetPriceTrackingStatusForCurrentUrl_Params_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_SetPriceTrackingStatusForCurrentUrl_Params_Data)");
class ShoppingServiceHandler_OpenUrlInNewTab_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_OpenUrlInNewTab_Params_Data>;

    ShoppingServiceHandler_OpenUrlInNewTab_Params_Data();
    ~ShoppingServiceHandler_OpenUrlInNewTab_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_OpenUrlInNewTab_Params_Data) == 16, "Bad sizeof(ShoppingServiceHandler_OpenUrlInNewTab_Params_Data)");
class ShoppingServiceHandler_SwitchToOrOpenTab_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_SwitchToOrOpenTab_Params_Data>;

    ShoppingServiceHandler_SwitchToOrOpenTab_Params_Data();
    ~ShoppingServiceHandler_SwitchToOrOpenTab_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_SwitchToOrOpenTab_Params_Data) == 16, "Bad sizeof(ShoppingServiceHandler_SwitchToOrOpenTab_Params_Data)");
class ShoppingServiceHandler_GetParentBookmarkFolderNameForCurrentUrl_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetParentBookmarkFolderNameForCurrentUrl_Params_Data>;

    ShoppingServiceHandler_GetParentBookmarkFolderNameForCurrentUrl_Params_Data();
    ~ShoppingServiceHandler_GetParentBookmarkFolderNameForCurrentUrl_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetParentBookmarkFolderNameForCurrentUrl_Params_Data) == 8,
    "Bad sizeof(ShoppingServiceHandler_GetParentBookmarkFolderNameForCurrentUrl_Params_Data)");
class ShoppingServiceHandler_GetParentBookmarkFolderNameForCurrentUrl_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> name;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetParentBookmarkFolderNameForCurrentUrl_ResponseParams_Data>;

    ShoppingServiceHandler_GetParentBookmarkFolderNameForCurrentUrl_ResponseParams_Data();
    ~ShoppingServiceHandler_GetParentBookmarkFolderNameForCurrentUrl_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetParentBookmarkFolderNameForCurrentUrl_ResponseParams_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_GetParentBookmarkFolderNameForCurrentUrl_ResponseParams_Data)");
class ShoppingServiceHandler_ShowBookmarkEditorForCurrentUrl_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_ShowBookmarkEditorForCurrentUrl_Params_Data>;

    ShoppingServiceHandler_ShowBookmarkEditorForCurrentUrl_Params_Data();
    ~ShoppingServiceHandler_ShowBookmarkEditorForCurrentUrl_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_ShowBookmarkEditorForCurrentUrl_Params_Data) == 8,
    "Bad sizeof(ShoppingServiceHandler_ShowBookmarkEditorForCurrentUrl_Params_Data)");
class ShoppingServiceHandler_ShowFeedbackForPriceInsights_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_ShowFeedbackForPriceInsights_Params_Data>;

    ShoppingServiceHandler_ShowFeedbackForPriceInsights_Params_Data();
    ~ShoppingServiceHandler_ShowFeedbackForPriceInsights_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_ShowFeedbackForPriceInsights_Params_Data) == 8,
    "Bad sizeof(ShoppingServiceHandler_ShowFeedbackForPriceInsights_Params_Data)");
class ShoppingServiceHandler_GetAllProductSpecificationsSets_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetAllProductSpecificationsSets_Params_Data>;

    ShoppingServiceHandler_GetAllProductSpecificationsSets_Params_Data();
    ~ShoppingServiceHandler_GetAllProductSpecificationsSets_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetAllProductSpecificationsSets_Params_Data) == 8,
    "Bad sizeof(ShoppingServiceHandler_GetAllProductSpecificationsSets_Params_Data)");
class ShoppingServiceHandler_GetAllProductSpecificationsSets_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::commerce::shared::mojom::internal::ProductSpecificationsSet_Data>>> sets;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetAllProductSpecificationsSets_ResponseParams_Data>;

    ShoppingServiceHandler_GetAllProductSpecificationsSets_ResponseParams_Data();
    ~ShoppingServiceHandler_GetAllProductSpecificationsSets_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetAllProductSpecificationsSets_ResponseParams_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_GetAllProductSpecificationsSets_ResponseParams_Data)");
class ShoppingServiceHandler_GetProductSpecificationsSetByUuid_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Uuid_Data> uuid;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetProductSpecificationsSetByUuid_Params_Data>;

    ShoppingServiceHandler_GetProductSpecificationsSetByUuid_Params_Data();
    ~ShoppingServiceHandler_GetProductSpecificationsSetByUuid_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetProductSpecificationsSetByUuid_Params_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_GetProductSpecificationsSetByUuid_Params_Data)");
class ShoppingServiceHandler_GetProductSpecificationsSetByUuid_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::commerce::shared::mojom::internal::ProductSpecificationsSet_Data> set;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetProductSpecificationsSetByUuid_ResponseParams_Data>;

    ShoppingServiceHandler_GetProductSpecificationsSetByUuid_ResponseParams_Data();
    ~ShoppingServiceHandler_GetProductSpecificationsSetByUuid_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetProductSpecificationsSetByUuid_ResponseParams_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_GetProductSpecificationsSetByUuid_ResponseParams_Data)");
class ShoppingServiceHandler_AddProductSpecificationsSet_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> name;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Url_Data>>> urls;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_AddProductSpecificationsSet_Params_Data>;

    ShoppingServiceHandler_AddProductSpecificationsSet_Params_Data();
    ~ShoppingServiceHandler_AddProductSpecificationsSet_Params_Data() = delete;
};
static_assert(
    sizeof(ShoppingServiceHandler_AddProductSpecificationsSet_Params_Data) == 24, "Bad sizeof(ShoppingServiceHandler_AddProductSpecificationsSet_Params_Data)");
class ShoppingServiceHandler_AddProductSpecificationsSet_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::commerce::shared::mojom::internal::ProductSpecificationsSet_Data> created_set;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_AddProductSpecificationsSet_ResponseParams_Data>;

    ShoppingServiceHandler_AddProductSpecificationsSet_ResponseParams_Data();
    ~ShoppingServiceHandler_AddProductSpecificationsSet_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_AddProductSpecificationsSet_ResponseParams_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_AddProductSpecificationsSet_ResponseParams_Data)");
class ShoppingServiceHandler_DeleteProductSpecificationsSet_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Uuid_Data> uuid;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_DeleteProductSpecificationsSet_Params_Data>;

    ShoppingServiceHandler_DeleteProductSpecificationsSet_Params_Data();
    ~ShoppingServiceHandler_DeleteProductSpecificationsSet_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_DeleteProductSpecificationsSet_Params_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_DeleteProductSpecificationsSet_Params_Data)");
class ShoppingServiceHandler_SetNameForProductSpecificationsSet_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Uuid_Data> uuid;
    mojo::internal::Pointer<mojo::internal::String_Data> name;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_SetNameForProductSpecificationsSet_Params_Data>;

    ShoppingServiceHandler_SetNameForProductSpecificationsSet_Params_Data();
    ~ShoppingServiceHandler_SetNameForProductSpecificationsSet_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_SetNameForProductSpecificationsSet_Params_Data) == 24,
    "Bad sizeof(ShoppingServiceHandler_SetNameForProductSpecificationsSet_Params_Data)");
class ShoppingServiceHandler_SetNameForProductSpecificationsSet_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::commerce::shared::mojom::internal::ProductSpecificationsSet_Data> updated_set;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_SetNameForProductSpecificationsSet_ResponseParams_Data>;

    ShoppingServiceHandler_SetNameForProductSpecificationsSet_ResponseParams_Data();
    ~ShoppingServiceHandler_SetNameForProductSpecificationsSet_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_SetNameForProductSpecificationsSet_ResponseParams_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_SetNameForProductSpecificationsSet_ResponseParams_Data)");
class ShoppingServiceHandler_SetUrlsForProductSpecificationsSet_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Uuid_Data> uuid;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::url::mojom::internal::Url_Data>>> urls;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_SetUrlsForProductSpecificationsSet_Params_Data>;

    ShoppingServiceHandler_SetUrlsForProductSpecificationsSet_Params_Data();
    ~ShoppingServiceHandler_SetUrlsForProductSpecificationsSet_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_SetUrlsForProductSpecificationsSet_Params_Data) == 24,
    "Bad sizeof(ShoppingServiceHandler_SetUrlsForProductSpecificationsSet_Params_Data)");
class ShoppingServiceHandler_SetUrlsForProductSpecificationsSet_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::commerce::shared::mojom::internal::ProductSpecificationsSet_Data> updated_set;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_SetUrlsForProductSpecificationsSet_ResponseParams_Data>;

    ShoppingServiceHandler_SetUrlsForProductSpecificationsSet_ResponseParams_Data();
    ~ShoppingServiceHandler_SetUrlsForProductSpecificationsSet_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_SetUrlsForProductSpecificationsSet_ResponseParams_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_SetUrlsForProductSpecificationsSet_ResponseParams_Data)");
class ShoppingServiceHandler_SetProductSpecificationsUserFeedback_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t feedback;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_SetProductSpecificationsUserFeedback_Params_Data>;

    ShoppingServiceHandler_SetProductSpecificationsUserFeedback_Params_Data();
    ~ShoppingServiceHandler_SetProductSpecificationsUserFeedback_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_SetProductSpecificationsUserFeedback_Params_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_SetProductSpecificationsUserFeedback_Params_Data)");
class ShoppingServiceHandler_GetProductSpecificationsFeatureState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetProductSpecificationsFeatureState_Params_Data>;

    ShoppingServiceHandler_GetProductSpecificationsFeatureState_Params_Data();
    ~ShoppingServiceHandler_GetProductSpecificationsFeatureState_Params_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetProductSpecificationsFeatureState_Params_Data) == 8,
    "Bad sizeof(ShoppingServiceHandler_GetProductSpecificationsFeatureState_Params_Data)");
class ShoppingServiceHandler_GetProductSpecificationsFeatureState_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::ProductSpecificationsFeatureState_Data> state;

private:
    friend class mojo::internal::MessageFragment<ShoppingServiceHandler_GetProductSpecificationsFeatureState_ResponseParams_Data>;

    ShoppingServiceHandler_GetProductSpecificationsFeatureState_ResponseParams_Data();
    ~ShoppingServiceHandler_GetProductSpecificationsFeatureState_ResponseParams_Data() = delete;
};
static_assert(sizeof(ShoppingServiceHandler_GetProductSpecificationsFeatureState_ResponseParams_Data) == 16,
    "Bad sizeof(ShoppingServiceHandler_GetProductSpecificationsFeatureState_ResponseParams_Data)");
class Page_PriceTrackedForBookmark_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::BookmarkProductInfo_Data> bookmark_product;

private:
    friend class mojo::internal::MessageFragment<Page_PriceTrackedForBookmark_Params_Data>;

    Page_PriceTrackedForBookmark_Params_Data();
    ~Page_PriceTrackedForBookmark_Params_Data() = delete;
};
static_assert(sizeof(Page_PriceTrackedForBookmark_Params_Data) == 16, "Bad sizeof(Page_PriceTrackedForBookmark_Params_Data)");
class Page_PriceUntrackedForBookmark_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::BookmarkProductInfo_Data> bookmark_product;

private:
    friend class mojo::internal::MessageFragment<Page_PriceUntrackedForBookmark_Params_Data>;

    Page_PriceUntrackedForBookmark_Params_Data();
    ~Page_PriceUntrackedForBookmark_Params_Data() = delete;
};
static_assert(sizeof(Page_PriceUntrackedForBookmark_Params_Data) == 16, "Bad sizeof(Page_PriceUntrackedForBookmark_Params_Data)");
class Page_OperationFailedForBookmark_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::BookmarkProductInfo_Data> bookmark_product;
    uint8_t attempted_track : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<Page_OperationFailedForBookmark_Params_Data>;

    Page_OperationFailedForBookmark_Params_Data();
    ~Page_OperationFailedForBookmark_Params_Data() = delete;
};
static_assert(sizeof(Page_OperationFailedForBookmark_Params_Data) == 24, "Bad sizeof(Page_OperationFailedForBookmark_Params_Data)");
class Page_OnProductBookmarkMoved_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::BookmarkProductInfo_Data> bookmark_product;

private:
    friend class mojo::internal::MessageFragment<Page_OnProductBookmarkMoved_Params_Data>;

    Page_OnProductBookmarkMoved_Params_Data();
    ~Page_OnProductBookmarkMoved_Params_Data() = delete;
};
static_assert(sizeof(Page_OnProductBookmarkMoved_Params_Data) == 16, "Bad sizeof(Page_OnProductBookmarkMoved_Params_Data)");

} // namespace internal

class ShoppingServiceHandlerFactory_CreateShoppingServiceHandler_ParamsDataView {
public:
    ShoppingServiceHandlerFactory_CreateShoppingServiceHandler_ParamsDataView() = default;

    ShoppingServiceHandlerFactory_CreateShoppingServiceHandler_ParamsDataView(
        internal::ShoppingServiceHandlerFactory_CreateShoppingServiceHandler_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const
    {
        return !data_;
    }
    template <typename UserType> UserType TakePage()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::shopping_service::mojom::PageInterfaceBase>>(&data_->page, &result, message_);
        DCHECK(ret);
        return result;
    }
    template <typename UserType> UserType TakeHandler()
    {
